{
    "remaining_requests": 429,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Accidental-President-Truman-Months-Changed/dp/1328505685",
    "body": {
        "name": "The Accidental President: Harry S. Truman and the Four Months That Changed the World",
        "price": "$15.36$15.36$11.75$11.75$15.36",
        "originalPrice": "$24.99",
        "rawPrice": 15.36,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Accidental-President-Truman-Months-Changed/dp/1328505685",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41mAjc-2T9L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31rzNnHhPlL.jpg",
            "https://m.media-amazon.com/images/I/51JDC 6zLbL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "A. J. Baime",
            "link": "https://www.amazon.com/A-J-Baime/e/B001IXO0YK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by SimplyyQuality and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 9354,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 12 hrs 59 mins",
            "FREE delivery February 27 - 29 on orders shipped by Amazon over $35",
            "Or fastest delivery February 25 - 27",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 6 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2376"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Mariner Books; Reprint edition (October 2, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 464 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1328505685"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1328505682"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.3 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 1.12 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,506 in Books (See Top 100 in Books) #14 in WWII Biographies #21 in US Presidents #50 in World War II History (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 9,354 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "marcia b",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCV6FRPAX6VK4W3SS3UGUESLV5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8DZFJC5TK8WF?ASIN=1328505685",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Who knew?",
                "reviewText": "My parents were huge Truman fans. I now know why. This was a book club selection that I never would have read. His story is incredible! He was a common man with the weight of the entire world on his shoulders. Well worth my time to read this story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark71",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5GJU4NSJWXSBIFWMEGIFFQIOAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3M400HFC5QUYD?ASIN=1328505685",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars GREAT READ of the end of WWII",
                "reviewText": "Awesome undertaking by Mr. Baime… a heretofore unknown (by me, in my ignorance) author of American history of times we know too little of. I found myself frequently spellbound in his writing of just these four months in the aftermath of FDR’s passing — a time in the history of the world packed with so MANY events that could have led to WWIII and the dismantling of Europe and the rest of the world as we now know it. We (the entire world), owe a great debt to Truman & his administration for their dedication to their tasks at hand.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bill Hughes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPTZAX3JOFNX77VKRPMYIXLZ3CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TQVY1AML8J4C?ASIN=1328505685",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2020",
                "reviewTitle": "4.0 out of 5 stars A Fair and Balanced Portrayal of Harry S Truman",
                "reviewText": "﻿“If you want a friend in Washington, get a dog!” That was just one of Harry S. Truman’s more memorable lines. The man from Larmar, Missouri, a farmer’s son, had plenty more like that one. Truman, to put it in the popular lexicon, was a straight shooter from the old school. He knew how to cut to the chase and get things done. During WWI, Truman, at age 33, served as an artillery officer for Battery D company He saw action during the Meuse-Argonne Offensive. At war’s end, he was discharged with the rank of captain, much respected and admired by his troops, most of whom were “Irish and German Catholics.” One of them, “Eddie McKim, became one of Truman’s lifelong friends,” the author A. J. Baime writes. Baime described Truman this way: “He was the prototypical ordinary man. He had no college degree and never had enough money to own his own home.” For a while he even lived in his mother-in-law’s home, who “never liked Harry very much.” Baime’s book, published in 2017, is entitled: “The Accidental President: Harry S. Truman and the Four Months That Changed the World.” Those “four months” turned out to be truly action-packed. They helped to create the strong, resilient President Truman the nation and most of the world would come to know and respect. Truman, Baime underscores, became president “by accident” - his own words. In 1944, after serving as vice-president for 82 days, the then-president, Franklin D. Roosevelt (FDR), in office since 1933, died on April 12, 1945. World War II was still raging against Japan on the Eastern front and Nazi Germany in Europe. The Soviet Union, under the brutal dictator Josef Stalin, was our ally in that massive struggle. Truman had “never governed a state or served as mayor of a city.” He was married in 1919, to Bess Wallace, and they had one child, Margaret. Thanks to the help of a then-powerful Missouri political boss, Tom Pendergast, Truman began, in the early 30s, his rise up the ladder to eventually the White House itself. No boss Pendergast, no White House for Harry! Pendergast got Truman a number of low level administrative posts in Jackson County Missouri, with state agencies, and one job with a bureau of the federal government. He then supported Truman’s bid for a U.S. Senate seat in the 1934 election, which he shockingly won. In 1944, FDR picked Truman to be his running mate. “The die” as Caesar once said, “was cast.” Baime’s book describes what the “first four months of the Truman’s presidency” looked like. The term “mind-boggling” doesn’t begin do it justice. It began, Baime writes, with the “collapse of Nazi Germany, then the founding of the United Nations, and the fire bombing of Japanese cities.” The latter attacks killed thousand of civilians. The liberation of “Nazi death camps, the suicide of Adolf Hitler, and the execution of Benito Mussolini” quickly followed. The Italian strong man was executed in the city of Milan by Communist partisans. He was then hanged by his feet along side his murdered mistress, Claretta Petacci. Their “death photo” was truly a shocking thing to see. It may have been the first time I had ever seen a dead body outside of a funeral home. In Germany, the capture of war criminals, such as “Hermann Goring and Ernst Kaltenbrunner and the fall of Berlin” are all covered in Baime’s book. On the Eastern front, Baime noted the “victory at Okinawa, which Bill Sloan, a historian, called ‘the deadliest campaign of conquest ever undertaken by American arms.’” While that battle was raging, a Japanese suicide plane crashed into the “USS Bunker Hill,” killing nearly 400 American sailors. The author reported, “It would take 800,000 U.S. troops” to invade Japan. General George Marshall had “set D-Day as November 1st.” The above was soon followed by the “Postdam Conference, during which the new president sat at the negotiating table with Winston Churchill and Josef Stalin in Soviet-occupied Germany in an attempt to map out a new world.” Unfortunately, Stalin resisted that effort. Instead, a “Cold War” would ensue, writes the author. The first four months of Truman’s presidency were all highly-charged with international tensions of every variety and filled with important, seminal events. Author Baime brings them all to life again. They were all ultra-charged, the author submits, by Truman’s controversial decision, “to drop the first atomic bombs on two Japanese cities - Hiroshima and Nagasaki in early August, 1945. Those monumental actions “did end the war with Japan” and prevented the loss of an estimated hundreds of thousand of American lives from a land invasion. They also ushered in “the dawn of the Cold War and the beginning of nuclear arms race,” Baime reports. The dropping of the A bombs also led the Japanese to begin the release of its American and Ally POWs, including a hero son of Baltimore - Harry S. Agro. To this day, unlike Germany, Japan has had a difficult time confronting and owning up fully to its criminal past and massive crimes. Meanwhile, seventy-five years later, memorials are still being held for the atomic bombs’ estimated 200,000 victims, along with repeated calls to ban nuclear weapons. During this four months period of his presidency, “fifty delegates signed the U.N. Charter in San Francisco. President Truman addressed the delegates in the city’s War Memorial Veterans Building.” Today, the UN is a thriving bastion for international peace and security. It has 193 member states. It’s not perfect, but with the goodwill of its member states, it can be, and often is, effective. Truman along the way hired his own man to be Secretary of State - James F Byrnes. By then our country had also successfully tested its A-bomb in the desert of New Mexico. At the Postdam conference, Truman made it a point to tell Stalin to his face the U.S. had an atomic bomb. Up to that point, Stalin had been making off-the-wall demands about the future of Poland and Germany and on other issues. Truman’s strategy worked, Stalin backed off. Finally, I grew up as a teenager with Harry Truman as my president. This book by A. J. Baime examines and explains many of the critical issues that confronted him early in his presidency. He does it in a fair and balanced way. I liked Truman then and I like him even more now. I’m giving Baime four out of five stars for his fine literary effort.",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZPASDYBALQ4JVOGVNXPYU4453Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5P44IQLVGWLS?ASIN=1328505685",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars A great story well told",
                "reviewText": "The book is a story that all should read and appreciate what the world was like at that time. History repeats itself because \"people\" don't change.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr. Physics",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEADCH4MKLT4GUJ7XQOD4B5RKOBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R384VSRSO3EUZY?ASIN=1328505685",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Important history",
                "reviewText": "History with clarity. Doesn’t shirk an honest assessment of the appropriateness and morality of the atomic bomb.4 months - Truman’s abilities were incredibly important for the world.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kimberly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDHPNYTEOBSNCA6WRFXXV7V5REQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M6WG06T3BRYI?ASIN=1328505685",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Very well written with notations of sources along the way.",
                "reviewText": "I purchased this book for my son, who enjoys the history of WWII. I picked it up to add it to the collection and found myself consumed by the information provided.It has peeked my interest in Truman and his role as our President and the part he played bringing the war to an end.A must read.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina I. ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3QXW5EO4HCOFO5QOAJPRCLTYVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AOH5US8MXXDQ?ASIN=1328505685",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars learn something new every day",
                "reviewText": "So many little tidbits I didn’t know about this man and the struggles he faced. I’ve driven through his home town many times but never stopped. I will definitely make it a point to do so now.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marian Lechner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJXN3RHDIQY26R3V5UW7CI5CJOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NZUCMBYTBRB4?ASIN=1328505685",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2023",
                "reviewTitle": "4.0 out of 5 stars An ordinary man and a great leader",
                "reviewText": "I particularly enjoyed the explanation of the many meetings between The president, Churchill & Stalin,as well as what it took to bring the United Nations into being.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edimilson Mario",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 14, 2022",
                "reviewTitle": "Leitura esclarecedora",
                "reviewText": "Alguns jornalistas descrevem o Truman como um líder genocida que usou a bomba atômica para subjulgar um país que já tinha se rendido. É recomendável que leiam este livro para saber mais a respeito deste período; terão a oportunidade de saber mais a respeito do Presidente Acidental.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 7, 2021",
                "reviewTitle": "Really bad paper and print quality. Do NOT buy.",
                "reviewText": "The paper and print quality is so bad... Brown paper with such a light print that it's so hard to read. The print is also not at all clear.Regret buying. Returned immediately.These Indian editions are unfortunately made with such poor quality. How do these publishers get away with this?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Johnoc",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 27, 2020",
                "reviewTitle": "Excellent book and history of the last months WWII",
                "reviewText": "This isn't a biography from cradle to the grave, which,lets be honest -spend too many pages on tedious stuff, this mainly covers a few months when Truman went from not even a household name in his family to the most powerful man on the planet taking momentous decisions almost daily.In his first four months of his presidency he had seen Germany defeated, spent days horse trading with Churchill and Stalin (one of them would have been too much for most politicians) on what Europe would look like post-war and give permission to drop two nuclear bombs that forced Japan to surrender. Throw in the first seeds about the state of Israel being created and Truman's decisions still have huge consequences today.Throw in the fact he never wanted to be President and his wife hated the idea all the while he was in office nakes the title completely accurate of someone who was thrust into office and power and judging by this book did a pretty good job under circumstances probably no world leader had seen before or since.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rule 62 Ken",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 27, 2018",
                "reviewTitle": "How an Ordinary Guy Shaped the Future of the World",
                "reviewText": "Harry Truman's selection as Franklin Roosevelt's running mate in 1944 was a big surprise to everyone, including Truman himself. Roosevelt was in poor health and was not expected to live out his term and the nation was still fighting a two front war. Truman, a former haberdasher and failed businessman from Missouri, did not inspire confidence as a replacement for the iconic FDR at such a precarious time in history. When Roosevelt died in April of 1945, Truman told reporters that it \"felt like the moon, the stars, and all the planets had fallen on me.\"Longtime Wall Street Journal contributor A. J. Baime tells the story of Harry Truman's remarkable transition from county politician to leader of the free world in The Accidental President: Harry S. Truman and the Four Months that Changed the World. This is a remarkably well-researched account of the beginning of the Truman Presidency and the end of the Second World War, a war that was ended by the most controversial wartime decision likely made by any president: the decision to use the atomic bomb against Japan in August of 1945.Baime begins with an accounting of the day that Vice-President Truman became President Truman, before embarking on Truman's life story, told in the perfect amount of detail, enough to know how Harry Truman became the man that would come to confront the world's greatest problems. The author introduces the 33rd President to the reader in his many dimensions: Truman the family man, Truman the Jacksonian Democrat, Truman the poker-playing good old boy. Baime's accounting of Truman's first four months as President puts the reader right in the Oval office and paints a picture of a Harry Truman as a man who makes decisions quickly, without wavering. He also provides a fascinating account of the relationship between Truman and Winston Churchill and Joseph Stalin, and has the reader shadow Truman at the historic Potsdam Conference.This book is not only about Truman. It also ably tells the story of the development and the deployment of the atomic bombs that fell on Hiroshima and Nagasaki. Baime has the wonderful ability to make the reader that he or she is witnessing these events as they occur from close vantage. His accounting of the actions and emotions of the crew of the Enola Gay (the plan from which the first atomic bomb fell) is fascinating. His extensive use of Truman's diaries, as well as the personal first-hand accounts of many of the participants who were present at these events enhances the reader's feeling of watching these events at the time of their occurrence. Baime also has that wonderful author's gift of being able to tell the reader something he or she did not know before. For example, we learn of Joseph Stalin's revelation to Truman of the Russian leader's belief that Adolf Hitler was alive and living in South America, or of how Truman dressed down a sleazy army officer who offered to act as a pimp for the President at Potsdam.At times, Baime seems too enamored with Truman to consider that his subject may have had faults. Truman was schooled in the bare-knuckled political academy of the corrupt Pendergast machine and while the author acknowledges the shady dealings of this organization, he is convinced of Truman's absolute honesty. Truman made a lot of snap decisions, and while he was decisive, the author never questions whether Truman was too hasty at times in some of these snap judgements. But it is hard to question the author's objectivity, given the depth of his research and the completeness of his description of the circumstances surrounding the challenges Truman faced. The author provides an especially well-considered post mortem of Truman's decision to unleash the first nuclear weapons, providing his own defense of why he believes Truman was correct in doing so.Baime serves up excellent history in telling a remarkable story of unique circumstances that placed the under-estimated ordinary guy from Independence in the position of having to shape the world that we live in today. He does so in a manner that is thorough and complete, informative and insightful, and which makes the reader feel present and close at some of the most interesting events in recent history.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ken M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 29, 2022",
                "reviewTitle": "fascinating story",
                "reviewText": "Readable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}