{
    "remaining_requests": 575,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Unbroken-Young-Adult-Adaptation-Olympians/dp/0385742525",
    "body": {
        "name": "Unbroken (The Young Adult Adaptation): An Olympian's Journey from Airman to Castaway to Captive",
        "price": "$9.87$9.87$8.88$8.88$9.87",
        "originalPrice": "$10.99",
        "rawPrice": 9.87,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Unbroken-Young-Adult-Adaptation-Olympians/dp/0385742525",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/810oCIeMMZL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Laura Hillenbrand",
            "link": "https://www.amazon.com/Laura-Hillenbrand/e/B000APTZYM/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Jenson Books Inc and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 5311,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “This adaptation of Hillenbrand’s adult best-seller is highly dramatic and exciting, as well as painful to read as it lays bare man’s hellish inhumanity to man.”--Booklist, STARRED\"This captivating book emphasizes the importance of determination, the will to survive against impossible odds, and support from family and friends. A strong, well-written work.\"--SLJ\"This fine adaptation ably brings an inspiring tale to young readers.\"--Kirkus\"A humdinger of a page-turner: a noble story about the courage of America's Greatest Generation, personified.\"--The Horn Book Review About the Author Laura Hillenbrand is the author of the #1 New York Times bestseller Unbroken: A World War II Story of Survival, Resilience, and Redemption and Seabiscuit: An American Legend, which was a finalist for the National Book Critics Circle Award, won the Book Sense Nonfiction Book of the Year award and the William Hill Sports Book of the Year Award, landed on more than fifteen best-of-the-year lists, and inspired the film Seabiscuit, which was nominated for seven Academy Awards, including Best Picture. She served as a consultant on the Universal Pictures feature film based on Unbroken. Hillenbrand’s New Yorker article, “A Sudden Illness,” won the National Magazine Award. Her work has also appeared in such publications as the New York Times, Vanity Fair, the Washington Post, and the Los Angeles Times. She and actor Gary Sinise were cofounders of Operation International Children, a charity that provided school supplies to children through American troops."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 15 hrs 15 mins",
            "FREE delivery February 26 - 28 on orders shipped by Amazon over $35",
            "Or fastest delivery February 24 - 26",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Wednesday, February 21. Order within 15 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In this captivating and lavishly illustrated young adult edition of her award-winning #1 New York Times bestseller, Laura Hillenbrand tells the story of a former Olympian's courage, cunning, and fortitude following his plane crash in enemy territory. This adaptation of Unbroken introduces a new generation to one of history's most thrilling survival epics. On a May afternoon in 1943, an American military plane crashed into the Pacific Ocean and disappeared, leaving only a spray of debris and a slick of oil, gasoline, and blood. Then, on the ocean surface, a face appeared. It was that of a young lieutenant, the plane’s bombardier, who was struggling to a life raft and pulling himself aboard. So began one of the most extraordinary sagas of the Second World War. The lieutenant’s name was Louis Zamperini. As a boy, he had been a clever delinquent, breaking into houses, brawling, and stealing. As a teenager, he had channeled his defiance into running, discovering a supreme talent that carried him to the Berlin Olympics. But when war came, the athlete became an airman, embarking on a journey that led to his doomed flight, a tiny raft, and a drift into the unknown. Ahead of Zamperini lay thousands of miles of open ocean, leaping sharks, a sinking raft, thirst and starvation, enemy aircraft, and, beyond, a trial even greater. Driven to the limits of endurance, Zamperini would respond to desperation with ingenuity, suffering with hope and humor, brutality with rebellion. His fate, whether triumph or tragedy, would hang on the fraying wire of his will. Featuring more than one hundred photographs plus an exclusive interview with Zamperini, this breathtaking odyssey—also captured on film by director Angelina Jolie—is a testament to the strength of the human spirit and the ability to endure against the unlikeliest of odds.Praise for Unbroken\"This adaptation of Hillenbrand's adult bestseller is highly dramatic and exciting, as well as painful to read as it lays bare man's hellish inhumanity to man.\"—Booklist, STARRED\"This captivating book emphasizes the importance of determination, the will to survive against impossible odds, and support from family and friends. A strong, well-written work.\"—SLJ\"This fine adaptation ably brings an inspiring tale to young readers.\"—Kirkus Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Education & Reference",
                "link": "https://www.amazon.com/Teen-Young-Adult-Education-Reference/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3344092011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Random House Children's Books; Reprint edition (April 25, 2017)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 320 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0385742525"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0385742528"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 11+ years, from customers"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 850L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 7 - 9"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.04 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 7 x 0.84 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,267 in Books (See Top 100 in Books) #1 in Teen & Young Adult Sports Biographies #1 in Teen & Young Adult Military History #1 in Teen & Young Adult Historical Biographies"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 5,311 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Diana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLJESRZBHDWY56NVXRGXR2E3MLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34R7WPGNW9PLW?ASIN=0385742525",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Best book ever",
                "reviewText": "Laura Hillenbrand’s Unbroken is a book that will leave a lasting impression on any reader. The biography of Louis Zamperini's incredible life journey is extremely heart-wrenching and uplifting. An important theme of the book is the power of forgiveness. Throughout his journey, Louis gained just feelings of anger and resentment towards his captors. However, in the end, he found it within himself to forgive them, realizing that holding onto those negative emotions was only hurting himself. After being abused and tortured this was a massive challenge for Louis, but he eventually forgave them. This message is particularly relevant in today's world, where so many people are quick to judge and condemn others without taking the time to understand their perspectives. Even though what the Japanese were doing to Louis was wrong, he had to take in their perspective. Also, this book is a powerful reminder of the horrors of war and the damages it causes. The book's vivid descriptions of Louis's experiences as a prisoner of war in Japan are an eye opening reminder of the inhumanity that can occur in times of war. However, the book also shows us that even in the darkest of times, there is always hope for a better future. Louis was able to use this hope to get himself through all of the challenges that he faced. This is absolutely a must read because of all of the lessons the book teaches. It is a reminder to have forgiveness in our hearts, and to find hope even in the darkest of places. Louis Zamperini's story is one that will stay with you forever, and it will inspire you to be a better person and to never give up, no matter what life throws at you.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRMMN7QFONN3WYTU4EX3RUHBLQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCAUVKBEX56SO?ASIN=0385742525",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Simply brilliant non fiction history",
                "reviewText": "Every citizen should read this book. The price soldiers payed for our blessings were and continue to be severe. This book brings one man's low expectations to a high reality then down an incredible deep abyss of endurance and pain. The ending is a true shocker. It will renew or confirm one's faith in a power greater than ourselves. Non-fiction. Far superior to the movie which left out so much. The author is a great writer. She flawlessly tells this remarkable story.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joseph W. Moylan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVMQLV7CEFXTIIM37BOBGFA5KGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30CMZ0EADB20B?ASIN=0385742525",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Never give up!",
                "reviewText": "Should be required reading for Jr. high. Learn your countries history!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mimi Devereaux",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHT3Y4SF4IRKJUBDVUPBJXQREA6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QGR7RK66F8ZA?ASIN=0385742525",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2014",
                "reviewTitle": "5.0 out of 5 stars This will do the trick! Yay!",
                "reviewText": "My ten-year-old reads well above grade level, but is still reluctant. Like many boys, he just doesn't want to sit still long enough to get through a story! He likes adventure stories, so I thought he would enjoy listening to the audio version of \"Unbroken,\" while following along in the book. No dice. I lost him at the word \"dirigible.\"So I was delighted to learn that a young adult version was on the horizon, and I immediately pre-ordered both the Kindle and audio versions. I am pleased to report that I think this will do the trick.Of course, the first thing I did upon receiving the new version, was to turn to Chapter One to see if the word \"dirigible\" had been changed! It is now \"airship.\" Then I went back to the beginning and did a side-by-side comparison of both. The changes were immediately apparent:On the first page, the previous version read: Somewhere on the endless expanse of the Pacific Ocean, Army Air Forces bombardier and Olympic runner Louie Zamperini lay across a small raft, drifting westward.The new version read: Somewhere on the Pacific Ocean, American military airman and Olympic runner Louie Zamperini lay on a small raft, drifting.In a nutshell, Hillenbrand deleted \"the endless expanse of,\" and simplified Zamperini's title from \"Army Air Forces bombardier,\" to \"American military airman.\"Looking randomly through the two books, I'm seeing other instances of abridgement, as well as simplified language. I have high hopes that my young reader will now enjoy this story. I'm excited at the prospect, as I think our children need to read more stories about people like Mr. Zamperini. He is easily the bravest, most remarkable person I've ever read about, and a fine example of what we hope our young people will choose to emulate.A final thought: I'm an avid reader, but I wish this version had been out when I read the original. While still long, it is shorter than the first book, and I wouldn't consider this one to be at all \"dumbed down.\" It would not be inappropriate for an adult to read this version instead of the other.",
                "reviewVotes": "411 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gina U",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKLO74KFZXC5HS3L5KWYU5IRWAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KUWAZPAQFT8L?ASIN=0385742525",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Interesting Story",
                "reviewText": "I ordered this book for my husband as he was recovering from a stroke. He enjoyed the book but wants to read the original book. This version is much smaller and not as wordy as the original. Which I thought would be better for my husband because at the time his brain wouldn't have been able to handle so much detail. Plus he's not much of reader but his recovery required him to basically do nothing but rest for awhile. Given he actually finished the book says a-lot. If you want an easier read for this particular story I recommend this one.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claire T Taylor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5WFSCK2X7TJL2II27KK2YUX3IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RG0TYP8TD8X72?ASIN=0385742525",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Required summer reading",
                "reviewText": "This was a book required for summer reading for my son. It was easier and cheaper to purchase here and have it delivered to my house",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary C. Ellis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVGTUEFAH6DZHEUNNKYDKQP3Q3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJIM36MZM4J14?ASIN=0385742525",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Great book!",
                "reviewText": "It’s like ready history. I’ve read it twice!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rdgteacher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCC5YEK7Z2PDRFZW7MZZKE5WCYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH6959QQS34RJ?ASIN=0385742525",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Wonderful",
                "reviewText": "Such a wonderful Story for my 10 year old son to read with his dad. We’ve been learning about wwii in our homeschool and this story was a beautiful compliment to the complexities of POW and the strength and resilience of the silent generation. It was well adapted to a younger audience without removing the drama and accuracy of war. Well done.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2023",
                "reviewTitle": "Recommend for you readers",
                "reviewText": "I would recommend it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rhianon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 10, 2021",
                "reviewTitle": "My son loved this book",
                "reviewText": "I bought this book for my 12 year old son and he has been really enjoying it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SSC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 6, 2020",
                "reviewTitle": "Olympian Survivor of WWII",
                "reviewText": "Do you want to know how Louie Zamperini, an Olympian, survived in a Japanese P.O.W camp? If that sounds interesting to you, then I recommend you read Unbroken by Laura Hillenbrand.Although I encourage you to read the book, if you are not comfortable with violence, I wouldn’t suggest it.This fascinating story shows the perspective of a poor family. In the book Louie steals to get food for himself. In addition to stealing, the Zamperinis ran out of money at the end of each week and were forced to improvise food.If you like studying WWII, then you will like this book. One point to support this is that a lot of the story is about Louie, the main character, being in the U.S. Army Air Forces. Another example is it shows the treatment of P.O.W.s during the war.This book also has a lot of show don’t tell writing which means the author describes what characters are feeling or what is happening instead of just saying it. One example of this is, “Louie was standing in dust, sweating,” which explains it was hot. Another example is, “There was a pulse of light,” which means there was an explosion.To sum it all up, I recommend this book because it shows the perspective of a poor family, WWII history and a lot of show don’t tell. The best part is it’s a true story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Naomi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 26, 2020",
                "reviewTitle": "Engaging book for a young teenage boy",
                "reviewText": "My almost 13 year old son loved this book from cover to cover and read it during lockdown over the past few weeks. As a relucant reader of late, it was a relief to find a book that captured his imagination! He now wants me to buy books of a similar genre. Highly recommend this youth adaptation for 12 plus age group.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 6, 2018",
                "reviewTitle": "Awesome",
                "reviewText": "The book was like new,very good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.38",
                "sellerName": "Shakespeare Book House",
                "sellerRating": "5"
            }
        ]
    }
}