{
    "remaining_requests": 656,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Reminiscences-Stock-Operator-Edwin-Lefevre-ebook/dp/B09YRCNQHB",
    "body": {
        "name": "Reminiscences of a Stock Operator",
        "price": "$0.49",
        "originalPrice": "",
        "rawPrice": 0.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Reminiscences-Stock-Operator-Edwin-Lefevre-ebook/dp/B09YRCNQHB",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71mLbU4n3IL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Edwin Lefevre",
            "link": "https://www.amazon.com/Edwin-Lefevre/e/B000APATZG/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 4163,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Reminiscences of a Stock Operator is a fictitious account of Jesse Livermore's trading career. It chronicles his life from the time he was 15 years old and made his first $1,000 to becoming a Wall Street superstar. See how he learned the ropes of trading the hard way by losing everything and then making it back. Readers are still benefiting greatly from Livermore's experience decades after it was first published.These chapters include lengthy statements from Livermore and are based on a series of interviews conducted by leading financial writer Richard D. Wyckoff. He talks about how to figure out what stocks to buy and when, as well as the psychology of trading and how to get started. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Business & Money",
                "link": "https://www.amazon.com/Business-Money-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=154821011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09YRCNQHB"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ SAS Books (April 22, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ April 22, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1223 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 324 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1983011118"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#46,097 in Kindle Store (See Top 100 in Kindle Store) #4 in Business Writing Skills (Kindle Store) #7 in Banks & Banking (Kindle Store) #13 in Business Systems & Planning"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 4,163 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Vasiliy Zhulin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5DVZ7TSVTS4A5DVVG3AWYGF7VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LTOSAIWNUU4Q?ASIN=B09YRCNQHB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2007",
                "reviewTitle": "5.0 out of 5 stars A timeless masterpiece filled with wisdom still applicable today",
                "reviewText": "Edwin Lefèvre does a fantastic job bringing the experiences of Jesse Livermore (disguised in the pages as Larry Livingston) to life in this fantastic book. This work is written as a novel and almost as a biography, in which Livermore describes his career as a stock operator. He starts from his childhood days in bucket shops (which earned him the title of \"boy plunger\"), continues with his experiences on Wall Street - where he made and lost millions of dollars over and over again, and finishes with intriguing stories on price manipulation and speculation back in the earlier half of the 20th century.All throughout the book, amidst the inspiring stories and witty humor, the reader will find numerous pieces of advice - on anything from human psychology and public behavior to insider trading and investing/speculation strategies. I completely agree with other reviewers who state that this book needs to be read more than once. You simply won't absorb all the useful information the first time. Maybe not even the first two times. Or three.Some of the book's advice is very obvious, as it is repeated many times over. Livermore makes his basic strategy clear - incremental or \"probe\" approach, where he would slowly build his position in a certain stock/commodity by buying (or selling) blocks of securities until he reached his target - if the ticker tape confirmed his outlook. For example, assume Livermore wanted to go long on A with an investment target of $10,000. He'd first buy $1,000 and wait. If the price moved up, his assessment seemed to be correct - so he'd buy another $2,000 of A at the slightly higher price. If the price kept going up, he'd then increase his position to $6,000 - and eventually up to $10,000 - his original target. If, of course, the price reacted differently, his market \"probe\" would tell him that his assessment may not have been correct.Other \"obvious\" advice in the book is equally important - history repeats itself (he describes 2 amazing cases - Stratton's corner on corn and insider boosting of Tropical Trading - where he used the same technique to turn a commodity or stock bearish), don't ever follow tips from anyone (trust in yourself only), and don't cash out quickly for a small profit - but rather ride your investment out (go long in a bull market, short in a bear market).Amidst examples and stories in which the above pieces of advice appear to shine over and over again, other small and hidden tid-bits pop up throughout the entire book. Livermore is unafraid to talk about his mistakes, and he makes it clear that it's not his wish to brag about his successes - but to simply inform the reader why he did what he did. And he does a fantastic job in that.The book is very well written. It feels like a novel, where every chapter follows the main story arc but talks about something different each time, with great insight on yet another topic. The stories are very engaging, often witty and humorous. I read through more than half of the book carefree, simply enjoying the great prose and Lefèvre's literary skill - before I realized that Livermore has been giving me timelessly precious advice all throughout, and that I need to pay more attention.I will read this book again. I will take notes again. I don't want to miss anything.In conclusion, I highly recommend this book to anyone who is interested in the stock or commodities markets. It is enjoyable and entertaining, and it is eye-opening and insightful. It can be read simply as a collection of intriguing stories, or as an \"investment bible\" with much advice that is still applicable today. While the rules of the exchanges and the amount of money that flows through them have changed, the people trying to beat the market haven't.Pros:+ beautiful literary prose+ intriguing, engaging, witty stories+ lots and lots of investment advice that still holds true today (80+ years later!)+ many examples of historical events that have and will continue to repeat themselves+ great as either a low-key bed-time book or as a serious stock/commodity investment and speculation guide+ each chapter talks about something new, making it easy to read the book over time without losing track of the main storyCons:- first published in 1923 - so keep in mind that, of course, some things are outdated (i.e. certain rules and practices are in place now that weren't then, the amount of money has increased to a point where stock price manipulation is not as easy, etc.) - but treat this as a history lesson- probably needs to be read more than once (but is that really a con?) for the investment advice",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cameron Cobb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJFAMUSRBT3UDFAQ3AKITQ63F2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TT4Z63VT4UPV?ASIN=B09YRCNQHB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Phenomenal book",
                "reviewText": "Great book. Many tales still apply to what you see in the markets today.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "O. Halabieh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRGEDFNY7H3NZF63VA5JTQGHKOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YRXIPNK8ECP4?ASIN=B09YRCNQHB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 15, 2013",
                "reviewTitle": "4.0 out of 5 stars The Trading Handbook!",
                "reviewText": "1- \"Another lesson I learned early is that there is nothing new in Wall Street. There can't be because speculation is as old as the hills. Whatever happens in the stock market to-day has happened before and will happen again. I've never forgotten that. I suppose I really manage to remember when and how it happened. The fact that I remember that way is my way of capitalizing experience.\"2- \"It takes a man a long time to learn all the lessons of all his mistakes. They say there are two sides to everything. But there is only one side to the stock market; and it is not the bull side or the bear side, but the right side. It took me longer to get that general principle fixed firmly in my mind than it did most of the more technical phases of the game of Stock speculation.\"3- \"If the unusual never happened there would be no difference in people and then there wouldn't be any fun in life. The game would become merely a matter of addition and subtraction. It would make of us a race of bookkeepers with with plodding minds. It's the guessing that develops a man's brain power. Just consider what you have to do to guess right.\"4- \"There is nothing like losing all you have in the world for teaching you what not to do. And when you know what not to do in order not to lose money, you begin to learn what to do in order to win. Did you get that ? You begin to learn!\"5- \"After spending many years m Wall Street and after making and losing millions of dollars I want to tell you this: It never was my thinking that made the big money for me. It always was my sitting. Got that? My sitting tight! It is no trick at all to be right on the market. You always find lots of early bulls in bull markets and early bears in bear markets. I've known many men who were right at exactly the right time, and began buying or selling stocks when prices were at the very level which should show the greatest profit. And their experience invariably matched mine--that is, they made no real money out of it. Men who can both be right and sit tight are uncommon. I . I found it one of the hardest things to learn. But it is only after a stock operator has firmly grasped this that he can make big money. It is literally true that millions come easier to a trader after he knows how to trade than hundreds did in the days of his ignorance.\"6- \"The reason is that a man may see straight and clearly and yet become impatient or doubtful when the market takes its time about doing as he figured it must do. That is why so many men in Wall Street, who are not at all in the sucker class, not even in the third grade, nevertheless lose money. The market does not beat them. They beat themselves, because though they have brains they cannot sit tight.\"7- \"Even as a lad I always got my own meanings out of such facts as I observed. It is the only way in which the meaning reaches me. I cannot get out of facts what somebody tells me to get. They are my facts, don't you see? If I believe something you can be sure it is because I simply must.\"8- \"A stock speculator sometimes makes mistakes and knows that he is making them. And after he makes them he will ask himself why he made them; and after thinking over it cold-bloodedly a long time after the pain of punishment is over he may learn how he came to make them, and when, and at what particular point of his trade; but not why. And then he simply calls himself names and lets it go at that. Of course, if a man is both wise and lucky, he will not make the same mistake twice. But he will make any one of the ten thousand brothers or cousins of the original. The Mistake family is so large that there is always one of them around when you want to see what you can do in the fool-play line.\"9- \"The weaknesses that all men are prone to are fatal to success in speculation--usually those very weaknesses that make him likable to his fellows or that he himself particularly guards against in those other ventures of his where they are not nearly so dangerous as when he is trading in stocks or commodities. The speculator's chief enemies are always boring from within. It is inseparable from human nature to hope and to fear. In speculation when the market goes against you you hope that every day will be the last day--and you lose more than you should had you not listened to hope--to the same ally that is so potent a success-bringer to empire builders and pioneers, big and little. And when the market goes your way you become fearful that the next day will take away your profit, and you get out--too soon. Fear keeps you from making as much^money as you ought to. The successful trader has to fight these two deep-seated instincts. He has to reverse what you might call his natural impulses. Instead of hoping he must fear; instead of fearing he must hope. He must fear that his loss may develop into a much bigger loss, and hope that his profit may become a big profit. It is absolutely wrong to gamble in stocks the way the average man does.\"10- \"The professional concerns himself with doing the right thing rather than with making money, knowing that the profit takes care of itself if the other things are attended to. A trader gets to play the game as the professional billiard player does--that is, he looks far ahead instead of considering the particular shot before him. It gets to be an instinct to play for position.\"11- \"A trader, in addition to studying basic conditions, remembering market precedents and keeping in mind the psychology of the outside public as well as the limitations of his brokers, must also know himself and provide against his own weaknesses. There is no need to feel anger over being human.\"12- \"A bear tip is distinct, positive advice to sell short. But the inverted tip that is, the explanation that does not explain--serves merely to keep you from wisely selling short. The natural tendency when a stock breaks badly is to sell it. There is a reason--an unknown reason but a good reason; therefore get out. But it is not wise to get out when the break is the result of a raid by an operator, because the moment he stops the price must rebound. Inverted tips!\"13- \"The belief in miracles that all men cherish is born of immoderate indulgence in hope. There are people who go on hope sprees periodically and we all know the chronic hope drunkard that is held up before us as an exemplary optimist. Tip-takers are all they really are.\"14- \"I have found that experience is apt to be steady dividend payer in this game and that observation gives you the best tips of all. The behaviour of a certain stock is all you need at times. You observe it. Then experience shows you how to profit by variations from the usual, that is, from the probable.\"15- \"The manipulator to-day has no more need to consider what they did and how they did it than a cadet at West Point need study archery as practiced by the ancients in order to increase his working knowledge of ballistics. On the other hand there is profit in studying the human factors--the ease with which human beings believe what it pleases them to believe; and how they allow themselves-- or by the dollar-cost of the average man's carelessness. Fear and hope remain the same; therefore the study of the psychology of speculators is as valuable as it ever was. Weapons change, but strategy remains strategy, on the New York Stock Exchange as on the battlefield.\"16- \"Speculation in stocks will never disappear. It isn't desirable that it should. It cannot be checked by warnings as to its dangers. You cannot prevent people from guessing wrong no matter how able or how experienced they may be. Carefully laid plans will miscarry because the unexpected and even the unexpectable will happen. Disaster may come from a convulsion of nature or from the weather, from your own greed or from some man's vanity; from fear or from uncontrolled hope. But apart from what one might call his natural foes, a speculator in stocks has to contend with certain practices or abuses that are indefensible morally as well as commercially.\"17- \"But today, a '\"an is trading in everything; almost every industry in the world is represented. It requires more time and more work to keep posted and to that extent stock speculation has become much more difficult for those who operate intelligently.\"",
                "reviewVotes": "182 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Irma R",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 23, 2022",
                "reviewTitle": "Excelente libro, la edición en inglés muy bien",
                "reviewText": "Excelente recopilación de datos, intenté la traducción al español y no se entiende.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jvlimas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 26, 2022",
                "reviewTitle": "MELHOR LIVRO PARA TRADER",
                "reviewText": "MELHOR LIVRO PARA ADQUIRIR A MENTALIDADE DE TRADER",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "abhijit b",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 8, 2024",
                "reviewTitle": "Great Book",
                "reviewText": "Must read if Stock market excites you",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samer AmaneddineSamer Amaneddine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 29, 2023",
                "reviewTitle": "Great book",
                "reviewText": "",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/813QzR8vpAL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luca",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 28, 2021",
                "reviewTitle": "A must read, should be mandatory in business colleges",
                "reviewText": "Best investment book ever, every sentence is full of wisdom! a must read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}