{
    "remaining_requests": 434,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Novel-Who-Needs-Joseph-Epstein/dp/1641773057",
    "body": {
        "name": "The Novel, Who Needs It?",
        "price": "$16.39",
        "originalPrice": "",
        "rawPrice": 16.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Novel-Who-Needs-Joseph-Epstein/dp/1641773057",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/51iev9ctysL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Joseph Epstein",
            "link": "https://www.amazon.com/Joseph-Epstein/e/B000APTOSE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 49,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “If Epstein's ultimate master is Montaigne, his more immediate master is Mencken. Like Mencken, he has fashioned a style that successfully combines elegance and even bookishness with street-smart colloquial directness. And there is nothing remote or aloof about him.” —John Gross“[Joseph Epstein's] work is well in the Addisonian line of succession that [Cyril] Connolly saw petering out in Punch and the professional humorists. . . Epstein is a great deal more sophisticated than they were, and a great deal more readable. His subjects are tossed up, turned round, stuck with quotations, abandoned, returned to, playfully inverted, and finally set back on their feet, as is the reader, a little breathless but quite unharmed. But it is essentially a merry-go-round, not a view to death.”—Philip Larkin“The modern essay has regained a good deal of its literary status in our time, much to the credit of Joseph Epstein.”—Karl Shapiro“Joseph Epstein's essays no more need his identifying byline than Van Gogh's paintings need his signature. Epstein's style—call it learned whimsy—is unmistakable; for Epstein addicts, indispensable.”—George Will“Joseph Epstein is an essayist in the brilliant tradition of Charles Lamb. He moves so effortlessly from the amusingly personal to the broadly philosophical that it takes a moment before you realize how far out in the intellectual cosmos you have been taken. He is also mercilessly free of the petty intellectual etiquettes common at this moment in our national letters. It is refreshing to hear so independent a voice.”—Tom Wolfe About the Author Joseph Epstein is the author of thirty-one books, among them books on divorce, ambition, snobbery, friendship, envy, and gossip. He has published seventeen collections of essays and four books of short stories. He has been the editor of the American Scholar, the intellectual quarterly of Phi Beta Kappa, and for thirty years he taught in the English Department at Northwestern University. He has written for the New Yorker, Commentary, the New Criterion, Times Literary Supplement, Claremont Review of Books, the New York Review of Books, Poetry, and other magazines both in the United States and abroad."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 14 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In this brief but highly engaging book Joseph Epstein argues for the primacy of fiction, and specifically of the novel, among all intellectual endeavors that seek to describe the behavior of human beings. Reading superior fiction, he holds, arouses the mind in a way that nothing else quite does. He shows how the novel at its best operates above the level of ideas in favor of taking up the truths of the heart. No other form probes so deeply into that eternal mystery of mysteries, human nature, than does the novel. Along the way, Epstein recounts how we read fiction differently than much else we read. He sets out how memory works differently in the reading of fiction than in that of other works. He notes that certain novels are best read at certain ages, and suggests that novels, like movies, might do well to carry ratings, with some novels best read no later than one’s early twenties, others not to be read before the age of forty.The knowledge one acquires from reading novels differs from all other kinds of knowledge, for the subject of all superior fiction is human existence itself, in all its variousness and often humbling confusion. The spirit of the novel entails questioning much that others consider home truths. This is demonstrated by the fact that so many important philosophers, social scientists, jurists, and other intellectuals have been devoted readers of fiction, among them Oliver Wendell Holmes, Jr., Michael Oakeshott, Edward Shils, and Clifford Geertz.The Novel, Who Needs It? takes up those current elements in the culture that militate against the production of first-rate fiction. Prominent among them are the rise of online reading, the expansion of creative writing programs, the artistically discouraging effects of political correctness, and the pervasiveness of therapeutic thinking throughout contemporary culture. As for the title, The Novel, Who Needs It?, Joseph Epstein’s answer is that we all do. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "History & Criticism",
                "link": "https://www.amazon.com/History-Criticism-Literature-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10204"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Encounter Books (July 18, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 152 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1641773057"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1641773058"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 18 years and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.4 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#68,314 in Books (See Top 100 in Books) #36 in General Books & Reading #175 in Literary Genre History & Criticism"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 49 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joy Schwabach",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGN6JTDWV3BRCWM43S32PCAY2IGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL0OVRBM7OO7N?ASIN=1641773057",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars A Profound Book",
                "reviewText": "This book is an antidote to the cultural slide going on all around us. It points the way to a richer experience of life. It encourages the sort of inquiry that makes us better people, by showing us how novels can aid us in our journeys. It pushes away political correctness and psychobabble in favor of matters of the heart. Bravo!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth Milan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAAN7KZW3FYS5KLAYNOTHEVK5QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3M8OU9P5ZN0NW?ASIN=1641773057",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 2, 2023",
                "reviewTitle": "5.0 out of 5 stars the novel is the best art form to explore humanity in all its depth.",
                "reviewText": "Joseph Epstein is one of our overlooked but important essayists. Here he reminds us of the treasures to be found in thoughtful novels that explore the human condition.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AL Adriano",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7LDK7NQFLVFWM3BKVSME3EUZWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW6OIK8FT017B?ASIN=1641773057",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2023",
                "reviewTitle": "4.0 out of 5 stars A thought and discussion-provoking read for readers of The Novel",
                "reviewText": "Back in April 2016, I sent Joseph Epstein an email with a cover photo of a graphic novel I saw at a Fully Booked in BGC, Manila. The title amused me, and Epstein was one of two people whom I knew would appreciate the irony of it. That graphic novel was Swann's Way, and my message said \"I guess it was just a matter of Time,\" a phrase he found \"very amusing to use in connection with Proust.\" (Yes, I am very much a fan of Mr Epstein, and no, I don't go around writing random emails to every writer I'm a fan of--ask Stephen King if I've ever written to him.) Seven years later, as I was reading this book, specifically on \"the phenomenon known as 'graphic novels,\" I am equally amused to read his reaction of \"a comic-book version of Proust--who would have thought it?\" (Perversely, I now have this hankering to read that graphic novel/comic book.) In any case, like me, Epstein scoffs at this fancy labelling of what is essentially a comic book with better quality paper and binding, and shares novel and comic book writer Neil Gaiman's catty comment: I felt like someone who'd been informed that she wasn't actually a hooker; that in fact she was a lady of the evening.That the re-labelling of the comic book as a graphic novel is one of the pet peeves I share with Epstein is new to me. What is not are his sentiments on political correctness gone awry, fostering the hybrid cultural menace that is cancel culture. But these are trivial reasons for my ceaseless pursuit of Epstein's writing. With each of his books I take away something that provokes thought and enriches my reading pleasure, even stirs the curious soul. From this, one of his of his shortest books, I have gathered that Theodore Dreiser and Willa Cather--two writers who are unlikely to be in the running at any hypothetical Cocktail Party Test Epstein somewhat optimistically brings up--are recommended reading, and Joseph Conrad, whose stories I have long been a fan since my days, much like the young Epstein, as a serial Illustrated Classics comic book reader, highly recommended rereading. It has also placed an intriguing book in my periphery, a book which may explain why the novel is in peril, however subtly. Philip Rieff's The Triumph of the Therapeutic \"marks a significant shift in our culture\" with the contention that we no longer live \"in a culture where honor and dignity, courage and kindness, are primary, but instead in one in which self-esteem and self-gratification are the chief goals. The enemy in the new therapeutic culture is repression, and its main means of expression is confession.\" Novel thought, that, when you realize Rieff published this in 1966, some thirty years before the internet and social media took over our lives.So. The novel, who needs it? For as long as readers are provoked by \"the role of destiny and moral conflict\" in literature, then I think the novel will continue to stay relevant.* If this had not been such an invigorating, thought and discussion-provoking read, I would have felt terribly shortchanged. Because really, it's a tauntingly-titled lengthy essay on the novel, hardbound, with a neat dust jacket. And it cost this Philippine peso-earning reader $20.49 (exchange rate, $1=P56+). But boy was it worth it--every hard-earned peso and centavo of it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "paul zisserson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWCON3APWHJC5AFB25ZJA4ZEAAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OT8F0RGWJ368?ASIN=1641773057",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 27, 2023",
                "reviewTitle": "5.0 out of 5 stars always a pleasure",
                "reviewText": "Any words written by Epstein always glide along the pages with insight and wit. This short work is no exception.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kiri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5ED45CP37FC2OHXJRVMJGS5O5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZI0K9C4BRBNL?ASIN=1641773057",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Love his writing",
                "reviewText": "Joseph Epstein is the best. We read him in Commentary all the time. This book made me want to start rereading the greats.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQUH7NZHTC3FZ3XTSPDRAIBDC7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RHNX9E22EZF6?ASIN=1641773057",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2023",
                "reviewTitle": "5.0 out of 5 stars the enduring value of the novel",
                "reviewText": "I have always loved Joseph Epstein's writing, for its freshness, wit, and intelligence. This latest essay does not disappoint. It is an engaging and entertaining defense of the novel. Novels can do things for us emotionally and intellectually that no other form can do. Among many values, it can supercharge our gathering of experiences to help us develop and sharpen our moral discernement, as the author explains well. The book is not just an argument that one ought to read novels, like one ought to eat their vegetables. Its infectious enthusiasm for its enjoyment value too (literature is broccoli that tastes like ice cream, one might say) rather propels one to get a novel and start reading. Next stop, Willa Cather.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laurence Goldstein",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBLSJ7PKKCTYK3MA6LB3A6QG6MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LFNMRKAOOGTH?ASIN=1641773057",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars We both were young enthusiasts of John R. Tunis.",
                "reviewText": "From Epstein, “The novel at its best demonstrates the thinness of most such intellectual constructs [current day philosophy, social science, pop psychology, high flown journalism], and seeks to discover deeper truths, the truth of the imagination, the truth of human nature, the truth of the heart.” As an essay in persuasion, it may be useless: I don’t see why a person who is novel averse would read this book, much less why a novel averse person might be persuaded to read a novel. On the other hand, I was interested in his insights and in the differences and similarities between his views and mine. For example, we both were young enthusiasts of John R. Tunis.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}