{
    "remaining_requests": 495,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fighting-Belong-Americans-Hawaiians-Islanders/dp/B0CCQS7KLF",
    "body": {
        "name": "Fighting to Belong!: Asian American, Native Hawaiian, and Pacific Islander History from the 1700s Through the 1800s (A History of Asian Americans, Native Hawaiians, and Pacific Islanders, 1)",
        "price": "$11.95$11.95",
        "originalPrice": "",
        "rawPrice": 11.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fighting-Belong-Americans-Hawaiians-Islanders/dp/B0CCQS7KLF",
        "soldBy": {
            "sellerID": "A2U84RID2RXM9W",
            "name": "the_nps_store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2U84RID2RXM9W"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "Available to ship in 1-2 days",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/A1bPBnHFTsL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Amy Chu",
            "link": "https://www.amazon.com/Amy-Chu/e/B019LW0RTG/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "the_nps_store",
        "customerReview": "5.0 out of 5 stars",
        "customerReviewCount": 11,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Historic contributions and stories of resilience are shared in this dynamic graphic novel. An informative and engaging read!\" —Maia and Alex Shibutani, two-time Olympic medalists and authors of Amazing: Asian Americans and Pacific Islanders Who Inspire Us AllPraise for Amy Chu: “An impressive graphic fantasy with adventure, danger, and magic . . . A fast-paced beginning to a stunning new under-the-sea graphic series.”—Kirkus Reviews (Sea Sirens)\"Another stunning work of art . . . With mermaids, an evil collector of curiosities, a hero cat, an extraordinary theme park, and twists and turns aplenty, there is something for all fantasy adventure lovers.\"—Kirkus Reviews (Sky Island) SCHOOL LIBRARY JOURNAL RECOMMENDED PURCHASEFighting to ­Belong!: Asian American, Native Hawaiian, and Pacific Islander History from the 1700s Through the 1800s by Amy Chu & Alexander Chang (text) & illus. by Louie Chin Third State Bks. (A History of Asian Americans, Native Hawaiians, and Pacific Islanders: Bk. 1). Feb. 2024. 40p. Tr $18.95 ISBN 9798890130198. Gr 6 Up–Middle school students Padmini, Sammy, Joe, and Tiana visit the local history museum for their group project on AANHPI (Asian Americans, Native Hawaiian, and Pacific Islanders). Accompanied by Kenji, a tour guide at the museum, they embark on an incredible journey through time where they discover key events in AANHPI history. Kenji starts the history journey with the arrival of the “Manilamen” (Filipino immigrants) in the 18th century, followed by various momentous events spanning the next 150 years in the United States. These are supplemented with rich artifacts, comprehensive notes, and commentaries. The challenges and contributions of AANHPI people are an integral part of the development of United States, yet they are often not viewed as part of American history and are frequently excluded in American schools. This short, fantastic, and fast-paced graphic novel will fill in that missing piece, providing readers a living history of AANHPI. VERDICT This visually engaged book helps young readers of all backgrounds across the country understand how AANHPI historical events are greatly linked within the foundation of the United States. Recommended purchase. Reviewed by Anna Ching-Yu Wong, Jan 01, 2024 About the Author Amy Chu is a writer for comics, graphic novels, and TV, currently working on projects for DC, Marvel and Netflix. She has written popular characters such as Wonder Woman, Deadpool, Ant-Man and Iron Man. She wrote Poison Ivy’s first solo mini series, and is the first woman to write the Green Hornet series created in the 1930s. She is also the author of children's graphic novels, including Sea Sirens and the sequel Sky Island (Viking). Amy is the co-founder of the imprint Alpha Girl Comics and enjoys nonprofit work, creating comics for the New York Historical Society, Baltimore Museum of Art, and the Museum of Chinese in America. She studied Architectural Design at MIT, East Asian Studies at Wellesley College, and has an MBA from Harvard Business School. Amy is a frequent speaker at conventions around the world and lives in New Jersey. You can follow her on amychu.com, twitter @amychu and on Facebook/iwritecomics.Alexander Chang is a writer and editor for comics and graphic novels. His published credits include Rick and Morty, Red Sonja, and the Where We Live anthology. A third generation Chinese American from Princeton, New Jersey, he loves writing in his journal, growing plants, fire spinning, and Chinese lion dancing.Louie Chin is an illustrator whose work includes the children's book, Bodega Cat (POW! Kids Books), which was a Junior Library Guild Gold Standard Selection in 2020. He has created artworks for a variety of publications and projects, including the New York Times, Boston Globe, and Nike. He works in both traditional mediums such as watercolor and gouache as well as with digital art software. He was born and raised in New York City, where he still resides."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 28 - 29 on orders shipped by Amazon over $35",
            "Or fastest delivery February 25 - 26",
            "$3.99 delivery February 23 - 28.",
            "Or fastest delivery February 22 - 27."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A SCHOOL LIBRARY JOURNAL Recommended Purchase!\"The challenges and contributions of AANHPI [Asian American, Native Hawaiian, and Pacific Islander] people are an integral part of the development of the United States, yet they are often not viewed as a part of American history and are frequently excluded in American schools. This short, fantastic, and fast-paced graphic novel will fill in that missing piece, providing readers a living history of AANHPI. VERDICT This visually engaged book helps young readers of all backgrounds across the country understand how AANHPI historical events are greatly linked within the foundation of the United States. Recommended purchase.\"\"Historic contributions and stories of resilience are shared in this dynamic graphic novel. An informative and engaging read!\"—Maia and Alex Shibutani, two-time Olympic medalists and authors of Amazing: Asian Americans and Pacific Islanders Who Inspire Us AllAsian American, Native Hawaiian, and Pacific Islander history is American history. The unique experiences, challenges, and contributions of AANHPIs are an integral part of our country’s development, but they are rarely taught in American schools.For many Americans of Asian American, Native Hawaiian, or Pacific Islander descent who grew up in the United States, there continues to be a startling lack of opportunity to learn about our own history in our country. Even today, over 70% of Americans have little knowledge about AANHPI history or confuse it with Asian history. Fighting to Belong! Asian Americans, Native Hawaiians, and Pacific Islanders from the 1700s Through the 1800s, written by best-selling writer Amy Chu (Wonder Woman, Deadpool, Ant-Man, Iron Man) and Alexander Chang and illustrated by Louie Chin (Bodega Cat), shares this important and dynamic part of the American experience in an accessible and engaging graphic novel format.In this book, the first volume of a three-book series, our middle school protagonists Padmini, Sammy, Joe, and Tiana and their guide, Kenji, embark on an amazing journey through time to witness key events in AANHPI history. They witness the arrival of the \"Manilamen\" to the United States in the eighteenth century and fly through significant moments in the next 150 years. Fighting to Belong! helps new audiences young and old, AANHPI and non-AANHPI, understand how these stories are truly interwoven within the fabric of America.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Geography & Cultures",
                "link": "https://www.amazon.com/Childrens-Geography-Cultures-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3344091011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CCQS7KLF"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Third State Books (February 6, 2024)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 40 pages"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 979-8890130174"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 8 - 12 years"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ GN660L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 4 - 8"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 5.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 0.1 x 0.4 x 9.9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#40,317 in Books (See Top 100 in Books) #4 in Children's Books on Immigration (Books) #36 in Children's Asian & Asian American Books #156 in Children's Multicultural Biographies"
            },
            {
                "name": "Customer Reviews",
                "value": "5.0 5.0 out of 5 stars 11 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29bf29e2-2065-4fee-8813-c7d7502c2a3b.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/089ec2df-0bba-4ea6-8237-29cd9e4610f4.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/06933142-ebf3-45ad-9345-2e340201c624.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jessica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZFSN2BCVUUIEUIPWLQ3ZKSQFIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GUG9UGRXB9NO?ASIN=B0CCQS7KLF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Important AAPI history in fun format",
                "reviewText": "I was worried that this was going to be too advanced in reading and subject matter for my 8 yo, but I thought it was important for us to learn together the history of AAPIs. The framework and graphic novel format made the story very accessible. A group of middle schoolers go on a time traveling field trip of sorts for a school project. During the course of Volume 1, they realize what they're learning is more important than a school project and struggle with their emotions when learning about past wrongs aimed at AAPIs.The book talks about groups of AAPIs who died of disease brought by Europeans or killed due to fighting for their rights or because they were AAPIs. I know some parents aren't ready to talk about those topics with their kids, but we've talked about war and the civil rights movement in the United States particularly about the discrimination the Black community has faced. It felt right to introduce the history of AAPI discrimination and civil rights in parallel.We read through the book at bedtime over two nights. I was wondering if she would want to pick the book up again after the first night, and she enthusiastically requested that we finish it. I stopped at certain parts to explain that we had family members who worked on the railroad and faced discrimination that led them to go back to China. We also talked through some parallels with what she already learned in school, such as Native Hawaiians dying from diseases introduced by Europeans similar to the Native Americans on the U.S. mainland.I also appreciate that the authors included that the US government has apologized for their role in overthrowing the Hawaiian monarchy. We were able to talk through how government sometimes makes big mistakes and what our role is in our democracy.My daughter really enjoyed the book and has asked to bring it in the car with her so she can read parts on her own. I'm sure she'll have some more tough questions for us about the subject matter, but we expected that. This book is a great conversation starter if you want to start these conversations with your kids (or educate yourself for future conversations).My daughter and I are excited to read Volume 2 when it comes out.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDVPG4G7J5SBMTAGRKE3QK7PMRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AOCL2MC6L0MJ?ASIN=B0CCQS7KLF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Wish I had this as a middle schooler - glad my kids do!",
                "reviewText": "My middle schooler, who is Asian American, gobbled this book up and can't wait for the next one. Learning about AAPI history is so important for middle schoolers in shaping a true sense of identity and history - and resources like this - in a fun, but meaningful format like this - are invaluable. I didn't know about some of these events and wish I had known them as a middle schooler - that would've helped me so much understand the world I grew up in as an Asian American growing up in California as well. Glad this exists and can't wait for the next one!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAHWYR2VF24CUCNQV2SN5W344BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NHRM9IRWPDHR?ASIN=B0CCQS7KLF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Great read!",
                "reviewText": "I was so excited to hear about an AAPI book that would present history in a graphic novel format and this did not disappoint! This book covered a lot of ground and opened up a lot of discussions between myself and my 6yo and 8 yo. Definitely a little advanced for the 6yo, but my 8yo actually found the book first and was eager to flip through and take a read before we read it together. In a world of Dog Man and Diary of a Wimpy Kid, this was such a refreshing way to engage and talk about our history.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna Gavin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJCTLMBTOVGQC6MJMWFMZRZUF2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31LPYLKU21J3Z?ASIN=B0CCQS7KLF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for kids",
                "reviewText": "My daughter loved this book and wanted to know when the next volume was coming out n",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth BuckholdElizabeth Buckhold",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLG6ETFMJ5FMSJ3OOG2C3OGENAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YE1VEJEK4A7Q?ASIN=B0CCQS7KLF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Honest Look at Asian American & Pacific Islanders History",
                "reviewText": "Fighting to Belong: History of Asian Americans & Pacific islanders,By Amy Chu, Alexander Chang, and Louie Chin,For more information, check out the...LAAUNCH Foundation, Asian American Education Project, & The Asian American Foundation.As part of an assignment for school, a group of middle school students take a special private tour through an exhibit at the local museum: A History of Asians in America, 18th Century and Beyond. The tour is led by a special tour guide who takes them on a time-traveling adventure through American history where the students witness the injustices faced by many Asian American and Pacific Islanders in America’s past, like those faced during the California Gold Rush and overthrowing of the Hawaiian monarchy. As they prepare for the 20th century part of the tour, the museum director halts the tour and promptly fires the tour guide, leaving the reader with a cliffhanger for the next book in this trilogy.As Kenji, the tour guide, said “ History is about truth. You can’t pick and choose only the nice parts.” This is exactly what the authors of Fighting to Belong have done–provide a visual exploration of the truths about Asian American and Pacific Islanders’ struggles in America. Readers will get an honest dose of history that provides more detail than any middle school history book. Students are shown how the treatment of Asian Americans during the Gold Rush and building of railroads resulted in many deaths, including how racism caused hate-filled mobs, broke apart families, and denied equal access to education to all students. The beauty of this book is how it tells these stories in a graphic novel, a medium that reaches students who otherwise might not pick up a novel or history book. The graphics are well done and the story is written well for all readers. This books is a great addition to any library!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81KVP240GHL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colleen Lindt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVNR53OWUPJHCEM6PHT6OLBUPUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24GSEEXJD6A7Y?ASIN=B0CCQS7KLF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars My 3rd Grader Loves this Comic!",
                "reviewText": "Amy Chu and Alexander Chang wrote such a thoughtful story and I look forward to the next two installments. My daughter could not put this comic down.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "allen yuen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY7LLYFWLX6LKWVHYJPMOGSYXHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D36GN6KHF11A?ASIN=B0CCQS7KLF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Book about Asian American History.",
                "reviewText": "This is a great book about Asian history that I can show my children. I like that it's in a comic form. The writers and artist make a complex history of Asians easily digestible for all ages. I thought I knew everything about Asian history. Surprised that there's so much more to learn. Looking forward to the next volume. Will definitely pick up a copy of Bodega Cat next.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$11.95",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            },
            {
                "price": "$17.72",
                "sellerName": "GrandEagleRetail",
                "sellerRating": "4.5"
            },
            {
                "price": "$13.58",
                "sellerName": "Book & Mortar Record Store",
                "sellerRating": "5"
            }
        ]
    }
}