{
    "remaining_requests": 715,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wager-Tale-Shipwreck-Mutiny-Murder/dp/0385534264",
    "body": {
        "name": "The Wager: A Tale of Shipwreck, Mutiny and Murder",
        "price": "$17.84",
        "originalPrice": "$30.00",
        "rawPrice": 17.84,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wager-Tale-Shipwreck-Mutiny-Murder/dp/0385534264",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91lUa7PChXL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "David Grann",
            "link": "https://www.amazon.com/David-Grann/e/B001YDEZJO/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 22786,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Amazon.com Review An Amazon Best Book of April 2023: David Grann, author of the best seller—and Amazon Best Book of the Year—Killers of the Flower Moon, unfurls a story of mayhem and murder, adventure, and reckless ambition on the high seas. Drawing on “archival debris: the washed-out logbooks, the moldering correspondence, the half-truthful journals, the surviving records from the troubling court-martial,” Grann brilliantly retells the story of the Wager—a British boat bound for South America on a secret mission during the Imperial War with Spain. The fate of the captain and crew was not to be one of conquest or fortune, but frightening storms, shipwreck, savagery, and betrayal. While you can almost feel the salt spray on your skin and the creak and crashing of wood against rock, Grann also captures the pomp and circumstance of imperialism, the brazen bravado of power-hungry men, and the inhuman brutality that fear conjures. The personalities aboard this 18th century ship are made for the history books, as the saying goes, and Grann, once again, has written an epic narrative that is both shocking and utterly absorbing. —Al Woodworth, Amazon Editor Review #1 NEW YORK TIMES BESTSELLERA Best Book of the Year: The New York Times, The Wall Street Journal, The Washington Post, TIME, NPR, Esquire, BookPage“The most gripping sea-yarn I’ve read in years….A tour de force of narrative nonfiction. Mr. Grann’s account show how storytelling, whether to judges or readers, can shape individual and national fortunes – as well as our collective memories.”— Wall Street Journal “Glorious, steely…a tightly written, relentless, blow-by-blow account that is hard to put down”— The Washington Post“As much a rousing adventure as an exploration of the power of narratives to shape our perception of reality.” — The New York Times “Propulsive….finely-detailed…a ripping yarn…remarkable.” — The Boston Globe“David Grann's latest work of narrative nonfiction, The Wager, is part Robinson Crusoe, part Lord of the Flies... Gripping”—Maureen Corrigan, NPR (Top 10 Book of 2023) “Riveting...The Wager reads like a thriller, tackling a multilayered history—and imperialism—with gusto.” — Time Magazine“The beauty of The Wager unfurls like a great sail…He fixes his spyglass on the ravages of empire, of racism, of bureaucratic indifference and raw greed…one of the finest nonfiction books I’ve ever read.” — The Guardian (UK) “The story of the shipwreck and its aftermath features scenery-chewing characters, unexpected twists and an almost unimaginable amount of human misery. Grann, the author of the acclaimed “Killers of the Flower Moon,” tells it with style. He manages to wring maximum drama out of the events and sketch out nuanced portraits of key players on the doomed ship.\" — Associated Press“His dogged search through ships’ logs and other contemporaneous accounts of the disaster and its mutinous aftermath has turned up the kind of sterling details that make his writing sing; he is also interested in the way these events were recorded and then recounted, with many different people trying to shape the memory of what happened. Grann simultaneously reconstructs history while telling a tale that is as propulsive and adventure-filled as any potboiler.”— The Atlantic\"A genre-defying literary naval-history thriller, part Master and Commander, part Lord of the Flies\" — Vanity Fair\"One of our finest nonfiction storytellers returns with a swashbuckling epic about shipwreck, scandal, mutiny, and murder\" — Esquire “A thrilling account…dramatic and engrossing.” — The Economist“This astonishing tale of maritime warfare, mutiny and survival in the 18th-century Atlantic proves that a nonfiction book can be as thrilling as any summer blockbuster.” — People\"The Wager\" is a soaring literary accomplishment and seductive adventure tale… enthralling, seamlessly crafted… ‘The Wager’ then, is an accomplishment as vividly realized and ingeniously constructed as Grann's previous work, on par with Jon Krakauer's Into Thin Air and Sebastian Junger's The Perfect Storm. Welcome a classic.” — Minneapolis Star Tribune“Gripping … Combining impeccable research with exceptional storytelling powers, [Grann] spirits the reader aboard a creaking wooden ship trapped at the eye of a howling storm… No book that you’re likely to read either this year or next will prove more dramatic and enthralling than Grann’s magnificent story of life both at sea and out on the desolate, mist-laden island whose solitary peak the Wager’s unfortunate crew aptly named Mount Misery”— Financial Times “A masterclass in story-telling…With a series of twists and turns worthy of a well-plotted thriller, the author of ‘Killers of the Flower Moon,’ uncovers an epic sea-faring tale…Epic true story as told by a master… David Grann has produced this riveting book…with the artistry of a superb novelist.” — The Toronto Star “[Grann’s] meticulously researched stories, with their spare, simmering setups that almost always deliver stunning payoffs, have made him one of the preeminent adventure and true-crime writers working today…[Grann] has mastered a streamlined, propulsive type of narrative that readers devour for its hide-and-seek reveals…David’s stuff reads like literature, but every detail, every quote, every seemingly implausible glimpse into a subject’s mind is accounted for” — New York Magazine “Your favorite writer’s favorite writer for decades…David Grann is poised to become the moment’s leading storyteller... [Grann] specializes in gripping historical chronicles and crime stories…so rich in intrigue that they would strain credulity in fiction…[Grann’s] become one of our culture’s leading sources of holy s**t page-turners.” — GQ “David Grann is one of the premier nonfiction storytellers of our time…Grann’s masterful new book…is at once an adventure on the high seas, a horror story, and a courtroom drama — a little bit Rashomon meets Lord of the Flies.” — Rolling Stone“Not just a good but a great story, fraught with duplicity, terror and occasional heroism… the story of the Wager is, like many of its antecedents — from Homer’s “Odyssey” to “Mutiny on the Bounty” — a testament to the depths of human depravity and the heights of human endurance, and you can’t ask for better than that from a story...The Wager will keep you in its grip to its head-scratching, improbable end.” — Los Angeles Times About the Author DAVID GRANN is the author of the #1 New York Times bestsellers KILLERS OF THE FLOWER MOON and THE LOST CITY OF Z. KILLERS OF THE FLOWER MOON was a finalist for the National Book Award and won an Edgar Allan Poe Award. He is also the author of THE WHITE DARKNESS and the collection THE DEVIL AND SHERLOCK HOLMES. Grann’s investigative reporting has garnered several honors, including a George Polk Award. He lives with his wife and children in New York. Excerpt. © Reprinted by permission. All rights reserved. Chapter 1The First LieutenantEach man in the squadron carried, along with a sea chest, his own burdensome story. Perhaps it was of a scorned love, or a secret prison conviction, or a pregnant wife left on shore weeping. Perhaps it was a hunger for fame and fortune, or a dread of death. David Cheap, the first lieutenant of the Centurion, the squadron’s flagship, was no different. A burly Scotsman in his early forties with a protracted nose and intense eyes, he was in flight—from squabbles with his brother over their inheritance, from creditors chasing him, from debts that made it impossible for him to find a suitable bride. Onshore, Cheap seemed doomed, unable to navigate past life’s unexpected shoals. Yet as he perched on the quarterdeck of a British man-of-war, cruising the vast oceans with a cocked hat and spyglass, he brimmed with confidence—even, some would say, a touch of haughtiness. The wooden world of a ship—a world bound by the Navy’s rigid regulations and the laws of the sea and, most of all, by the hardened fellowship of men—had provided him a refuge. Suddenly he felt a crystalline order, a clarity of purpose. And Cheap’s newest posting, despite the innumerable risks that it carried, from plagues and drowning to enemy cannon fire, offered what he longed for: a chance to finally claim a wealthy prize and rise to captain his own ship, becoming a lord of the sea.The problem was that he could not get away from the damned land. He was trapped—cursed, really—at the dockyard in Portsmouth, along the English Channel, struggling with feverish futility to get the Centurion fitted out and ready to sail. Its massive wooden hull, 144 feet long and 40 feet wide, was moored at a slip. Carpenters, caulkers, riggers, and joiners combed over its decks like rats (which were also plentiful). A cacophony of hammers and saws. The cobblestone streets past the shipyard were congested with rattling wheelbarrows and horse-drawn wagons, with porters, peddlers, pickpockets, sailors, and prostitutes. Periodically, a boatswain blew a chilling whistle, and crewmen stumbled from ale shops, parting from old or new sweethearts, hurrying to their departing ships in order to avoid their officers’ lashes.It was January 1740, and the British Empire was racing to mobilize for war against its imperial rival Spain. And in a move that had suddenly raised Cheap’s prospects, the captain under whom he served on the Centurion, George Anson, had been plucked by the Admiralty to be a commodore and lead the squadron of five warships against the Spanish. The promotion was unexpected. As the son of an obscure country squire, Anson did not wield the level of patronage, the grease—or “interest,” as it was more politely called—that propelled many officers up the pole, along with their men. Anson, then forty-two, had joined the Navy at the age of fourteen, and served for nearly three decades without leading a major military campaign or snaring a lucrative prize.Tall, with a long face and a high forehead, he had a remoteness about him. His blue eyes were inscrutable, and outside the company of a few trusted friends he rarely opened his mouth. One statesman, after meeting with him, noted, “Anson, as usual, said little.” Anson corresponded even more sparingly, as if he doubted the ability of words to convey what he saw or felt. “He loved reading little, and writing, or dictating his own letters less, and that seeming negligence . . . ​drew upon him the ill will of many,” a relative wrote. A diplomat later quipped that Anson was so unknowing about the world that he’d been “round it, but never in it.”Nevertheless, the Admiralty had recognized in Anson what Cheap had also seen in him in the two years since he’d joined the Centurion’s crew: a formidable seaman. Anson had a mastery of the wooden world and, equally important, a mastery of himself—he remained cool and steady under duress. His relative noted, “He had high notions of sincerity and honor and practiced them without deviation.” In addition to Cheap, he had attracted a coterie of talented junior officers and protégés, all vying for his favor. One later informed Anson that he was more obliged to him than to his own father and would do anything to “act up to the good opinion you are pleased to have of me.” If Anson succeeded in his new role as commodore of the squadron, he would be in a position to anoint any captain he wanted. And Cheap, who’d initially served as Anson’s second lieutenant, was now his right-hand man.Like Anson, Cheap had spent much of his life at sea, a bruising existence he’d at first hoped to escape. As Samuel Johnson once observed, “No man will be a sailor who has contrivance enough to get himself into a jail; for being in a ship is being in a jail, with the chance of being drowned.” Cheap’s father had possessed a large estate in Fife, Scotland, and one of those titles—the second Laird of Rossie—that evoked nobility even if it did not quite confer it. His motto, emblazoned on the family’s crest, was Ditat virtus: “Virtue enriches.” He had seven children with his first wife, and, after she died, he had six more with his second, among them David.In 1705, the year that David celebrated his eighth birthday, his father stepped out to fetch some goat’s milk and dropped dead. As was custom, it was the oldest male heir—David’s half brother James—who inherited the bulk of the estate. And so David was buffeted by forces beyond his control, in a world divided between first sons and younger sons, between haves and have-nots. Compounding his upheaval, James, now ensconced as the third Laird of Rossie, frequently neglected to pay the allowance that had been bequeathed to his half brothers and half sister: some blood was apparently thicker than others’. Driven to find work, David apprenticed to a merchant, but his debts mounted. So in 1714, the year he turned seventeen, he ran off to sea, a decision that was evidently welcomed by his family—as his guardian wrote to his older brother, “The sooner he goes off it will be better for you and me.”After these setbacks, Cheap seemed only more consumed by his festering dreams, more determined to bend what he called an “unhappy fate.” On his own, on an ocean distant from the world he knew, he might prove himself in elemental struggles—braving typhoons, outdueling enemy ships, rescuing his companions from calamities.But though Cheap had chased a few pirates—including the one-handed Irishman Henry Johnson, who fired his gun by resting the barrel on his stump—these earlier voyages had proved largely uneventful. He’d been sent to patrol the West Indies, generally considered the worst assignment in the Navy because of the specter of disease. The Saffron Scourge. The Bloody Flux. The Breakbone Fever. The Blue Death.But Cheap had endured. Wasn’t there something to be said for that? Moreover, he’d earned the trust of Anson and worked his way up to first lieutenant. No doubt it helped that they shared a disdain for reckless banter, or what Cheap deemed a “vaporing manner.” A Scottish minister who later became close to Cheap noted that Anson had employed him because he was “a man of sense and knowledge.” Cheap, the once-forlorn debtor, was but one rung from his coveted captaincy. And with the war with Spain having broken out, he was about to head into full-fledged battle for the first time.The conflict was the result of the endless jockeying among the European powers to expand their empires. They each vied to conquer or control ever larger swaths of the earth, so that they could exploit and monopolize other nations’ valuable natural resources and trade markets. In the process, they subjugated and destroyed innumerable indigenous peoples, justifying their ruthless self-interest—including the reliance on the ever-expanding Atlantic slave trade—by claiming that they were somehow spreading “civilization” to the benighted realms of the earth. Spain had long been the dominant empire in Latin America, but Great Britain, which already possessed colonies along the American eastern seaboard, was now on the ascendance—and determined to break its rival’s hold. Then, in 1738, Robert Jenkins, a British merchant captain, was summoned to appear in Parliament, where he reportedly claimed that a Spanish officer had stormed his brig in the Caribbean and, accusing him of smuggling sugar from Spain’s colonies, cut off his left ear. Jenkins reputedly displayed his severed appendage, pickled in a jar, and pledged “my cause to my country.” The incident further ignited the passions of Parliament and pamphleteers, leading people to cry for blood—an ear for an ear—and a good deal of booty as well. The conflict became known as the War of Jenkins’ Ear.British authorities soon devised a plan to launch an attack on a hub of Spain’s colonial wealth: Cartagena. A South American city on the Caribbean, it was where much of the silver extracted from Peruvian mines was shipped in armed convoys to Spain. The British offensive—involving a massive fleet of 186 ships, led by Admiral Edward Vernon—would be the largest amphibious assault in history. But there was also another, much smaller operation: the one assigned to Commodore Anson.With five warships and a scouting sloop, he and some two thousand men would sail across the Atlantic and round Cape Horn, “taking, sinking, burning, or otherwise destroying” enemy ships and weakening Spanish holdings from the Pacific coast of South America to the Philippines. The British government, in concocting its scheme, wanted to avoid the impression that it was merely sponsoring piracy. Yet the heart of the plan called for an act of outright thievery: to snatch a Spanish galleon loaded with virgin silver and hundreds of thousands of silver coins. Twice a year, Spain sent such a galleon—it was not always the same ship—from Mexico to the Philippines to purchase silks and spices and other Asian commodities, which, in turn, were sold in Europe and the Americas. These exchanges provided crucial links in Spain’s global trading empire.Cheap and the others ordered to carry out the mission were rarely privy to the agendas of those in power, but they were lured by a tantalizing prospect: a share of the treasure. The Centurion’s twenty-two-year-old chaplain, Reverend Richard Walter, who later compiled an account of the voyage, described the galleon as “the most desirable prize that was to be met with in any part of the globe.”If Anson and his men prevailed—“if it shall please God to bless our arms,” as the Admiralty put it—they would continue circling the earth before returning home. The Admiralty had given Anson a code and a cipher to use for his written communication, and an official warned that the mission must be carried out in the “most secret, expeditious manner.” Otherwise, Anson’s squadron might be intercepted and destroyed by a large Spanish armada being assembled under the command of Don José Pizarro.Cheap was facing his longest expedition—he might be gone for three years—and his most perilous. But he saw himself as a knight-errant of the sea in search of “the greatest prize of all the oceans.” And along the way, he might become a captain yet.Yet if the squadron didn’t embark quickly, Cheap feared, the entire party would be annihilated by a force even more dangerous than the Spanish armada: the violent seas around Cape Horn. Only a few British sailors had successfully made this passage, where winds routinely blow at gale force, waves can climb to nearly a hundred feet, and icebergs lurk in the hollows. Seamen thought that the best chance to survive was during the austral summer, between December and February. Reverend Walter cited this “essential maxim,” explaining that during winter not only were the seas fiercer and the temperatures freezing; there were fewer hours of daylight in which one could discern the uncharted coastline. All these reasons, he argued, would make navigating around this unknown shore the “most dismaying and terrible.”But since war had been declared, in October 1739, the Centurion and the other men-of-war in the squadron—including the Gloucester, the Pearl, and the Severn—had been marooned in England, waiting to be repaired and fitted out for the next journey. Cheap watched helplessly as the days ticked by. January 1740 came and went. Then February and March. It was nearly half a year since the war with Spain had been declared; still, the squadron was not ready to sail.It should have been an imposing force. Men-of-war were among the most sophisticated machines yet conceived: buoyant wooden castles powered across oceans by wind and sail. Reflecting the dual nature of their creators, they were devised to be both murderous instruments and the homes in which hundreds of sailors lived together as a family. In a lethal, floating chess game, these pieces were deployed around the globe to achieve what Sir Walter Raleigh had envisioned: “Whosoever commands the seas commands the trade of the world; whosoever commands the trade of the world commands the riches of the world.”Cheap knew what a cracking ship the Centurion was. Swift and stout, and weighing about a thousand tons, she had, like the other warships in Anson’s squadron, three towering masts with crisscrossing yards—wooden spars from which the sails unfurled. The Centurion could fly as many as eighteen sails at a time. Its hull gleamed with varnish, and painted around the stern, in gold relief, were Greek mythological figures, including Poseidon. On the bow rode a sixteen-foot wooden carving of a lion, painted bright red. To increase the chances of surviving a barrage of cannonballs, the hull had a double layer of planks, giving it a thickness of more than a foot in places. The ship had several decks, each stacked upon the next, and two of them had rows of cannons on both sides—their menacing black muzzles pointing out of square gunports. Augustus Keppel, a fifteen-year-old midshipman who was one of Anson’s protégés, boasted that other men-of-war had “no chance in the world” against the mighty Centurion.Yet building, repairing, and fitting out these watercraft was a herculean endeavor even in the best of times, and in a period of war it was chaos. The royal dockyards, which were among the largest manufacturing sites in the world, were overwhelmed with ships—leaking ships, half-constructed ships, ships needing to be loaded and unloaded. Anson’s vessels were laid up on what was known as Rotten Row. As sophisticated as men-of-war were with their sail propulsion and lethal gunnery, they were largely made from simple, perishable materials: hemp, canvas, and, most of all, timber. Constructing a single large warship could require as many as four thousand trees; a hundred acres of forest might be felled. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 13 hrs 32 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 NEW YORK TIMES BESTSELLER • From the author of Killers of the Flower Moon, a page-turning story of shipwreck, survival, and savagery, culminating in a court martial that reveals a shocking truth. The powerful narrative reveals the deeper meaning of the events on The Wager, showing that it was not only the captain and crew who ended up on trial, but the very idea of empire.A Best Book of the Year: The New York Times, The Wall Street Journal, The New Yorker, TIME, Smithsonian, NPR, Vulture, Kirkus Reviews“Riveting...Reads like a thriller, tackling a multilayered history—and imperialism—with gusto.” —Time \"A tour de force of narrative nonfiction.” —The Wall Street JournalOn January 28, 1742, a ramshackle vessel of patched-together wood and cloth washed up on the coast of Brazil. Inside were thirty emaciated men, barely alive, and they had an extraordinary tale to tell. They were survivors of His Majesty’s Ship the Wager, a British vessel that had left England in 1740 on a secret mission during an imperial war with Spain. While the Wager had been chasing a Spanish treasure-filled galleon known as “the prize of all the oceans,” it had wrecked on a desolate island off the coast of Patagonia. The men, after being marooned for months and facing starvation, built the flimsy craft and sailed for more than a hundred days, traversing nearly 3,000 miles of storm-wracked seas. They were greeted as heroes.But then ... six months later, another, even more decrepit craft landed on the coast of Chile. This boat contained just three castaways, and they told a very different story. The thirty sailors who landed in Brazil were not heroes – they were mutineers. The first group responded with countercharges of their own, of a tyrannical and murderous senior officer and his henchmen. It became clear that while stranded on the island the crew had fallen into anarchy, with warring factions fighting for dominion over the barren wilderness. As accusations of treachery and murder flew, the Admiralty convened a court martial to determine who was telling the truth. The stakes were life-and-death—for whomever the court found guilty could hang.The Wager is a grand tale of human behavior at the extremes told by one of our greatest nonfiction writers. Grann’s recreation of the hidden world on a British warship rivals the work of Patrick O’Brian, his portrayal of the castaways’ desperate straits stands up to the classics of survival writing such as The Endurance, and his account of the court martial has the savvy of a Scott Turow thriller. As always with Grann’s work, the incredible twists of the narrative hold the reader spellbound.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2"
            },
            {
                "name": "True Crime",
                "link": "https://www.amazon.com/true-crime-biographies-memoirs-books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11314"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Doubleday; First Edition (April 18, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0385534264"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0385534260"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.41 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.45 x 1.28 x 9.57 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#112 in Books (See Top 100 in Books) #1 in Chile Travel Guides #2 in Maritime History & Piracy (Books) #7 in Murder & Mayhem True Accounts"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 22,786 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9805f984-9f6d-411b-85a6-00c4841d2b5f.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/28ffaf73-908a-4349-b052-e1e1a65603ec.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bf2c2658-7370-46aa-b29f-920d4070e15a.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/adaac829-6b2e-427e-acc6-f6126fa20de0.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e84a6fea-a3ec-47d9-9875-4975ec6f35eb.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5329f259-b95c-45f8-a86b-522b70e7be2b.__CR0,0,1080,1080_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tom Weikert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AED5QWAD2SA3PYQDMH7QH2QGBGCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLI3ZV7R16BI8?ASIN=0385534264",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2023",
                "reviewTitle": "5.0 out of 5 stars An Extraordinary Tale.",
                "reviewText": "“As a tale gets passed from one person to another, it ripples out until it is as wide and mythic as the sea.”The annals of British naval history abound with great and small adventures alike. None, however, captivates like the extraordinary tale of the HMS Wager. And no one can better recount such a hair-raising series of events than David Grann. With \"The Wager,\" Grann tops his previous works of narrative nonfiction with this harrowing story of inconceivable hardship and the machinations of desperate men. To be sure, no incident contained in this book is without ample evidence proving it occurred.It is hard to imagine a more horrifying set of survival conditions than those faced by Wager's crew, and capturing those conditions accurately based on aging historical records and biased published accounts was undoubtedly tricky. Yet, Grann does yeoman's work on this story of the ill-fated Wager, part of a British squadron ordered to sea in August 1740 against the Spanish in the apocryphal “War of Jenkins’ Ear.\" Commanding Wager and at the center of Grann's book is Captain David Cheap, a deeply flawed and complicated skipper.Like Grann's other books, \"The Wager\" nearly requires one to suspend disbelief. The author carefully and patiently reveals the story's events, shocking the reader in the process. Moreover, upon completing Grann's 257-page account of Wager's exploits and those of its sister ship, HMS Centurion, the reader better understands the ruthlessness and cunning demonstrated by the British Royal Navy as it navigated the high seas in quest of Empire. Indeed, British imperial ambitions are fully displayed in \"The Wager.\"Based mainly on seamen’s logbooks and trial records, many of which are over 250 years old, Grann pieces together the seemingly doomed Wager’s calamities while providing ample historical context. The author, for example, details the multitudinous threats facing British ships as they pursued the Empire's aims in the mid-18th century. He also describes shipboard conditions on a British man-of-war sailing the world's oceans during this era.Wager meets its fate while searching for a Spanish galleon laden with treasure and attempting to negotiate the treacherous seas off Cape Horn at the tip of the South American continent. The crew, already decimated by storms, scurvy, and sundry other trials, finds its ship dashed on the rocks off the coast of Patagonia, Argentina. Marooned in May 1741 with little hope of rescue, the men struggle to survive on a scabrous spit of land subsequently named Wager Island.Malnourished and desperate, Wager’s surviving company suffers a complete breakdown in discipline and decorum. Having lost confidence in the ailing and unpredictable Cheap, still in command, the castaways defy British naval law and flout regulations. A fulminant Cheap, for his part, opposes the indiscipline and enforces his authority at the end of a pistol. A mutiny takes shape, and eventually, a breakaway faction, led by Gunner's Mate John Bulkeley, abandons Cheap and his loyalists, leaving them to fend for themselves on Wager Island. By this time, subsisting on the meagerest of diets harvested from terrain that barely sustains life while withstanding storm after storm, Cheap and crew somehow endure.Sailing a small transport boat reinforced with scrap lumber harvested from Wager and equipped with makeshift sails and rigging, Bulkeley and his charges successfully navigate the Strait of Magellan to Brazil. Meanwhile, Cheap and the Wager Island stragglers experience an equally implausible outcome. Sailing on an eighteen-foot yawl salvaged from the Wager, they set off to reach the Chilean coast. Surviving their respective ordeals, the two parties return to London, providing their lurid accounts of mutiny, betrayal, abandonment, and murder to an incredulous British Admiralty and fascinated public. They alternately face scorn and approbation and, eventually, court-martial.It is the Wager leadership’s trial for which Grann saves his best narration and jaw-dropping, surprise ending.\"The Wager\" asks which of the stories is harder to believe: the death-defying travails and travels of these indomitable seamen or the unanticipated result as the British Admiralty adjudicates their fate. Yet, Grann provides the reader with all the evidence necessary to confirm these events happened irrefutably. Relying on an abundance of journals, logs, diaries, and even letters, Grann demonstrates again his seemingly unquenchable thirst for the truth to inform his audience. His single-spaced bibliography alone exceeds 13 pages.Without question, \"The Wager\" is an astonishing naval story reminiscent of Charles Nordhoff’s and James Norman Hall’s “Mutiny on the Bounty.” Considering the inglorious actions of the Wager's crew, Grann's book is worth reading and rereading to comprehend the motives of desperate men. Experiencing the audacity and might of the 18th century British Royal Navy, particularly exemplified by Centurion as she squares off with the Spanish man-of-war Our Lady of Covadonga off the Philippines, provides immensely satisfying adventure reading. Grann's spellbinding account of the naval gunfight puts the reader in the crow's nest as though he is viewing the fight aboard the Centurion from the very mast top!\"The Wager\" offers an incredible piece of storytelling suitable for any devotee of narrative nonfiction or lover of naval lore.An extraordinary tale.",
                "reviewVotes": "91 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MMS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQETLLM6FTOJHWYM2EXJTEN7CJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMIDRGV8WQ80A?ASIN=0385534264",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "4.0 out of 5 stars Book club pick",
                "reviewText": "I picked this for our Book Club book this month. I enjoyed reading it, although it was rather depressing. Most of the people in my Book Club enjoyed reading it and learning about that time in history. It is well written but some felt it was hard to read about so much hardship. It’s good to remember the past and realize what people had to go through to bring us to where we are today, which for all of the stuff going on in our world now, seems we are so much better off in many ways.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charles Salmans",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLHXRR2FT6X2TH3MIWW34FKW6KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BQO1IJC40KNM?ASIN=0385534264",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Grann's Gift as a Story-Teller on Full Display",
                "reviewText": "Grann’s Gift as a Story-Teller on Full DisplayIn the first half of the 18th century, Britain already had the most powerful navy in the world. But financing that navy was a huge burden on the Crown and England had not yet achieved the wealth that the industrial revolution and its own colonization efforts would later bring. The answer: intercept the gold and silver that Spanish ships were bringing home from its New World colonies.Author David Grann is able to tell not only this larger story but also to resurrect one of the most astonishing seafaring events of the time. A ship named “The Wager” was to be part of a British fleet that would intercept gold-laden Spanish vessels in what was officially-sanctioned piracy. As the book’s cover indicates, what then transpired was shipwreck, mutiny and murder. This is also the story of unexpected survival and efforts in an Admiralty court back in England to establish the truth of what happened.Life on board a ship at the time, so full of danger and disease that it was not unusual for as few as ten percent of the crew to survive a long voyage, meant that the Royal Navy had great difficulty manning its ships. Grann provides graphic descriptions of able-bodied and not-so-able-bodied men being kidnapped off the wharfs (“impressed”) to fill the complement of seamen just as a ship was about to sail. (Some years later the impressment of American seamen was a contributor to the War of 1812.)The hulls of wooden sailing ships had a very short life-span due to wood-eating worms, and were susceptible to leaks and other threats to seaworthiness. Scurvy could render entire crews incapable of functioning. Other communicable diseases could cause widespread death on board a crowded, ill-ventilated vessel.In the case of The Wager, the author was able to find a remarkable record of its 1740 voyage and of the events to come. This was in part due to the fact that on board as a junior officer was John Byron, a gentleman volunteer and a compulsive diarist. Incidentally, he was the grandfather of Lord Byron.Additionally, another major actor in the drama, John Bulkeley, had kept a voluminous diary which chronicled the events of the voyage. Buikeley held the position of Gunner, a crucial role in ship combat, and had many other responsibilities on board. He was an instinctive leader, physically imposing, who commanded respect.Finally, there was the record of the court-martial proceedings themselves, in which the main actors including David Cheap, the captain, provided their own version of events. Cheap was an ambitious, younger son of a Scottish Laird who, under the rules of primogeniture, did not inherit his father’s estate. He ran off to sea at 17 and set his sights on becoming a captain, which he realized when an opening occurred on The Wager.The Wager survived the perilous passage around the treacherous Cape Horn, only to run aground and break up on the rocks of an uninhabited island off Patagonia. There were no animals or other significant source of food on the island. The crew soon divided into two factions, one supporting Captain Cheap who wanted to build a vessel out of timbers salvaged from the shipwreck and continue up the Pacific coast of South America to engage Spanish ships. The other group was led by Buckeley, who wanted to build a vessel to return to England. The situation was so dire it would seem impossible that either group would survive.Improbably a few men did make their way back to England to be hailed as heroes. That is, until a second group, including Captain Cheap, also arrived. This forms the final chapter of the story of The Wager and the launch of an inquiry to establish the truth.Faced by death by hanging if they were found guilty of mutiny or of discipline if they failed their duty, each survivor told his story. “Members of the Admiralty found themselves confounded by competing versions of events,” the author tells us. The result was unexpected, but only if one fails to consider that the leaders of an institution, in this case the Royal Navy, have as their first priority the preservation of that institution and the protection of its reputation.This is a wonderfully-written book and Grann is a masterful story teller.",
                "reviewVotes": "43 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole Latourelle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 16, 2023",
                "reviewTitle": "Touchant récit",
                "reviewText": "L'auteur fait ici le récit de l’expédition secrète d’un bateau, ayant lui-même déjà une histoire, le Wager, navire marchand transformé en navire de guerre, faisant partie d’une flotte britannique et envoyé, au XVIIIème siècle, vers l’Amérique du Sud . C’est la guerre mais ici il s’agit uniquement du piratage d’un galion espagnol chargé de pièces d’argent.L’écriture de ce récit a demandé à l’auteur plusieurs années de préparation, il a épluché de très nombreux documents d’époque que l’on trouve cités dans une imposante bibliographie à la fin du livre.C’est un événement historique qui n’est pas passé inaperçu et qui a été par la suite romancé par plusieurs grands écrivains tel que Jules Verne, Daniel Defoe et Joseph Conrad.Le récit s’étale sur quelques quatre années est daté grâce à un journal de bord tenu par l’un des marin, jeune officier canonnier débrouillard, qui a pris le commandement du navire lors d’une une mutinerie. Malgré la crudité de certains détails dans cette histoire tragique, le courage de ces hommes revigore et capte l’attention et en fait un récit passionnant.Il y a l’ingéniosité pour survivre de ces marins, sur une île de la côte du Pacifique, que l’on dénommera Wager, près du Chili, où le bateau a échoué en morceaux, laissant des marins sans beaucoup de provisions et en attente d’un éventuel secours. S’organisera une tentative aventureuse de retour au pays.Le voyage du bateau et la traversée très dangereuse de l’océan près du détroit de Magellan, sont très bien racontés, on croirait y être.Le bilan est lourd : un crime a eu lieu et presque la moitié des deux mille marins auront péris, noyés ou de maladie, et plusieurs ont souffert du scorbut.On finira par découvrir l’origine lointaine de ce triste conflit : huit ans plus tôt, une attaque par les espagnols d’un capitaine marchand nommé Jenkins.Au retour le commandement a dû subir le procès d’un tribunal militaire. Les dessous politique de l’affaire, ainsi que les intérêts personnels de tous ces grands messieurs, et du gouvernement anglais de l’époque, sont très bien explicités par cet auteur journaliste d’enquête.Avec tristesse l’auteur termine par cette évaluation : ‘finalement’, écrit-il, (…) ‘ne restera ni de cette lutte féroce qui a eu lieu à cet endroit, ni des rêves ravageurs d’empire(…), rien d’autre que quelques branches de céleri que les naufragés avaient fait pousser (…) et quelques planches de bois échouées sur l’île.’",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jorge P. Castello",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 18, 2023",
                "reviewTitle": "About The Wager story",
                "reviewText": "The Wager is an excellent book. Very well written keeps the reader a captive. Based upon actual events the author shows a master quality for understanding several and rich human qualities.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 7, 2024",
                "reviewTitle": "Altamente recomendable",
                "reviewText": "Muy entretenida, es una historia increíble y narrada y escrita con todos los detallesFelicidades por esta joyaPero ......Porqué no está es español?Porqué no ha sido traducida?Por desgracia pasa mucho con grandes obras literarias en este caso MarítimaUna pena",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "I. Jones",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 28, 2024",
                "reviewTitle": "It won't put me off sailing round the world",
                "reviewText": "I was listening to an abridged version of this book on BBC Radio 4 recently and then I stopped listening because I realised it would be better to read the book – and I’m glad I did.This is a book about a squadron of Royal Navy ships that were despatched to South America to harass Spanish shipping during the oft-forgotten War of Jenkins’s Ear in 1740 (when I was doing A Level History I was taught that it wasn’t his ear but one of the family jewels that was sliced off by a Spanish swordsman). Their commander, Commodore George Anson, has secret orders to sail round Cape Horn and across the Pacific Ocean to the Philippines to intercept and capture a Spanish galleon laden with tonnes of silver and gold extracted from Spain’s colonies in the region.The expedition is a fiasco. The squadron sets off from Portsmouth months later than planned. Many of the crewmen have been pressganged and are untrained. They have only got as far as Madeira when they learn that the Spanish already know about their secret mission and are hunting the Atlantic for them. By the time they get down to Cape Horn the squadron is in a mess due to storms, typhus, scurvy, and damage to the ships. A couple of ships disappear, hundreds of sailors die from disease or drowning or are incapacitated due to sickness. The Wager is the least seaworthy ship and is wrecked on a tiny island off the coast of Chile that later became known as Wager Island. What follows is a kind of Lord of the Flies for adults. I won’t spoil it by saying what happens. Obviously there are survivors – as the back cover announces – and that’s how we know what happened. Or rather, we have several conflicting accounts of what happened. I will say that the back cover blurb doesn’t tell the whole story. A third group of survivors eventually reach home some years later. Also the mission is not a complete disaster as some people emerge from the sea fog with untold riches.I haven’t read any of David Grann’s other books but I gather from the acknowledgements, the note on the sources, the end notes and the select bibliography that he is one of those journalists whose work is capable of verging on history. That means he engaged in extensive research of primary and secondary sources as well as picking the brains of several historians. He even spent three weeks on Wager Island to understand what the castaways went through. There are some jarring notes. Despite the extensive help from editors and historians, the author is not entirely familiar with naval terminology and – specifically – with terminology used on this side of the Atlantic. He often refers to an institution that doesn’t exist – the British Navy – rather than the Royal Navy. That grates, even for a staunch republican like me. Direct quotations from the survivors are converted into American spelling, which also grates, but it would be wrong of me to whinge too much. It’s a well-written book and a lot more than just a dramatic account of a ship wreck. The castaways are not just seamen, they are naval personnel and thus subject to the harsh discipline of the rope – used for flogging and hanging. They are also products of our class hierarchy and all the snobbery and nonsense that that involves. How some of them survived the ordeal is – pardon the cliché – nothing short of a miracle.I’ve seen some complaints about wokery from some reviewers. They seem to assume that 300 years ago there was a consensus about imperialism and slavery such that any right-thinking person at the time couldn’t possibly have conceived of any alternative. That is far from being the case. There were plenty of people questioning what Britain and other European nations were doing sailing the seven seas. Ironically, a lot of that questioning was coming from Tories, like the great Samuel Johnson, who was hardly woke by any standards. It was the Whigs – now the Liberal Democrats in Britain – who were the party of trade and empire, while Johnson and other conservatives with a small “c” were deeply uncomfortable about slavery and our treatment of indigenous peoples.The author gives a practical example of the self-damaging consequences of colonial attitudes. The castaways are shivering and starving to death on Wager Island. A bunch of locals arrive from nowhere. Over the centuries they have developed the skills needed to survive in this hostile environment. They show the castaways how to catch fish and paddle around the stormy seas in flimsy canoes that don’t break up and sink like the British ships and boats. In return some of the castaways try to harass the womenfolk and the locals paddle off. As a result dozens of men die who could possibly have survived if they had cooperated better with the locals. At a later date, several men are rescued by locals and taken hundreds of miles to safety. The author therefore makes a valid point when he complains that the survivors refer to these lifesavers as “savages”. There’s a lot of irony there, given the behaviour of some of the castaways.I would recommend this book to anyone who enjoys action and adventure, naval history, British history or to anyone who wants to know more about how human beings behave and survive in extreme circumstances.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wiwy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 17, 2024",
                "reviewTitle": "avvincente",
                "reviewText": "Storia che si sviluppa attraverso la sequenza di disastri e avventure dalla partenza del Wager fino al ritorno dei protagonisti",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$11.40",
                "sellerName": "charlestonsoon",
                "sellerRating": "4.5"
            }
        ]
    }
}