{
    "remaining_requests": 582,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/When-Stars-Scattered-Victoria-Jamieson/dp/0525553908",
    "body": {
        "name": "When Stars Are Scattered",
        "price": "$9.37$9.37",
        "originalPrice": "",
        "rawPrice": 9.37,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/When-Stars-Scattered-Victoria-Jamieson/dp/0525553908",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81eVNZ607uL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Victoria Jamieson",
            "link": "https://www.amazon.com/Victoria-Jamieson/e/B001JP4E6Q/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 3626,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review A New York Times BestsellerNational Book Award FinalistSchneider Family Book Award, Middle School HonorYALSA Great Graphic Novel for Teens YALSA Quick Pick for Reluctant Young Adult ReadersYALSA Excellence in Nonfiction NomineeWalter Award Winner (Younger Readers)Amazon Best Children’s Book of 2020New York Times Book Review Notable Children's BookTIME Best Book of the YearSchool Library Journal Best Book of 2020Kirkus Best Children’s Book of 2020NYPL Best Book for KidsNPR's Book Concierge PickJane Addams Children's Book Award FinalistCharlotte Huck Award Honor Book2021 ALSC Notable Children’s Books List2021 Children’s Africana Book Award Honor Book2021 Josette Frank Award Winner2021 Notable Books for a Global Society List2021 Kids’ Book Choice Award Winner★ \"Jamieson's characteristically endearing art, warmly colored by Geddy, perfectly complements Omar's story, conjuring memorable and sympathetic characters who will stay with readers long after they close the book . . . This engaging, heartwarming story does everything one can ask of a book, and then some.” —Kirkus, starred review★ \"With this sensitive and poignant tale, Jamieson and Mohamed express the power of the human spirit to persevere.\" —School Library Journal, starred review★ \"Tragedy is certainly present throughout the story, yet Mohamed and Jamieson’s focus on deep familial love and education works to subvert many refugee stereotypes.\" —Horn Book, starred review★ \"Mohamed's experience is unfortunately not unique, but it is told with grace, humility, and forgiveness. This beautiful memoir is not to be missed.\" —Booklist, starred review★ \"Jamieson and Mohamed together craft a cohesive, winding story that balances daily life and boredom, past traumas, and unforeseen outcomes alongside camp denizens’ ingenuity and community . . . colorist Iman Geddy’s deep purple skies drive home the title. The result of this team effort is a personal and poignant entry point for young readers trying to understand an unfair world.\" —Publishers Weekly, starred review★ \"The graphic novel presentation and first person narration from the young narrator creates an immediacy and connection with the events of the story. Readers are quickly drawn into Omar’s world and worry for him and his friends.\" —School Library Connection\"Over the next fifteen years chronicled in this moving, slightly fictionalized graphic novel, the boys grow to manhood in an overcrowded tent city . . . Jamieson’s artwork, affectionately depicting resilient kids who manage to carve out lives in a community with few solid prospects, reprises the inviting ebullience readers will recognize from Roller Girl and All’s Faire.\" —BCCB YALSA Quick Pick for Reluctant Young Adult Readers About the Author Victoria Jamieson is the co-creator of the National Book Award finalist When Stars Are Scattered and the creator of the graphic novels All's Faire in Middle School and Newbery Honor winner Roller Girl. She received her BFA in illustration from the Rhode Island School of Design and worked as a children's book designer before becoming a freelance illustrator. She has also worked as a portrait artist aboard a cruise ship, and has lived in Australia, Italy, and Canada. Now she lives in Pennsylvania with her husband and son. Omar Mohamed is co-creator of the National Book Award finalist When Stars Are Scattered, based on his childhood growing up in the Dadaab refugee camp, after his father was killed and he was separated from his mother in Somalia. He devoted everything to taking care of his younger brother, Hassan, and to pursuing his education. He now lives in Lancaster, Pennsylvania, with his wife and five children, and is the founder of Refugee Strong, a non-profit organization that empowers students living in refugee camps.Iman Geddy, the colorist for this book, is an Atlanta-based designer and illustrator who is passionate about using the graphic arts for social good. Inspired by the geometric harmony of Islamic architecture as well as the colorful equatorial landscapes of eastern Africa, she creates striking art that highlights the beauty of the world around us."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 3 hrs 47 mins",
            "FREE delivery February 29 - March 4 on orders shipped by Amazon over $35",
            "Or fastest delivery February 27 - 29",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 13 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A National Book Award Finalist, this remarkable graphic novel is about growing up in a refugee camp, as told by a former Somali refugee to the Newbery Honor-winning creator of Roller Girl.Omar and his younger brother, Hassan, have spent most of their lives in Dadaab, a refugee camp in Kenya. Life is hard there: never enough food, achingly dull, and without access to the medical care Omar knows his nonverbal brother needs. So when Omar has the opportunity to go to school, he knows it might be a chance to change their future . . . but it would also mean leaving his brother, the only family member he has left, every day.Heartbreak, hope, and gentle humor exist together in this graphic novel about a childhood spent waiting, and a young man who is able to create a sense of family and home in the most difficult of settings. It's an intimate, important, unforgettable look at the day-to-day life of a refugee, as told to New York Times Bestselling author/artist Victoria Jamieson by Omar Mohamed, the Somali man who lived the story.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Geography & Cultures",
                "link": "https://www.amazon.com/Childrens-Geography-Cultures-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3344091011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Dial Books; Illustrated edition (April 14, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 264 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0525553908"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0525553908"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 9 - 12 years, from customers"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ GN530L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 4 - 7"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.26 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.56 x 0.9 x 8.31 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,226 in Books (See Top 100 in Books) #3 in Children's Africa Books #21 in Children's Fiction on Social Situations #190 in Children's Comics & Graphic Novels (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 3,626 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Roller Girl All's Faire in Middle School Olympig! More by Victoria Jamieson: A heartwarming graphic novel about friendship and surviving junior high through the power of roller derby A graphic novel about starting middle school, surviving your embarrassing family, and the Renaissance Faire An Olympics-themed picture book that brings home the bacon",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/cde444ff-b886-4301-9b4b-409fbe3c2c34.__CR0,0,1347,833_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/21884567-c79d-475b-b476-7a74355f535c.__CR0,0,417,417_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/27569f46-5ead-401f-99ce-dd1cdbc88bb9.__CR0,0,417,417_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/59c39d0d-8620-4527-a07e-b4f181d68b19.__CR0,0,417,417_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dc313434-e8e8-40cd-9cdd-624f77da3f24.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7b73b581-406b-4ef1-a80b-4a6935dc1611.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6be7a720-8e4d-4282-b939-7d4a9f451ff1.__CR0,0,300,600_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "scarlett ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTNDWFRQGB6DPAI6FMYFPOZBQJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ATHO4BOB4X05?ASIN=0525553908",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars AMAZING READ!!",
                "reviewText": "This book is such a cute read and shares such a heartwarming story…I cried multiple times lol.I definitely recommend to grades 5th and up",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie ClineKatie Cline",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHK5TWMEAZB6F6BJLZZWL5D4N5GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RB09CQPI8F88?ASIN=0525553908",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Great book in great condition",
                "reviewText": "This book wasn't easy to find at in-person stores, so I'm glad Amazon had it at a reasonable price! I can't recommend it enough! It's such a beautiful story. It's a graphic novel that can be easily read by ages 8+, but the content would make more sense for the 12-15+ age group. I read it as an adult, and absolutely adored it, so it really does appeal to all ages and is a book that you could read multiple times over your life and glean new things from it each time.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71wtD86auCL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deane Rynerson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLGBGZQA3EMFIXIGKWIKEPRF27Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R254FK2T5GVIKY?ASIN=0525553908",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 3, 2023",
                "reviewTitle": "5.0 out of 5 stars One of my Favorite Graphic Novels and Memoirs",
                "reviewText": "When Stars Are Scattered is a memoir that everyone should read, presenting a true and in depth look at the life of a refugee. The art style is simple, but expressive and suits the story well and Omar Mohamed's retelling of his youth takes you on a journey of frustration, kindness, heartbreak and hope full of gentle humor, hard truths and surprising twists and turns that will engage a reader of any age.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHA5JJWXRVH6CCLQVZR3CJGJYSNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YUMVHUGRAIZ?ASIN=0525553908",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 30, 2020",
                "reviewTitle": "5.0 out of 5 stars Riveting and refreshing to have depth and cultural exposure in a graphic novel...",
                "reviewText": "This is a a beautiful story about two Somalian refugee brothers who have not given up hope on finding their mother or being reassigned to America. It’s a story about human grit and resilience that is difficult to really hit home for many American children, but the stunning illustrations carry this message through-out the story. My 9-year-old struggled to get into the first chapter, but when I sat down and read it to her, she was hooked. We almost finished the entire book in two reading sessions. This book gave me an opportunity to expose my daughter to diversity and examine the conditions of her own life. During this quarantine pandemic, my daughter has had to face some difficult changes in our family structure and sell her home. This book was a lesson to her to hold on to the ones she loves, and remember how lucky she is to be sleeping in a soft bed, eating nutritious, abundant food, and receiving free quality education. My daughter was particularly stunned about the refugee girls who don’t have choices about whom they marry and whether or not they go to school. I whole-heartedly recommend this book to any graphic novel enthusiast, or just anyone. Parents, read it to your child and talk with them about the similarities and differences of their life to Omar and Hassan’s. Thank you, Omar, for sharing your life story with the world and for organizing Refugee Strong so we can help. Please, Jamieson, find more diverse stories like this to capture and I will buy every one of them.",
                "reviewVotes": "89 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Felicia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJUM54VMRTJDFPW4RXVWLJZPB5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EJVM9DOA4IXU?ASIN=0525553908",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Love",
                "reviewText": "My daughter has developed a love for reading bc of this book",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ananas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPDZZJTPRGHNWBHPDCHV6YFM24A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I8EU0MCPMIS8?ASIN=0525553908",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Kid devoured it",
                "reviewText": "My 10 years old read this book with enthusiasm and had a hard time putting it down !",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shahbaz Masih",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYUCIMGDPFGTFJIM55FP7R2LBYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W0FWVEEZSA87?ASIN=0525553908",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Book",
                "reviewText": "The book was alright I did not like it very much but I can see why people would like it and it would be a book I would recommend",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "james rhee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNWBAL3SRUMRYRAIIITHL2AAULQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3K41M5CCM2M8U?ASIN=0525553908",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "To understand English",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amélia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 14, 2023",
                "reviewTitle": "A coisa mais linda!",
                "reviewText": "A história mais linda e comovente! Lindo! Deixou o coração apertado em muitos momentos, mas vale a pena!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ayesha",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 12, 2022",
                "reviewTitle": "Heart touching ♥",
                "reviewText": "I am nine years old. My mom bought me this book. I enjoyed reading this book alot. I got to know lot about how people spend their life in refugee camps. Thay have tough times there but they are still very grateful. To be honest its emotional, sad 😥 but you don't want to put it down until you finish it. Amazing book!!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CHH",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on January 21, 2024",
                "reviewTitle": "Excellent",
                "reviewText": "Both my reluctant 9 year old and my 12 year old thoroughly enjoyed this graphic novel. The book itself was also of great quality.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NIKOLAOS P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 3, 2023",
                "reviewTitle": "Great book",
                "reviewText": "Great book for 9+ yo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rameesa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 19, 2023",
                "reviewTitle": "Great read",
                "reviewText": "It’s a must read for all agesMe and My daughter finished it in 1 dayOur eyes were filled with tears in many parts.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$4.46",
                "sellerName": "qualityschooltexts",
                "sellerRating": "5"
            },
            {
                "price": "$5.38",
                "sellerName": "All American Textbooks",
                "sellerRating": "4.5"
            }
        ]
    }
}