{
    "remaining_requests": 556,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wishtree-Katherine-Applegate/dp/1250233895",
    "body": {
        "name": "Wishtree",
        "price": "$8.00$8.00",
        "originalPrice": "",
        "rawPrice": 8.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wishtree-Katherine-Applegate/dp/1250233895",
        "soldBy": {
            "sellerID": "AJVRJJ9RFZDME",
            "name": "Goodwillswpa",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=AJVRJJ9RFZDME"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91Y0txgHg1L._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Katherine Applegate",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Katherine+Applegate&text=Katherine+Applegate&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "Goodwillswpa",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 5645,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for wishtree:A NEW YORK TIMES BESTSELLER!A New York Times Notable Book, 2017A National Public Radio Best Book of 2017A Publishers Weekly BestsellerA Washington Post Best Book of 2017A Chicago Public Library Best Book of 2017A Publishers Weekly Best Book of 2017San Francisco Chronicle 2017 Gift Guide Los Angeles Times 2017 Gift GuideAutumn 2017 Kids’ Indie Next List \"Top Pick\" TitleWinner, E.B. White Read Aloud Award 2018 ALSC/ALA Notable Children's Book \"Wishtree is beautiful in every way one can imagine. Everyone should read this book.\" ―R.J. Palacio, bestselling author of Wonder, White Bird, and Pony\"A beautifully written, morally bracing story that will leave its imprint on a reader of any age.\" The New York Times Book Review\"The simplicity of Newbery Medalist Applegate’s graceful novel contrasts powerfully with the prejudice it confronts. Narration comes from Red, an enormous red oak near an elementary school that also serves as a “wishtree” for the neighborhood―once a year, residents deposit wishes in Red’s branches and hollows.... It’s a distinctive call for kindness, delivered by an unforgettable narrator.\"--Publishers Weekly, starred review\"Applegate introduces another quiet, resilient protagonist who -- like the caged gorilla in The One and Only Ivan and the working-class boy in Crenshaw -- speaks movingly to a noisy, fractious world. -- The Washington Post\"The story’s wit and humor keep it from being heavy-handed, as do vivid portrayals of minor characters, especially Bongo, the sarcastic crow who is Red’s best friend. This is a book made for family sharing and discussion.\"--Raleigh News & Observer\"Timely, necessary, and brimming with heart.\"-- Booklist, starred review \"Newbery Award–winning author Applegate meets high expectations in this tale told by a tree named Red, a red oak who is “two hundred and sixteen rings old.” ... Another stunning effort from Applegate. This thoughtful read is a top choice for middle graders.\"--School Library Journal, starred review\"This swiftly moving yet contemplative read is great for early middle grade, reluctant or tentative readers, or precocious younger students. A deceptively simple, tender tale in which respect, resilience, and hope triumph.\"--Kirkus Reviews, starred review\"This gentle yet powerful book is suitable for all ages...and its message remains more vital than ever.\"--BookPage\"Inspires hope for positive change. Perfect for a powerful classroom read, Wishtree is another winner for Applegate.\"--Voices of Youth Advocates, starred review________Praise for Crenshaw:A New York Times BestsellerA Publishers Weekly Bestseller\"This accessible and moving novel demonstrates how the creative resilience of a child’s mind can soften difficult situations, while exploring the intersection of imagination and truth.\" ―Publishers Weekly, starred review\"A compelling and unflinchingly honest treatment of a difficult topic.\" ―School Library Journal, starred review\"The tone is warm and, occasionally, quirkily funny, but it doesn’t sugarcoat the effects of hunger and vulnerability.\" ―The Horn Book, starred review About the Author Katherine Applegate is the #1 New York Times-bestselling author of beloved and award-winning books for young readers, including Odder, Home of the Brave, Crenshaw, Wishtree, Willodeen, and The One and Only Ivan, for which she won the Newbery Medal. She is also the author of the Animorphs series, and a beginning reader series, Doggo and Pupper, illustrated by Charlie Alder. Katherine Applegate lives in Southern California with her family."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 13 mins",
            "$3.99 delivery Monday, February 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "An oak tree and a crow help their neighbors embrace their differences in this beautiful, nuanced, New York Times-bestselling middle-grade novel from Newbery Medalist author Katherine Applegate.Trees can't tell jokes, but they can certainly tell stories. . . .Red is an oak tree who is many rings old. Red is the neighborhood \"wishtree\"―people write their wishes on pieces of cloth and tie them to Red's branches. Along with a crow named Bongo and other animals who seek refuge in Red's hollows, this wishtree watches over the neighborhood.You might say Red has seen it all.Until a new family moves in. Not everyone is welcoming, and Red's experience as a wishtree is more important than ever.Funny, deep, warm, and nuanced, this is Katherine Applegate at her very best―writing from the heart, and from a completely unexpected point of view.This book has Common Core connections. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Growing Up & Facts of Life",
                "link": "https://www.amazon.com/Issues-Childrens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1084192"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Square Fish; Reprint edition (March 28, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 240 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250233895"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250233899"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 8 - 11 years, from customers"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 590L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ Preschool - 2"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.05 x 0.65 x 7.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,929 in Books (See Top 100 in Books) #4 in Children's Books on Prejudice & Racism #17 in Children's Bird Books (Books) #140 in Children's Friendship Books"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 5,645 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Wishtree Crenshaw Willodeen Doggo and Pupper Odder Home of the Brave Read them all! A red oak tree and a crow help their human neighbors work out their differences, in this beautiful, nuanced novel. An unforgettable and magical story about family, friendship, and resilience. A middle-grade novel about a girl who risks everything to help her handmade bear when he comes to life. An old dog has to welcome a new puppy to the household, in this delightful chapter book series. A touching and lyrical tale about a remarkable sea otter. A deeply poetic and affecting novel about the contemporary immigrant experience.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9b0601e2-298e-4fc4-8a99-948fd02aafec.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4ecf47f-ac0e-4abf-aeb8-c0ee4969ea18.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8fbda0cf-7f66-4476-8124-61ea810956e9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0a542ab4-c570-466e-89f4-f00e3cfb030c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/13c57aad-0dcb-4e79-9005-6a4f801f29cc.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1e9bfed7-ea21-4605-9d55-0a2c3f5ab0d6.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a7609118-86ed-4769-ac26-29918add9816.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3ae01786-d491-4c2b-b1d7-a540177b9de8.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ad5b757b-fcc5-4213-99ca-2d136b93f6c3.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7c8567b0-3bf6-46b9-81ee-7257f9dfa6e8.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa58f149-ad49-40bf-843a-9b8d739fae53.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "DramaQueen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV3WVWCDA6OA6JHDEFUCBMI6TAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37NI59CC072FQ?ASIN=1250233895",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful Imagery",
                "reviewText": "Beautiful story!My students absolutely loved this book! The imagery was an inspiration for them to use their own creative voices in their own writing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ari",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2TVGE3L7XOU3SG3Z6SG3MG5FNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38ZXFNTYDBD3Q?ASIN=1250233895",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Absolutely BEAUTIFUL, meaningful story!",
                "reviewText": "Please get this book, no matter your age! I read this with my kids (8 and 10 yrs old) and husband, and it moved all of us. There were multiple times that my husband and I were brought to tears- the message about unity, compassion, and acceptance is powerful. Our kids loved this book too- the imagery and word painting, darling characters, and relatable experiences were engaging. We ended up using this for a homeschool unit- Language Arts. There is so much to gain from this book! It is an important read for every human and will leave you feeling joy, hope, compassion, and connection.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leabea28",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZDNYNI5SCVRDV5YYOL2ELJXNNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HKCYYOZ7V8HI?ASIN=1250233895",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "5.0 out of 5 stars 9 year old loved this book",
                "reviewText": "My third grader was reading this in her class and she loved it so much she wanted her own copy. I haven’t read it, but she’s told me all about it. It seems very sweet, yet with important and mature themes that are great for this age. Lots of little cliff hangers and she liked the ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "portia shaffer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHBST7OA4CRRZWY3D6VFPHO6WLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VKC98WX2FLZ5?ASIN=1250233895",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Charming and Delightful",
                "reviewText": "All children should have a story that captivates attention and leaves you feeling eager for more. This book actually gets you absorbed in the characters. Adults will also enjoy this story. I couldn't put it down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Fuller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEJYZGHJQJBIPV72KJVIRZXANDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BYA17TK4990U?ASIN=1250233895",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2017",
                "reviewTitle": "5.0 out of 5 stars Life is hard and love is hard, but \"stand stall and dig deep...\"",
                "reviewText": "This story is told from the perspective of a tree. There's inherent wisdom and patience that comes from being a tree, and now, we get to hang out with one for a few hundred pages. Our tree houses many neighborhood animals, all diverse yet similar. The neighborhood that our friend calls home is also very diverse and we get to watch what happens when a tree helps two kiddos become friends despite their different backgrounds. This story is for younger readers, and yes a tree that talks is make believe, but it's about real life. Get a copy, read it and then share it with your friends.Here are a few of my favorite quotes from the book:\"Hollows offer protection from the elements. A secure spot to sleep and to stash your belongings. They're a safe place. Hollows are proof that something bad can become something good with enough time and care and hope\" p. 5\"... Sometimes things happen that aren't so good. When they occur, I've learned that there's not much you can do except stand tall and reach deep.\" P. 35\"Real life, like a good garden, is messy.\" p. 209This book is going to be very popular. It was published in September of this year and has already topped some major book lists. It's beautiful. Not just pretty to look at, which it is, but so sweet. I hugged the book when I finished, which isn't something I never do, but it's reserved for a special category of book.",
                "reviewVotes": "47 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KylieMomma",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAZB7DC76C3LYPDAISMCBCSMWJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD6FSYIV2EVQ6?ASIN=1250233895",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Another amazing story by Applegate",
                "reviewText": "My daughter and I love this author and The Wishtree is a wonderful story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Petiteblue",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOYV73TVZ5FQQAAQYV4LAATKITQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C8RCXQOUHSAE?ASIN=1250233895",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 4, 2019",
                "reviewTitle": "4.0 out of 5 stars Great Book with an Unexpected Ending",
                "reviewText": "Katherine Applegate’s book, Wishtree was a great book for mature 3rd graders to 6th graders. The beginning and middle were excellent, but the end was very unexpected.Whether it was the ancient tree, Red, describing the sunny days or switching back and forth between 120 years ago and now, I liked how Applegate used the tree’s point of view rather than a person’s point of view. The tree saw everything that happened in the neighborhood, and the people only saw about one-third of what happened in the neighborhood because they were in their houses.The ending, however, was unexpected because someone did something that she could have done anywhere else in the entire book. Katherine Applegate could have made the animals or the people do something that they only could have done in the end.In all, the book was great, but it would have been WAY better if there was at least a decent ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Randy Wing",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZWUEKP7OLA4NHYK5GDGPKT4XUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R193T98REI5B2Z?ASIN=1250233895",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Beautifully written",
                "reviewText": "My daughter loved it! No complaints!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 12, 2021",
                "reviewTitle": "A story of friendship, loyalty, acceptance and tolerance.",
                "reviewText": "A lovely story narrated by the protagonist's point of view - a 216 ring old Red Oak tree that uses fantasy and fiction to touch on the topic of bigotry, community and tolerance.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monika Kaminski",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 13, 2020",
                "reviewTitle": "einfaches Englisch",
                "reviewText": "Das ist eine sehr schöne Geschichte, die ich als Hörbuch entdeckt habe. Ich dachte nach der Vorstellung erst, es sei ein Kinderbuch (was ich mag), es ist aber sowohl für Kinder als auch für Erwachsene, die genauer hinschauen und denen in der Form einfache Geschichten (nicht im Inhalt) nicht \"zu blöd\" sind. Ich mag das Buch sehr, besonders, weil es ein einfaches Englisch hat, das leicht verständlich ist, wenn man einigermassen Englisch kann. Uneingeschränkt zu empfehlen!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B srinivas reddy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 3, 2019",
                "reviewTitle": "This book my daughter 2 grade full enjoy",
                "reviewText": "Amazon great work",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sabrina B.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 10, 2021",
                "reviewTitle": "Wishtree",
                "reviewText": "Ordered this got my brother, he absolutely loves it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle-Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 26, 2019",
                "reviewTitle": "Schönes Buch",
                "reviewText": "Meine Tochter (13) hat es für den Englischunterricht für ein Referat benötigt. Es ist in englischer Sprache geschrieben, doch leicht verständlich. Die Story ist wunderschön bebildert. Das Buch ist klein und handlich.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}