{
    "remaining_requests": 496,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/State-of-Fear-Michael-Crichton-audiobook/dp/B000776JN8",
    "body": {
        "name": "State of Fear",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/State-of-Fear-Michael-Crichton-audiobook/dp/B000776JN8",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ITQdtkUfL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Michael Crichton",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Michael+Crichton"
        },
        "brand": "Michael Crichton",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 6611,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The undisputed master of the techno-thriller has written his most riveting, and entertaining, book yet. Once again Michael Crichton gives us his trademark combination of pause-resistant suspense, cutting-edge technology, and extraordinary research. State of Fear is a superb blend of edge-of-your-seat suspense and thought provoking commentary on how information is manipulated in the modern world. From the streets of Paris, to the glaciers of Antarctica, to the exotic and dangerous Solomon Islands, State of Fear takes the listener on a rollercoaster thrill ride, all the while keeping the brain in high gear. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Suspense",
                "link": "https://www.amazon.com/Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10495"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "18 hours and 18 minutes"
            },
            {
                "name": "Author",
                "value": "Michael Crichton"
            },
            {
                "name": "Narrator",
                "value": "George Wilson"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "November 23, 2004"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B000776JN8"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,838 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #63 in Technothrillers (Audible Books & Originals) #193 in Technothrillers (Books) #478 in Adventure Science Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Phil in Magnolia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGS6HKYNXMJR7UT6XFJGZJUGSGTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IA15ZV81J7M2?ASIN=B000776JN8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 2, 2015",
                "reviewTitle": "5.0 out of 5 stars Crichton provokes skepticism and independent thinking",
                "reviewText": "I didn't realize what I was getting into when I picked up this book recently. I've enjoyed many of Michael Crichton's earlier novels, not only Jurassic Park but also some of his lesser known works such as A Case of Need , one of his very early novels. My impression of Michael Crichton has always been that he brought a certain amount of technical expertise to his writings, along with a level of integrity, that caused them to raise to a level above most other thrillers and similar works.Reading State of Fear, I found myself confounded by the point of view that began to dominate, that of skepticism regarding the global warming and environmental points of view that I had always more or less taken for granted. Surely Michael Crichton is not suggesting that Global Warming is not a Real Threat?? Can it be??Well, it's not quite that simple, but first let me comment to the book itself. It's a good read, beginning seemingly as a 'good guy' vs 'bad guy' story with the corporate interests playing the expected role as 'bad guys', but early on there are questions raised about whether or not the bad guys are in fact the corporate interests, or if they are in fact the environmental interests, or are they both equally 'bad'. And then along the way, in the discussions that take place between the characters as they discuss the environmental movement and whether or not it is solidly based on real science and actual data, there is a good amount of real data included, for example charts of the warming trends of cities throughout the world, that do not present the expected evidence of a general warming trend. Is this real data, or something fabricated to support the story? The truth is not fully clear until the book is completed and the afterward is read (Crichton calls it his 'Author's Message' and in two or three pages he lays out very clearly his point of view with respect to the environmental movement and global warming, and it is quite interesting to read).He also substantiates the data provided throughout the book, and the conclusions he presents in his 'Author's Message', as well as the astonishingly thorough and diverse listing of references that are provided, are such that I have to feel that there is something serious here that merits thoughtful reflection.If nothing else, it is that afterword, written by Crichton to give his own point of view, that is worth reading. I am appending it here to my review, confident that I am not violating any copyright restrictions since Crichton's own website also offers it for anyone to read.This is a book that is both entertaining, and as well it is unexpected and thought provoking.I am still not sure what to make of it.-------------------Michael Crichton's 'Author's Message' from the book State of Fear:AUTHOR'S MESSAGEA novel such as State of Fear, in which so many divergent views are expressed, may lead the reader to wonder where, exactly, the author stands on these issues. I have been reading environmental texts for three years, in itself a hazardous undertaking. But I have had an opportunity to look at a lot of data, and to consider many points of view. I conclude:- We know astonishingly little about every aspect of the environment, from its past history, to its present state, to how to conserve and protect it. In every debate, all sides overstate the extent of existing knowledge and its degree of certainty.- Atmospheric carbon dioxide is increasing, and human activity is the probable cause.- We are also in the midst of a natural warming trend that began about 1850, as we emerged from a four-hundred-year cold spell known as the \"Little Ice Age.\"- Nobody knows how much of the present warming trend might be a natural phenomenon.- Nobody knows how much of the present warming trend might be man-made.- Nobody knows how much warming will occur in the next century. The computer models vary by 400 percent, de facto proof that nobody knows. But if I had to guess-- the only thing anyone is doing, really-- I would guess the increase will be 0.812436 degrees C. There is no evidence that my guess about the state of the world one hundred years from now is any better or worse than anyone else's. (We can't \"assess\" the future, nor can we \"predict\" it. These are euphemisms. We can only guess. An informed guess is just a guess.)- I suspect that part of the observed surface warming will ultimately be attributable to human activity. I suspect that the principal human effect will come from land use, and that the atmospheric component will be minor.- Before making expensive policy decisions on the basis of climate models, I think it is reasonable to require that those models predict future temperatures accurately for a period of ten years. Twenty would be better.- I think for anyone to believe in impending resource scarcity, after two hundred years of such false alarms, is kind of weird. I don't know whether such a belief today is best ascribed to ignorance of history, sclerotic dogmatism, unhealthy love of Malthus, or simple pigheadedness, but it is evidently a hardy perennial in human calculation.- There are many reasons to shift away from fossil fuels, and we will do so in the next century without legislation, financial incentives, carbon-conservation programs, or the interminable yammering of fearmongers. So far as I know, nobody had to ban horse transport in the early twentieth century.- I suspect the people of 2100 will be much richer than we are, consume more energy, have a smaller global population, and enjoy more wilderness than we have today. I don't think we have to worry about them.- The current near-hysterical preoccupation with safety is at best a waste of resources and a crimp on the human spirit, and at worst an invitation to totalitarianism. Public education is desperately needed.- I conclude that most environmental \"principles\" (such as sustainable development or the precautionary principle) have the effect of preserving the economic advantages of the West and thus constitute modern imperialism toward the developing world. It is a nice way of saying, \"We got ours and we don't want you to get yours, because you'll cause too much pollution.\"- The \"precautionary principle,\" properly applied, forbids the precautionary principle. It is self-contradictory. The precautionary principle therefore cannot be spoken of in terms that are too harsh.- I believe people are well intentioned. But I have great respect for the corrosive influence of bias, systematic distortions of thought, the power of rationalization, the guises of self-interest, and the inevitability of unintended consequences.- I have more respect for people who change their views after acquiring new information than for those who cling to views they held thirty years ago. The world changes. Ideologues and zealots don't.- In the thirty-five-odd years since the environmental movement came into existence, science has undergone a major revolution. This revolution has brought new understanding of nonlinear dynamics, complex systems, chaos theory, catastrophe theory. It has transformed the way we think about evolution and ecology. Yet these no-longer-new ideas have hardly penetrated the thinking of environmental activists, which seems oddly fixed in the concepts and rhetoric of the 1970s.- We haven't the foggiest notion how to preserve what we term \"wilderness,\" and we had better study it in the field and learn how to do so. I see no evidence that we are conducting such research in a humble, rational, and systematic way. I therefore hold little hope for wilderness management in the twenty-first century. I blame environmental organizations every bit as much as developers and strip miners. There is no difference in outcomes between greed and incompetence.- We need a new environmental movement, with new goals and new organizations. We need more people working in the field, in the actual environment, and fewer people behind computer screens. We need more scientists and many fewer lawyers.- We cannot hope to manage a complex system such as the environment through litigation. We can only change its state temporarily-- usually by preventing something-- with eventual results that we cannot predict and ultimately cannot control.- Nothing is more inherently political than our shared physical environment, and nothing is more ill served by allegiance to a single political party. Precisely because the environment is shared it cannot be managed by one faction according to its own economic or aesthetic preferences. Sooner or later, the opposing faction will take power, and previous policies will be reversed. Stable management of the environment requires recognition that all preferences have their place: snowmobilers and fly fishermen, dirt bikers and hikers, developers and preservationists. These preferences are at odds, and their incompatibility cannot be avoided. But resolving incompatible goals is a true function of politics.- We desperately need a nonpartisan, blinded funding mechanism to conduct research to determine appropriate policy. Scientists are only too aware whom they are working for. Those who fund research-- whether a drug company, a government agency, or an environmental organization-- always have a particular outcome in mind. Research funding is almost never open-ended or open-minded. Scientists know that continued funding depends on delivering the results the funders desire. As a result, environmental organization \"studies\" are every bit as biased and suspect as industry \"studies.\" Government \"studies\" are similarly biased according to who is running the department or administration at the time. No faction should be given a free pass.- I am certain there is too much certainty in the world.- I personally experience a profound pleasure being in nature. My happiest days each year are those I spend in wilderness. I wish natural environments to be preserved for future generations. I am not satisfied they will be preserved in sufficient quantities, or with sufficient skill. I conclude that the \"exploiters of the environment\" include environmental organizations, government organizations, and big business. All have equally dismal track records.- Everybody has an agenda. Except me.",
                "reviewVotes": "315 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emc2",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOWNJIMSHPIIMGE2KXHHEPOFF5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4ZL1KB5UA93Q?ASIN=B000776JN8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 10, 2007",
                "reviewTitle": "4.0 out of 5 stars A non-fiction book would have been better/Make your own judgment",
                "reviewText": "I am a big Crichton fan but this is one of his poorest novels, the plot is so exaggerated and unrealistic, as much, as he did in \"Next\" or \"The Lost World\" (JP II), his worst work. The main characters look like cartoon superheroes hoping around the World, and they could have resolved many of the predicaments they went in just by asking for help outside of their group, but instead, they brought with them Hollywood stars!?. It looks a lot like a script for a kid's movie, full of fast unrealistic action.The message of the novel is a completely different thing. Polemical as you can conclude from the book reviews. MC wants us to be aware of the exaggerations the media, the environmentalists, and now the politicians, are making of Global Warning. MC is challenging the predictions of a theory based almost entirely on simulation models of a complex system (explained with chaos theory), with the first estimates made in the 90's already showing predictions completely off the charts. We are incapable of forecasting the weather one year from today, but we are ready to accept estimates with a precision of one decimal, regarding the future temperatures in the Amazon Basin and elsewhere 20 years from now?. Are we that gullible? Or is this just a noble cause that we have to support, no questions asked?Remember that popular wisdom is not always right, as MC clearly illustrates in Appendix I, \"Why politicized Science is Dangerous\" regarding the theory of eugenics. Also, as the late Carl Sagan used to say, and Richard Dawkins is now remembering to us: Extraordinary claims require extraordinary evidence. And don't forget that \"anecdotal evidence is not proof\". As contrary to law, in science the burden of proof is always on the side of those making the new claim or theory. Hence, from a strictly scientific skeptical point of view, Michael Crichton criticism or doubts are absolutely valid, whether we don't like it is a different matter.It is understandable that highway safety, anti-smoking and other pro-health related media campaigns are exaggerated or overstated, even by MDs, just for the sake of changing a dangerous behavior within a population. The same concept is absolutely valid regarding the protection of the environment, avoiding pollution, but as MC asserts regarding specifically for Global Warming, all the fuss is based on simulation of a phenomena we still don't fully understand, without enough solid scientific evidence, with anecdotal evidence, and even with conveniently biased sets of data. MC also made a warning about the dangers and consequences of taking action when lots of uncertainty still exists, and when clearly Western society does not even know how to do wilderness management properly, or our poor ability to predict the weather in the short and long term. The mean temperature in the Antarctica continent has in fact been declining for the last two decades (check by yourselves through an internet search), but the media is only concerned about one piece that went afloat, and when actual data contradicts the Global Warming theory, some scientists simply claim those statistics are incomplete, but not theirs?.Based on the amount of technical and scientific information presented in the novel (even with references to web sites, footnote references and a full bibliography, that gives you a chance to check the facts by yourself), obviously based on a throughout research on the subject, I guess a non-fiction book (Carl Sagan style) would have been a better medium to deliver his message, rather than through this weak fiction novel. I really would like Crichton to write a book on this polemical subject, no fiction in it, analyzing both sides of the issue (Bush and Al Gore included), rigorously, the way Richard Dawkins bravely writes his books.Many people didn't like Crichton's critical or skeptical position on Global Warming, especially the environmental groups and the scientists who did the research to support the theory, and they just dismiss him as crazy, or working for big industry interests, or manipulating research results, or simply asserting the whole thing inside the book is just fiction, summarized by the now famous quotation: \"Going to \"State of Fear\" for any facts on global warming is like going to \"The Da Vinci Code\" for facts on the life of Jesus\". But please, just be a little skeptical for a few minutes, and make your own judgment by checking on the rebuttals available in the internet. Wikipedia is a good starting point, just type \"State of Fear\". A couple of good examples presenting serious rebuttals are found at the sites of Real Climate and the Pew Center on Climate Change. Check also supporting views for Crichton criticism. Watch Al Gore's film \"An Inconvenient Truth\". Read carefully, balancing the different points of view, and make your own conclusions. And remember, the burden of proof is on those making the extraordinary claim, that's how the scientific method works.And finally, for those so blinded because of his criticism to global warming, please cool off and read carefully the \"Author's Message\" at the end of the book, where he makes explicit his position, guesses and thoughts on this issue. Michael Crichton is not against the environment, he is not Pro-Bush, he is just against the waste of resources based on a theory lacking enough hard scientific proof, especially when so many respectable scientists and intellectuals are on board this near-hysterical cause, and a few people is taking personal advantage of all the frenzy.PS: as suggested by a fellow Amazonian, The Future of Everything: The Science of Prediction (Apollo's Arrow in the Canadian version) by David Orrell is an objective critical analysis of modeling for future predictions in the fields of climate, health and economics. If your are genuinely interested in the limitations and uncertainties of the science behind Global Warming, this book is a must-read. For less biased and common sense criticism I also recommend reading The Deniers: The World Renowned Scientists Who Stood Up Against Global Warming Hysteria, Political Persecution, and Fraud**And those who are too fearful to do so and An Appeal to Reason: A Cool Look at Global Warming",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arthur Wriedt",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 12, 2023",
                "reviewTitle": "Get this book before you cant find it anymorr",
                "reviewText": "Good read, and questions the climate change \"industry\"",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "maria and barry gill",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 5, 2023",
                "reviewTitle": "Ok",
                "reviewText": "Ok",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 29, 2023",
                "reviewTitle": "Challenging Perceptions",
                "reviewText": "I came to this book via a chance reference after missing it first time around. The basic plot is the standard \"Seven days to defeat the terrorists etc\" but Crichton's superb twist was that the terrorists were eco-fanatics seeking to create a disaster to persuade the world by terror to their point of view. I can well understand the rejection by some reviewers since Crichton chose to shred their ideological point of view by simply quoting real science at them! The plot itself follows the Crichton method of \"one damned thing after another\" as our heroes face cliff hanger after cliff hanger. Tremendous stuff and fierce pace - but there is little characterization and the narrative does suffer from the fierce didacticism which was Crichton's intention. I found it tremendous fun and fiercely relevant today since Crichton wrote (in 2004) the eco movement has morphed into climate crisis and is even further removed from its real scientific base. Political ideologies tend to be like this, more's the pity. Crichton was NOT anti science - he used real world real time complex scientific data to debunk armaggedon theories and argue for complex difficult pragmatic solutions to realworld problems. Alas! he lost, and the politicians, media pundits and HR diversity, inclusion, white guilt and deindustrilization enthusiasts won. He also has a bash at explaining this as well! Wonderful stuff and a great polemic. RIP Michael - you are very much missed.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Giovani",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 10, 2020",
                "reviewTitle": "Awesome",
                "reviewText": "I love fiction books that also have real knowledge in them. Crichton was one of the masters of this craft. Also, the subjects of media scare and climate change are more current than ever.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "snake de plume",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on December 8, 2021",
                "reviewTitle": "Wearisome badly written opinionated garbage",
                "reviewText": "When Crichton wrote this I suspect he thought he would be proved right with time, that climate change would be a leftist theory. He wasn't. Its scientific consensus now. The plot is that the heroes fight a fake charity which is trying to manufacture evidence of climate change so that it can get funding. Its painfully stupid stuff, and badly written too. I was shocked that it was possible to get a publisher to print and distribute this rubbish.Dont waste your money on this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}