{
    "remaining_requests": 557,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Couple-Next-Door-Novel/dp/0735221103",
    "body": {
        "name": "The Couple Next Door: A Novel",
        "price": "$8.87$8.87",
        "originalPrice": "",
        "rawPrice": 8.87,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Couple-Next-Door-Novel/dp/0735221103",
        "soldBy": {
            "sellerID": "A1L5ZKRZ8VS139",
            "name": "Giant Giant",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1L5ZKRZ8VS139&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41lFdL3S9BL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31MPdj2OxJL.jpg",
            "https://m.media-amazon.com/images/I/51uvGUlViyL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Shari Lapena",
            "link": "https://www.amazon.com/Shari-Lapena/e/B00QV4963G/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Giant Giant",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 88855,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Meticulously crafted and razor-sharp. The Couple Next Door lingers long after you turn the final page.” —Harlan Coben, #1 New York Times bestselling author of Fool Me Once\"The twists come as fast as you can turn the pages.\" --People\"Provocative and shocking. One crime, an entire neighborhood of suspects, secrets and lies. How well do we ever know those around us? The Couple Next Door will keep you glued the pages in search of the answer. Even then, you'll never guess the truth...until it's too late.” --Lisa Gardner, #1 New York Times bestselling author of Find Her“I read this novel at one sitting, absolutely riveted by the storyline. The suspense was beautifully rendered and unrelenting!” —Sue Grafton, New York Times bestselling author of Y is for Yesterday“Real men read women writers–because of books like this. Trust me.” —Lee Child, #1 New York Times bestselling author of Make Me\"A twisty, utterly riveting tale that will send readers on a wild rollercoaster ride of emotions. Shocking revelations kept me turning the pages like a madwoman.\" —Tess Gerritsen, New York Times bestselling author ofPlaying with Fire“Expertly paced and finely crafted, The Couple Next Door is a gripping thriller of the highest order. I couldn’t put it down.” —A. J. Banner, bestselling author of The Good Neighbor“Gripped me from the very beginning to the very end!” --Becky Masterman, author of Rage Against The Dying“Brilliant! This utterly riveting psychological thriller hurtles along at breakneck speed, never giving you the opportunity to catch your breath. Twisty, turny, and unputdownable.” —C. L. Taylor, bestselling author of The Lie“Exquisitely torturous tension.” —NPR.org“Where did that baby go! It’s hard not to read to the end to find out, and the twists waiting there are gratifyingly clever.”—USA Today“The many never-saw-them-coming twists and questionable characters. . . will keep you on the edge of your seat. First-time novelist Lapena’s writing is spare and tense, and it makes The Couple Next Door a compulsive read. The last line is absolutely killer.” –Good Housekeeping“[A] well-sculpted domestic thriller . . . highly suspenseful . . . Twists are subtly revealed with aplomb, taking the story to increasingly unpredictable levels.” —Associated Press“[A] suspenseful, heart-wrenching debut. . . After numerous twists and turns, Lapena delivers one final, deftly crafted surprise.” —Publishers Weekly“Brisk prose style and character development are almost beside the point in Lapena’s suspense-fiction debut; this is a plot-driven page-turner, and even the most character-focused readers will find it hard to put down.” —Booklist About the Author Shari Lapena is the internationally bestselling author of the thrillers The Couple Next Door, A Stranger in the House, An Unwanted Guest, Someone We Know, The End of Her, Not a Happy Family, and Everyone Here Is Lying, which have all been New York Times and The Sunday Times (London) bestsellers. Her books have been sold in forty territories around the world. She lives on a farm outside of Toronto. Excerpt. © Reprinted by permission. All rights reserved. ***This excerpt is from an advance uncorrected copy proof***Copyright © 2016 Shari LapenaOne Anne can feel the acid churning in her stomach and creeping up her throat; her head is swimming. She's had too much to drink. Cynthia has been topping her up all night. Anne had meant to keep herself to a limit, but she'd let things slide-she didn't know how else she was supposed to get through the evening. Now she has no idea how much wine she's drunk over the course of this interminable dinner party. She'll have to pump and dump her breast milk in the morning. Anne wilts in the heat of the summer night and watches her hostess with narrowed eyes. Cynthia is flirting openly with Anne's husband, Marco. Why does Anne put up with it? Why does Cynthia's husband, Graham, allow it? Anne is angry but powerless; she doesn't know how to put a stop to it without looking pathetic and ridiculous. They are all a little tanked. So she ignores it, quietly seething, and sips at the chilled wine. Anne wasn't brought up to create a scene, isn't one to draw attention to herself. Cynthia, on the other hand . . . All three of them-Anne, Marco, and Cynthia's mild-mannered husband, Graham-are watching her, as if fascinated. Marco in particular can't seem to take his eyes off Cynthia. She leans in a little too close to Marco as she bends over and fills his glass, her clingy top cut so low that Marco's practically rubbing his nose in her cleavage. Anne reminds herself that Cynthia flirts with everyone. Cynthia has such outrageous good looks that she can't seem to help herself. But the longer Anne watches, the more she wonders if there could actually be something going on between Marco and Cynthia. Anne has never had such suspicions before. Perhaps the alcohol is making her paranoid. No, she decides-they wouldn't be carrying on like this if they had anything to hide. Cynthia is flirting more than Marco is; he is the flattered recipient of her attentions. Marco is almost too good-looking himself-with his tousled dark hair, hazel eyes, and charming smile, he's always attracted attention. They make a striking couple, Cynthia and Marco. Anne tells herself to stop it. Tells herself that of course Marco is faithful to her. She knows he is completely committed to his family. She and the baby are everything to him. He will stand by her no matter what-she takes another gulp of wine-no matter how bad things get. But watching Cynthia drape herself over Marco, Anne is becoming more and more anxious and upset. She is still more than twenty pounds overweight from her pregnancy, six months after having the baby. She thought she'd be back to her pre-pregnancy figure by now, but apparently it takes at least a year. She must stop looking at the tabloids at the grocery-store checkout and comparing herself to all those celebrity moms with their personal trainers who look terrific after mere weeks. But even at her best, Anne could never compete with the likes of Cynthia, her taller, shapelier neighbor-with her long legs, nipped-in waist, and big breasts, her porcelain skin and tumbling jet-black hair. And Cynthia always dressed to kill, in high heels and sexy clothes-even for a dinner party at home with one other couple. Anne can't focus on the conversation around her. She tunes it out and stares at the carved marble fireplace, exactly like the one in her own living-dining room, on the other side of the common wall that Anne and Marco share with Cynthia and Graham; they live in attached brick row houses, typical of this city in upstate New York, solidly built in the late nineteenth century. All the houses in the row are similar-Italianate, restored, expensive-except that Anne and Marco's is at the end of the row and each reflects slight differences in decoration and taste; each one is a small masterpiece. Anne reaches clumsily for her cell phone on the dining table and checks the time. It is almost one o'clock in the morning. She'd checked on the baby at midnight. Marco had gone to check on her at twelve thirty. Then he'd gone out for a cigarette on the back patio with Cynthia, while Anne and Graham sat rather awkwardly at the littered dining table, making stilted conversation. She should have gone out to the backyard with them; there might have been a breeze. But she hadn't, because Graham didn't like to be around cigarette smoke, and it would have been rude, or at least inconsiderate, to leave Graham there all alone at his own dinner party. So for reasons of propriety, she had stayed. Graham, a WASP like herself, is impeccably polite. Why he married a tart like Cynthia is a mystery. Cynthia and Marco had come back in from the patio a few minutes ago, and Anne desperately wants to leave, even if everyone else is still having fun. She glances at the baby monitor sitting at the end of the table, its small red light glowing like the tip of a cigarette. The video screen is smashed-she'd dropped it a couple of days ago and Marco hadn't gotten around to replacing it yet-but the audio is still working. Suddenly she has doubts, feels the wrongness of it all. Who goes to a dinner party next door and leaves her baby alone in the house? What kind of mother does such a thing? She feels the familiar agony set in-she is not a good mother. So what if the sitter canceled? They should have brought Cora with them, put her in her portable playpen. But Cynthia had said no children. It was to be an adult evening, for Graham's birthday. Which is another reason Anne has come to dislike Cynthia, who was once a good friend-Cynthia is not baby-friendly. Who says that a six-month-old baby isn't welcome at a dinner party? How had Anne ever let Marco persuade her that it was okay? It was irresponsible. She wonders what the other mothers in her moms' group would think if she ever told them. We left our six-month-old baby home alone and went to a party next door. She imagines all their jaws dropping in shock, the uncomfortable silence. But she will never tell them. She'd be shunned. She and Marco had argued about it before the party. When the sitter called and canceled, Anne had offered to stay home with the baby-she hadn't wanted to go to the dinner anyway. But Marco was having none of it. \"You can't just stay home,\" he insisted when they argued about it in their kitchen. \"I'm fine staying home,\" she said, her voice lowered. She didn't want Cynthia to hear them through the shared wall, arguing about going to her party. \"It will be good for you to get out,\" Marco countered, lowering his own voice. And then he'd added, \"You know what the doctor said.\" All night long she's been trying to decide whether that last comment was mean-spirited or self-interested or whether he was simply trying to help. Finally she'd given in. Marco persuaded her that with the monitor on next door they could hear the baby anytime she stirred or woke. They would check on her every half hour. Nothing bad would happen. It is one o'clock. Should she check on Cora now or just try to get Marco to leave? She wants to go home to bed. She wants this night to end. She pulls her husband's arm. \"Marco,\" she urges, \"we should leave. It's one o'clock.\" \"Oh, don't go yet,\" Cynthia says. \"It's not that late!\" She obviously doesn't want the party to be over. She doesn't want Marco to leave. She wouldn't mind at all if Anne left, though, Anne is pretty sure. \"Maybe not for you,\" Anne says, and she manages to sound a little stiff, even though she's drunk, \"but I have to be up early to feed the baby.\" \"Poor you,\" Cynthia says, and for some reason this infuriates Anne. Cynthia has no children, nor has she ever wanted any. She and Graham are childless by choice. Getting Marco to leave the party is difficult. He seems determined to stay. He's having too much fun, but Anne is growing anxious. \"Just one more,\" Marco says to Cynthia, holding up his glass, avoiding his wife's eyes. He is in a strangely boisterous mood tonight-it seems almost forced. Anne wonders why. He's been quiet lately, at home. Distracted, even moody. But tonight, with Cynthia, he's the life of the party. For some time now, Anne has sensed that something is wrong, if only he would tell her what it is. He isn't telling her much of anything these days. He's shutting her out. Or maybe he's withdrawing from her because of her depression, her \"baby blues.\" He's disappointed in her. Who isn't? Tonight he clearly prefers the beautiful, bubbly, sparkly Cynthia. Anne notices the time and loses all patience. \"I'm going to go. I was supposed to check on the baby at one.\" She looks at Marco. \"You stay as late as you like,\" she adds, her voice tight. Marco looks sharply at her, his eyes glittering. Suddenly Anne thinks he doesn't seem that drunk at all, but she feels dizzy. Are they going to argue about this? In front of the neighbors? Really? Anne begins to glance around for her purse, gathers up the baby monitor, realizes then that it's plugged into the wall, and bends over to unplug it, aware of everyone at the table silently staring at her fat ass. Well, let them. She feels like they're ganging up on her, seeing her as a spoilsport. Tears start to burn, and she fights them back. She does not want to burst into tears in front of everyone. Cynthia and Graham don't know about her postpartum depression. They wouldn't understand. Anne and Marco haven't told anyone, with the exception of Anne's mother. Anne has recently confided in her. She knows that her mother won't tell anyone, not even her father. Anne doesn't want anyone else to know, and she suspects Marco doesn't either, although he hasn't said as much. But pretending all the time is exhausting. While her back is turned, she hears Marco's change of heart in the tone of his voice. \"You're right. It's late, we should go,\" he says. She hears him set his wineglass on the table behind her. Anne turns around, brushing the hair out of her eyes with the back of her hand. She desperately needs a haircut. She gives a fake smile and says, \"Next time it's our turn to host.\" And adds silently, You can come to our house, where our child lives with us, and I hope she cries all night and spoils your evening. I'll be sure to invite you when she's teething. They leave quickly after that. They have no baby gear to gather up, just themselves, Anne's purse, and the baby monitor, which she shoves into it. Cynthia looks annoyed at their swift departure-Graham is neutral-and they make their way out the impressively heavy front door and down the steps. Anne grabs hold of the elaborately carved handrail to help her keep her balance. It is just a few short paces along the sidewalk until they are at their own front stairs, with a similar handrail and an equally impressive front door. Anne is walking slightly ahead of Marco, not speaking. She may not speak to him for the rest of the night. She marches up the steps and stops dead. \"What?\" Marco says, coming up behind her, his voice tense. Anne is staring. The front door is ajar; it is open about three inches. \"I know I locked it!\" Anne says, her voice shrill. Marco says tersely, \"Maybe you forgot. You've had a lot to drink.\" But Anne isn't listening. She's inside and running up the staircase and down the hall to the baby's room, with Marco right at her heels. When she gets to the baby's room and sees the empty crib, she screams. Two Anne feels her scream inside her own head and reverberating off the walls-her scream is everywhere. Then she falls silent and stands in front of the empty crib, rigid, her hand to her mouth. Marco fumbles with the light switch. They both stare at the empty crib where their baby should be. It is impossible that she not be there. There is no way Cora could have gotten out of the crib by herself. She is barely six months old. \"Call the police,\" Anne whispers, then throws up, the vomit cascading over her fingers and onto the hardwood floor as she bends over. The baby's room, painted a soft butter yellow with stencils of baby lambs frolicking on the walls, immediately fills with the smell of bile and panic. Marco doesn't move. Anne looks up at him. He is paralyzed, in shock, staring at the empty crib, as if he can't believe it. Anne sees the fear and guilt in his eyes and starts to wail-a horrible, keening sound, like an animal in pain. Marco still doesn't budge. Anne bolts across the hall to their bedroom, grabs the phone off the bedside table, and dials 911, her hands shaking, getting vomit all over the phone. Marco finally snaps out of it. She can hear him walking rapidly around the second floor of the house while she stares across the hall at the empty crib. He checks the bathroom, at the top of the stairs, then passes quickly by her on his way to search the spare bedroom and then the last room down the hall, the one they have turned into an office. But even as he does, Anne wonders in a detached way why he is looking there. It's as if part of her mind has split off and is thinking logically. It's not like their baby is mobile on her own. She is not in the bathroom, or the spare bedroom, or the office. Someone has taken her. When the emergency operator answers, Anne cries, \"Someone has taken our baby!\" She is barely able to calm herself enough to answer the operator's questions. \"I understand, ma'am. Try to stay calm. The police are on their way,\" the operator assures her. Anne hangs up the phone. Her whole body is trembling. She feels like she is going to be sick again. It occurs to her how it will look. They'd left the baby alone in the house. Was that illegal? It must be. How will they explain it? Marco appears at the bedroom door, pale and sick-looking. \"This is your fault!\" Anne screams, wild-eyed, and pushes past him. She rushes into the bathroom at the top of the stairs and throws up again, this time into the pedestal sink, then washes the mess from her shaking hands and rinses her mouth. She catches a glimpse of herself in the mirror. Marco is standing right behind her. Their eyes meet in the mirror. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, March 5 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 10 hrs 28 mins",
            "FREE delivery February 29 - March 5 on orders shipped by Amazon over $35",
            "Or fastest delivery February 26 - 27"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A NEW YORK TIMES BESTSELLER Another thrilling domestic suspense novel from the New York Times bestselling author of Not a Happy Family “The twists come as fast [as] you can turn the pages.” —People “I read this novel at one sitting, absolutely riveted by the storyline. The suspense was beautifully rendered and unrelenting!” —Sue GraftonIt all started at a dinner party. . .A domestic suspense debut about a young couple and their apparently friendly neighbors—a twisty, rollercoaster ride of lies, betrayal, and the secrets between husbands and wives. . .Anne and Marco Conti seem to have it all—a loving relationship, a wonderful home, and their beautiful baby, Cora. But one night, when they are at a dinner party next door, a terrible crime is committed. Suspicion immediately lands on the parents. But the truth is a much more complicated story.Inside the curtained house, an unsettling account of what actually happened unfolds. Detective Rasbach knows that the panicked couple is hiding something. Both Anne and Marco soon discover that the other is keeping secrets, secrets they've kept for years. What follows is the nerve-racking unraveling of a family—a chilling tale of deception, duplicity, and unfaithfulness that will keep you breathless until the final shocking twist. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Books; Reprint edition (May 30, 2017)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0735221103"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0735221109"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 8.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.08 x 0.55 x 7.98 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,925 in Books (See Top 100 in Books) #156 in Psychological Fiction (Books) #489 in Psychological Thrillers (Books) #820 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 88,855 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jennifer Williams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNKHRWXXJCMVABN2BGGE3KBDXVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LGL3JCS4Z21L?ASIN=0735221103",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars amazing read",
                "reviewText": "it truly is a page turner. i couldn’t put it down. any time i absolutely HAD to put it down all i could think about was what was going to happen next. not too long and also not dramatically short. each page had me questioning everything and everyone. amazing story. i wish i could read it again as if i hadn’t read it already. so many of my friends and coworkers have been WAITING for me to finish it so they can have a turn",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Belle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVKNNUNUYX3V27DCJZ3M3S6LYKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KVVEHWC7UIL7?ASIN=0735221103",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2018",
                "reviewTitle": "4.0 out of 5 stars the fact that they do their best to put their best foot forward is not as ...",
                "reviewText": "Is it true that you never quite know what's going on behind closed doors?For Anne and Marco Conti, the fact that they do their best to put their best foot forward is not as obvious as one would think. They've always appeared so perfect to outsiders : a seemingly flawless couple; beautiful and wealthy, successful in business and in family. No one would ever suspect the trouble that lay behind the doors of their expensive brownstone. On the inside of the Conti home, a different story is playing out altogether. There are cracks in the porcelain; there are irreparable runs in the fabric that has been meticulously woven together to complete the Conti household.Since giving birth to their baby girl, Anne has struggled with her identity. She's struggled with postpartum depression. She's struggled with her weight and feeling desirable to her husband. It certainly doesn't help that next door lives a neighbor who is not only dripping with seductive curves and a general air of sex, but that the woman makes constant eyes at Anne's husband. After years working with affluent collectors and purveyors of fine art, Anne is now bombarded with the constant needs of her new child; the years of having endless hours to spend perfecting her hair and makeup or carefully honing her body with a personal trainer are over, the time now spent cleaning spit-up off of her dirty and oversized t-shirt or thrusting a nipple attached to an engorged breast into her screaming infant's mouth. Cora isn't an easy baby, in fact she's the opposite of the sweet and cuddly angelic little figure Anne had in her mind during her pregnancy. She'd dreamed of days curled up in bed with her baby laying peacefully beside her, of afternoons spent pushing silky curls back from her daughter's face as she gurgled happily. But the reality is that Cora does nothing but cry, and Anne feels like a veritable failure as a result.So when a night away presents itself, Anne is intrigued. Marco insists they go next door to get away, to have a little time with other adults and have a few drinks. Anne is at first thrilled to disengage herself from the thickly formed vines of motherhood and spend a few hours in shoes that she used to walk in, to perhaps regain a bit of her old self. But when the babysitter cancels at the last minute and they cannot find another, Anne retreats into herself, becoming anxious to leave their daughter and questioning a night out. Why would she want to go next door, anyway? Seeing her neighbor Cynthia is only going to make her feel more self-conscious about her appearance; it will only solidify the festering feelings of unease in her own skin, will only remind her of the excess weight hugging her middle like a too tight hug. Anne doesn't want to leave Cora. Something in her gut is telling her no. She's uncomfortable with Marco's suggestion : that they take the baby upstairs, lay her down for bed, and spirit themselves next door as quietly as they can, the baby monitor in tow. He promises her that they will check on baby Cora every half an hour, and since they are next door after all, what could possibly happen?What happens is the unthinkable. When the couple returns home after midnight - only thirty minutes since the last check on their sleeping child - the door to their posh New York City brownstone in the well-maintained and quietly wealthy neighborhood stands ajar. Rushing upstairs, Anne and Marco find their baby girl missing, the crib standing vacant with the ugly truth.Cora is gone. Vanished, without a trace. The detective on the scene is seasoned and cautious. Detective Rasbach can tell right off the bat that something isn't quite adding up here. The emotional distance between the couple is palpable. The stressed relationship with Anne's parents is full of tension so thick it could be cut with a butcher knife. As the weeks go by, the detective will begin to peel back the many layers of the Conti family, laying bare their insecurities and their deepest secrets and forcing them to look at each other in ways they'd never imagined. Anne will discover the things her husband is keeping to himself, and Marco will unearth shocking discoveries about a wife he thought he knew. . . . but . . . where is the baby? Where is Cora? The Couple Next Door, the newest book by Shari Lapena, is full of twists and turns that will leave the reader dizzy and frenzied. As the plot unfolds from page to page, suspense and suspicion will mount and attack upon the senses, all leading up to the unexpected reveal. 4 out of 5 stars is given to this thrilling novel, and I recommend it to readers who enjoy fast-paced plots the like of Gillian Flynn and Megan Miranda. This quick read will leave you breathless and keep you guessing; the pivoting of the storyline coming as fast as you can turn the page.",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AbigailAbigail",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDTCG32H4EVU2YZTFTW3FTHYFBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Q0QK1WX355B2?ASIN=0735221103",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "3.0 out of 5 stars Good",
                "reviewText": "The physical book was a little damage when it arrived but nothing too crazy. The story was alright, I really did not enjoy the 3rd POV (that’s just my taste thought). I felt like the book was dragging so much because it kept repeating somethings so the book could’ve been smaller for sure. the story itself was interesting with a lot of twists and turns. I would recommend as a quick little read on the side.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71d+jxmHKFL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lyatt17",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGN2FJEPV5SLGU5TBTNJAJFF2DJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH0ZFK9ETJSW4?ASIN=0735221103",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars lots of twists and turn",
                "reviewText": "This was a quick read. The plot was good, the story line easy to follow, but with all the twists and turns it kept you questioning who did up until the end!And quick,easy and exciting read!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arielle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKW6I3IT6TW7FQVLTCCL6TTXO4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZIXNNIXR2RT5?ASIN=0735221103",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "4.0 out of 5 stars it was okay",
                "reviewText": "I started this book because I wanted to read it before the show comes out. Overall good book but the ending sucked.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcia S. Pec",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM4A5LCGVELTA4ZZ2PKKXUGVCEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J3ERWYF88H5L?ASIN=0735221103",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars A suspenseful book",
                "reviewText": "Story keeps you guessing. I liked it very much",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael S Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHZKBDLUTULDO3YRGYBQ7UYD2TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AH2TTAG3NCYN?ASIN=0735221103",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Couldn’t Put It Down!",
                "reviewText": "Best thriller I have read in a long time! You truly have no idea where it’s going to go next up until the last pages.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tierra S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXKAVV4HP2WLT2L4G2GAMVUC7JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T5AZDG6VNAPL?ASIN=0735221103",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Great book!",
                "reviewText": "This is the first book I’ve read from this author. Very suspenseful to where you don’t want to put it done. It was good up to the very last page. I can’t wait to read more from this author.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darcie Chaisson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 27, 2024",
                "reviewTitle": "suspense",
                "reviewText": "A good read from start to finish",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gemma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 12, 2024",
                "reviewTitle": "Enjoyed reading this…",
                "reviewText": "Really enjoyed this book! Don’t normally read but needed something to read whilst travelling and once I started I couldn’t wait to finish it to see what the ending was 👍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doris Day",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 27, 2024",
                "reviewTitle": "Great book",
                "reviewText": "very good read. Un-put-downable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sudipta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 24, 2023",
                "reviewTitle": "Thrilling and absolutely riveting!!",
                "reviewText": "The couple next door is a story that will keep you riveted to itself. You won't feel like stopping. It is an unceasing thrill that you will look forward to. The story is well spun and the events are properly segued. The characters are animated and well placed throughout the story. The shocks come to you as they please. The story is unpredictable. There are no plot-holes. Just, go for it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Caro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 9, 2022",
                "reviewTitle": "Best boook I’ve read in years",
                "reviewText": "The story just goes from one surprise to another. Brilliantly written book which I couldn’t put down. Maybe one twist too many at the very end but the rest of the book is gripping.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}