{
    "remaining_requests": 29113,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/VideoSecu-MW340B2-Bracket-Articulating-400x400mm/dp/B001OBV7T2",
    "body": {
        "name": "VideoSecu MW340B2 TV Wall Mount Bracket for Most 32-65 Inch LED, LCD, OLED, UHD Plasma Flat Screen TV, with Full Motion Tilt Swivel Articulating Dual Arms 14\" Extend,400x400mm,100 LBS WR9",
        "price": "$34.99",
        "originalPrice": "",
        "rawPrice": 34.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/VideoSecu-MW340B2-Bracket-Articulating-400x400mm/dp/B001OBV7T2",
        "soldBy": {
            "sellerID": "A1YX7EB80E4EIU",
            "name": "Warehouseseller",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1YX7EB80E4EIU&asin=B001OBV7T2&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41YTk0PfJEL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41CtHS6OVuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21vy9LGg0FL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zhbO2wVDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YaQIsdlCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mNIVZ1bML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xp6FlnDQL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: VideoSecu",
            "link": "https://www.amazon.com/VideoSecu/b/ref=bl_dp_s_web_2530729011?ie=UTF8&node=2530729011&field-lbr_brands_browse-bin=VideoSecu"
        },
        "brand": "VideoSecu",
        "merchantInfo": "Warehouseseller",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 5576,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 3 hrs 57 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fit 32\" 37\" 40\" 42\" 46\" 47\" 50\" 52\" 55\" 60\" 65\" Display with VESA up to 400x400mm(16\"x16\")",
            "Steel construction, supports TV up to 100 lbs., Mount to wood wall studs up to 16\" on center.",
            "Low profile 2.3”, Maximum pull out 14.5”; Adjustable tilt 15 degree forward or 5 degree backward; Swivel 130 degrees",
            "Lift n’ Lock makes installation a three step process",
            "Bonus 6 feet HDMI cable. Common hardware pack included in the package"
        ],
        "description": "The MW340B2 is a low profile full motion TV wall mount. Made to be mounted into double studded walls for extra rigidity, two articulating arms added strength to safely support today’s newer, thinner TV. Designed for TV with 100 x 100mm to 400 x 400mm mounting hole pattern, and the mount holds up to 100 lbs, mounting to 16” dual stud, single stud or solid wall.The MW340B2 low profiles mount with a flat depth of only 2.3 inches, you will have a very sleek, against the wall design. It also can extend out 14” for easy access, swivel and tilt to give any seat in the house the perfect viewing angle. Notice: This mount fits most 32-65 inch TVs (VESA hole patterns from 100x100 mm (4x4\") to 400x400mm (16x16\") ), do not work for some old size 50-65 inch TVs manufactured before 2013.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Television & Video",
                "link": "https://www.amazon.com/Televisions-Video/b?ie=UTF8&node=1266092011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/TV-Accessories/b?ie=UTF8&node=3230976011"
            },
            {
                "name": "TV Mounts, Stands & Turntables",
                "link": "https://www.amazon.com/b?ie=UTF8&node=21217994011"
            },
            {
                "name": "TV Wall & Ceiling Mounts",
                "link": "https://www.amazon.com/TV-Mounts-Accessories-Supplies/b?ie=UTF8&node=760796"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "18 x 6.9 x 4.5 inches"
            },
            {
                "name": "Item Weight",
                "value": "5 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "VideoSecu"
            },
            {
                "name": "ASIN",
                "value": "B001OBV7T2"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "MW340B"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 5,576 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#37,621 in Electronics (See Top 100 in Electronics) #655 in TV Wall & Ceiling Mounts"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "December 23, 2008"
            },
            {
                "name": "Mounting Type",
                "value": "Wall Mount"
            },
            {
                "name": "Movement Type",
                "value": "Swivel, Tilt, Articulating"
            },
            {
                "name": "Brand",
                "value": "VideoSecu"
            },
            {
                "name": "Material",
                "value": "Wood"
            },
            {
                "name": "TV Size",
                "value": "65 Inches"
            },
            {
                "name": "Color",
                "value": "black"
            },
            {
                "name": "Minimum Compatible Size",
                "value": "32 Inches"
            },
            {
                "name": "Compatible Devices",
                "value": "Television"
            },
            {
                "name": "Maximum Tilt Angle",
                "value": "15 Degrees"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Full Motion Tilt Swivel Articulating TV Wall Mount MW340B2 The MW340B2 is a low profile full motion TV wall mount. Made to be mounted into double studded walls for extra rigidity, two articulating arms added strength to safely support today’s newer, thinner TV. Designed for TV with 100 x 100mm to 400 x 400mm mounting hole pattern, and the MW340B2 holds up to 100 lbs, mounting to 16” dual stud, single stud or solid wall. The MW340B2 low profiles mount with a flat depth of only 2.3 inches, you will have a very sleek, against the wall design. It also can extend out 14” for easy access, swivel and tilt to give any seat in the house the perfect viewing angle. Notice: This mount fits most 32-65 inch TVs (VESA hole patterns from 100x100 mm (4x4\") to 400x400mm (16x16\") ), do not work for some old size 50-65 inch TVs manufactured before 2013.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/b380dce9-493d-4002-8928-3047ab4b7e10.__CR0,0,337,337_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/b380dce9-493d-4002-8928-3047ab4b7e10.__CR0,0,337,337_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/7269b907-8886-4bad-993a-42cc87e29659.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marky Nark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP6PSY4INAIZK3RHA7NER7SKCJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMO3GL5X6R9PE?ASIN=B001OBV7T2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2014",
                "reviewTitle": "5.0 out of 5 stars Works for my heavy Vizio 3D 47\" LED",
                "reviewText": "I've had my Vizio 3D 47\" LED TV for about three years now. My TV weighs 51.8 pounds. This is my 3rd mount (haha). The first mount I got was from Sam's Club and was supposed to be designed for flat screens that were up to 47\". But it was terribly weak, and you could see the tube steel actually warp a bit when moving it. Then I got another one here on Amazon (Mount-It! Vizio Compatible Swivel TV Mount) but after 6 months, it began to come apart. Although it never dropped the TV, it was pretty close to doing so. This one had great reviews, so I thought I would try it. My complete review is below ....1) Strong for the size. Its about half the weight of other heavy duty adjustable mounts that I have purchased on Amazon before. Yet its strong and doesn't warp or bend when articulating from side to side. I am very impressed with it. 5 of 5 stars2) Tilt Adjustment. The tilt adjustment, which angles the top down or up, is quite good. It uses a flip up lever and when you push down, it clamps it firm. Others use a screw knob which is much more difficult. 5 of 5 stars3) No Level. This unit does not come with a built in level, but I just used my own. 4 of 5 stars4) Small Base. As others have said, this unit has a small foot print and could make it difficult to mount in the correct room position. Fortunately for me, the mounting stud is at the center of where I mount the TV. 3 of 5 stars5) Right and left articulating swing angle. This type of mount is good because it provides and right and left articulating swing angle. My eating table is a raised bar height table to the left of the TV. The swing angle allows me to swing the TV over to the table when I am enjoying a meal. However, when I am cooking in the kitchen, I need to swing it to the opposite side. The angle is not quite as high as others because the articulating frame is not as long as other mounts do because of its size. But it still works for me and should for most people. 5 of 5 stars6) Overall Design. I like the way the bolts, especially for the articulating swing mechanism, are easily accessible. This allows for an easy visual inspection to see if the bolts are tight. Other mounts have the bolts hidden and can't be adjusted or tightened which could cause the TV to fall if they become loose. 5 of 5 stars7) Level when articulating to the left or right. As others have mentioned, nearly all these types of mounts to tend to warp a bit when articulating to the extreme left or right. However, because this works well with my heavy 47\" TV weighing at 51.8 lbs, it does not warp and therefore the level does not need to be readjusted every time I swing to the right or left. I would say if you have a heavier or larger TV, that might be a problem with this particular mount. The last mount I purchased did have a better mechanism for leveling after articulating - You just leveled the TV with your hands. So, therefore I would be cautious when using anything above a 50\" TV if you didn't want to mess with the level every time you articulated to the left or right. Again, I am pleasantly surprised how well it does with my 51.8 lb Vizio 47\" TV.8) Ease of mounting. I was able to do mount the frame to the wall, and mount the TV to the frame by myself. Two people would be better, especially if you have a heavier TV. 5 of 5 stars9) Smooth Operation. The articulating frame is extremely smooth and it doesn't take very much effort to return the TV to the center position. Its much smoother than the other mounts I have owned. 5 of 5 starsAs others have said, this is a very good mount and strangely strong for how light it is. I have no problem recommending it for flat screens that are heavy up to 47\" in size. My previous mount that this one replaced was listed as \"Mount-It! Vizio Compatible Swivel TV Mount for 32-60\" Plasma & LCD\". I would not recommend it because the articulating bolts came loose and there was no way to tighten them.I fully recommend this mount",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Hill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYRIIK6LRXEUO2BZHVPRDNJGL5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MVZ8WK13HX99?ASIN=B001OBV7T2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 17, 2013",
                "reviewTitle": "5.0 out of 5 stars Works Well On Sony Bravia 46\" - Highly Recommended",
                "reviewText": "This VideoSecu TV Wall Mount is fairly easy to setup (with an extra set of hands), provides tilt and swivel functionality, and is also a great value. Here are my observations:Needed for standard wall mounting, but not included; Stud Finder, Drill, 7/32 Drill Bit, Hex Wrench Set, Socket Set or Adjustable Wrench, and a Philips Head ScrewdriverPros-+ Strong; easily supports my 36-pound TV+ Easy Setup; with my teen son's help, we had this up on the wall and the TV mounted in well under 30 minutes+ Adjustable; allows TV to pull away from the wall, swivel to the left and right, and tilt up and down+ Hardware; comes with all the mounting hardware likely to be needed+ HDMI Cable; includes a good quality 10' HDMI cableCons-+ Tricky Tilt Adjustment; to get the final leveling after the TV is mounted, it may be required to adjust two screws with a Hex WrenchThis is much better quality than expected for the relatively low cost of this sturdy and well made mount.Highly Recommended!CFH",
                "reviewVotes": "97 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. Spencer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNOYQQQ4RPNGDV7BDM3TJ3HTFQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ODZ93L0SFF5G?ASIN=B001OBV7T2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2016",
                "reviewTitle": "5.0 out of 5 stars Very satisfied",
                "reviewText": "After comparing mounts on Amazon, and marveling at the high prices of similar mounts elsewhere, I ordered this one. I decided I wanted a two-stud mount for security, and an articulating mount for ease of access once the TV was mounted. (As other reviewers have noted, even if you want your TV flat against the wall, having an articulating mount makes getting it set up so much easier. Even if you think you will never swivel or tilt the TV, get an articulating mount.) This mount fit perfectly using the 16\" studs in the wall. The mount is sturdy, and feels as if it will hold a much heavier item than most of today's TV's. Mine is an 18 lb. Sharp 43\" Roku TV. As others have noted, the swivel joints are quite stiff and difficult to work at first. This is actually OK with me, because it means the TV won't move unless I want it to. The mount extends far enough out to allow you to work behind the TV, so I was able to mount a power strip and cable box on the wall behind the TV; both of which are covered when the TV is pushed back into its normal position. It took about 30 minutes to install after gathering the tools needed, and was pretty painless. Plenty of different mounting screws and spacers were included. I didn't need any of them, as the TV came with the proper mounting screws, and has a flat back. All in all, a very satisfying experience. The TV looks great, everything I don't want to see is tucked away behind it, and it was easy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$34.99",
                "sellerName": "Warehouseseller",
                "sellerRating": "5"
            }
        ]
    }
}