{
    "remaining_requests": 29224,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/VideoSecu-ML531BE-Monitor-Articulating-Extension/dp/B000WYVBR0",
    "body": {
        "name": "VideoSecu ML531BE2 TV Wall Mount kit with Free Magnetic Stud Finder and HDMI Cable for Most 26-55 TV and New LED UHD TV up to 60 inch 400x400 Full Motion with 20 inch Articulating Arm WT8",
        "price": "$19.99",
        "originalPrice": "$25.00",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/VideoSecu-ML531BE-Monitor-Articulating-Extension/dp/B000WYVBR0",
        "soldBy": {
            "sellerID": "A1YX7EB80E4EIU",
            "name": "Warehouseseller",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1YX7EB80E4EIU&asin=B000WYVBR0&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "300",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/5112tPeu rL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51rfYOZsrVS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411m7GuYcDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31pNpZHPCqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41bdfTnnsvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sb7LH-F0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41I7I0BkagL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: VideoSecu",
            "link": "https://www.amazon.com/VideoSecu/b/ref=bl_dp_s_web_2530729011?ie=UTF8&node=2530729011&field-lbr_brands_browse-bin=VideoSecu"
        },
        "brand": "VideoSecu",
        "merchantInfo": "Warehouseseller",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 57027,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 4 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Heavy gauge steel mount supports TV up to 88 lbs. Compatible with VESA (mounting hole pattern) 400x400mm/400x300mm/400x200mm/300x300mm/300x200mm/200x200mm/200x100mm/100x100mm (16\"x16\"/16\"x12\"/16\"x8\"/12\"x12\"/12\"x8\"/8\"x8\"/8\"x4\"/4\"x4\")",
            "Tilt, pan and 20” pull out from the wall provides maximum viewing flexibility.",
            "Low profile mount retracts to 2 1/2\" and nests centered on the wall",
            "Free Magnetic stud finder included",
            "6ft HDMI cable and mounting hardware included in this mounting kit"
        ],
        "description": "ML531BE2 is a low-profile full motion wall mount, It extends up to 20 inches off the wall, gives you maximum flexibility in positioning your TV to fit your environment for comfortable view. This heavy duty steel mount supports most TVs weighing up to 88 lbs. It fits most 26\"–55\" flat panel TV and new LED TVs up to 60”. The mount can swivels in either direction, tilts up 5 degree, tilts down 15 degree, and has ±5 degree screen level adjustment capability. To determine if the mount fits your TV, measure the vertical and horizontal distance between mounting holes on the back of the TV. A VESA pattern is measured in both horizontal and vertical distance in millimeters. 4\" is about 100mm, 7 7/8\" is 200mm, 11 13/16\" is 300mm, and 15 ¾\" is 400mm. This versatile mount supports TV with the following VESA mounting hole patterns: 100 x 100 mm, 150 x 150 mm, 200 x 100 mm, 200 x 200 mm, 300 x 200 mm, 300 x 300 mm, 400 x 200 mm, 400 x 300 mm, 400 x 400 mm. 6ft HDMI cable include in this new wall mounting kit. Common TV mounting hardware is included for easy installation.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Television & Video",
                "link": "https://www.amazon.com/Televisions-Video/b?ie=UTF8&node=1266092011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/TV-Accessories/b?ie=UTF8&node=3230976011"
            },
            {
                "name": "TV Mounts, Stands & Turntables",
                "link": "https://www.amazon.com/b?ie=UTF8&node=21217994011"
            },
            {
                "name": "TV Wall & Ceiling Mounts",
                "link": "https://www.amazon.com/TV-Mounts-Accessories-Supplies/b?ie=UTF8&node=760796"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "13 x 10.6 x 2.5 inches"
            },
            {
                "name": "Item Weight",
                "value": "8.8 pounds"
            },
            {
                "name": "ASIN",
                "value": "B000WYVBR0"
            },
            {
                "name": "Item model number",
                "value": "ML531BE2"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 57,027 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,669 in Electronics (See Top 100 in Electronics) #113 in TV Wall & Ceiling Mounts"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 9, 2007"
            },
            {
                "name": "Department",
                "value": "Unisex Adult"
            },
            {
                "name": "Manufacturer",
                "value": "VideoSecu"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Mounting Type",
                "value": "Wall Mount"
            },
            {
                "name": "Movement Type",
                "value": "Articulating,Â Tilt"
            },
            {
                "name": "Brand",
                "value": "VideoSecu"
            },
            {
                "name": "Material",
                "value": "Alloy Steel"
            },
            {
                "name": "TV Size",
                "value": "65 Inches"
            },
            {
                "name": "Minimum Compatible Size",
                "value": "26 Inches"
            },
            {
                "name": "Compatible Devices",
                "value": "Television"
            },
            {
                "name": "Maximum Tilt Angle",
                "value": "15 Degrees"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Brianstech",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDBMGEDHI2UKUCNL53PWUZE2GJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MI2TCTSRWUE5?ASIN=B000WYVBR0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 27, 2010",
                "reviewTitle": "5.0 out of 5 stars Absolute Perfection!",
                "reviewText": "*UPDATE 11-10-11* Apparently the design and sale of this mount has changed since my original review. It's now easier to install, and comes with an HDMI cable and level. Otherwise, most of my review still stands.I was planning to make my own TV mount because all the affordable ones were so cheaply made. That was until I stumbled on this one for $25.Wow, was I surprised when it arrived! Very nicely double-boxed and packaged extremely well. Then the construction is quality all the way, right down to the chrome-plated nuts, screws and bushings. This mount was manufactured and boxed as if it were a high-dollar item.It only took about 15 minutes to have my 37\" LG firmly hanging on the wall. Oh, and I did it all by myself.I can't comment on the mount-to-TV screws because my LG already provided them. And I did use my own 5/16\" flat washers on 2 of the lag screws since none were included, but that's just my preference.I highly recommend this mount, I would have been happy to pay double for such quality.Now, as usual, many of the reviews here are misleading:*Dismiss all reviews that talk about adjacent studs, or difficulties getting screws to grab at an angle. This thing BOLTS TO A SINGLE WALL STUD VERY EASILY! Just like what's shown on the instruction sheet, you simply screw 3 of the lag screws down the center of the mount. That's all that's needed, the other holes are just a bonus for more complicated setups. DO NOT PUT 6 OR 7 LAGS INTO A STUD! You will probably shred or weaken it. Crash goes your TV while ripping a chunk of 2x4 through your drywall.*Dismiss the reviews that mention short lag screws. They are 2\", that's a depth of almost 1 1/2\" into the stud after going through 1/2\" drywall and the mount. If you drilled roughly 3/16\" to 1/4\" diameter pilot holes and didn't over-tighten your lags, it should be fine. I've mounted mine twice now, using the same (provided) lags.*I have no idea where this review came from that complains about an adjustment knob getting in the way. My mount doesn't have any kind of knob on it whatsoever, perhaps they are commenting on a different model. There's a tilt adjustment, but it uses a wrench and doesn't protrude anywhere. The ONLY BAD PART I'VE FOUND is that cheap stamped sheet-metal wrench to tighten the tilt mechanism. No problem, I just used my own 13mm wrench instead.*Yes, the mount can be somewhat stiff. Like another reviewer stated, just lubricate it. I used a few drops of 3-In-1 Oil in the joints.*And bad reviews from people who didn't research or check to see if their TV or monitor is VESA compliant. That also includes the ones who didn't check to see if the mounting plate will block off their inputs. The plate is about 8 1/2\" square, it shouldn't be that hard to see if you'll have a conflict. Besides, in the description it says, \"Please make sure what mount your TV needs before you place order. If you are not sure, please send us a message. We will check for you.\" So they are giving a nice product bad reviews because they simply didn't read the description.*Then all the complaints of trying to hold the TV to the mount while installing the screws. If you look at the pictures on Amazon you'll see the center screw hole is a \"keyhole\". 1. Hold the mount to the wall and mark the 3 hole locations on the wall. On the center keyhole you want to only mark the narrow slot at the top. 2. Drill (3) 3/16\" holes. 3. Install center screw into the stud, but leave a small gap between the head and the drywall, you can even use the mount to test whether the slot in the \"keyhole\" passes behind the head. 4. Lay your TV face-down on a safe place like a mattress or a table with a comforter over it. Place the mount over the back of the TV and install screws. 5. Position the mount so the wall mounting plate is reasonably close to the TV and as close to center as possible, and simply hang it on the wall to the center lag screw through the keyhole. That should help with the weight while you screw the top lag in, then the bottom. Don't tighten anything completely until all 3 screws are in, then make sure it's level or plumb.That's it. This is an inexpensive, very well built product that solves a simple problem. I'll be ordering more for my PC monitors and future customers ASAP.",
                "reviewVotes": "1,549 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason Brent",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOTSR6X6DP66OAVKMVMUCCO5S3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO7P4RZ21NOUW?ASIN=B000WYVBR0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 10, 2012",
                "reviewTitle": "5.0 out of 5 stars Can't go wrong on this mount",
                "reviewText": "I ordered 2 of these for my 32 inch flat tv's. They came packaged nicely, and with ALL mounting hardware included.. Just have to search thru the bag of screws and find the ones you need to match up to the back of your tv. Mounting was easy.. I chose to take the front portion of mount off of bracket and mount it to the back of tv first, then mount it to the wall mount.. If you have two people, you could easily do everything with the mount already installed on the wall.. All adjustments seem to work fine and tv will move almost any desired direction.. I have mounted several tv's on the wall the past few years.. This is very nice and affordable mount.. For $25.00 and free shipping you can't go wrong.. Don't go to the box / retail stores and pay up to or over $100.00 for the same thing.. They are hoping you will buy one the same time you buy the tv there, vs ordering it on line.. Tip: if you want one delivered before you buy your tv, look up the tv you are going to buy and see which VESA mount it uses.. Most of these tv mounts are pretty universal to match most tv's today, but it only takes a few minutes to do and should help assure you have the correct mount when you bring home your new tv.. Also make sure you have the proper cables for connecting to cable service / outdoor antenna and other devices.. The tv's sold today do not come with any cables.. Tip: Do not buy cables from box stores.. They are a huge ripoff, just like their tv mounts.. Order all the cables you need on Amazon with your tv mount order.. Or ebay is a good source for cables as well.. You will save a huge amount of dollars, especially on HDMI and DVI cables.. Also don't be afraid to pick up a cheap outdoor tv antenna and search for free over-the-air digital channels.. Depending on your area, you may receive many free channels. You may even find the free channels are adequate for your tv watching and it would not be necessary to subscribe to cable or dish programming.. The over-the-air digital channels are all excellent quality, they beat our local cable provider for clarity hands down.. Just a few tv tips for you do it yourself ers.. Make sure when you mount your wall mount that you get it fastened solid into a wall stud.. That will do all the supporting.. Remember: you're not hanging a picture on the wall, you are hanging a large device and needs solid support.. If you have trouble locating a stud, a cheap stud finder from home improvement stores can help.. Otherwise, your local handyman can help find it for you.. This seems to be a good solid mount for the money and I can't see where anyone could go wrong.. Just don't exceed the weight it is designed for by putting too large of a tv on it..",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vic Berzins",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 4, 2021",
                "reviewTitle": "Good Value for the price",
                "reviewText": "No Issues, works great with my 32\" TV",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miguel Sánchez del Pozo.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 14, 2020",
                "reviewTitle": "Fácil instalación pero considera que...",
                "reviewText": "Es primera vez que instalo una televisión. Mi TV es de 50 pulgadas. Sin embargo la instalé con un tío.Cabe mencionar que: Los tornillos que incluye son para paredes de madera o tabla roca (como es usual en EUA).También te incluye un cable HDMI. Por lo que si pensabas comprar uno, este te lo incluye.Es fácil de instalar porque tiene diferentes inclinaciones (horizontal o vertical) que te solucionan en caso de que NO lo instales en un ángulo de 90°.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alison H",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 31, 2019",
                "reviewTitle": "Excellent",
                "reviewText": "Good piece of Kit",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raul",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 8, 2021",
                "reviewTitle": "Buen producto",
                "reviewText": "Buen producto, sin embargo no incluye los taquetes de expansión y eso complica un poco la instalación.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jabee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 11, 2020",
                "reviewTitle": "Good price",
                "reviewText": "Good product, good price, good delivery.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}