{
    "remaining_requests": 29238,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/VIVO-Adjustable-Pneumatic-Articulating-MOUNT-V001GW/dp/B0B48K12JV",
    "body": {
        "name": "VIVO Height Adjustable Pneumatic Extended Arm Single Monitor Wall Mount, Full Motion Articulating, Fits 17 to 27 inch Screen, White, MOUNT-V001GW",
        "price": "$37.99$33.17$37.99",
        "originalPrice": "$44.99",
        "rawPrice": 37.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/VIVO-Adjustable-Pneumatic-Articulating-MOUNT-V001GW/dp/B0B48K12JV",
        "soldBy": {
            "sellerID": "A3W3STWCK1O3NR",
            "name": "V I V O",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3W3STWCK1O3NR&asin=B0B48K12JV&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B5FKLLCH"
        ],
        "asinVariationValues": [
            {
                "asin": "B0779BHZCG",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31+S4aVDvxL._SS36_.jpg"
            },
            {
                "asin": "B0B48K12JV",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31lUjl07dlL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31lUjl07dlL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41KDuzEq9hL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41t1HoWoqFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31NDBvEhxjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31rSWlOoIsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lCsLRQsmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91aKrt gmmL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/cf475f70-e8d5-5148-9198-56d0b1df250f/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91gJ9GYcoOL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91gJ9GYcoOL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the VIVO Store",
            "link": "https://www.amazon.com/stores/VIVO/page/80615CC7-EA3E-4B20-ADA8-BBCACD186AB7?ref_=ast_bln"
        },
        "brand": "VIVO",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1279,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 11 hrs 57 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "FREE pickup Monday, February 19",
            "Or fastest pickup Tomorrow, February 15. Order within 16 hrs 57 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Counter-Balance Wall Mount - Clear up valuable desk space with a deluxe extended pneumatic spring arm wall mount. Features tool-less, instant height adjustment, allowing you to find the perfect ergonomic viewing level.",
            "Compatibility - Fits VESA 75x75mm or 100x100mm and holds one computer monitor 17\" to 27\" (under 19.8 pounds).",
            "Articulating Arm - Features +90° to -45° tilt, 180° swivel, and 360° rotation for a variety of viewing angles.",
            "Easy Installation - Mounting hardware such as mounting screws, anchors, washers, and VESA bolts are included, as well as cable management to keep cords out of sight and organized.",
            "We've Got You Covered - Sturdy steel design is backed with a 3 Year Manufacturer Warranty and friendly tech support to help with any questions or concerns."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Monitor Accessories",
                "link": "https://www.amazon.com/Computer-Monitor-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=281062"
            },
            {
                "name": "Monitor Arms",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=23572104011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "14.76 x 12.2 x 3.82 inches"
            },
            {
                "name": "Item Weight",
                "value": "4.5 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0B48K12JV"
            },
            {
                "name": "Item model number",
                "value": "MOUNT-V001GW"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,279 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#423 in Computer Monitor Arms"
            },
            {
                "name": "Other display features",
                "value": "Home Theater"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Manufacturer",
                "value": "VIVO"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "June 15, 2022"
            },
            {
                "name": "Mounting Type",
                "value": "Wall Mount"
            },
            {
                "name": "Movement Type",
                "value": "Articulating"
            },
            {
                "name": "Brand",
                "value": "VIVO"
            },
            {
                "name": "Material",
                "value": "Alloy Steel"
            },
            {
                "name": "TV Size",
                "value": "27 Inches"
            },
            {
                "name": "Minimum Compatible Size",
                "value": "17 Inches"
            },
            {
                "name": "Compatible Devices",
                "value": "Monitor"
            },
            {
                "name": "Maximum Tilt Angle",
                "value": "90 Degrees"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Find the Perfect Ergonomic Viewing Level",
                "media_link": []
            },
            {
                "media_text": "MOUNT-V001G Pneumatic Arm Single Monitor Wall Mount Clear up valuable desk space with this single monitor pneumatic spring wall mount. The pneumatic spring extended arm allows for simple height adjustment without the use of tools and features articulation for setting the monitor to almost any viewing angle. Comes with hardware for an easy mounting process",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3a2bcf1b-9cc2-4998-891e-fff7b4bf70a6.__CR0,0,2485,1864_PT0_SX800_V1___.jpg"
                ]
            },
            {
                "media_text": "Full Motion Articulation",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0d4dce73-d5bf-43fc-b799-937574395324.__CR0,0,3700,1516_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Previous page Counter-Balance Wall Mount Adjusts to the weight of your monitor allowing you to effortlessly adjust the height of your monitor Integrated Cable Management Helps you keep messy A/V and power cords out of sight and organized. Easy Installation Mounts to a variety of surfaces. All hardware included. Next page 1 Tool-less Adjustments 2 Cable Management 3 Mounting",
                "media_link": []
            },
            {
                "media_text": "SPECIFICATIONS Color: Black, White VESA Standard: 75x75mm & 100x100mm Screen Size: 17\" to 27\" Height Range: 9.75\" Arm Extension: 20.5\" Wall Plate Dims: 2\" x 6.8\" Articulation: +90° to -45° tilt, 180° swivel, and 360° rotation Weight Capacity: 4.4 lbs to 19.8 lbs",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/164c8d91-4d7d-4b1c-aa0e-72af52c71ac6.__CR0,0,3500,1434_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3a2bcf1b-9cc2-4998-891e-fff7b4bf70a6.__CR0,0,2485,1864_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0d4dce73-d5bf-43fc-b799-937574395324.__CR0,0,3700,1516_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/689dc6c3-d24c-4b57-ac40-2c1b46e177ae.__CR1,0,3499,1434_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/82bae5c4-64ef-4665-81a4-b430f79ebb7c.__CR0,0,3999,1639_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d9538925-842f-45a5-ae8c-acbb988c16f6.__CR1,0,3499,1434_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Scott R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENMGU7PFFEAQCZSBDJUWO5K6FQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3T4BN48DPCTL0?ASIN=B0B48K12JV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Sturdy mount for your VESA equipment",
                "reviewText": "Purchased this to mount my RodeCaster Pro II to the wall and off a box precariously balanced on the floor. It came with two metric-sized lag bolts with washers, and two sheetrock anchors. Personally, I don't think the sheetrock anchors would work very well. I'd bet they'd tear an even bigger hole in your wall if used.I didn't have metric sockets for my impact driver, so I got some standard 1/4\" x 3\" lag bolts from the hardware store so that I could mount it directly to a stud in the wall. The apartment building I live in was built over 40 years ago and the wood used in it extremely dry. I found this out because the first bolt I tried to install had its head twisted off by the impact driver. I was expecting it to go in like a hot knife through butter, but no. THAT'S when I learned you need to drill a pilot hole if you use lag bolts!After drilling two holes slightly less than 1/4\" in diameter, the bolts went in very easily. The hardest thing at this point was holding the arm in one hand and the driver in the other and getting the bolt far enough in so as to fine-tune positioning for the second bolt. Once tightened into position, the mount is very secure. If you are planning on using this, absolutely guarantee you have a stud in your proposed mounting location otherwise you may regret it!The only negative comment I have with the mount is with the way it was packaged. They used cheap packing tape to keep the arm folded so that it would be in a more compact package. This tape would NOT come off easily and when it did, it left most of the adhesive on the arm itself! I spent a lot more time than I expected scrubbing this residue off with a lot of isopropanol. They could have done the exact same thing with a couple zip-ties and it would have been orders of magnitude cleaner and simpler!!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna W.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYZVXTT4YRVTJOJYSPL7LSUDMZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JXD783FCW2MS?ASIN=B0B48K12JV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2021",
                "reviewTitle": "5.0 out of 5 stars Very Nice Monitor Arm",
                "reviewText": "I've never been disappointed by VIVO monitor mounts. On one computer, I have a three monitor VIVO table top stand. On another computer, I have a dual-monitor desk clamp stand. And on this computer, I have this wall mount arm. All of them have performed beautifully. One benefit is that many of the parts interchange between their various models should you need to switch things around.It's very quick and easy to mount on drywall -- just find the stud, drill two pilot holes, and bolt it on. It took me all of five minutes. I do recommend using a level to make sure you get the mount straight. Not only does that help with aesthetics but it reduces the load on the pneumatics and helps keep the monitor from wanting to move after being adjusted.The only thing I think could be better on this mount is if the upper arm was an inch or so longer to give the arm a couple additional inches in vertical adjustment, but it's very adjustable as it is. I also didn't even have to make any adjustments to the tension. It was nearly perfect for my monitor out-of-the-box. It's easy to adjust the monitor position and it stays put.I did get a nice chuckle from the other reviews when originally buying this. One schmuck had tried to bolt it directly to drywall without anchoring it to the stud and then tried to blame the monitor arm for the giant hole he created in his rental property. He was even brave enough to post a picture and show the world what happens when you don't read and follow instructions. Unfortunately, someone must have told him, as it seems he has removed his review -- too bad, as you would have gotten a good laugh.And another reviewer was talking about the horrible drywall anchors it comes with. Apparently he too didn't follow instructions as they aren't drywall anchors. They are brick/concrete anchors. For drywall, you're supposed to find a stud and use the supplied screws to bolt it to the stud behind the drywall.All in all, this is a very nice monitor arm. It looks nice and is more adjustable than most wall mounts.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "OnlyANameOnlyAName",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFECFOGMVVNYR3DGA66EDXFGGQTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQQRA0JEORRD4?ASIN=B0B48K12JV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2020",
                "reviewTitle": "4.0 out of 5 stars Very robust and well priced mounting arm",
                "reviewText": "More of a 4.5 stars since it is incredible value for the money and my only complaints are relatively minor. Ultimately I would buy it again adn recommend it to anyone looking for a well priced arm mount.I ordered this to mount a small 24 inch Vizio TV and soundbar in our kitchen under the cabinets. Installation was easy with 2 lag screws straight into a stud (pre-drill the holes though). The tv was very light on its own (6.9 lb or 3.1 kg) as was the soundbar (2.2 lb or 1 kg). So in total between the TV, soundbar, cables, and soundbar mount there is maybe 11 lbs (5 kg) on this arm. It has no problem supporting this weight and I had to actually reduce the tension to get it dialed in just right. As you move the arm around, extending and rotating it, it keep the TV vertically oriented. That is something worth knowing, this arm, though you can adjust the up down viewing angle it is designed to hold the TV or monitor in only the vertical position. So if you have something like a touch screen monitor that you want to be able to pull out and lay flat-ish to work on, this is NOT the arm for you.As you can see in the pictures, it will push flat against the wall, however, there is of course a gap left that is the thickness of the arm and mount which means the back of the tv is held between 3.75 and 4.5 inches (9.5 to 11.5 cm) away from the wall depending on how carefully you push it back into place. There are cable management channels that will help with the appearance when viewed from the side, or extended, but inevitably the cords will still be longer than the channel and need to be bundled behind the TV/monitor or at the base since the channel is a little to small to coil them inside the channel. If you have only one power cord and maybe one other cable that isn't very stiff you may be able to bundle them into the cable channels.The middle joint is pretty stiff to rotate so I usually make sure to grab the arm itself rather then stress the TV housing to extend it. Depending on how you look at this it may be good or it may be bad. It definitely holds its position once adjusted but redepositing ti is a bit of extra effort. Maybe with more use it will loosen up a bit and wear-in? I have only been using this for about a month and don't reposition the TV very often.All in all this is a great deal for the price and I would absolutely buy it again, but I can see how it could be improved. For example better cable management, looser swivel joints, lower profile. Though the stiffer joints may be beneficial in some use cases.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61Xi1IssnJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71L3v8VsyPL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBRACT7WTCIRWJXHSYZ52UHPWDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JOSSUJSCIGPS?ASIN=B0B48K12JV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Well made works as intended",
                "reviewText": "I would definitely buy this again. It looks great and does the job.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marco NuñezMarco Nuñez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 16, 2023",
                "reviewTitle": "¡Buen producto!",
                "reviewText": "Funciona muy bien con mi monitor de 27”; lo soporta sin problemas y se puede maniobrar fácilmente. Se siente de buena calidad, las instrucciones son sencillas de seguir y me gusta los cables se pueden esconder en el brazo. Fue una buena compra.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/719iEUTCALL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Ysy+GFdmL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "moypassi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 10, 2023",
                "reviewTitle": "Could not be happier",
                "reviewText": "This is a well designed and made piece of hardware. I got it today and mounted it right away and have been using it beside a recliner (my office working chair now) for my laptop. I put a board on top to test the utility and am really pleased.I have some adjustments to make. I will put a tapered piece under the board so that I can tilt this totally level like a proper little table. But to get it level laterally I need to remount. I will do this by putting the top screw in first and solid and then fine adjusting to level before putting the second bottom screw. The screws provided are garbage with a Phillips driver and strip too easily. That’s all.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Titus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 27, 2019",
                "reviewTitle": "Heath-Robinson project",
                "reviewText": "I used this to make an articulated keyboard tray for my sofa-workstation.Bolted it to side table with castors on (to make it mobile).Works great :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 17, 2018",
                "reviewTitle": "Good product",
                "reviewText": "Quality product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jody",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 25, 2024",
                "reviewTitle": "Awesome Arm",
                "reviewText": "Had these in use for 18 months. I bought 2 and both have a 32inch monitor on them. No issues and we move the monitors a lot. They stay exactly where you want them",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$44.99",
                "sellerName": "V I V O",
                "sellerRating": "4.5"
            }
        ]
    }
}