{
    "remaining_requests": 29308,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/VideoSecu-Monitor-Extension-Articulating-100x100/dp/B003O1UYHG",
    "body": {
        "name": "VideoSecu ML12B TV LCD Monitor Wall Mount Full Motion 15 inch Extension Arm Articulating Tilt Swivel for Most 19\"-31\" LED TV Flat Panel Screen with VESA 100x100, 75x75 1KX",
        "price": "$15.99",
        "originalPrice": "",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/VideoSecu-Monitor-Extension-Articulating-100x100/dp/B003O1UYHG",
        "soldBy": {
            "sellerID": "A1YX7EB80E4EIU",
            "name": "Warehouseseller",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1YX7EB80E4EIU&asin=B003O1UYHG&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41mSjibmRPL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51F6v9Jk8FL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Pglc x1NL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41RNukZQbJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ORnDAoQQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZFFe13J-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41i02BalC4L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: VideoSecu",
            "link": "https://www.amazon.com/VideoSecu/b/ref=bl_dp_s_web_2530729011?ie=UTF8&node=2530729011&field-lbr_brands_browse-bin=VideoSecu"
        },
        "brand": "VideoSecu",
        "merchantInfo": "Warehouseseller",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 12734,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 18 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fits 32 inch TVs except some Samsung 32 inch TVs, for example, Samsung 32in H4003 series and UN32J5205AF",
            "High grade steel material offers loading capacity to 44lbs",
            "Post-installation level adjustment allows the TV to perfectly level; Removable TV plate designed for single-person installation",
            "Adjustable 5 degrees forward or 5 degrees backward tilt, 180 degrees swivel, 360 degrees rotate; Retracts to 2.4\"save space, extends up to 15\" from the wall",
            "Compatible with VESA (mounting hole pattern) 75 x75(3\"x3\") or 100x100(4\"x4\"). Common hardware pack included in the package"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Television & Video",
                "link": "https://www.amazon.com/Televisions-Video/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1266092011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/TV-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3230976011"
            },
            {
                "name": "TV Mounts, Stands & Turntables",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=21217994011"
            },
            {
                "name": "TV Wall & Ceiling Mounts",
                "link": "https://www.amazon.com/TV-Mounts-Accessories-Supplies/b/ref=dp_bc_aui_C_5?ie=UTF8&node=760796"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎VideoSecu"
            },
            {
                "name": "Item Weight",
                "value": "‎2.59 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎9.7 x 6.4 x 2.1 inches"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎FBA_ML12B"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Color Name",
                "value": "‎BLACK"
            },
            {
                "name": "ASIN",
                "value": "B003O1UYHG"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 12,734 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,058 in Electronics (See Top 100 in Electronics) #338 in TV Wall & Ceiling Mounts"
            },
            {
                "name": "Date First Available",
                "value": "May 26, 2010"
            },
            {
                "name": "Mounting Type",
                "value": "Wall Mount"
            },
            {
                "name": "Movement Type",
                "value": "Articulating"
            },
            {
                "name": "Brand",
                "value": "VideoSecu"
            },
            {
                "name": "Material",
                "value": "Alloy Steel"
            },
            {
                "name": "TV Size",
                "value": "40 Inches"
            },
            {
                "name": "Color",
                "value": "BLACK"
            },
            {
                "name": "Minimum Compatible Size",
                "value": "19 Inches"
            },
            {
                "name": "Compatible Devices",
                "value": "Television"
            },
            {
                "name": "Maximum Tilt Angle",
                "value": "5 Degrees"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "With our articulating wall mount, you can extend your TV up to 15\" outwards or lay it flat against the wall for a more low-profile look. Our mount can also swivel left and right and tilt up and down to reduce glare and provide multiple angles of viewing for your TV.",
                "media_link": []
            },
            {
                "media_text": "The tilt, swivel, and extend functions provide smooth adjustment in all directions. Extends up to 15\" Retracts up to 2.4\" Swivel allows for easy adjustment of TV",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/ebf9f577-a292-4ab3-894a-a1e1bc8e65b9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/1f891e81-864c-40eb-a6ff-29fbdccd7c04.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/0e8a89ff-8e90-45bd-9532-ab409440930f.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/ebf9f577-a292-4ab3-894a-a1e1bc8e65b9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/1f891e81-864c-40eb-a6ff-29fbdccd7c04.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/0e8a89ff-8e90-45bd-9532-ab409440930f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/59049ead-053f-454e-b965-84bbfbd84063.__CR0,0,1040,643_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/2803a0e2-dd5f-4c0b-8aa1-2cdfa27e7e6f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "John Gray",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZ67ODNQ43GANZSEKUKOS7CAX7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WI40IL5UG99N?ASIN=B003O1UYHG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2014",
                "reviewTitle": "5.0 out of 5 stars Great Wall Mount!",
                "reviewText": "After making a trip to Best Buy to buy a new 28\" Vizio Smart TV, I was absolutely appalled at the price of the their wall mounts. The cheapest one to mount a 28\" was about 30$! I couldn't believe that, so I instantly hopped onto Amazon, looked for a decent looking one, and bought.First of all, make sure your TV will fit! This only has two sizes it can handle, holes that are in a 3\" square on the back of the TV, and holes in a 4\" square. As long as your TV has these two sizes, it should work perfect. I was confused at first because it didn't say 28\" in the title, but trust me, it works great! I'm sure I read something about an adapter to hold bigger TVs too, but with the extra cost, you might as well buy one made for your TVs size.The box comes with the actually mount (fully assembled, mount ready!), and a little kit with different sized screws, washers, anchors, and all you need to adjust the mount and hang it up.A few things that I didn't expect...- You might **NEED SEPARATE WASHERS**, because the screws that come with might be too long for the back of your TV, in which case you must put some washers between screw head and the mount. Which shouldn't be too big of a problem, I just found some random washers in the garage, popped them on there, and screwed the TV onto the mount.-You really cant fit the included wrench in the adjustable slot for adjusting the tilt and spin of the TV to tighten it down. So if you like a position of the TVs tilt and all, you can't lock it in really, it'll always be kind of adjustable. If you bump it, it will lose your perfect placement.-It **DOES NOT** come with an option to mount it in a hollow portion of drywall. The only included mount kits is anchors for a concrete wall, and screws for a wall stud. So be sure the place you want to mount this TV is either on a stud, or on concrete, or you might have to go out and buy special anchors to put it in hollow drywall.-You'll need a power drill to make pilot holes.-You'll definitely need a better ratchet with a 1/2 inch socket. It would be absolutely impossible to hand screw the included screws in the wall with the included wrench.Other than those unexpected things, I absolutely love this wall mount. It's cheap (Around 1/3 of the cost of a non-pivoting mount at Best Buy), yet still built very durably. It's very flexible in where it can be adjusted. It wont fall out of the wall, I promise. If you mount this bad boy right, there's no chance of it falling out and losing your precious TV. What more can be asked of from a mount? Be sure it fits, be sure you have the tools to mount it and level it, and you will be absolutely happy. 5 Stars!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jake",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3TSXINLJLCITFOBEP6W2INQZPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RP74BU38ROJJV?ASIN=B003O1UYHG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2013",
                "reviewTitle": "5.0 out of 5 stars Easy to install, solid mount, lots of articulation, outstanding value. I not only would buy again, I will be buying again.",
                "reviewText": "Works great, I mounted a 19\" LCD TV that I use with an HD box and as a computer monitor. It does give a great deal of flexibility in positioning your screen. The installation was a breeze, it took me longer to get prepared than it did to install it. Two lag bolts secure it to a stud in the wall (if you are unfamiliar with locating studs this can be a bit scary, but is easy enough to figure out, in a pinch you can use a piece of a wire clothes hanger to push into the wall to find the stud, misses can be covered easily with spackle). Mark where the lag bolts will go, drill pilot holes and then start the top lag bolt and turn it until it is almost tight, leaving just enough play to line up and level the mount, then turn in the bottom lag bolt. I had an issue with the bottom lag bolt, I started it out with a slight upward tilt, and the ratchet I was using was too thick to pass by the bottom bolt on the first joint, no problem, use a 13MM open end wrench I very light weight wrench is included with mount). Then put the panel (that should already have the plate mounted to it) onto the mount, secure it with the two provided screws and you are done.I would like to mention that the mount includes the three sets of the most common sizes of screws to mount the plate to the TV/Monitor.I would think that up to a 27\" panel would be a single person job, and this mount isn't designed for much larger than that. I would normally give this mount a four star review, because while it is sturdy and useful, it certainly is a little industrial looking, and the instructions while very clear and easy to follow are in mild Engrish, but given the price, this product absolutely deserves five stars. I will be buying a couple more of these for mounting some other monitors and TV's in the house.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael A. Grumbein",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENGVGMQVE6AR26NSKQXL4R3L7BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33CHTS0LGPRKQ?ASIN=B003O1UYHG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 27, 2013",
                "reviewTitle": "5.0 out of 5 stars Very Sturdy and Stable",
                "reviewText": "I bought this LCD monitor mount and use it with a 24\" monitor, and it works very well for that. It swivels sideways at two different locations, so the monitor can face any direction in a 180 degree field, and can be moved more than a foot to the left or right. Please note that these hinges are not designed to lock in place, but they are stiff enough so the monitor will stay where you put it.This mount is also designed to swivel up and down 5 degrees, and rotate 360 degrees (so you could set your monitor as a tall-screen instead of a wide-screen if you wanted), and for this there is a nut that must be loosened. The advantage here is that you can lock this section in place once you have adjusted it to your liking.Installation is a breeze! This mount comes with hefty screws for direct use in wooden walls, and anchors for use with screws in concrete walls. Holes need to be drilled before installation, but instructions are provided to facilitate that. The plate that connects to the monitor itself is a separate piece that hooks onto the mounting arm and is then fastened with screws, so you don't even need a partner to help you install it. It's still safer to have a spotter in the room during this process, however.Once in place, the monitor mount is very stable and does not move unless it is voluntarily moved. Of course, an earthquake might make a difference, but I have not been so privileged as to see how it holds up under such conditions. Since the arm does not have locks to hold it in place and only relies on stiffness to remain stationary, I cannot guarantee that it will be as stable after a decade of adjustments. It is very solid and stable now, however, and unless you are always moving your monitor around, the mount will probably last past the lifespans of your next several monitors.If you want to mount your monitor to the wall and this kind of articulation suits your needs, this mount is a good choice considering durability and stability. Mine didn't even cost much, but I won't say what I paid for it because prices naturally change over time.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Betty Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPD73FDHK7LNVKHHSUXGVWI6UDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KE2J0SRE6526?ASIN=B003O1UYHG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Sturdy and easy to install for our 32\" TV",
                "reviewText": "We use for our bedroom TV. We thought it was supposed to tilt 15 degrees but it doesn't. Otherwise it works great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 18, 2022",
                "reviewTitle": "exactement ce que je cherchais",
                "reviewText": "Bon produit bien fait",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 1, 2018",
                "reviewTitle": "Three Stars",
                "reviewText": "Thought there was more of a tilt",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 13, 2018",
                "reviewTitle": "It’s ok",
                "reviewText": "Just ok",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}