{
    "remaining_requests": 25594,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Portable-Washing-Machine-Lightweight-Collapsible/dp/B08XDJQ3XC",
    "body": {
        "name": "Pyle Portable Mini Washing Machine Lightweight Collapsible Bucket - Perfect for Camping, Travelling, Apartment, Dorm USA Brand - Pure Clean PUCWM33",
        "price": "$68.18",
        "originalPrice": "$89.99",
        "rawPrice": 68.18,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Portable-Washing-Machine-Lightweight-Collapsible/dp/B08XDJQ3XC",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Di5y9MClL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ZMsHY3XoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51--stMQfvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FYhsLVkhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DtDur FTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519So8OnrPL.jpg",
            "https://m.media-amazon.com/images/I/41KVHAPeJfL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/34ecaeaf-18ac-4222-a513-072ff219b40d/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91nyzzXbBJL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91nyzzXbBJL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Pyle Store",
            "link": "https://www.amazon.com/stores/PyleUSA/page/D79E9149-99F8-49A4-8E8C-D24560694FC2?ref_=ast_bln"
        },
        "brand": "PyleUSA",
        "merchantInfo": "Sold by Value Stock and Fulfilled by Amazon.",
        "customerReview": "3.5 out of 5 stars",
        "customerReviewCount": 366,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 6 hrs 59 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 6 hrs 59 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "4.4 LB LOAD CAPACITY: This folding washing machine features 2 kg or 4.41 lbs. wash capacity. Perfect for washing light clothes that require separate cleanings like baby clothes, underwear, towels, socks, T-shirts, tank tops, toys, or other small items",
            "ENERGY-SAVING: The collapsible washing machine mini foldable washer uses high-frequency vibration to effectively remove dirt without residue and irritants. Energy-saving and environmental protection, saving water and electricity",
            "FOLDABLE DESIGN: Pure Clean foldable laundry tub washing machine features a foldable and portable bucket type design for easy storage When not in use. Can easily fit under the stool or under the bed and will not take up much space in your house",
            "PORTABLE & LIGHTWEIGHT: The bucket washing machine folds in a compact size of 11.64\" x 11.64\" x 6.4\" so you can easily carry it out and conveniently wash clothes outdoors. Perfect for camping, vacation, business trip, apartments, dorms",
            "EASY TO OPERATE: This pop up washing machine features a semi-automatic cleaning function and is equipped with a 15-minute timer knob that automatically resets after completion"
        ],
        "description": "Foldable Washing Machine Introducing our innovative Foldable Washing MachineUpgrade your laundry experience with our Foldable Washing Machine, designed to revolutionize your laundry routine with its advanced features and portability. This compact washing machine offers a range of benefits, making it the perfect choice for camping, apartments, dorms, and business trips. Key Features:Semi-Automatic Cleaning Function: Enjoy the convenience of semi-automatic cleaning, allowing you to focus on other tasks while the washing machine handles the cleaning process efficiently.High-Frequency Vibration: The washing machine utilizes high-frequency vibration to ensure thorough and effective cleaning of your garments, delivering exceptional results every time.Energy-Saving and Environmental Protection: With its energy-saving design, this washing machine helps you reduce your carbon footprint while still achieving optimal cleaning performance. It's an environmentally conscious choice.Foldable and Portable Bucket Type: The foldable design allows for easy storage and transportation. Simply fold it up when not in use or when you need to take it on your travels. Its bucket-style construction ensures durability and stability during operation.Convenient to Use and Store: This washing machine offers a hassle-free laundry experience. Its user-friendly interface makes it easy to operate, while its compact size allows for convenient storage even in limited spaces.Water and Electricity Saving: By utilizing efficient water and energy consumption, this washing machine helps you save resources without compromising on cleanliness. It's an economical choice for eco-conscious individuals. What's in the Box:Foldable Washing Machine: Experience the convenience of this portable and efficient washing machine. Technical Specifications:Construction Material: Engineered ABS, TPE & TPR: Enjoy a durable and long-lasting washing machine constructed from high-quality materials.Wash Capacity: 4.41 lbs. (2 Kg): Accommodate a decent load of laundry with this compact washing machine.Rated Wash Power: 180W: Benefit from efficient washing performance without excessive power consumption.Frequency Response: 60Hz: Experience optimal vibration frequency for effective cleaning.Voltage: 110V: Compatible with standard voltage requirements for easy usage.Waterproof: IPX4: Enjoy a waterproof design that ensures safe and reliable operation.S/N Ratio: 60dB: Experience a quiet and peaceful laundry experience.Timer: 0~15 mins: Set the desired wash time to suit your laundry needs.Motor: Aluminum Motor: Benefit from a robust and reliable motor for consistent performance.Motor Speed: 1320 Revolutions/Min: Achieve efficient cleaning results with a powerful motor.Unfolded Dimension: 11.64'' x 11.64'' x 12.46'' -inches: Experience a compact yet spacious washing machine that can accommodate your laundry requirements.Folded Dimension: 11.64'' x 11 Construction Material: Engineered ABS, TPE & TPRWash Capacity: 4.41 lbs. (2 Kg)Rated Wash Power: 180WFrequency Response: 60HzVoltage: 110VWaterproof: IPX4S/N Ratio: 60dBTimer: 0~15 minsMotor: Aluminum MotorMotor Speed: 1320 Revolutions/MinUnfolded Dimension: 11.64'' x 11.64'' x 12.46'' -inchesFolded Dimension: 11.64'' x 11'' Experience a compact yet spacious washing machine that delivers efficient and reliable performance. Q&A:Q: What is the wash capacity of this Portable Washing Machine?A: The Portable Washing Machine has a wash capacity of 4.41 lbs. (2 Kg), making it perfect for small loads of laundry. It offers convenience and efficiency in a compact size.Q: Does this washing machine have a semi-automatic cleaning function?A: Yes, this Portable Washing Machine features a semi-automatic cleaning function, allowing you to save time and effort while achieving clean and fresh laundry results.Q: How does the high-frequency vibration feature benefit the cleaning process?A: The Portable Washing Machine utilizes high-frequency vibration to ensure thorough and effective cleaning of your garments. This advanced feature helps remove dirt and stains, providing excellent cleaning performance.Q: Is this washing machine energy-saving and environmentally friendly?A: Absolutely! This Portable Washing Machine is designed with energy-saving features, helping you reduce energy consumption and contribute to environmental sustainability. It is an eco-conscious choice for your laundry needs.Q: Can this washing machine be easily folded and transported?A: Yes, this Portable Washing Machine features a foldable and portable design, allowing you to easily store and transport it. It is perfect for camping trips, small apartments, dorms, and other spaces with limited laundry facilities.Q: How convenient is this washing machine to use and store?A: This Portable Washing Machine offers convenience in both usage and storage. Its user-friendly interface ensures easy operation, while its compact size allows for hassle-free storage, even in tight spaces.Q: Does this washing machine save water and electricity?A: Yes, this Portable Washing Machine is designed to save water and electricity without compromising cleaning performance. It efficiently utilizes resources, making it an economical and eco-friendly choice for your laundry needs.",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2619525011"
            },
            {
                "name": "Laundry Appliances",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18116194011"
            },
            {
                "name": "Washers & Dryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2383576011"
            },
            {
                "name": "Portable Washers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=9709422011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎Pyle"
            },
            {
                "name": "Model Info",
                "value": "‎PUCWM33"
            },
            {
                "name": "Item Weight",
                "value": "2 Kilograms"
            },
            {
                "name": "Product Dimensions",
                "value": "11.64\"D x 11.64\"W x 6.4\"H"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎PUCWM33"
            },
            {
                "name": "Efficiency",
                "value": "‎Energy Efficiency"
            },
            {
                "name": "Capacity",
                "value": "2 Kilograms"
            },
            {
                "name": "Annual Energy Consumption",
                "value": "‎180 Watts"
            },
            {
                "name": "Max Spin Speed",
                "value": "‎1320 rev/month"
            },
            {
                "name": "Noise",
                "value": "‎1 dB"
            },
            {
                "name": "Part Number",
                "value": "‎PUCWM33"
            },
            {
                "name": "Special Features",
                "value": "‎Manual"
            },
            {
                "name": "Control Console",
                "value": "‎Knob"
            },
            {
                "name": "Standard Cycles",
                "value": "‎1"
            },
            {
                "name": "Access Location",
                "value": "Top Load"
            },
            {
                "name": "Voltage",
                "value": "‎110"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B08XDJQ3XC"
            },
            {
                "name": "Customer Reviews",
                "value": "3.5 3.5 out of 5 stars 366 ratings 3.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#926 in Appliances (See Top 100 in Appliances) #124 in Portable Clothes Washing Machines"
            },
            {
                "name": "Date First Available",
                "value": "February 24, 2021"
            },
            {
                "name": "Brand",
                "value": "Pyle"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Cycle Options",
                "value": "Baby Wear"
            },
            {
                "name": "Controls Type",
                "value": "Knob"
            },
            {
                "name": "Operation Mode",
                "value": "Semi Automatic"
            },
            {
                "name": "Model Name",
                "value": "Portable Mini Washing Machine Lightweight Collapsible Bucket - Perfect for Camping, Travelling, Apartment, Dorm USA Brand - Pure Clean PUCWM33 See more"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Cleaning and Maintenance After Washing When the washing process is completed, please drain the sewage in the washing machine to avoid changing the water quality for a long time. When you need to bring it out Please wipe the whole machine clean, and fold the washing machine according to the method of folding the washing machine, and put the cover on the top. WASHING MACHINE OPERATION Put the clothes to be washed into the washing bucket, and then put in an appropriate amount of detergent . Pour in an appropriate amount of water (water should completely cover the clothes, and the level of the water is better to higher than clothes for about 3~5cm). Put the cover plate on the tub, turn on the washer timer, switch it to \"15min\" position, then the machine begins to work automatically . After the program is over, the timer resets automatically and the machine stops working. Take out the laundry clothes. Disconnect the adapter from the washing machine and socket. . Choose an appropriate drainage method to drain the water out of the washing machine. Wipe the Machine",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7860db51-15d1-4def-89d0-d6a82626b3aa.__CR12,0,975,1300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/921f76c1-fdd1-4c1f-9482-9b8c05035f07.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "WASHING CLOTHES Weightless than 1.8KG, such as underwear, socks, etc... Since the washing machine is a single washing machine after the washing process is completed. Take out the clothes manually to wring them out or put them in the dehydration machine for dehydration DRAINAGE 1. Lower drainage: Pull out the plug of the outlet on the pedestal, the machine begins to drain water naturally, and then insert the plug into the outlet after the water drains. 2. Upper drainage: In order to drain the water fast, you can choose manual upper drainage. Shut o the electricity rst and disconnect the product and the power. Grab the handle and the hole of the pedestal, lean the upper outlet downward, and then drain o the water CLOTHING PRE-TREATMENT In order to avoid clogging the drain n pipe and a ecting the performance of the washing machine. Please remove obvious sod, bars, etc. inside and outside of the clothes in advance, and then put the clothes into the washing machine CLOTHING PLACEMENT In order to ensure better washing e ect, please open the clothes, int the washing bucket, so as not to cause the washing e ect to be unsatisfactory due to the knots of the clothes",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b319bd4-8020-44b8-a81f-e638c93842cc.__CR0,0,3500,3500_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3dd08bc8-64ab-4451-953e-7d8f386260e6.__CR0,0,3500,3500_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4868a86a-00c5-4aa0-bd76-113a0ae4b941.__CR0,0,3500,3500_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "PORTABLE & LIGHTWEIGHT The bucket washing machine folds in a compact size of 11.64\" x 11.64\" x 6.4\" so you can easily carry it out and conveniently wash clothes outdoors. Perfect for camping, vacation, business trip, apartments, dorms FOLDABLE DESIGN Pure Clean foldable laundry tub washing machine features a foldable and portable bucket type design for easy storage When not in use. Can easily fit under the stool or under the bed and will not take up much space in your house EASY TO OPERATE This pop up washing machine features a semi-automatic cleaning function and is equipped with a 15-minute timer knob that automatically resets after completion ENERGY-SAVING The collapsible washing machine mini foldable washer uses high-frequency vibration to effectively remove dirt without residue and irritants. Energy-saving, saving water and electricity",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/727ce1c2-0cd3-4288-97ae-b5a9c305d141.__CR0,0,3500,3500_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/71a834e0-5146-4a94-970a-4069b594872f.__CR0,0,3500,3500_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8518a38a-11d0-4502-987b-db5f061dd4e6.__CR0,0,3500,3500_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6fb2929-d3c5-43a1-b3b2-73f32dfd8be5.__CR0,0,3500,3500_PT0_SX220_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6958afa0-c697-45c4-9a24-50b53b8c9924.__CR0,0,1970,1219_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7860db51-15d1-4def-89d0-d6a82626b3aa.__CR12,0,975,1300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/921f76c1-fdd1-4c1f-9482-9b8c05035f07.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b319bd4-8020-44b8-a81f-e638c93842cc.__CR0,0,3500,3500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3dd08bc8-64ab-4451-953e-7d8f386260e6.__CR0,0,3500,3500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4868a86a-00c5-4aa0-bd76-113a0ae4b941.__CR0,0,3500,3500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90c03260-5d88-4f43-9023-4a1bb7fe7e29.__CR0,0,1970,1219_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/727ce1c2-0cd3-4288-97ae-b5a9c305d141.__CR0,0,3500,3500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/71a834e0-5146-4a94-970a-4069b594872f.__CR0,0,3500,3500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8518a38a-11d0-4502-987b-db5f061dd4e6.__CR0,0,3500,3500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6fb2929-d3c5-43a1-b3b2-73f32dfd8be5.__CR0,0,3500,3500_PT0_SX220_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Pikayla",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGG753QU7HPI37S5MIHMDXJIVB2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21SEI2B4R4TLW?ASIN=B08XDJQ3XC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 20, 2022",
                "reviewTitle": "5.0 out of 5 stars I'm obsessed! Great little machine for lighter items.",
                "reviewText": "The media could not be loaded. A great purchase! We live with a well in an area that loses power a couple times a year and have been without power for as long as a week. No power, no well. As such I am always looking for ways to function when that happens. This is a great little machine for lighter items which honestly is what you need. I can wear jeans several times, undies not so much! I did two loads of washing and rinsing. I found it takes about 2 gallons of water per wash and 2 gallons per rinse. That said you can use the rinse water from one load for your next wash so two loads = six gallons. My first load had 5 light large women's camisoles (jockey elance supersoft; ladies, if you don't own some you should!) and 5 large women's hipster underwear. My second load was 5 extra large sports bras and 3 large hipster underwear. None were extra dirty just regular wear and they came out clean (actually squeaky clean). If I had heavily soiled items I would pre-treat, soak and scrub as necessary. I used about one tablespoon of Tide HE per wash load and about two teaspoons of Downey liquid fabric softener in the rinse to mitigate any suds that may have remained. This unit will not spin your clothes dry and the way it agitates I would not recommend trying. Just wring your clothes out and hang them. I have a drying rack and a clothes line which I use regularly.When starting it up pay attention to the spin. It should be free flowing. I found with the load of sports bras I originally started with six but took one out to improve the agitation. See the posted video for what I think is good agitation. Also make sure you add enough water. I saw a review where someone noted a motor burning smell. I suspect that would happen if there is not enough water to allow the clothes to float freely thus requiring the motor to do extra work. After two loads the motor was warm but I didn't feel it was over hot. With that I would do two loads and let it rest. Not a deal breaker you just can't run it all day without letting it cool down. The machine is very quiet.This unit will run on our battery pack or with our inverter so it's great for power outages. Laundry may be a luxury during those times but it's nice to have the option to make life seem more normal.I love that I can reuse the gray water. With no electricity, flushing the toilet is a manual process; a perfect use for the water. Also, I could use it to wash the floor. I used the drain hose but you have to attach it after pulling the plug so be quick! Basically you pull the plug and the water comes out there is no way that I can see to attach the hose before pulling the plug. That said it can be done if you are quick just be prepared to position the unit properly over your sink or a large bucket if reusing the water. The hose is very easy to attach.I found it a bit hard to \"pop up\" when I first received it because they instruct you not to press in the middle. I'm a senior citizen so my strength isn't what it used to be but I got it eventually so if this is an issue for you, be prepared to store it expanded just in case. If you are going to collapse it, make sure it is fully dry to avoid mold issues.I purchased a returned unit. I had to give it a light cleaning and there is some sticky residue where it was taped but otherwise fine and worth the savings. Just remember, this is not a regular washer so set your expectations accordingly. With that it can be useful for power outages, camping, washing delicate items, or just saving trips to the laundromat. I highly recommend this product.",
                "reviewVotes": "108 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a4be8dd2-9a8c-40e7-9b55-261fcd55622a/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Cautious Shopper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFI4UUWAN7X2P6CX2MDDNCLX2AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GHWQENSUPZI0?ASIN=B08XDJQ3XC",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 7, 2023",
                "reviewTitle": "1.0 out of 5 stars Danger- electric hazard!",
                "reviewText": "I ordered a refurbished one, so I am fine with it being used, but I am not fine with getting a dangerous appliance that could cause a fire. As soon as I opened it, I tested it with water only. Worked great for 5 minutes- nice strong motor- but then the turning action got progressively sluggish and weak. Next thing I know, it tripped the GFCI switch on the outlet. I used it on a non-GFCI outlet, thinking maybe the GFCI was being overly sensitive, and it damaged the outlet. Unless you want a fire risk, stay far away from this brand and product. The Moyu brand is much better- I have their mini washer (for socks) and I love it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kimmy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLGLZNGEBJY7QC34CLIBAI2FKHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNZR57IA89KNW?ASIN=B08XDJQ3XC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 25, 2022",
                "reviewTitle": "4.0 out of 5 stars Machine overheats",
                "reviewText": "I unboxed the machine and found scuff marks at the base of the item. The user manual says the machine is tested before it is shipped so maybe they need to be more careful during the testing phase because I first thought that they sent me a used product. Anyway, I unfolded the bucket and set it on the kitchen counter. I read through the user manual and then proceeded with washing operation. The machine did a good job washing my clothes. The unit did shake a bit but that was due to the powerful agitation in the water. No signs of leaking and the drainage did not take long. I drained directly into sink. The hose provided is useless. One caveat; the washing machine overheats after two washing cycles. I felt the base of the unit and it was hot. I had done 1 wash and 1 rinse cycle for a total of 30 minutes of use. I was afraid to continue with another wash/rinse cycle. Also, the machine has a strong \"new appliance smell\" that I hope will dissipate after it airs out some. Will update this review, if any issues crop up, after I have used the machine a few more times.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kraken",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGO6PCDKW7QIU3FFCHVXQX5MHIBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MZWHXGPP7N8U?ASIN=B08XDJQ3XC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Surprisingly usable",
                "reviewText": "It won't replace a proper washing machine, but it's pretty usable when it comes to washing T-Shirts, underwear, and socks.I don't have a washer in my studio and the nearest laundromat is too far to walk (pretty expensive as well).I bought this machine used (for about $40) as an experiment and so far I'm pretty happy.It is very limited in its volume, but it can handle my daily set of clothing (T-Shirt, socks, underwear) or can be used to \"freshen up\" a kitchen towel in a pinch.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zulema cruz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERZC5FQN756UKJN36KO5OHDC6QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R229B9W1S05QTO?ASIN=B08XDJQ3XC",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 10, 2023",
                "reviewTitle": "3.0 out of 5 stars Se calienta el motor",
                "reviewText": "La maquina cumple la función de lavar bien la ropas que sean ligeras pero se calienta mucho el motor hasta sentí olor a quemado la apague y no ka voy a usar ahora si vuelve hacerlo en la próxima vez ka devolveré",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUDIUMPGICJKGQHRSP3B5HZHSZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21I0G3OD6B0E3?ASIN=B08XDJQ3XC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 28, 2023",
                "reviewTitle": "5.0 out of 5 stars So far, so good",
                "reviewText": "Just started using it today and already my life feels easier (no facilities in my building.) It is efficient, quiet, and quick. Easily ran it in my tub.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Niki Rich",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRSBQJGA64NP2G7JQ6L24K3NOWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Y3BSEFUT3M3Z?ASIN=B08XDJQ3XC",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "1.0 out of 5 stars Leaking Water",
                "reviewText": "this seems like an amazing idea. And we really need one of these… So I was super bummed when it started to leak. I just received this item today and read all the instructions before plugging it in and adding 2 wash clothes and 2 hand towels, and water. The towels are very thin, as they were pretty cheap. Before I was even able to turn on the washing machine, water started leaking out from the bottom. Not from the empty spout on the side, from the bottom, where there is like a metal plate. It was just leaking randomly from that area. I’m not sure exactly where the water was coming from, but eventually all the water I poured in just leaked right out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rashmi Prava Patro",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHD6AGTGHUBUWQXQ62E7MTO63IXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HW7GR36HFZQ4?ASIN=B08XDJQ3XC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2022",
                "reviewTitle": "5.0 out of 5 stars Worth every penny",
                "reviewText": "Portable Mini Washing Machine is a great purchase to wash the clothes of my new born. Its a great alternative instead of hand washing. It works extremely well and I love this product.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Giz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 18, 2023",
                "reviewTitle": "It super easy to store and super cleaner machine",
                "reviewText": "I like this to wash my clothes and my families too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vania Cardenas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 11, 2022",
                "reviewTitle": "Funciona perfecto",
                "reviewText": "Funciona como se espera. No tiene gran capacidad, pero la descripción es muy clara: la capacidad es para 2 kg",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HubyK",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 22, 2023",
                "reviewTitle": "Very weak",
                "reviewText": "After reading the reviews and seeing the videos I actually believed this could be a decent product to have for small clothing items.It couldn't be further from the truth. The machine struggled to spin a single shirt, even with just water inside the motor doesn't seem to have enough power.Tried running it for about 10 minutes until it started getting really warm before I gave up.It also leaks from underneath.Poor design, poor quality, it's a kids toy at best.Don't waste your time or money on this.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rocio Presbitero Dorantes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 9, 2021",
                "reviewTitle": "Mini Lavadora",
                "reviewText": "Solo le falta la centrifuga",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 18, 2023",
                "reviewTitle": "Geeat product",
                "reviewText": "Great product, good for camping, nice machine",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}