{
    "remaining_requests": 25765,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/O3-Pure-Professional-Laundry-Washer/dp/B00AUWTYN2",
    "body": {
        "name": "O3 Pure Professional Eco Laundry Washer System - Newest Generation",
        "price": "$297.00",
        "originalPrice": "",
        "rawPrice": 297.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/O3-Pure-Professional-Laundry-Washer/dp/B00AUWTYN2",
        "soldBy": {
            "sellerID": "A3SI6K0ESD8QD5",
            "name": "Pure Energy",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3SI6K0ESD8QD5&asin=B00AUWTYN2&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41opKoOI10L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41l6xWv ZWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31y0e1UJGjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417ZLmQD2zL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wr0i75gcL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the O3 Pure Store",
            "link": "https://www.amazon.com/stores/O3PURE/page/8891B230-2845-4A7E-9FD6-0982D6BA8344?ref_=ast_bln"
        },
        "brand": "O3PURE",
        "merchantInfo": "Pure Energy",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 631,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 9 hrs 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Don't settle for older technology. The O3 Pure Eco Laundry System is the newest generation Ozone Washing Unit and one of the Most Powerful Residential Ozone Washing Generator Available.",
            "Detergent, Chemical and Odor free for those with sensitive skin. Enables you to thoroughly wash and clean your clothes without soap and cold water only. Removes odors from mold and mildew.",
            "The O3 Pure Eco Laundry System offers a True 3 Year Manufacturer Parts and Labor Warranty.",
            "It's more effective than older ionic technology and works. The O3 Pure Eco units are both CE and RoHS Certified.",
            "10 minute installation by homeowner without any special tools. Requires no maintenance or additives. Only activates when the washer is in use, plugs into a standard outlet and uses less than 45 watts of electricity. The unit also only runs when the washer is filling or rinsing. The customer is supplied with a template, mounting hardware, phillips screwdriver, and an additional hose connector."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2619525011"
            },
            {
                "name": "Laundry Appliances",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18116194011"
            },
            {
                "name": "Washers & Dryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2383576011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3 x 16.5 x 8 inches; 7.7 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ PE1000"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ December 30, 2012"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Pure Energy LLC"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00AUWTYN2"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#472 in Appliances (See Top 100 in Appliances) #90 in Washers & Dryers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 631 ratings"
            },
            {
                "name": "Brand",
                "value": "O3 Pure"
            },
            {
                "name": "Special Feature",
                "value": "High Efficiency"
            },
            {
                "name": "Access Location",
                "value": "Top Load"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Included Components",
                "value": "Power Adapter, Extra Hose, Phillips Screwdriver, Quick Mount Template"
            },
            {
                "name": "Efficiency",
                "value": "High Efficiency, Standard Efficiency"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "THE O3 PURE ECO LAUNDRY SYSTEM The latest generation in Ozone Washing The O3 Pure uses the natural cleaning powers of O3 or Ozone to clean your laundry more effectively and safely than soap, detergent or older ionic wash units. This technology has been used for years in commercial applications across the U.S. Our O3 Pure Eco units are both CE and RoHS compliant. Ozone laundry units have been around for decades, but were too large, expensive or unreliable for household use. Our current model widely used within the European Union, is now designed to work within any American household, with washers of any make and model. Cold water is directed through the O3 Pure System. An ozone generator converts O2 (regular oxygen) into O3 (ozone) which is mixed and diffused into the water for your washer. The colder the water, the more effective it cleans. The ozone works by breaking the molecular bonds that hold dirt and grime to your clothes while oxidizing most of this material into carbon dioxide and water. Afterward any remaining ozone converts back into regular oxygen. What you are left with are clean clothes and linens free of any smells, dirt and grime or chemicals. Simple to use and extremely effective. The O3 Pure Eco Wash doesn't require any maintenance, cleaning or additives. These next generation O3 Pure Wash Eco Laundry Systems will work with all washers including High Efficiency Front and Top Loaders and all Standard washers. Units work with both hard and soft water.",
                "media_link": []
            },
            {
                "media_text": "How It Works The O3 Pure can be installed in about 10 minutes by the homeowner. No specials tool are required. A quick mounting template, handy screwdriver and an extra laundry hose are included. The cold water hose is attached to the unit and the included extra hose is attached to the washer. Our O3 Pure Laundry System automatically senses when your washer calls for water and the unit is only on when water is being ran thru the system. Our units are equipped with a German Engineered Oxidizing Unit to create ozone as well as a UV Photo Catalytic Oxidizer. As water is passed thru the venturi injector, it draws that ozone into the water. Our newest units also come with a quad check valve system to prevent leaking. The ozonated water then flows thru a diffusion mixer and highly ozonated water is delivered to your washer. No maintenance, cleaning, cartridges or additives are required.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A3SI6K0ESD8QD5/f5acdea7-cb35-4b4b-885e-82c2535b79d5._CR0,0,500,500_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "The O3 Pure System is as simple and eloquent in function as it is in design. Once installed, the unit requires no further fuss. After each wash cycle, the ozone produced will naturally convert back into O2 or regular oxygen in a short amount of time. This leaves no odors or byproducts and requires no regular maintenance. If service is ever needed, all components are replaceable, are designed with plug in connections, stainless steel screws and nothing more than a screwdriver is required in replacing them. This provides you with a system that can be used for many years to come.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A3SI6K0ESD8QD5/bf575b88-4ae2-4437-b6de-7294654f95b8._CR125,0,750,750_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Better For The Environment Eliminates the need for detergentsSaves energy by only using cold waterNo harmful chemicals are producedSeptic friendly Leaves no residue or odor leaving your clothes scent and odor free Better For You Wash without separating colorsReduces or eliminates using bleachExtends fabric lifeReduces or eliminates your fabric softenersRids your washer and clothes of those musty smells Better for Your Family No chemical exposure to your family and petsSimple use lets anyone use the washerWorks great with sensitive skin allergiesRemoves residual chemical and cleaning agents in clothes",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A3SI6K0ESD8QD5/a8d3efcc-cbb0-4595-bf9a-fbfba6044b28._CR100,0,800,800_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A3SI6K0ESD8QD5/3fc0681f-e815-4945-b468-d1b01bdf88ac._CR83,0,334,334_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A3SI6K0ESD8QD5/f5dbee00-0146-4260-9556-dd17d83034a7._CR166,0,667,667_PT0_SX300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A3SI6K0ESD8QD5/b66a9f60-e110-4f20-bf4a-1596a25e47f2._CR0,0,600,180_PT0_SX600__.png",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A3SI6K0ESD8QD5/f5acdea7-cb35-4b4b-885e-82c2535b79d5._CR0,0,500,500_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A3SI6K0ESD8QD5/bf575b88-4ae2-4437-b6de-7294654f95b8._CR125,0,750,750_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A3SI6K0ESD8QD5/a8d3efcc-cbb0-4595-bf9a-fbfba6044b28._CR100,0,800,800_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A3SI6K0ESD8QD5/3fc0681f-e815-4945-b468-d1b01bdf88ac._CR83,0,334,334_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A3SI6K0ESD8QD5/f5dbee00-0146-4260-9556-dd17d83034a7._CR166,0,667,667_PT0_SX300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Journeyman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBYX7TJP2LUS5EWNRBUO2V6WEMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26FP5G20AETMN?ASIN=B00AUWTYN2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 6, 2017",
                "reviewTitle": "5.0 out of 5 stars This is the one you want",
                "reviewText": "I waited a long time to write this review because I wanted to know if this would work, and how well this would work in any condition. We installed this about six months ago and have put hundreds of loads through it since then. We have a front loading washing machine, and we use this with a custom built wash cycle that uses cold water only but is otherwise similar to the machine's \"normal\" cycle.1. Cleanliness of the clothesThey are as clean when washed using this product and no detergent as I have ever had with any combination of washer and detergent. Clothes come out clean and odor free. Some of the hype about these machines is that they push ozone into the fabric which leads to clothes that dry faster and are fluffier, this is not observably true for us. But they do come out clean and dry normally. So maybe this doesn't improve on the standard method, but it certainly doesn't detract.2. Really, no detergent?Yeah really, no detergent. You can of course use detergent if you want to/have heavily soiled clothes. No one is going to come to your house and stop you...I think. But we haven't used/bought detergent in 6 months and that's probably permanent for us. I did a cost analysis (because I'm a geek) and this device easily pays for itself in 2 years by saving you on detergent. Even if it goes belly up after that, I'd absolutely replace it because it does actually save the environment, and money, whichever of those is important to you.3. Saves the environment? Do tell..Well let's start with the bottles of detergent. I always recycled mine, you do as well, but you know what's better than recycling what you consume? Not consuming it in the first place. No chemicals or dyes or manufacturing waste to enter the waste stream, no oils or carbon footprints in the production of bottles or soaps, and no water footprint used in making liquid detergents. That's all eliminated using this. Bonus, if you are on a well/septic system like we are, this devices returns clean (ish) water back to that system. We vented ours to a new line which we ran to the leech fields. Since there is only organic run-off this is a perfectly acceptable solution. You could spend big on biodegradable soaps, or you could just eliminate them.4. Cold water only? How does that work in winter?Yes cold water only, and yes it works in winter, in northern NY where we spend a majority of winter below freezing, and several days in a row below zero. This system still works fine in these conditions even with painfully cold water running through the system. Although we do have a hot water line available to warm up the wash water should we find it needed, we haven't yet and, contrary to what they tell you on Game of Thrones, winter is almost over here.5. InstallationYeah I paid a guy $85.00 to do that for me. Seemed worth it to have someone else to blame in case water shot all over the place. I could have done it myself because it requires little more than connecting rubber hoses to nozzles. So you can save $85.00 and do it yourself no problem, but then you won't have anyone to blame if the laundry room looks like your kid's were reenacting the final scene in \"Carrie\" with water.6. MaintenanceAside from the regularly scheduled filter changes (see installation and maintenance guide) this thing just goes about it's business just as you would want it to.7. Rashes and irritationMy family has extremely sensitive skin. Every winter all four of us would break out in rashes from dry skin. Little red bumps, nasty stuff. We tried switching soaps, using lotions and oils, eliminating all perfume and fragrance, etc. We didn't buy this because of our sensitive skin, but I can report that all of the dry skin problems we used to experience in winter are gone and I suspect that not using detergents in our laundry has at least something to do with it. Though this may be confirmation bias, or a classic causation versus correlation issue. Who knows?8. Cool factorIt is a blast to watch people's mind slowly explode as you explain to them that you are washing your clothes with science instead of chemicals (which I know chemicals are science, John, I know that. Don't be that guy John, ok? ok? Just be cool) And as a bonus this unit has a blue light that comes on whenever the water flows through the chamber and it just looks like something the Jetson's would have had. I mean it scores huge on the cool factor.9. Take awayI read endless reviews and articles about this technology and the reality and feasibility of this technology before I bought this system. I'm a hard-core internet researcher when it comes to products and the like. If you are considering whether this is real or hype, or whether or not this is the right unit for you, here's what you have been looking for. This thing works exactly as they say it does. It saves you money and the environment, you get clean clothes, less skin irritation, seriously, just buy it. This is the model you want too. I looked at every available model through many sources and this one has the features and components you want. Go ahead and blame me if I'm wrong (I'm not though.)",
                "reviewVotes": "484 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JAG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUYC4554MOSQED5OZ24EM5YTLMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REQAZNZ3W5V2K?ASIN=B00AUWTYN2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 19, 2022",
                "reviewTitle": "5.0 out of 5 stars Pure when cold.",
                "reviewText": "Ok, I've had this for a few months... and I'll say I'm fairly happy with it. I gave it 5 stars because it does what it says, but I'm only \"fairly happy\" because of the way it works isn't conducive to where I live, and some bleaching.So, yes it bleaches items. That's what it is... more clearly it oxidizes things, and does what hydrogen peroxide would do, conventionally bleaching. What I did notice was that it tended to bleach items that had their colors not washed before, or not set fully. So here's my suggestion, wash new items in hot water first, then wash with the O3 water on cold.When it works, it actually leaves clothes smelling oddly fresh. Like there's no soap, there's no scents, only water; so how does my clothes actually smell good? Magic apparently. I can't explain it. It has a slight ozone smell, but after that fades, it smells like fresh linen...Now my biggest problem, and the main take away from owning one of these, you CANT use hot water, at all. You can't even use warm water at all. The oxygen is dissolved in the water, like carbonation is dissolved in your soda (seriously.) Warm water doesn't let gasses, like oxygen or carbon-dioxide, stay dissolved in it. So in order to have high concentration of oxygen to clean the clothes, it has to be cold... best if it's refrigerated, like a soda.(Yes, soda under pressure can be warm but once removed from the can the gasses will condense out of it as quickly as it can. Unless you've cooled it first.)During the winter, this system worked great for me. Water is cold from the tap, and oxygen is dissolved in the water well. But during the summer, in the Mojave desert, even the tap water gets warm... like \"I would enjoy a soak in this warm water\" warm. As the summer approached, my clothes and sheets didn't smell \"as good\"... uh oh... the water is too warm for this to work anymore.To solve this, I've kept using the cold water, but I've added a single thing of detergent. There's \"enough\" oxygen dissolved to do a good amount of disinfectant work, and the soap should cut through the rest. So, for me, it's not a magic bullet... however it did cut my detergent use down to only during the summer. Minor bleaching effect can be mitigated if you remember about it with new items.If you live in a cold climate, or have cold water all year round, you're in luck. You can literally stop buying detergent with this... which is good if you want to stop polluting the water table with soaps, want less chemicals on your skin, and want actually ^disinfected^ clothes.Soap doesn't disinfect or kill germs, it just helps remove them by making water able to release them. Ozone breaks down the cell walls of germs and bacteria, and destroys them, not just killing them... it's as good as bleach at disinfecting, but without (always) destroying colors.However, the upfront cost is the biggest bug for me. How many loads of laundry can you do, adding the cost of heating the water and the soap use, to match the upfront cost of the unit? Probably a few years worth. At about $0.25 a load for detergent, and lets say $0.25 for heating water also... that's about 600 loads, for me 4 loads a week, that's just under 3 years of laundry (probably a lot more depending on the water heating costs, or less depending on how much laundry you do, also depending on the price you get the system at.)",
                "reviewVotes": "137 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ChrisChris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEP6N4DR26MTBUSFGZDJAZTJBSXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PMQO1OVS7JGA?ASIN=B00AUWTYN2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Worth every penny",
                "reviewText": "I was skeptical before I bought it and I think it's hard to fathom the thought of no soap and cold water. You definitely should pre treat food and grease type stains as per usual but normal grime is no match. I hooked up a splitter and put a trigger style outdoor spray nozzle on mine and before I start a load I pressure wash the stain from inside the garment outwards and then spray a little stain fighter on the actual stain and that works very well. I also use the spray hose to fill up our carpet cleaner which has never cleaned the carpets so well before. I also fill up a spray bottle with the water and use it on the counters, tables, sometimes I just spray it on furniture and bean bags etc. I have reduced our household use of a lot of different chemicals and just use cold machine water. I poor it out if I don't use it up within 30 minutes due to ozone's short half life.We have 3 kids and a dog so we are doing a load almost daily and with sensitive skin issues for myself we were using extra rinse cycles. Now we just do normal wash cycle with cold water and the house smells like a fresh rain storm. The towels which I feel like always came out of the washer and to me smelled musty even with washing the drum regularly. Now they smell fresh and clean. Absolutely wish I knew about this thing sooner. This product is competitively priced and carry's an excellent warranty it's a no brainer. You will not be disappointed.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711ANYqH7PL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "PEPE RAMOS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 31, 2018",
                "reviewTitle": "Jose ramos",
                "reviewText": "El producto va genial, mi opinión es que deja la ropa muy suave. Además del ahorro de detergente está el ahorro eléctrico pues sólo funciona con agua fría. Agradecer la atención del vendedor, el trato un diez.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}