{
    "remaining_requests": 25751,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/LG-TurboWash-360-Degree-Technology-Intelligence/dp/B0B1LPV6Z5",
    "body": {
        "name": "LG 4.5 Cubic Feet Ultra Large Capacity Smart Wi-Fi Enabled Front Load Washer with TurboWash 360-Degree Technology and Built-In Intelligence (White)",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/LG-TurboWash-360-Degree-Technology-Intelligence/dp/B0B1LPV6Z5",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Zy8x5WoqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41  byWMyeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41yD5NjbAtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41C7h6WzUgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ybTKZjnCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41L7DzlcBBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FqX3jJhqL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the LG Store",
            "link": "https://www.amazon.com/stores/LGElectronics/page/E8585304-4D77-4965-9D22-B5F2CF409E38?ref_=ast_bln"
        },
        "brand": "LGElectronics",
        "merchantInfo": "",
        "customerReview": "5.0 out of 5 stars",
        "customerReviewCount": 1,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": true,
            "details": "ENERGY STAR Most Efficient recognizes the best of ENERGY STAR certified products with highest efficiency and maximum carbon reductions."
        },
        "features": [
            "Smart Front-Load Washer: The LG washer is equipped with smart technology, allowing you to control and monitor the washing process remotely",
            "Tempered Glass Door: The LG washer features a tempered glass door, which provides durability and visibility into the washing drum during operation",
            "ColdWash Technology: The LG washer utilizes cold water efficiently by employing different washing motions and techniques",
            "Stainless Steel Tub: The LG washer's tub is made of stainless steel, which offers durability and prevents chips that can potentially snag on clothing during the wash cycle",
            "Shallow Depth: The LG washer is designed with a shallow depth, allowing it to fit in more compact spaces"
        ],
        "description": "4.5 cu. ft. Ultra Large Capacity TurboWash™ 360° Technology AI Fabric Sensor/ Smart Pairing AAFA Certified LG washers ThinQ® Technology with ThinQ Care Tempered Glass Door with Rose Gold Trim *Consumer Reports does not endorse product or services. 5 powerful jets spray clothes from multiple angles for a complete clean in under 30 minutes*. *Based on independent testing in normal cycle with TurboWash™ option, 10 lb. load (June 2020). AI technology selects optimal wash or dry settings. Washer can auto-select a compatible drying cycle. AAFA certified LG washers with the Allergiene™ Cycle remove over 95%* of pet dander and dust. *Based on certification by the Asthma and Allergy Foundation of America (AAFA). *ASTHMA & ALLERGY FRIENDLY Mark is a Registered Trade Mark of the ASTHMA AND ALLERGY FOUNDATION OF AMERICA and ALLERGY STANDARDS LTD. Discover ThinQ Care within the ThinQ app -- proactive smart alerts to keep your appliances running smoothly. Get notifications about usage, maintenance, plus early diagnosis right on your smartphone. Sleek, scratch-resistant tempered glass doors are complemented by chrome or rose gold accents.* *Accent colors and finishes vary by model. Bring on big loads of towels or jeans -this ultra large (4.5 cu. ft.) washer fits more in every load up to 20 lbs. ColdWash™ technology penetrates deep into fabrics, for cold water savings with warm water performance. Wash small loads that can't wait or two loads at once with the LG SideKick™ Pedestal Washer. *LG SideKick™ Sold Separately. LG closet-depth washers have a shallower depth to fit in more places & add sleek style to any room. Unlike porcelain & plastic, LG's stainless steel tub avoids chips that snag on & ruin clothing. Nothing is more frustrating than an appliance that doesn’t fit. We’ll help you find the right one for your space. Type Front Load Washer Capacity (cu.ft.) 4.5 cu. ft. Matching Electric Dryer DLEX4000W Matching Gas Dryer DLGX4001W Color White (W) Hard Buttons Yes Touch Buttons Yes Dial-A-Cycle™ Yes ENERGY STAR® Most Efficient Yes ENERGY STAR® Qualified Yes CEE Tier 2 IMEF 2.92 IWF 2.9 No. of Programs 12 Programs Normal, Perm. Press, Heavy Duty, Delicates, Towels, Speed Wash, Bedding, Tub Clean, Bright Whites™, Sanitary, Allergiene™, Downloaded No. of Options 14 Options TurboWash®, Steam, Fresh Care, Pre-wash, Remote Start, Delay Wash, Wi-Fi, Add Item, ColdWash, Extra Rinse, Rinse+Spin, Control Lock, Spin Only, Signal No. of Wash/Rinse Temps 5 Wash/Rinse Temps Extra Hot, Hot, Warm, Cold, Tap Cold No. of Spin Speeds 5 Spin Speeds Extra High, High, Medium, Low, No Spin Max RPM 1300 Water Levels Load Sensing No. of Soil Levels 5 AI DD™ Yes TurboWash™ 360 Technology Yes Steam Technology Yes Allergiene™ Cycle Yes Sanitary Cycle Yes ColdWash™ Option Yes SenseClean™ System Yes TrueBalance™ Anti-Vibration System Yes 4 Tray Dispenser Prewash, Main Wash (with liquid detergent cup), Bleach, Fabric Softener LoDecibel™ Quiet Operation Yes End of Cycle Signal Yes LoadSense Yes Child Lock* Yes Auto Suds Removal Yes Leveling Legs 4 Adjustable Legs SmartDiagnosis™ (v3.0) Yes Wi-Fi Yes Remote Start and Cycle Monitor Yes Energy Monitoring Yes Tub Clean Coach Yes Motor Type Inverter Direct Drive Motor Axis Horizontal NeveRust™ Stainless Steel Drum Yes Cabinet PCM Control Panel Plastic Top Plate Painted Door / Rim Glass/Shiny Rose Gold Door Cover Tempered Glass Door All Available Colors White (W), Black Steel (B) AAFA Yes Ratings UL Listed Electrical Requirements 120V, 10 Amps Type Electric Pedestal WDP4W Pedestal (WxHxD) 27\" x 13 5/8\" x 28\" (43 7/8\" D with door open) LG Sidekick™ Pedestal Washer WD100CW LG Sidekick™ Pedestal Washer (WxHxD) 27 x 14 1/8 x 30 3/4 (50 1/2 D with door open) Stacking Kit KSTK1 Product (WxHxD) 27\" x 39\" x 30 1/4\" Depth with Door Open (55\" D with door open) Carton (WxHxD) 29 23/32\" x 41 27/32\" x 31 17/32\" Weight (Product/Carton) 187.4/209.8 lbs Parts and Labor 1 Year Direct Drive Motor 10 Years Drum 3 Years UPC 048231028288 Prices, promotions and availability may vary by model, store, and online. Prices subject to change without notice. Quantities are limited. Check with your local retailers for their final price and availability. Looking for a large capacity washer that suits your active lifestyle? The 4.5 cu. ft. of space in this LG Front Load Washer (WM4000HWA) is expertly designed to keep your family and your home looking their best. Wi-fi capabilities of an LG smart washer allows for easy control and monitoring through notifications, remote help, and more. LG washing machines feature a streamlined design, come in a wide range of colors and boast user-friendly control panels, as well as the performance you need to complete wash cycles with ease and expertise. The 4.5 cu. ft. Ultra Large Capacity LG washer is equipped with cutting-edge cleaning technology including 6Motion, Direct Drive Motors and TurboWash™360. Browse all of our innovative Home Appliances, including our complete collection of LG Washers and Dryers, guaranteed to suit your lifestyle and aesthetic.",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b?ie=UTF8&node=2619525011"
            },
            {
                "name": "Laundry Appliances",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18116194011"
            },
            {
                "name": "Washers & Dryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=2383576011"
            },
            {
                "name": "Washers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=13397491"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎LG"
            },
            {
                "name": "Model Info",
                "value": "‎WM4000HWA"
            },
            {
                "name": "Item Weight",
                "value": "20 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎30.25 x 27 x 39 inches"
            },
            {
                "name": "Item model number",
                "value": "‎WM4000HWA"
            },
            {
                "name": "Efficiency",
                "value": "‎Energy Efficiency"
            },
            {
                "name": "Capacity",
                "value": "4.5 Cubic Feet"
            },
            {
                "name": "Max Spin Speed",
                "value": "‎360 RPM"
            },
            {
                "name": "Part Number",
                "value": "‎WM4000HWA"
            },
            {
                "name": "Special Features",
                "value": "‎Adjustable"
            },
            {
                "name": "Color",
                "value": "White (W), Black Steel (B)"
            },
            {
                "name": "Control Console",
                "value": "‎Remote"
            },
            {
                "name": "Standard Cycles",
                "value": "‎12"
            },
            {
                "name": "Access Location",
                "value": "Top Load"
            },
            {
                "name": "Voltage",
                "value": "‎120 Volts"
            },
            {
                "name": "Certification",
                "value": "‎Energy Star"
            },
            {
                "name": "Material Type",
                "value": "‎Stainless Steel"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B0B1LPV6Z5"
            },
            {
                "name": "Customer Reviews",
                "value": "5.0 5.0 out of 5 stars 1 rating 5.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,048 in Appliances (See Top 100 in Appliances) #69 in Clothes Washing Machines"
            },
            {
                "name": "Date First Available",
                "value": "May 17, 2022"
            },
            {
                "name": "Brand",
                "value": "LG"
            },
            {
                "name": "Special Feature",
                "value": "Adjustable"
            },
            {
                "name": "Finish Type",
                "value": "Painted"
            },
            {
                "name": "Cycle Options",
                "value": "Spin, Normal, Rinse"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Controls Type",
                "value": "Remote"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [],
        "otherSellers": []
    }
}