{
    "remaining_requests": 25750,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ZENSTYLE-Compact-Washing-Machine-Portable/dp/B07J9J8HPK",
    "body": {
        "name": "ZenStyle Portable Washer Compact Twin Tub 9.9 LB Mini Top Load Washing Machine Washer/Spinner w/ 6.57 FT Inlet Hose",
        "price": "$107.99",
        "originalPrice": "",
        "rawPrice": 107.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/ZENSTYLE-Compact-Washing-Machine-Portable/dp/B07J9J8HPK",
        "soldBy": {
            "sellerID": "A2C1YJA37QPCPJ",
            "name": "ZenStyle",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2C1YJA37QPCPJ&asin=B07J9J8HPK&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41-cHzMEgeL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41cIj5lw5IL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51GzUsYb36L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513NrjQzfhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51mMusygbzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5179-vrDDUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ccy2aJ9fL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: ZenStyle",
            "link": "https://www.amazon.com/ZenStyle/b/ref=bl_dp_s_web_19856540011?ie=UTF8&node=19856540011&field-lbr_brands_browse-bin=ZenStyle"
        },
        "brand": "ZenStyle",
        "merchantInfo": "ZenStyle",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1685,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 23 - 27."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "★- ZenStyle mini washing machine featured a powerful yet quiet 1300RPM motor with max frequency of 60Hz to ensure your clothes are thoroughly washed, rinsed and spun; Separate timer control design for washer and spinner to meet your different needs; Comes with a 78.8” length water inlet hose for easier filling water; Large capacity of totally 9.9lbs (Washer: 5.5lbs, Spinner: 4.4lbs)",
            "★- Practical 2 in 1 twin tub design, one for washing and another one for spin drying; Dual functions allow you to wash the cloth and spin dry the cloth at the same time; Plastic body ensures the machine will never be rust eaten, blue transparent body design allows you to check your cloth anytime, conveniently and practically for daily life",
            "★- Its compact and lightweight design allows you to move and transit the clothes washing machine to anyplace; Easily to fit in most place such as bathroom or closet; Separate timer allows you to use the washer and spinner separately or together to save time; This is a perfect time/space/energy saving washing machine",
            "★- Easy to operate the machine, simply put in your load of clothes, fill with water, set the timer and start washing/spinning, the washer and spinner can run at the same time; Separate time controller for the washer and spinner, maximum 15mins for washer and 5mins for spinner",
            "★- With this mini twin tub washing machine you will no more trouble to do laundry in compact area or moving environment; This is your ideal washing machine choice for such as dorms, college rooms, apartments, RV’s, camping, traveling and more. Please feel free to contact us if you have any problems with your order. Replacement or Refund"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b?ie=UTF8&node=2619525011"
            },
            {
                "name": "Laundry Appliances",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18116194011"
            },
            {
                "name": "Washers & Dryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=2383576011"
            },
            {
                "name": "Portable Washers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=9709422011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎ZenStyle"
            },
            {
                "name": "Item Weight",
                "value": "22 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "14.6\"D x 22.1\"W x 22.7\"H"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Efficiency",
                "value": "‎Energy Efficiency"
            },
            {
                "name": "Capacity",
                "value": "9.9 Pounds"
            },
            {
                "name": "Max Spin Speed",
                "value": "‎1300 RPM"
            },
            {
                "name": "Special Features",
                "value": "‎Practical 2 in 1 twin tub design"
            },
            {
                "name": "Color",
                "value": "Blue 9.9LB Twin"
            },
            {
                "name": "Control Console",
                "value": "‎Knob"
            },
            {
                "name": "Standard Cycles",
                "value": "‎1"
            },
            {
                "name": "Access Location",
                "value": "Top Load"
            },
            {
                "name": "Voltage",
                "value": "‎110 Volts"
            },
            {
                "name": "Material Type",
                "value": "‎Plastic"
            },
            {
                "name": "Included Components",
                "value": "‎Drain Hose, Inlet Hose, Manual"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B07J9J8HPK"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,685 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#192 in Appliances (See Top 100 in Appliances) #20 in Portable Clothes Washing Machines"
            },
            {
                "name": "Date First Available",
                "value": "August 7, 2018"
            },
            {
                "name": "Brand",
                "value": "ZenStyle"
            },
            {
                "name": "Special Feature",
                "value": "Practical 2 in 1 twin tub design"
            },
            {
                "name": "Finish Type",
                "value": "Plastic"
            },
            {
                "name": "Cycle Options",
                "value": "End of Cycle Signal"
            },
            {
                "name": "Material",
                "value": "Plastic"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Specifications: Color: Blue + WhiteMaterials: ABS Material + PP PlasticWasher Capacity: 5.5 lbsSpinner Capacity: 4.4 lbsOverall Dimensions: 22.7’’ x 22.1’’ x 14.6’’Weight: 22 lbsMotor Speed: 1300RPMVoltage: 110V/60HzRated Input Power: 240/120W (Wash/Spin)Wash Timer: Up to 15 minutesSpin Timer: Up to 5 minutesDrain Hose Length: 19.7’’ / 0.5 meterInlet Hose Length: 78.8’’ / 2 meterWarm Note: Watermarks left on hoses or tubs, it's manufacture function testing",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a36aa4e7-48b5-4c41-9ddd-7fec7b797937.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Practical 2 in 1 twin tub design, one for washing, another one for spin dryingLarge capacity of totally 9.9lbs (Washer: 5.5lbs, Spinner: 4.4lbs)Compact and Lightweight design can fit in most places to save space or be moved to other place easily Separate timer control design for washer and spinner to meet your different needs(Wash Timer: Up to 15 minutes, Spin Timer: Up to 5 minutes)Powerful yet quiet 1300rpm motor to ensure your clothes are thoroughly washed in low noise Your perfect time/space/energy saving washing machine choiceIdeal washing machine for doing laundry in a compact or moving environmentSuit to dorms, college rooms, apartments, RV’s, camping, traveling and more",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/945c3140-28d9-4ed6-8eb9-5fa31602773a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15895ac4-92d6-437e-a68b-3d96f5998401.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cdf84392-e3b0-43ba-b6e2-2ccd86559212.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Operation Steps: Put a load of laundry into the washing tub, large capacity up to 9.9 lbsHook up a water inlet or fill in water with a bucket or hoseAdd a teaspoon of liquid laundry detergent in to the wash tubSet the wash timer, max up to 15 minutesWashing over,take clothes to the spinner tub and set spin timer, max up to 5 minutes (Wash and spin dry can run at the same time)Take washed and drained clothes out, wear hangers and let them dry in the wind naturally",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ae42244-1a99-4eaf-9384-e812b921d51e.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Mini Single Tub Washing Machine Mini Twin Tub Washing Machine Mini Twin Tub Washing Machine Portable Washing Machine Dimension 15.4\"D x 14.7\"W x 22.8\"H 13.4\"D x 28.7\"W x 23.2\"H 14.96\"D x 23.62\"W x 27.17\"H 14.6\"D x 22.1\"W x 22.7\"H Automatic Semi-Automatic Semi-Automatic Semi-Automatic Semi-Automatic Wash/spin capacity 5.7lbs 11lbs 13lbs 9.9lbs Inlet Hose ✓ ✓ ✓ ✓ Drain Hose ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cd485f5b-2784-4fe0-96d3-cd53e602cb60.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a36aa4e7-48b5-4c41-9ddd-7fec7b797937.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/945c3140-28d9-4ed6-8eb9-5fa31602773a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15895ac4-92d6-437e-a68b-3d96f5998401.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cdf84392-e3b0-43ba-b6e2-2ccd86559212.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ae42244-1a99-4eaf-9384-e812b921d51e.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0b3aab15-8374-4607-87ca-de2b01813957.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/019c160b-1fc4-4b28-994d-7597d8a9d61b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1ead6279-3cd1-4817-9fda-732fe9ab814d.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/39af967b-53d2-4a05-a359-773913570229.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6ba3eef0-38b0-4af5-97e2-d27b4731e014.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "sean p keenan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWJHS7I37XB4Q22LZQAFP6Y5TLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10JLHRL8LZ3YX?ASIN=B07J9J8HPK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2019",
                "reviewTitle": "5.0 out of 5 stars I COULDN'T BE HAPPIER",
                "reviewText": "I'll be honest, I was very sceptical about a plastic washing machine. But this thing is just awesome! I have had it for 3 months now. I am a single male, and I use it about 2-3 times per week. I have had ZERO problems with it. I pulled it out of the box, put it in the shower surround, filled it with water and washed. There is NO assembly to do. And it is of quite good quality all around. It's not a bunch of cheap plastic that will fall apart in a year. This thing is so cool!You can place this ANYWHERE there is a drain nearby. I live in a small studio apartment. I dont have a typical tub/shower. Just a shower surround. So I just place it in the shower, drop the drain hose onto the floor, fill it with water and wash. Don't think it doesn't wash as well as a full size. It does! It is surprisingly quiet in both wash and spin cycles. Almost silent. So if you live in a multi-unit apartment complex, you dont need to worry about pissing off your neighbors.It's a money saver too! Because in the wash cycle, the motor spins the tub in one direction for a few seconds then stops. It pauses for a few seconds, then spins in the opposite direction for a few seconds. So it use very little energy, whereas a full size washer uses a much bigger motor and it runs continuously for the entire wash cycle. There are 2 seperate motors in the unit. And the motors seem to be of good quality, and quite strong. I'm not worried about them failing after a year or so.Another way it saves money is bc there is no heating element to dry clothes. BIG money saver right there! Instead, it has a seperate compartment which houses a stainless steel basket. The other motor spins the wet clothes so fast that it actually does a fantastic job of almost completely drying the clothes. It spins on a 0-5 minute automatic timer. More than enogh to do the job. (Note: full synthetic items come out almost completely dry. Only slightly damp to the touch. Cotton jeans and towels and the like, come out damp, and require some dry time. Depending on the climate where you live. If you live in a humid area, it may take a half day to dry the heavier cotton items)Another way it saves money is that you really only add NO MORE than a tablespoon of laundry detergent. Seriously, that is PLENTY.This 9.9 lb machine i bought, can do a pair of jeans and a few pairs of underware and socks in one load. Or one full size thick cotton bath towel and a few smaller items per load. I can easily fit full size bed sheets in it, but only top sheet, then bottem sheet in another load. But it handles it just fine. I'm pretty sure the 9.9 lb would handle a queen size. A full size comforter....No way, forget about it. Take that to the laundromat. (I think that one of the 13 lb machines will handle a comfortor though.) It will handle about 5-7 cotton t-shirts per load.There is definetly more \"hands on\" work with one of these machines as compared to a full size automatic. Bc you do a wash cycle, (about 10-12 minutes) then you have to turn a knob to the \"drain\" setting, let it drain (takes about 20 seconds), then refill with water, turn knob to wash cycle, (which is really the rinse cycle. I do about 6 minute rinse), then come back and turn knob to drain. Then, move clothes over to the other compartment on the right, set timer to 5 minutes to spin clothes dry. As you are spinning, you can be filling up wash tub for next load. (YES, you can be washing and spinning at the same time bc compartments, settings, timers and motors are seperate systems). I know all that sounds like alot of work, but it really isn't. It's so quick and simple that it's almost fun! I bought some cheap extendable clothes hanging bars, that I put between the hallway walls to hang clothes on. When I'm done washing, I just pick up the unit and place it in the back hallway. The thing is super lightweight, that a 90 yo grandma can easily move it.PROS:-Cheap...$80.33 shipped to the house-Good quality-Very light weight-Can be used in any dwelling where there is no waher/dryer hookups (perfect for apartments, studios, businesses, rv's/camp trailers etc)-Uses almost no electricity. So it can be easily used with very small solar systems like you'd have in rv's etc-uses very little detergent, no more than 1 tblsp per load- Easily portable. So if you move, and the new place doesn't have W/D hookups....no problem- Cleans every bit as good as a full size unit- Very quiet operation in both wash and spin. Great for multi-unit apartment complexes.- Excellent option if your full size breaks down and you cant afford to replace it right away- Much smaller loads save water. Although you do more loads, I still feel like it would use less than a full size would use. - Very user friendly.- Has a lint trap inside washer unit, that easily slides out/in for cleaning. And yes, it actually works surprisingly well. Traps quit a bit of lint.- Solidly made- Perfect for 1-2 people householdCONS:- Smaller loads so its more hands on. Bigger size machines wouldn't have this con.If you buy it and it turns out to be too small, exchange it, or give it to someone who needs it. Or donate it to a small business like an animal shelter, hair salon, food bank, charity organization etc.Hope this helped!",
                "reviewVotes": "576 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gail ferrantelligail ferrantelli",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4VICMRXURU3S5Q25NVEA4OQNKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZVZ84SSIK9EB?ASIN=B07J9J8HPK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2022",
                "reviewTitle": "5.0 out of 5 stars Love it! Love it! Love it! Does an amazing job! It's Cute, Versatile, and it's Fun!",
                "reviewText": "I live alone and purchased this washer to do my small loads (of which I have many), in addition to my very large new washer, which is just huge, I have to use tongs to get the clothes out of the bottom of the LG washer as it is so very deep. This little unit, gets things so clean and saves me a lot of money on detergent, water, additives, and I assume electricity. I use it in my laundry room next to my laundry sink. I love it for keeping up on all my small loads. I can still wash my large loads like towels, sheets, slip-covers, rugs and dog beds, in my large washer and during that same time period, run two seperate small loads of my delicates and everyday clothes I wear, in this one. I know it will pay for itself in no time at all. It only takes 1.5 oz of liquid detergent (I use a small amount of the he \"free and gentle\" liquid white tide), rather than using one or two of the expensive pods that I use in my large set. \"Free and gentle\" Tide is not cheap, so needing to use less is a big plus. I am amazed at how dirty the water gets, (ck out the picture) which tells me it is really getting my clothes clean. You can see thru it so you can tell how much it agitates. The wringer also works extremely well, I swear it is like the clothes have dry spots already when they come out. You can completely control how long the agitate cycle is as well as the spin cycle. When I went to wash my cleaning rags, I washed them for additional time and more than once changing the water in between til the water draining out was not so dirty, then I spun them, rinsed them and spun them before putting them in my regular dryer. Never having to wash them with my other whites, which I didn't like doing. I also think it will allow my expensive new LG Washer and Dryer to last me much longer. It is lightweight and compact. I plan to take this on vacation with me to a beach house I love to rent, that only has a coin laundry room in the complex. None of the units have washers or dryers. I hate getting coins, and setting in the hot laundry mat while the machines run, if I can even get one, as there are always several broken ones and they are usually busy. I also don't think those coin machines do a good job, and you just never know what the last person washed in them. Another plus, I wouldn't have to pack as many clothes, as I could wash them more frequently and spend more of my time enjoying my vacation.",
                "reviewVotes": "40 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Rz-4LgZYL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}