{
    "remaining_requests": 25553,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/washOTG-Portable-Washing-Machine-Waterproof/dp/B092X4THVJ",
    "body": {
        "name": "washOTG Portable Washing Machine – Durable & Waterproof Clothes Washing Wand – Mobile Clothes Washer that’s Perfect for Washing Clothes while Camping, Hiking, Traveling – Green Mobile Hand Washer",
        "price": "$25.99",
        "originalPrice": "",
        "rawPrice": 25.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/washOTG-Portable-Washing-Machine-Waterproof/dp/B092X4THVJ",
        "soldBy": {
            "sellerID": "A3VELZO9HHBX7N",
            "name": "Your Sole Provider",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3VELZO9HHBX7N&asin=B092X4THVJ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/21b0HOtOqdS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41RLUrPkxeS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/312mQfwC4pS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5136CHFQPzS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZV0qPcILS.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: washOTG",
            "link": "https://www.amazon.com/washOTG/b/ref=bl_dp_s_web_38655984011?ie=UTF8&node=38655984011&field-lbr_brands_browse-bin=washOTG"
        },
        "brand": "washOTG",
        "merchantInfo": "Your Sole Provider",
        "customerReview": "3.7 out of 5 stars",
        "customerReviewCount": 165,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 7 hrs 48 mins",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest pickup Friday, February 16. Order within 7 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "washOTG Portable Washing MachineDo you enjoy going camping and hiking, but never know how to effectively wash your dirty clothes?Are you tired of wasting water on ineffective washing methods that never seem to get your clothes fully clean when traveling?Introducing ?washOTG’s Portable Camping Washer?At washOTG, we know how hard it can be to keep you clothes clean and smelling fresh while you’re out camping, hiking, or just traveling through nature. There are some methods that many try, but those ultimately never end up making your clothes completely clean and just waste precious water. That’s why we’ve come up with our clothes washing wand!This mobile clothes washer is the ultimate camping essential for giving your clothes a deep and thorough wash without wasting excess water and getting your clothes completely spotless. How it works is simple and only takes 3 easy steps:Fill a laundry bucket with waterAdd your preferred detergent and then add your clothes.Place the clothes washing wand onto your clothes and begin pushing up and down continuously until cleanThanks to the grooved interior of the washing nozzle, our mobile hand washer acts just like a real washing machine when you push it up and down continuously onto your clothes. Our portable camping washer is also made from durable material that’s still gentle enough as to not tear or ruin your clothesNeed more reasons to choose us?Measures 26.5 when together and being collapsible into 5 parts makes it easy to pack when travelingErgonomic shovel type handle makes it easy to use without straining yourselfMakes a great gift for your friend or family member who’s always travelingClick the Add to Cart button and start cleaning your clothes the economical and effective way while camping with our Portable Washing Machine, today!",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2619525011"
            },
            {
                "name": "Laundry Appliances",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18116194011"
            },
            {
                "name": "Washers & Dryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2383576011"
            },
            {
                "name": "Portable Washers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=9709422011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎washOTG"
            },
            {
                "name": "Model Info",
                "value": "‎Mobile Hand Washer"
            },
            {
                "name": "Item Weight",
                "value": "‎1.26 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "8\"D x 8\"W x 26.5\"H"
            },
            {
                "name": "Item model number",
                "value": "‎Mobile Hand Washer"
            },
            {
                "name": "Capacity",
                "value": "3 Gallons"
            },
            {
                "name": "Part Number",
                "value": "‎G"
            },
            {
                "name": "Special Features",
                "value": "‎Portable"
            },
            {
                "name": "Standard Cycles",
                "value": "1"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B092X4THVJ"
            },
            {
                "name": "Customer Reviews",
                "value": "3.7 3.7 out of 5 stars 165 ratings 3.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,332 in Appliances (See Top 100 in Appliances) #175 in Portable Clothes Washing Machines"
            },
            {
                "name": "Date First Available",
                "value": "April 20, 2021"
            },
            {
                "name": "Brand",
                "value": "washOTG"
            },
            {
                "name": "Special Feature",
                "value": "Portable"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Donavan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4AW7BTJQPOIMZZB44BEJNS7LYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Q7JA6RC5EOEM?ASIN=B092X4THVJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2022",
                "reviewTitle": "5.0 out of 5 stars Works great! Easy to use! Here's how to prevent it breaking.",
                "reviewText": "This is a million times more effective and easier than using your hands to squish wash water through fabric. And the design & size of the head make it much better than a toilet plunger with holes drilled into it. Yes, the head unscrews slowly but surely while you're using it. And it you tighten it repeatedly, the threads will fail. The simple solution is a good plastic glue. I used a glue a bit thicker than super glue in case all the threads didn't meet well. And, because the other joints also have plastic threads, and because the longer the handle the more stress any sideways force will cause, I attached the handle directly to the head (omitting the other two sections). This works great for me whether my bucket is in the bathtub or on the kitchen counter. When I use the washer, I always only move it up & down perpendicular to the floor (never on an angle), and never push hard on a resistant lump (like jeans). I also never twist it or use it to reposition items in the wash. I wear long rubber gloves so if needed I can reach and move items around. Totally worth the money and the little bit of modification!",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mamma",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHR3UU7JNOBJVCZBVOWXTGEW7BPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TW4R6SWVWF3W?ASIN=B092X4THVJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 22, 2022",
                "reviewTitle": "4.0 out of 5 stars Handle is not sturdy, as soon at it met resistance, the handle threads slipped, used shaft instead",
                "reviewText": "Handle is weak, as soon as it met resistance from clothes in bucket to turn threads slipped, I omitted using handle and grabbed shaft to finish load",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEP4Z7NNIU3BUUUEGZAMUQCMV3HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39TIIHKF09X04?ASIN=B092X4THVJ",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2022",
                "reviewTitle": "1.0 out of 5 stars Not for regular use",
                "reviewText": "Worked very well for the first two loads of washing. After that, the plastic threading stripped. The plunger portion no longer attaches to the handle.Probably would have been fine had I used this exclusively for camping trips. Unfortunately, I hand wash about 25% of my laundry and need something that can withstand regular use.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C.U.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFIPBGMIPKMFM4Y7W4OSXX3GVXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36QRXBK4MD8UZ?ASIN=B092X4THVJ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 15, 2022",
                "reviewTitle": "3.0 out of 5 stars It came used :(",
                "reviewText": "The product works fine, better than a plunger. But I paid full price for something used. The only reason I didn’t complain at the time, was because I really needed to use it and had so many other things going on. But since you asked, I’ll tell you…I payed for something new but got something obviously used with no real assembly instructions, so at first I thought it was actually broken. Then I figured it out.That’s about it.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZVOVIN2GTPUXS64Y44ORWIOETA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GZX13U2RAZPE?ASIN=B092X4THVJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2021",
                "reviewTitle": "5.0 out of 5 stars The best thing since the invention of the washboard",
                "reviewText": "I didn't know these existed. Now that I know I think they are just wonderful. I have two. One for my handwash and one for the cat's laundry. The cat's stuff can't go into the machine because his hair will clog the drain there. As some other reviewers have pointed out you have to watch out that the handle might come undone. That's why I took a star off on \"lightweight.\" Too lightweight isn't a good thing. But if you give the thing it a twist in the right direction while you use it that won't be an issue. In the long run I may try glueing it or putting an aluminum pipe over the handle part. But just for now it makes doing the handwash a breeze and I can do the cat's laundry with a lint trap in the drain. I also love that I can do his laundry separate from mine and don't have to think about cleaning a machine off icky stuff cat messes before using it for stuff that I'll wear. I saw a similar model with a wood handle. Wet wood is not a good idea here. (Humid climate.) If they ever make an all cast aluminum or stainless model I'd be first in line to buy that. Except for coming in separate pieces these plastic ones work fine. I can't say anything about the longevity yet, but I'm not too worried. If these break I now know where to get more. I'm using them with Dollar store tubs, but will probably upgrade to using a bucket once I can go out and buy one. (Current online bucket prices are usury.) Even if you only use one of these every now and then it's a good buy and they don't take a lot of space. I don't use washable floor mops, but if I did I'd get another one of these washers just for that purpose.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matthew",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH42PIGDKABKNN5DMQT4GOC6EC6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPCIH3FA5DC44?ASIN=B092X4THVJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "4.0 out of 5 stars Works great! Faulty Handle!",
                "reviewText": "This works great but the handle doesn't like to stay on.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQBMVC2GQXUIGZQI7LKISIK7NLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TFIDFP4WVR3Q?ASIN=B092X4THVJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 8, 2023",
                "reviewTitle": "5.0 out of 5 stars I put sugru in the seams",
                "reviewText": "People had complained that the threading comes loose and the connections are no longer sturdy after some use. I filled the connections with Sugru, hoping to prevent that. So far so good. I cannot disassemble it but that's fine for me. I use it almost every day to wash sweaty gym clothes immediately after working out.I own a Laundry Alternative hand crank laundry machine, which my husband still prefers, but I prefer plunging in a bucket in my bathtub, maybe simply because I think it's faster to fill and dump the bucket water into the tub as opposed to draining the laundry machine. (Also for us we don't have enough space to keep the LA machine in our bathroom and use it outside w a hose, and it would be a hassle to move the machine around. With a bucket and this plunger wand I can easily carry it in and out of my bathroom)Also I started putting my whole small load of hand wash laundry in a mesh bag when using this wand/plunger, I think it helps to keep all the small items together and forces every piece to push through the water together instead of ending up on top of the plunger. I assume this helps the washing.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Юрий ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFS6QB56O3NJPCCNDFXVBUMRTUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I7LIVNMWW8IZ?ASIN=B092X4THVJ",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 3, 2023",
                "reviewTitle": "1.0 out of 5 stars Bought it two months ago and it’s already broke",
                "reviewText": "The theory behind this product seems convenient, but do yourself a favor and buy one that’s all one piece instead.I can’t return it because I missed the return window, but this has been gently used twice before and it broke today on the third use.It also doesn’t actually work as it’s meant to to begin with. You can use it to gently plunge the water in a bucket around but it can’t be moved from side to side. Even gently plunging it will cause the connections to come loose. I should have returned it after the first use, but thought I’d make due with a less than stellar product instead of going to the trouble.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}