{
    "remaining_requests": 25506,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/COSTWAY-Portable-Capacity-Function-Apartment/dp/B097KB31M2",
    "body": {
        "name": "COSTWAY Portable Washing Machine, Twin Tub 26 Lbs Capacity, 18 Lbs Washer and 8 Lbs Spinner, Compact Washer with Control Knobs, Timer Function, Drain Pump, Laundry washer for Apartment RV, Grey",
        "price": "$199.99",
        "originalPrice": "",
        "rawPrice": 199.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/COSTWAY-Portable-Capacity-Function-Apartment/dp/B097KB31M2",
        "soldBy": {
            "sellerID": "A383G1P012K88F",
            "name": "costway",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A383G1P012K88F&asin=B097KB31M2&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B097KBJF48"
        ],
        "asinVariationValues": [
            {
                "asin": "B097K9FZB2",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$199.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41A4k+hUZdS._SS36_.jpg"
            },
            {
                "asin": "B097KB31M2",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "$199.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31BwPaFhc+S._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31COTN7AKAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ARKeaFMaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51WUj-bReiS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OX5T5anrS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41i2zq8v4VS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51swdOdwqhS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZANjWpV6L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the COSTWAY Store",
            "link": "https://www.amazon.com/stores/COSTWAY/page/EA61CCE7-FF50-4C03-B232-585D5BA5DD91?ref_=ast_bln"
        },
        "brand": "COSTWAY",
        "merchantInfo": "costway",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 240,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23. Order within 22 hrs 40 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "💦【Twin Tub Washing Machine】This washing machine features the twin tub for convenient use, which allows you to wash and dry clothes at the same time. What’s more, the washing and drying function can be used independently, bringing a lot of convenience to your laundry. This is a good choice to free your hands and save your time.",
            "💦【Timing Function &3 Selection Modes】Our laundry washer comes with 5 minutes washing time and 5 minutes spinning time on the control panel for easy operation. Just rotate the timer knob to choose the suitable time according to your needs. In addition, you can choose the mode of gentle, normal, or drain based on the material of the garments.",
            "💦【Large Capacity for Daily Use】18lbs capacity for washing tub and 8lbs capacity for spin tub can accommodate a large quantity of clothes at once for household use. It is big enough for several items and even for larger garments like jeans or bed sheets. You only need to put in clothes and detergent, set the washing machine to wash.",
            "💦【Powerful Motor &Built-in Drain Pump】The power of washing is 280W and the power of spinning is 140W which help you to use it more effectively. Hence, you can wash the clothes of the whole family at the same time. And it is equipped with a drain pump which allows you to drain out dirty water directly after washing.",
            "💦【Compact & Portable Design】Featuring a clear washer lid, you can view the process of clothes at any time while using the washing machine. Plastic material prevents it from rusting in wet environment. Meanwhile, compact design makes it suitable for dorms, apartments, RV’s, camping trips or anywhere with limited space."
        ],
        "description": "DescriptionOur twin tub washing machine is perfect solution for doing laundry in limited space. Powerful motor makes your washing more faster and cleaner, meanwhile more convenient and less energy consumption. Featuring a twin tub washing design, the washing machine combines spinning function and washing function as one which offers great convenience for laundry. Made of a durable plastic body, this compact washing machine is ideal for camping trips, dorms, apartments or anywhere with limited space. It can also wash all kinds of clothes like shirts, underclothes, sweater, and so on. Don’t hesitant to buy one! FeatureSimultaneous or separated washing, spinning and drying The washer can hold up to 18lbs while the spin tub can hold up to 8lbs Separate timer control settings for wash and spin 15 minutes washing timer & 5 minutes spin timer 3 modes of gentle, normal and drain for your selection Water inlet hose & drain hose for easy filling & draining Powerful motor ensures effective wash and spin Rust-resistant and durable material ensures long-term use Built-in drain pump allows easy drainage Specification Color: Blue/Grey Material: ABS, PP Overall Dimension: 26.5” x 16.5” x 31.5”(L x W x H) Voltage: 120V/60HZ Rated Input Power of Washing: 280W Rated Input Power of Spin-drying: 140W Washing Timer: 15 minutes Spinning Timer: 5 minutes Wash Tube Capacity: 18lbs Spin Tube Capacity: 8lbs Length of Wire : 57” Length of Drainage Pipe: 52.5” Length of Inlet Pipe: 45.5” Diameter of Water Inlet Pipe (connect to faucet ): 1” Net Weight: 34lbs Package Includes: 1 x Washing Machine, 1 x Instruction",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2619525011"
            },
            {
                "name": "Laundry Appliances",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18116194011"
            },
            {
                "name": "Washers & Dryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2383576011"
            },
            {
                "name": "Portable Washers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=9709422011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎COSTWAY"
            },
            {
                "name": "Model Info",
                "value": "‎10021US-BL-CYPF"
            },
            {
                "name": "Item Weight",
                "value": "34 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "16.5\"D x 26.5\"W x 31.5\"H"
            },
            {
                "name": "Item model number",
                "value": "‎10021US-BL-CYPF"
            },
            {
                "name": "Efficiency",
                "value": "‎Energy Efficiency"
            },
            {
                "name": "Capacity",
                "value": "26 Pounds"
            },
            {
                "name": "Max Spin Speed",
                "value": "‎1300 RPM"
            },
            {
                "name": "Part Number",
                "value": "‎10021US-BL-CYPF"
            },
            {
                "name": "Special Features",
                "value": "‎Portable,Compact"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Control Console",
                "value": "‎Knob"
            },
            {
                "name": "Access Location",
                "value": "Top Load"
            },
            {
                "name": "Material Type",
                "value": "‎Plastic"
            },
            {
                "name": "Included Components",
                "value": "‎Drain Hose, Inlet Hose, Manual"
            },
            {
                "name": "ASIN",
                "value": "B097KB31M2"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 240 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,552 in Appliances (See Top 100 in Appliances) #201 in Portable Clothes Washing Machines"
            },
            {
                "name": "Date First Available",
                "value": "June 19, 2021"
            },
            {
                "name": "Brand",
                "value": "COSTWAY"
            },
            {
                "name": "Special Feature",
                "value": "Portable,Compact"
            },
            {
                "name": "Finish Type",
                "value": "ABS, PP"
            },
            {
                "name": "Cycle Options",
                "value": "Spin, Gentle, Drain, Normal"
            },
            {
                "name": "Material",
                "value": "Plastic"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Noramid Pena",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJB7QEZGEZF43TCCBJ3ZLIMTN6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LYVU355IZYIE?ASIN=B097KB31M2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 20, 2023",
                "reviewTitle": "5.0 out of 5 stars If you live in a small apartment, this washer is a must.",
                "reviewText": "I will be honest. I thought, for the price, this washer was going to be a temporary solution while I saved for a bigger washer/dryer combo, but this product proved me wrong!The washer arrived on time. Nothing was missing and it came in perfect condition. I watched a lot of YouTube videos of other users revising the product (which has been helpful). After a month and a half of using the washer, if you are thinking of buying it, do it.The washer packs more clothes than I thought it would. The spinner is amazing! The clothes come almost dry and since I prefer to hang the laundry outside in the summer, they don't take that much time to dry completely.If I could give the washer 10 starts, I would.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Demamabear",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDF3RUMH7MWPYGRWSAEAKEZDUNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R157V2YV72W3IY?ASIN=B097KB31M2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Life changing problem solved.",
                "reviewText": "My daughter and I recently had to move into a tiny cottage, in the mountains, due to a nasty divorce. During the process I had to give up most of my possessions, including my beautiful washer and dryer. We went to a laundromat every other week, hauling our laundry up & down a flight of stairs, sometimes in the rain. Not having a washer reminded me of all we loss. We are active people and my daughter plays sports, she needs her team practice gear washed weekly, which I would wash by hand between laundromat days. FYI: I have always hung dry most items to prevent shrinking and preserve the fabric/color. I have a minky drying rack that holds a lot of clothes and live in sunny CA.My daughter asked how do people living in RV’s wash their clothes? I started googling and watching YouTube videos and found this portable washer. It was delivered to my front door(most delivery services don’t want to go down my stairs.)First impression we were excited with the size of the wash tub and overall aesthetics but concerned about the hose as it is very cheap looking. We started a load inside, using buckets of water, draining into buckets. We had tears of joy! A month later, it’s used outside using the water hose and letting it drain outdoors. I can heat water to add warm water or hot water. I purchased the largest washer and it’s pretty quiet, easy to use, and does a beautiful job on the clothes. The spinner removes almost all of the water from the clothes, cutting down on drying time. The washer is light weight and has side handles, so easy to move, as the weather gets bad it will go back inside. I don’t overload or push down the clothes and think about weight vs. number of items in the washer, however I can do most of our clothes in one load. All of my bedding and dish towels, fit fine and one load. I do drain and refill for a short wash to remove soap as follows: Wash for 12 mins., drain, refill Rinse/wash 5 mins, put in spinner and rinse with water, spin 3mins.or less mins. So far the cheap washer hose is working great, if someone has a better one please post! Tip: I don’t drain the water from the wash tub until after the final spin. I feel it helps distribute weight in the spin tub. I have no rocking. Also if outdoors cover the top, an acorn scratch my top cover. We have overcome so many obstacles and purchasing this washer has helped us persevere. It’s a must for small places or two chicks in the woods.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blustery Days ROCK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPQV3G54FHEYKQOATYMRDYJRB5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R153G0XE06IIY9?ASIN=B097KB31M2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Greatest new invention (that apparently has been around since the mid-1900s!)",
                "reviewText": "Never heard of twin tub washers until 2022 and couldn't wait to try one out. Saves me having to go to the laundromat for most of my laundry cleaning needs. It's been almost two years with this particular machine - I've saved so much time, can do laundry whenever I feel like it, and can feel good knowing the machine is being used by only me. It IS hands on so one shouldn't expect it to be like a standard washing machine. Things I've learned: use less detergent than one would use in a full size washer; give laundry two rinses (spin dry between each); be sure to fully drain washer after using machine. For reference: I can easily put a queen top sheet, fitted sheet, four pillowcases plus a couple of wash cloths and dish towels in a load. A lightweight queen size blanket can fit in a load. Two pairs of sweatpants, three oversized long sleeve shirts, several pairs of socks can make up a load. Note: Just know that while larger sized items might be able to fit in the washer, if they're too large, they won't fit into the spinner (dryer - which is not really a dryer, it merely wrings out clothing and does a great job!). Despite my ignorance for not knowing that twin tub washers have existed since the 1960s, I'm glad I found out about them. Quite, quite pleased with this machine - simple to use, fair price, saves time and works really well.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennene Small",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUYAKING645NWKZKY7WQAVV4T5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAS5G0HOX6RE8?ASIN=B097KB31M2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Great if your apartment don't allow washers/great if you don't want to purchase one",
                "reviewText": "I like this washer/waterdrainer. I consider this to be a manual washing unit. I like the dryer / not dryer because it takes the access water off the clothes. The washing part does a good job as well. Here is where the manual comes in you either have to put the water in yourself you can hook it up to the sink but still you have to be there to monitor. After the first wash and you drain it, to rinse cycle your clothes again you have to put more water in and repeat the cycle by draining. Once done you then put your clothes into the dryer / water expeller. It only does 5 minutes at a time if it's not dry enough for you you have to continue to go and do another five and then another five. My overall opinion this is a great washing machine /dryer if you do not have a automatic washing machine / dryer. It is worth the money to me. I have washed my queen size comforter in the washer by itself. I would only recommend this to people if you have another thing that can expel the water off the comforter because it cannot fit in the dryer. The only blanket or cover that I know can fit in there is a throw cover depending on its size.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gemma Maria Monroy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2NG5ABFJAFOMYIY4ZWJKF4OFZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F2NE573M2IE5?ASIN=B097KB31M2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 7, 2023",
                "reviewTitle": "5.0 out of 5 stars This is a life saver",
                "reviewText": "The media could not be loaded. I moved into the country in a farm and the house is really old and small. The laundry room had no space for a regular size washer and dryer and I kept having to go to the laundry mat 20 minutes away. This machine is a life saver because it is small enough to fit in the laundry room and it washes clothes like a champ. I got what I expected. Of course I wish it would come with a dryer but the clothes ringer is quite powerful and gets the clothes almost dry to where they're not even dripping after hanging on the drying rack.It's definitely a good idea for people that have no city water service also because it doesn't take too much water to run.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a44591ea-ebb0-4cd7-a127-c6a961e6a7b3/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Fari Sal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 30, 2022",
                "reviewTitle": "Amazing customer service",
                "reviewText": "The customer service was amazing! Love the machine, works beautifully and cleans the clothes really well.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philip Gagnon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 12, 2022",
                "reviewTitle": "very nice",
                "reviewText": "I like it. clean like a big machine. some more work to do vs automatic one but the bin is bigger than small automatic one. its not a highest quality material but no problem so far. easy to use. drain pump is powerfull.the dry drum is noisy if you use water in to rinse",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dylan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 2, 2022",
                "reviewTitle": "Works as advertised",
                "reviewText": "We live on 9 acres with no utilities and for us this washer works well. We heat water on the wood stove and use a small inverter generator and then wash our clothes. The spinner takes some getting used to but works well. For best results we run the wash cycle , spin dry, and then a rinse cycle and another spin dry. 2 loads takes us just over an hour and clothes come out clean.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lloyd EvansLloyd Evans",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 19, 2023",
                "reviewTitle": "Not fully automatic, but works excellent for what it is.",
                "reviewText": "The unit requires purchase of a small piece of meshing for the filter. Open it up and place a piece in made to fit! I noticed a lot of complaints that it didn't catch any lint, but this did the trick for a purchase of under $5.00! Other than that, the unit is awesome, as I had an old 60's model way back when, and I liked that too! Yes it's not fully automatic, but you can reuse water if the load before wasn't that dirty. You also use less soap and fabric softener too. You can't obviously use boiling water as it's plastic, but you can use warm to hot water. Just use common sense. If it's too hot for your hand, then it's too hot for plastic. Then it works fine! It's also light enough to pick up, as I use mine in the bathtub. The pump and spinner also work great!!! I'm very happy!!!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61VP0E42AOL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61TW1KbRWfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711REZskuiL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna Ruckle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 24, 2022",
                "reviewTitle": "happy",
                "reviewText": "no complaint's happy i bought",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}