{
    "remaining_requests": 25473,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/LG-WM3555HVA-Stainless-Operation-TrueBalance/dp/B09KM76K7V",
    "body": {
        "name": "LG WM3555HVA 24 Inch Smart Front Load Washer/Dryer Combo with 2.4 cu.ft. Capacity, 14 Programs, 13 Wash Options, 8 Dry Cycles, TurboWash™, Allergiene™ Cycle, Sanitize Cycle, Steam Refresh",
        "price": "$1,349.00",
        "originalPrice": "$1,459.00",
        "rawPrice": 1349.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/LG-WM3555HVA-Stainless-Operation-TrueBalance/dp/B09KM76K7V",
        "soldBy": {
            "sellerID": "A1FCEOV950ARAM",
            "name": "Appliance Giant",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1FCEOV950ARAM&asin=B09KM76K7V&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "26",
        "stockDetail": "In stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Asya0s75L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41BiJtDwOqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tLhlCtoaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Bd6WfrI2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41FMeRiQ0wL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WjdHCb-RL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pB4QX2-kL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the LG Store",
            "link": "https://www.amazon.com/stores/LGElectronics/page/E8585304-4D77-4965-9D22-B5F2CF409E38?ref_=ast_bln"
        },
        "brand": "LGElectronics",
        "merchantInfo": "Appliance Giant",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 34,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 28 - March 8."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "2.4-Cu. Ft. Smart Wi-Fi-Enabled Compact Front-Load All-In-One Washer/Dryer Combo with Built-In Intelligence",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2619525011"
            },
            {
                "name": "Laundry Appliances",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18116194011"
            },
            {
                "name": "Washers & Dryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2383576011"
            },
            {
                "name": "Washers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=13397491"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎LG"
            },
            {
                "name": "Item Weight",
                "value": "161 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "22.5\"D x 24\"W x 33.5\"H"
            },
            {
                "name": "Capacity",
                "value": "2.4 Quarts"
            },
            {
                "name": "Part Number",
                "value": "‎WM3555HVA"
            },
            {
                "name": "Special Features",
                "value": "‎High Efficiency"
            },
            {
                "name": "Control Console",
                "value": "‎Touch"
            },
            {
                "name": "Option Cycles",
                "value": "14"
            },
            {
                "name": "Access Location",
                "value": "Front Load"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B09KM76K7V"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 34 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,003 in Appliances (See Top 100 in Appliances) #13 in Clothes Washing Machines"
            },
            {
                "name": "Date First Available",
                "value": "July 1, 2021"
            },
            {
                "name": "Brand",
                "value": "LG"
            },
            {
                "name": "Special Feature",
                "value": "High Efficiency"
            },
            {
                "name": "Cycle Options",
                "value": "Auto Dry"
            },
            {
                "name": "Controls Type",
                "value": "Touch"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHY54O77R4GH35Q6BPHVK2HEIF7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R344Q7LCAF3HMQ?ASIN=B09KM76K7V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Wonderful space saving washer combo",
                "reviewText": "We were given a phone call about 30 minutes after placing the order, to verify that we understood that we were getting one machine that could do both wash and dry, as well as to set up expectations on how and when my machine would be delivered. This alone I would recommend this purchase.Delivery was smooth and went as planned, the delivery company called about 3 days before delivery, and the driver called the morning of as well as about 1/2 hour out. Once the driver was here and we got the machine off the truck he did help cut the packaging open as it was damaged, so we verified the machine itself wasn't damaged. Which it wasn't just.We live in a 5th wheel toy hauler, so space is very limited. This machine fits perfectly in the space we have for it in our garage. This machine is not vented, so when its drying, the \"vented\" goes down the drain to the gray tank, and the lint is collected around the door and seal, which makes it easy to clean.Things to know is that with a unvented combo unit, your clothes are supposed to be slightly damp, take them out and give them a shake, this does 2 things, instantly dries and gets the wrinkles out. It does take about 3 or 4 hours to do a load of laundry that is from start to finish. So yes it does take a bit longer, but you don't have to remember to swap machines. I usually do 2 loads of laundry a day, one in the morning before leaving and one at night as we're going to bed. I come home to clean, dry clothes and wake up to clean, dry clothes. the loads do need to be smaller, but I can still wash a queen sheet set in one load, or 4 pairs of jeans or 2 heavy bath towels with a few hand towels.This is a normal 110 unit, so no special wiring or anything, just plug it in and connect the water and drain.I was surprised that this machine could connect to the internet, I haven't done it yet, I don't see a need for it, but it's great that I have that option. The manual was written in very good English, that was easy to read and understand, I don't know about the translations.I would recommend this machine if you are limited on space, water and time. It has lots of washing and drying features including steam and sanitize.",
                "reviewVotes": "42 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M.D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOKDYPIWWRRYKFT7GGVDA4ICJ2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13KRD7S4OQD2C?ASIN=B09KM76K7V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2023",
                "reviewTitle": "5.0 out of 5 stars This is one amazing, sophisticated machine.",
                "reviewText": "I agree it's good for smaller loads but it's obvious based on it's size. It's performance is amazing, washing quality is above what I expected. Drying....well it's an add-on feature and it does take longer but it works. Only issue I have is drying produces really high temperatures, much higher than regular dryer which can wreck havoc on synthetic items or elastics used in pants or even underwear. (Mostly only on lower quality items) When it comes to value, it's pricey. You can get a standard washer and dryer for much less, but I still believe it's worth the money due to its performance, options, quality of the product and effectiveness. This machine doesn't dance all over your kitchen or bathroom like many others do because it's well made, heavy and solid. I know I'm jumping around but as a conclusion this is far the best washing machine that fits like a dishwasher under the counter in your kitchen. Looks great and performs even better. Just watch out for the floor vibration during the spin cycle. If you're not in the basement or on cement slab you will feel it.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Inglis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHX5NLDI4NP4PAHJPWM63ICRQJ4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LTJ5650NS4E7?ASIN=B09KM76K7V",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2023",
                "reviewTitle": "3.0 out of 5 stars Unfortunate Smell",
                "reviewText": "We've had and been using this washer/dryer unit for a few months now. It has performed as expected in most ways, except for the smell. Every dry cycle causes the unit to make an awful burning rubber smell. After doing research online I found that this is not an uncommon occurrence and has to do with the material used as a gasket. When the material gets warm (ie in the dry cycle) it emits the smell and causes the cloths being dried to smell as well. The smell has become less pronounced with use and multiple bleach or vinegar cycles to clean the unit. However, after numerous uses the smell is still present.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Res",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQAIKI35TG7EL7WWJL6IV2YQ7SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJT300355JN04?ASIN=B09KM76K7V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice washer/dryer combo",
                "reviewText": "Fit perfectly in my washroom in my apartment. I have a 1 bedroom apartment and while there is a washer hookup, there is not enough space for a washer and dryer, and there is not a dryer vent connection. So, when I decided to purchase a washing machine I decided a ventless washer/dryer combo was the way to go, naturally. While there are a lot of options, most of them are no-name brands that seem sketchy and would have poor resale value. Something like this is nice because I could take it with me if I move, or I could sell it. Its small size is both a positive and a negative... It doesn't hold a lot of laundry. Also, since you typically have to tumble laundry to dry it, it states in the manual that if you wash a full load, you have to remove half the load to dry it, which means two separate dry cycles.There is one \"flaw\" with this machine. I was very excited that I could wash+dry my laundry in one go, so I wouldn't have to \"move\" the laundry. However, in order to run a low spin cycle, you cannot use a wash+dry combination cycle, you MUST wash first and THEN dry. To access the dry cycle, you simply hit dry without selecting a wash cycle. The controls are confusing and unintuitive compared to a standard washer+dryer and I had to read the manual to figure out how to use the thing. Now that I've done so and washed a few loads of laundry in the way that I normally will, I've gotten the washer to work as expected.There are a few downsides: 1) The ThinQ app is pointless, and running a dry only cycle counts as a cycle towards the tub clean counter, which means that since I have to run a separate wash and dry cycle, the tub clean counter is kinda pointless too! 2) Can't run wash+dry combo cycle to use low speed spin. Now, the neighbors haven't complained, because this building is over 100 years old and the floors are solid, but still, it makes me paranoid hearing my washer spin so loud, so low speed is a must, which means I have to attend to the washer. Not a big deal, but I thought I was gonna get away with no longer having to move laundry. 3) The small size of the unit means I can't really do large loads, but since I live alone that's not really a big deal. 4) It does take a while to wash and dry a load. To do some tshirts and underwear took about 4 hours, but at least I don't have to take my laundry upstairs to the laundry room anymore. Now, I can throw in a load and not worry so much.This unit has a lot of nice features for the price, and the cons and small size are really not a big deal in my case. I'm quite happy with my purchase, and look forward to clean laundry right from my own apartment.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josh Wobbles",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVBN7IPHU6D3NO4FT73WMYUJXRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R371PSZVCDPTUM?ASIN=B09KM76K7V",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "2.0 out of 5 stars Washes great.... And thats it....",
                "reviewText": "Could not get this to dry under any circumstances even loads as small as 1 pair of jeans and 1 t shirt. If i cannot even wash and dry a single days clothes in this then it has no business being sold at all....",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$1,395.00",
                "sellerName": "APPLIANCE SUPPLY",
                "sellerRating": "4.5"
            }
        ]
    }
}