{
    "remaining_requests": 25683,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/COSTWAY-Electric-Machines-Portable-Controller/dp/B074RDWS11",
    "body": {
        "name": "COSTWAY Portable Washing Machine, Twin Tub 20Lbs Capacity, Washer(12Lbs) and Spinner(8Lbs), Compact Laundry Machines Durable Design Energy Saving, Rotary Controller Drain Hose, Grey+White",
        "price": "$169.99",
        "originalPrice": "",
        "rawPrice": 169.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/COSTWAY-Electric-Machines-Portable-Controller/dp/B074RDWS11",
        "soldBy": {
            "sellerID": "A383G1P012K88F",
            "name": "costway",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A383G1P012K88F&asin=B074RDWS11&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ucJGncS0L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51FuQbfTIML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OROWDHGUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51w 37rOv9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 42cStldL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41eBvtYWXEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wG95BIglL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the COSTWAY Store",
            "link": "https://www.amazon.com/stores/COSTWAY/page/EA61CCE7-FF50-4C03-B232-585D5BA5DD91?ref_=ast_bln"
        },
        "brand": "COSTWAY",
        "merchantInfo": "costway",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 1473,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 21 hrs 15 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "💦【Twin Tub Design】You can operate washer or spinner separately, and you can also run two sides on the same time. The two tub design can meet your different needs, which makes the washing more easy and convenient.",
            "💦【Effective Performance】With 260W washing power and 140W spinner power, this washing machine works highly efficiently. And the large capacity of 12 lbs per wash and 8 lbs per spin helps to support your busy life.",
            "💦【Separate Time Setting】This washing machine has separate timer control settings for washer and spinner operations: 15 minutes for washing and 5 minutes for spinning. You can set the time according to the amount of your clothes, and it can help you save much energy and time.",
            "💦【Compact & Portable Washer】This twin tub washing machine is portable and compact. It is perfect for your limited space such as dorms, apartments, condos, motor homes, RV's, camping and more. And the light weight makes it easy for moving.",
            "💦【Shipping & Customer service】UPS or USPS will deliver the item to your house in 3-6 business days after you placed an order. We packed the item as good as we can, if there is any damaged part, please contact us first and offer us pictures of damaged part, we will solve the problem as the way you want(discount or replacement)."
        ],
        "description": "COSTWAY WASHING MACHINE Effective Performance With 260W washing power and 140W spinner power, this washing machine works highly efficiently. And the large capacity of 12 lbs per wash and 8 lbs per spin helps to support your busy life. Practical Design With mini and compact design, our washing machine can save much space and it is ideal for your dorms, apartments, condos, motor homes, RV's, camping and more. Besides, its light weight determines that it is perfect for you to transport in traveling.",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b?ie=UTF8&node=2619525011"
            },
            {
                "name": "Laundry Appliances",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18116194011"
            },
            {
                "name": "Washers & Dryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=2383576011"
            },
            {
                "name": "Portable Washers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=9709422011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "25 x 15 x 28.5 inches"
            },
            {
                "name": "Item Weight",
                "value": "26.4 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "COSTWAY"
            },
            {
                "name": "ASIN",
                "value": "B074RDWS11"
            },
            {
                "name": "Item model number",
                "value": "23103-CYWH"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 1,473 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,334 in Appliances (See Top 100 in Appliances) #176 in Portable Clothes Washing Machines"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Finish types",
                "value": "ABS"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Drain Hose, Draining Basket, Inlet"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "COSTWAY WASHING MACHINE Effective Performance With 260W washing power and 140W spinner power, this washing machine works highly efficiently. And the large capacity of 12 lbs per wash and 8 lbs per spin helps to support your busy life. Practical Design With mini and compact design, our washing machine can save much space and it is ideal for your dorms, apartments, condos, motor homes, RV's, camping and more. Besides, its light weight determines that it is perfect for you to transport in traveling. Specification Color: Gray and White Material: ABS+ PP Net Weight: 29 Lbs Wash Capacity: 12Lbs, Spin Capacity: 8Lbs Length of inlet pipe: 44.5\" Length of drain pipe: 20.5\" Dimension: 25\"L×15\" D×28.5\" H Package Include:1 x washing machine",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A383G1P012K88F/8d774fa5-3d84-43b0-99b9-954a8f98a612._CR0,0,300,300_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Washing Machine Feature Top load twin tub compact designSeparate timer control settings for wash and spin operationsOur machine features a drainage tube which allows you to easily drain out dirty waterWhen you turn on the water you have to stay by the washer to watch it because it does not stop filling with water by itselfEasy to operate, and powerful allows you to simply put in your load of clothes, fill with water, set the timer and start washing",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A383G1P012K88F/041db652-cbe3-437a-80bb-c90e6da5fd02._CR0,0,300,300_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Twin Tub Design You can operate washer or spinner separately, and you can also run two sides on the same time. The two tub design can meet your different needs, which makes the washing more easy and convenient. Separate Time Setting This washing machine has separate timer control settings for washer and spinner operations: 15 minutes for washing and 5 minutes for spinning. You can set the time according to the amount of your clothes, and it can help you save much energy and time. Compact & Portable Washing machine This twin tub washing machine is portable and compact. It is perfect for your limited space such as dorms, apartments, condos, motor homes, RV's, camping and more. And the light weight makes it easy for moving.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/a879dc27-26e0-4b44-85a3-b2d7dc641067.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A383G1P012K88F/727671d3-bf92-4c39-9626-4b3e63db88ee._CR0,0,300,300_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A383G1P012K88F/36003d0d-d022-43b7-8f52-4e32e67fe1a7._CR0,0,300,300_PT0_SX300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4001acd6-f8d1-4bec-83fc-98fa13768c1d.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A383G1P012K88F/abb7d9db-e449-47c6-960f-c78b36ffc158._CR0,0,970,600_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/902acc26-8008-4afb-8abc-5a4e99e10c91.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A383G1P012K88F/8d774fa5-3d84-43b0-99b9-954a8f98a612._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A383G1P012K88F/041db652-cbe3-437a-80bb-c90e6da5fd02._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/a879dc27-26e0-4b44-85a3-b2d7dc641067.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A383G1P012K88F/727671d3-bf92-4c39-9626-4b3e63db88ee._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A383G1P012K88F/36003d0d-d022-43b7-8f52-4e32e67fe1a7._CR0,0,300,300_PT0_SX300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sarah Willow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH662NLAZXWMH2266WSG6LZFZO4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35J9TAITW7PQT?ASIN=B074RDWS11",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 25, 2021",
                "reviewTitle": "5.0 out of 5 stars Small but very impressive",
                "reviewText": "Smaller than I thought, lighter than I imagined (I'm 5'6 and I can carry this thing myself) and more power than you'd think. It does take quite a bit of time to wash a small basket of clothes. Took me 6 hours, 1 hr per load. You can only wash maybe 3 pairs of jeans (depending on size) at a time. I haven't tried to wash bath towels yet. The spin side is small, only one pair of jeans can fit in it. Towels may be too heavy to spin. But it will spin your clothes pretty dry. Very impressive.On YouTube there are videos of people living in tiny homes and in one, 15 gallons of water was used to wash. I'm not sure what the standard full size washer uses, but 15 gallons seemed like a lot. I live in an apartment, so I don't pay for the water usage only electricity. So I can't say, for now, how much of a money saver this is. I will say, I would get $100 in quarters to use the communal washer/dryer area a month. Hoping this will cost less.I use the washer in my bath tub. Because of the vibration of the spin cycle, I've had to place the washer on a towel to prevent it from sliding in the tub. The washer is fairly quiet when in use, but you can still hear it. You should be able to do a load of laundry without interrupting one's sleep if you needed to. Especially if it's in a bathroom and you can close the door.The draining is souly based on gravity. So make sure the draining tube is low enough to drain the water properly. Once I'm finished, I keep the doors open to allow the unit to dry once it has completely drained. Also, clean the tub floor when you're done doing laundry. It will be very slippery for the next person taking a shower. Let's not fall, shall we?If you have a big and tall enough cabinet, you can possibly fit this thing right in it. I have mine in a bedroom closet. Takes up no more room than one large peice of luggage.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matthew Morales",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZKALUMFK4XCE6S6263ZXCXP6MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27MZKTRF08G96?ASIN=B074RDWS11",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing for the price",
                "reviewText": "This works great. I was a little skeptical of ordering this as I was not sure if it would work as I thought it would. But I am glad I made the purchase, as it works better than I could have ever thought. Loads don’t take to long to do and a couple cycles of the dryer make everything practically almost dry. I would buy this again as it’s a life saver for saving money!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Den 10 ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2R2LHOOJKBK46NIFPYCALK4YCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DNRKGX2DOZ14?ASIN=B074RDWS11",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Great washer",
                "reviewText": "Worth the money easy to use and it washes well and the spinner almost dries the clothes I would recommend this washer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lauren T",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFA3USFQ3L5YA3DSG4TFOEZZJ5KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QWLR6HC4KCWI?ASIN=B074RDWS11",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "4.0 out of 5 stars Huge convenience for a busy person",
                "reviewText": "I bought this because going to the laundromat began to become a real difficulty due to my long work schedule. I wasn’t sure how it would fare or if it would consume a lot of water but I have been pleasantly surprised and very satisfied. I found a YouTube video online which convinced me to use this in my stand up shower so I could use the shower hose to fill the washer and allow it to drain easily. I fill it with a small amount of detergent and scent beads once full. And then the clothes go in. The reviewer recommended 3 minutes for the wash and that has usually been sufficient although I’ve drained it after seeing dirty water and then filled it again/added soap and did another wash. She makes a great point to rinse the clothes with the shower head or hose once you drain the wash. You can just spray the water on the clothes in the washer while on drain, and then stop when the water that’s draining has no suds.The spinner works great and also only needs 3 minutes to get most of the wetness out. It does a great job but I’ve had to do a few spinner loads when I do a normal wash size. The spinner is much smaller than the washer, and you don’t want to stuff it with too many clothes. But again, it does the job and is very quick. As a time saver, start the second batch in the spinner while hanging the first batch on your drying rack. as long as this holds up for a while, I would recommend to this who have use for it. Try the shower method if possible so you don’t need to deal with any tubes or faucets. It is light so it’s easy to move in and out of the bathroom.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCA3D2WRVI7ER4DF2O6G5EOEYGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WQKYO2PXOKPN?ASIN=B074RDWS11",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 26, 2018",
                "reviewTitle": "1.0 out of 5 stars Disappointing quality and customer service",
                "reviewText": "Let me start by stating I was once in love with this washer. Raved about it to all my friends and family until recently. The original washer I purchased worked for a some amount of time and them the spin side started to break. It wouldn't dry my clothes at all and made a horrible hissing noise every time I had to use it. So I contacted the company and they sent me a replacement. That replacement arrived and I was able to use it for some time until the washer side COMPLETELY cut up my boyfriends favorite T-shirt. Upset with the washer and now my boyfriend upset with me, I decided to contact the company once again to see what could be done. They were apologetic and sent me a refund and a brand new washer I received about 3 weeks ago. It was working fine until a few days ago. I decided to do a bunch of wash so I filled up the washer with water, detergent and my clothes. Upon turning the knob to turn on the machine I was extremely upset to notice that the wash side on this brand new washer is FUNCTIONLESS! It doesn't spin now! I had to hand ring out the soap and water for my clothes. Needless to say the bathroom was a mess and I had hand wash my clothes because the brand new washer this company sent broke after a few uses. I would recommend spending your money elsewhere. It is what I am going to do for now on !Message to company:I’m very sorry but I think that is very poor service. You sent me a refund, which I’ve used on 2 occasions to purchase 2 brand new washer from your company with the hopes that I would get a washer that actually works and isn’t broken. Also, you mentioned that I should buy a washing machine in my local store. I live in an apartment and can’t purchase my own washer due to living on top of a business that doesn’t allow us to utilize our own washer system. That’s why I stumbled upon your washer with the hopes that it would work for a significant amount of time without having any type of dysfunctions. One “exchanged” washer the spin stopped working and the wash side ripped my boyfriends sentimental T-shirt that he will never be able to replace. The other one you just sent me 3 weeks ago to replace the washer that ripped my boyfriends shirt, the wash side doesn’t even work now? I filled the washer with the water, detergent and clothes to find that the wash side is COMPLETELY functionless. I had to drain and individually squeeze out all the water and detergent from my now drenched clothes and there is nothing you can do ? I’m not asking for a refund, I’m asking for a washer that actually works.Company: \"Hello,Thanks for your message.We are sincerely sorry for the inconvenience that brings to you.As for the order, we have refunded full money to your original payment account.Have you received it?If you still need a washing machine, you can buy one in your locals.If you have any questions, please contact us freely.\"",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 31, 2023",
                "reviewTitle": "It is heavier than I expected so .......",
                "reviewText": "This review is for the Mini Portable Compact Twin Tub 16lbs washing machine. I was planning to lift the washing machine and put it on my bathtub, but it is heavier than I expected, so I putted the machine on a flat dolly roller with wheels and now I have no problems moving it around. And the little filter box does not seem to work.I like my machine; it does a good job so far.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Taha Mrini",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 13, 2023",
                "reviewTitle": "Super efficace",
                "reviewText": "Rapide et efficace, offre un super lavage!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claude D.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 4, 2023",
                "reviewTitle": "Fonctionne très bien",
                "reviewText": "Pour le camping excellent",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Costway ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 7, 2023",
                "reviewTitle": "When receiving My refund after Returned item?",
                "reviewText": "A zero as very cheap looking n paid Way to much for n also still waiting for My Refund from Costway. When contact them there is no answer???",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 3, 2019",
                "reviewTitle": "Compact and hard working little machine, worth every penny!",
                "reviewText": "Great little machine that works hard! It fits in my RV shower for storage and is light enough for me to lift right out without stress. I've used it a few times already and love it! No longer will it be an issue for me to find a place to wash my clothes while holidaying. Who wants to sit in a laundromat on holidays? The spin dryer does actually spin it nearly dry. I have an attachable clothes dryer on the outside of my RV and it's perfect with this little powerhouse!",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}