{
    "remaining_requests": 25766,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Giantex-Portable-Capacity-Semi-automatic-Apartment/dp/B09MM7BH9P",
    "body": {
        "name": "Giantex GX24977-PE, Mini Washer and Spinner Combo, 5.5lbs Capacity, Semi-automatic Compact Laundry Apartment Dorm RV Portable Washing Machine",
        "price": "$89.99",
        "originalPrice": "",
        "rawPrice": 89.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Giantex-Portable-Capacity-Semi-automatic-Apartment/dp/B09MM7BH9P",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CGF1N77F"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/316LjAEZRZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/514HYKFlY5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51h1YyqIYDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/516xYHZ6uIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41b6opVt6XL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51d1hiaX0nL.jpg",
            "https://m.media-amazon.com/images/I/51fIX2bY8mL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/006d979f-7e7e-4987-81ff-ad33639f1375/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Giantex Store",
            "link": "https://www.amazon.com/stores/Giantex/page/5CAD1B16-908A-413E-8AEB-967B2F140721?ref_=ast_bln"
        },
        "brand": "Giantex",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 2037,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 8 hrs 29 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "『2 in-1 Function with Single Tub』: Featuring a single tub design, the washing machine combines spinning function and washing function into one for saving energy. Smart 2-in-1 design can well suit your various laundry needs and help you get the job done more efficiently.",
            "『Sufficient Washing Capacity & Powerful Motor』: There is 5.5lbs washing capacity to facilitate laundry for household use, which can accommodate a variety of clothes at one time. 170W powerful motor meets the performance requirements for daily use. A powerful turbine offers high-efficient swirl washing to your clothes and save time as well.",
            "『Easy Operation & Drainage』: The washing machine comes with 10 minutes washing time and 5 minutes spinning time which are operated by rotating control timer. Just simply put in your dirty clothes, then fill with water, and set the timer, finally start washing. The drain hose is available to empty the water directly after washing so as to keep your floor clean.",
            "『Compact & Lightweight Laundry Washer』: With the compact size of 14” x 13.5” x 20”, this washing machine is an ideal choice for limited space, such as apartment, dormitory and RV’s etc. Moreover, the whole machine weighs only 11lbs, making it easier to transport anywhere as needed.",
            "『Various Kinds of Intimate Details』: The translucent washer lid allows you to check the process of clothes at any time. Durable plastic material prevents the washing machine from rusting in wet environment. Non-slip foot pads enhance stability on uneven ground. Moreover, there is no installation need."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2619525011"
            },
            {
                "name": "Laundry Appliances",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18116194011"
            },
            {
                "name": "Washers & Dryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2383576011"
            },
            {
                "name": "Portable Washers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=9709422011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎Giantex"
            },
            {
                "name": "Model Info",
                "value": "‎GX24977-PE"
            },
            {
                "name": "Item Weight",
                "value": "11 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "14\"D x 13.5\"W x 20\"H"
            },
            {
                "name": "Country of Origin",
                "value": "‎USA"
            },
            {
                "name": "Item model number",
                "value": "‎GX24977-PE"
            },
            {
                "name": "Efficiency",
                "value": "‎Energy Efficiency"
            },
            {
                "name": "Capacity",
                "value": "5.5 Pounds"
            },
            {
                "name": "Installation Type",
                "value": "‎Freestanding"
            },
            {
                "name": "Part Number",
                "value": "‎GX24977-PE"
            },
            {
                "name": "Special Features",
                "value": "‎Semi-automatic"
            },
            {
                "name": "Control Console",
                "value": "‎Knob"
            },
            {
                "name": "Access Location",
                "value": "Top Load"
            },
            {
                "name": "Voltage",
                "value": "‎110 Volts"
            },
            {
                "name": "Material Type",
                "value": "‎Plastic"
            },
            {
                "name": "Included Components",
                "value": "‎Drain Hose, Manual"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B09MM7BH9P"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 2,037 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#98 in Appliances (See Top 100 in Appliances) #12 in Portable Clothes Washing Machines"
            },
            {
                "name": "Date First Available",
                "value": "November 26, 2021"
            },
            {
                "name": "Brand",
                "value": "Giantex"
            },
            {
                "name": "Special Feature",
                "value": "Semi-automatic"
            },
            {
                "name": "Cycle Options",
                "value": "Spin, Drain"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Controls Type",
                "value": "Knob"
            },
            {
                "name": "Operation Mode",
                "value": "Semi Automatic"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Mini Portable Washing Machine Helps You Wash Clothes Clean and Fast. Our mini washing machine is a perfect solution to do laundry in limited space. The smart combination of washing and drying function allows your washing more convenient and less energy consumption. 170W washing power makes clothes swirl for a thorough and high-efficient washing. The washing machine features a compact size yet sufficient washing capacity to satisfy different laundry needs, which is suitable for home, apartment, dormitory, etc. With the weight of 11lbs, it is convenient to carry around. Owning our washing machine means convenient and upgraded washing experience.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ffc8853-4610-4292-a6e4-a0e7bc18f8fd.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "2-in-1 Single Tub Washing Machine Helps You Save Much Effort and Time.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a1abd9b1-7093-49a1-a452-6d9db1774cfb.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Perfectly Suitable for Apartment, Dorm, RV Camping & Laundry Room.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29fd68f2-7885-48fc-8f34-521f717e6761.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Why You Choose Our Washing Machine? √This practical washing machine is suitable for dormitories, apartments,etc. √Smart 2-in-1 design makes it to be used as a washing machine. Features: Both can be used as a washing machine and dryer5.5lbs washing capacity satisfies basic laundry needsPowerful motor enhances washing and drying performanceSet the time of washing and spinning by control timerDrainage hose is convenient to drain out dirty waterPortable handle on either side for easy transportationCompact size is suitable for dormitory, apartment, RV’s, etcDurable plastic material ensures long service lifeClear lid makes it easy to view the progress of the laundryNon-slip foot pads protect the floor from scratchesNo assembly required",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/62aac8f3-95cf-4d4e-b8b8-a9ce9cbeff3f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Specification of Mini Washing Machine Blue, White Color 14\" x 13.5\" x 20\"(L x W x H) Overall Dimension 110V/60HZ Voltage 170W Rated Input Power of Washing 5.5lbs Washing Capacity 11lbs Net Weight 1Washing Machine,1xInstruction Package Includes",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ffc8853-4610-4292-a6e4-a0e7bc18f8fd.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e6823fa3-7d8a-497f-a517-067182875bb4.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a1abd9b1-7093-49a1-a452-6d9db1774cfb.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29fd68f2-7885-48fc-8f34-521f717e6761.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/62aac8f3-95cf-4d4e-b8b8-a9ce9cbeff3f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4c31edde-e9b5-4c26-b977-89b634a8f24c.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Charlie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVXZGR747Z4H75E3XWFQXMTDUMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SIBZCDO1L2NZ?ASIN=B09MM7BH9P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 9, 2017",
                "reviewTitle": "5.0 out of 5 stars Impressive",
                "reviewText": "On the positive side -It does a very good job washing. It works like most top loaders and sloshes the clothes around in the soapy water, activating the surfactants in the detergent to remove dirt. You can see the dirty water coming out in the drain. If you have never seen that before, it will surprise you.It is bigger than I thought. I put in the water first - about 2/3 to 3/4 and added the soap and the Calgon. I am in a place with unfiltered hard well water so I have to buy good detergent and the water softener like Calgon or washing soda. You don't need that if you have city water or soft water.I then did a load with 3 tank tops, 2 t-shirts, 1 pair shorts, 5 days of underwear and bras (all adult large clothing).After that I tried a load with 3 pairs of sweat pants and 3 t-shirts (all adult small). I might leave out one T-shirt next time, but it was pretty good.I set the wash for 6 minutes, let it soak for a couple minutes, and then set it for 6 more minutes to handle really dirty stuff. It worked very well and the wash water was really dirty.I then filled with cold, did a 3-minute run for rinse, and drained out that water. The soap washed away and the water did not seem dirty.The drain is gravity fed, so I put the unit outside my shower and ran the drain hose over the lip. It did not drain completely out each time, because of the bump to get over the lip of the shower. At the end of each drain, I just lifted the unit up for a few seconds, using the side handles and it drained right out. Long term, I might get a board to put under it to raise it up over the lip.The next part was the part that surprised me. I left the cold water running into the tank and rinsed each piece under it, then squeezed it out and put it in the spinner. You can only do 1 pants and 1 shirt at a time in the spinner, so you have 2-3 spins per wash load. The spinner actually did a very good job spinning the clothes to not be drippy wet, and I only ran it for 2 minutes each time. As a test, I took the whole load and I put it into one of the big Nina Soft Spin dryers to see how much more I could get out. I got almost a cup of water (7oz) out of the full load of 3 pants and 3 shirts after running it for about 6 minutes. So, yes, the big spinner does get more out, but the little spinner was still pretty impressive. All the notes about balancing it are true, so I will not rehash those. Do it right, and it works right.A lot of people complain about the hose. It is flimsy and short and I never used it. I have one of those old little green spiral water hoses (not the fabric ones, the hard plastic spiral hoses) that fit right in the slot. It was already cut in the middle due to a hole in it. I put one end on my faucet aerator adapter I got at the hardware store, and pressed the other end (just the cut end of the green hose with no fitting) into the water inlet slot. It worked perfectly, with the exception that I lost the use of the bathroom faucet while doing laundry. You can always just use a pitcher or a bucket to put in the water, but plan to spend a few dollars to make something that works for you.The negative-My only complaint is that I did not pay attention to the size of it. I saw the videos and people saying they used it in their campers and such. They must have big campers. I thought I would put it on my kitchen counter and there is no way it fits there. The dimensions given on some sites were incorrect, and others were correct. I just had not pictured in my head very well what 25\" tall and 25\" wide look like. That is my mistake, not a problem of the product.",
                "reviewVotes": "52 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Real Deal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7Z57LXPIPMXRIFXY6673V6HTDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VHD2V35IDU2P?ASIN=B09MM7BH9P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Convenient and Compact Laundry Solution",
                "reviewText": "The Giantex 16lbs Portable Mini Washing Machine has been a lifesaver for my laundry needs. This compact and efficient washer offers a convenient and space-saving solution, making it ideal for dorms, apartments, RVs, and even camping trips.One of the standout features of this mini washing machine is its twin tub design. The separate washing and spinning tubs allow me to wash and rinse my clothes simultaneously, saving time and effort.The 16lbs capacity is impressive for a mini washer, accommodating a decent load of laundry, making it suitable for small households or individuals with limited laundry needs.The gravity drain feature is incredibly convenient, allowing me to drain the water easily without the need for a complex plumbing setup.The compact size and lightweight design of the Giantex Portable Mini Washing Machine make it easy to move and store, perfect for small living spaces or on-the-go use.I appreciate the simplicity of the control panel, making it easy to operate even for those who are not tech-savvy.The washer's performance is efficient, effectively cleaning my clothes and removing stains without causing any damage.The noise level is surprisingly low, ensuring a peaceful laundry experience without disturbing others nearby.I've found this mini washing machine to be a game-changer for my camping trips, allowing me to do laundry on the go and keep my clothes fresh and clean.In conclusion, the washing machine is a must-have for anyone seeking a compact and efficient laundry solution. With its twin tub design, gravity drain, and user-friendly operation, it offers a reliable and practical way to do laundry in small living spaces or during outdoor adventures. If you're looking to simplify your laundry routine and have the convenience of a washing machine wherever you go, I highly recommend the machine. Embrace the convenience and efficiency it offers and experience the ease and effectiveness of this exceptional mini washer in your daily laundry endeavors.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Canadian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 18, 2020",
                "reviewTitle": "Just what I needed.",
                "reviewText": "Pro Tip: After your very first wash and drain, make sure you switch back from drain before refilling wash tub again ;)Excellent. I live in a cozy apartment. There are laundry facilities, however in these times of physical distancing and neutronic hygiene, like that I can completely control this (well much more than sharing washer/dryer in a building).It works good so far. All reviews noting the 'stunted' hoses are 100% correct. Nothing fancy, but I can see, if the fit permits - they will do the job. Otherwise, really? This isn't a big deal in my opinion because if you're setup with it in the bathtub when doing laundry and have a bucket at your disposition, simply fill that. You can fill the Giantex Wash basin much quicker that way and therefore I find more practical to use the product this way. But, as has been noted, it certainly will work connected with hoses firmly to a water source. Optionally if you have a hose on from a water source you can just fill it that way too, either holding and aiming it into the Giantex wash basin OR just sitting the end of the hose into the wash basin to allow filling.As for quality. Clothes clean. Need approximately 1/6th the amount of detergent compared to normal. Fantastic.Spinner - works great. From having experience wringing out clothes in the bathtub, this thing is wonderfully superior than that. I've stepped out of the dark ages and into the light. Already 'euro' adjusted, I use a clothes rack and no drip. Beautiful.Some more tips. The spinner needs to be coaxed into use. Google some video reviews, one lady outdoors using a garden hose to fill it speaks of *this. Be patient, she's spot on. Great tip/find.(*Otherwise, the Giantex will be rocking your bathtub and your neighbors to hell. Maybe you might want to do that... .;)Noise? Seriously, I don't get it. I know my neighbor has one and it makes LOTS of noise in comparison. I cannot speak about it though without more knowledge than the noise, but the Giantex is not noisy at all. When loading the spinner from a _full_ washer, you _must/should_ 'dumb down' the load, maybe split it or 'thrice it'.If you're still reading up to hear, fantastic. One last PRO TIP. If you have a huge pot/cauldron - something to boil a big thing of water with, you can also fill the washer with that and have an ultra hot wash done on your clothes. Word of caution here, not endorsing this because we don't want people ending up in the ICU with scalded feet...Still reading? Add a drop of white vinegar to your wash.JK",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joel Herrington",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 22, 2021",
                "reviewTitle": "Works great, as long as it stays working",
                "reviewText": "Arrived 2 days before estimated delivery window. So far very happy with the results it produces, it's absolutely perfect for my bachelor pad. I've seen other reviews mention it breaking down after a couple months use so if that should happen I will update my review, but so far so good. One more thing, your order may come with a slip telling you to download the app to spin the wheel for cashback anywhere between 5 and 200 dollars. Dont bother, it's a scam to get your email/info.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas E. Erskine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 29, 2020",
                "reviewTitle": "things you need to know",
                "reviewText": "Update: we bought it in April. It's only been used for light, small stuff and treaded carefully. The \"dehydrator\" is broken now. It'd probably take a month or more to get another one, ignoring the cost.Just not worth it. It works great. It washes well and the clothes come out of the \"dehydrator\" just damp.The issues are mostly information which is missing.- the electrical cord is short. You'll have to decide for yourself if you are comfortable using an extension cord.- remember to switch to \"drain\" mode when you are running the \"dehydrator\" (the spinner) or the water will build up inside and it won't \"dehydrate\"- if you balance the clothes in the dehydrator, it won't make much noise and will take most of the water out, more than I can wring out by hand- only put in enough water to cover the clothes in the washer- don't over-fill. It won't work and it will wear it out according to other reportsWe put it in the bathtub on a boot tray (https://www.amazon.ca/SafetyCare-Flexible-Rubber-Multi-Purpose-Garden/dp/B017JGAPQQ/ref=pd_yo_rr_rp_2/132-2597551-0663603?_encoding=UTF8&pd_rd_i=B017JGAPQQ&pd_rd_r=3f75eac3-74af-4b02-8c25-05d5b1376e06&pd_rd_w=JvFVL&pd_rd_wg=uu9m9&pf_rd_p=7c9c5993-bcdc-433f-87eb-0125a90eb665&pf_rd_r=R0A38WHBCKRDJP215Z1T&psc=1&refRID=R0A38WHBCKRDJP215Z1T) which reduces the noise and protects the tub and keeps it from moving around. That package has two trays, so the other is kept in the other room and protects the floor from drips.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Toya M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 1, 2020",
                "reviewTitle": "Money saving washer",
                "reviewText": "Great washer and convenient to use UPDATE: It's been a year and a month now since I bought this washer. Still works great, I use it for baby clothes, my clothes, sheets, towels, delicates etc. After I put my clothes in the spin dryer I throw them into my portable dryer to dry them completely. This washer is a money saver. The only con I'd say about it is the spin dryer makes a loud noise sometimes and causes it to vibrate alot, I use a rubber mat in my tub which lowers the sound and stops movement of the washer. Other than that it's still kickin after a year of using it every week :)",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samantha Jardine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 12, 2021",
                "reviewTitle": "Dope",
                "reviewText": "I love this thing. Super easy to figure out how to use. I put it in the bathtub when I'm using it - that way I can use my shower head to fill it and drain it right in the tub. I hold it down when the spinner is going just cause my bathtub is rounded and it can vibrate pretty loudly if it rocks back and forth.My only recommendation is to only put 1/2 of the clothes that you washed into the spinner at a time. It's smaller than the washer is and becomes unbalanced if you put too much in (also you don't want to overwork and burn out the motor). The spinner works super well - really dries out the clothes (~85% I'd say).",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$99.99",
                "sellerName": "Giantex",
                "sellerRating": "4.5"
            }
        ]
    }
}