{
    "remaining_requests": 25483,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/LogarM%C3%A9xico-Portable-Washing-Machine-6-5L/dp/B0CD161M5P",
    "body": {
        "name": "Portable Washing Machine 6.5L - Mini Washing Machine - Small Washing Machine - Mini Washer Machine - Foldable Washing Machine - Portable Washer Machine -(Green)- 2 Foldable Hangers",
        "price": "$79.99",
        "originalPrice": "$79.99",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/LogarM%C3%A9xico-Portable-Washing-Machine-6-5L/dp/B0CD161M5P",
        "soldBy": {
            "sellerID": "AKLIWTJ70JNV6",
            "name": "LogarMexico",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AKLIWTJ70JNV6&asin=B0CD161M5P&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31tCSQNf9SL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/415PUmTPFLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31CqUiN3YEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hnCdWITjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Uez4Em6OL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31CRTDCFisL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YZu8E4LGL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: LogarMéxico",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=LogarM%C3%A9xico"
        },
        "brand": "LogarMéxico",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 17,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 17 hrs 21 mins",
            "FREE delivery Friday, February 23"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Tired of spending hours on laundry every week? Introducing the LogarMéxico Mini Clothes Washer Machine, your ultimate laundry companion that will bring peace and convenience to your life. Say goodbye to bulky traditional washing machines and hello to this mini washing machine foldable wonder. Imagine the freedom of doing laundry anywhere, anytime! Whether you're a frequent traveler, a busy parent, or living in a small space, this portable wash machine is here to simplify your laundry routine and give you back precious moments to enjoy the things you love.",
            "Experience the joy of effortless laundry with our LogarMéxico Portable Folding Washing Machine. Crafted with top-notch materials, this portable washing machine foldable design ensures durability and long-lasting performance. Its innovative collapsible washing machine feature allows you to store it away when not in use, making it an ideal space-saving solution. Invest in the future of laundry convenience with our mexican \"lavadoras portatiles mini\" and experience the difference for yourself.",
            "Once upon a time, a young mother found herself drowning in a sea of laundry. Burdened with endless piles of baby clothes and delicate fabrics, she yearned for a magic solution to make her life easier. That's when she discovered the LogarMéxico Baby Washing Machine. From that moment on, laundry day became a breeze, and she cherished more moments with her little ones. Now, this innovative mini washer can be a part of your story too, providing the same peace and ease for your family's laundry needs.",
            "Tired of lugging heavy laundry bags to distant laundry rooms or laundromats? Isn't it time to take control of your laundry destiny? Say hello to the game-changing Portable Laundry solution! Why struggle with traditional washing machines when you can have the convenience of a portable washing machine foldable and compact enough to fit in your closet? Don't wait another day for cleaner clothes and stress-free laundry. Embrace the freedom of portable washing with our mini clothes washer machine.",
            "Underwear washing machine, the unsung hero of your laundry routine. Imagine never worrying about hand-washing your delicate undergarments again! This portable laundry companion is gentle yet effective, ensuring that your most intimate clothing receives the care it deserves. No more stress or tedious tasks – embrace the convenience of the portable folding washing machine and treat your underwear with the love it deserves.",
            "Don't let laundry become a burden; make it an effortless task with our Mini Clothes Washer Machine. This portable washing machine foldable design is crafted with you in mind, offering a simple and efficient solution for your laundry needs. Whether you're a busy professional, a student, or simply have limited space, this collapsible washing machine will be your go-to appliance. Invest in the future of laundry convenience and welcome the portable washing machine foldable into your home today! With its foldable washing machine feature, storing it away when not in use becomes a breeze, saving you valuable space and ensuring a clutter-free environment.",
            "Our Mini Portable Washing Machine has 3 modes of use, standard wash, soft wash, and drain. The standard wash will work for thicker or dirty clothes that need longer washing time. The gentle wash will work for smaller clothing such as socks and underwear or for smaller loads of clothing less than or equal to 2 pounds. Finally, the drain mode will be useful to remove excess water from your clothes.",
            "HOW TO USE 1) To start using your Mini Washing Machine Portable, press and hold the \"Switch\" button for 2 seconds to start the machine. A beep will sound at the same time. 2) Click once to switch the sync mode between the 3 modes. 3) The bell will ring once and the machine will start working. The disinfection lamp will always be on. 4) When your Mini Portable Washer Machine finishes washing or draining, the machine turns off and will beep 3 times and the disinfection lamp turns off. NOTE: If you are using the standard wash or the soft wash, you must remove the included drain basket. This is only used for drain mode."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b?ie=UTF8&node=2619525011"
            },
            {
                "name": "Laundry Appliances",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18116194011"
            },
            {
                "name": "Washers & Dryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=2383576011"
            },
            {
                "name": "Portable Washers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=9709422011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎LogarMéxico"
            },
            {
                "name": "Model Info",
                "value": "‎X09"
            },
            {
                "name": "Item Weight",
                "value": "3.9 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "12\"D x 12\"W x 9\"H"
            },
            {
                "name": "Country of Origin",
                "value": "‎Mexico"
            },
            {
                "name": "Item model number",
                "value": "‎X09"
            },
            {
                "name": "Efficiency",
                "value": "‎A+"
            },
            {
                "name": "Capacity",
                "value": "6.49 Liters"
            },
            {
                "name": "Max Spin Speed",
                "value": "‎300 RPM"
            },
            {
                "name": "Noise",
                "value": "‎30 dB"
            },
            {
                "name": "Installation Type",
                "value": "‎No installation"
            },
            {
                "name": "Special Features",
                "value": "‎Portable, Time Remaining Display, Foldable, 2 Foldable Hangers Included"
            },
            {
                "name": "Color",
                "value": "Light Green with Modern Gray accents"
            },
            {
                "name": "Control Console",
                "value": "‎Touch"
            },
            {
                "name": "Standard Cycles",
                "value": "‎300"
            },
            {
                "name": "Access Location",
                "value": "Top Load"
            },
            {
                "name": "Voltage",
                "value": "‎12 Volts"
            },
            {
                "name": "Material Type",
                "value": "‎Silicone, Plastic"
            },
            {
                "name": "Included Components",
                "value": "‎1 Cover, 1 Power Cord, 2 Foldable Hangers, 1 Portable Washing Machine"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B0CD161M5P"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 17 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,817 in Appliances (See Top 100 in Appliances) #1,090 in Portable Clothes Washing Machines"
            },
            {
                "name": "Date First Available",
                "value": "September 25, 2023"
            },
            {
                "name": "Brand",
                "value": "LogarMéxico"
            },
            {
                "name": "Special Feature",
                "value": "Portable, Time Remaining Display, Foldable, 2 Foldable Hangers Included"
            },
            {
                "name": "Cycle Options",
                "value": "Delicates, Drain, Normal"
            },
            {
                "name": "Material",
                "value": "Silicone, Plastic"
            },
            {
                "name": "Controls Type",
                "value": "Touch"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "What can you wash with your Mini Washing Machine? Baby's Clothing You can wash up to 3 pieces in one load Pet's Clothing You can wash up to 3 pieces in one load Socks You can wash up to 10 pieces in one load Underwear You can wash up to 4 pieces in one load",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6c5138c-4e15-4339-b5fd-618d35fe7579.__CR5,0,488,488_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d2d95ecd-d562-4eb6-8c97-1bad262ff856.__CR23,0,467,467_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cf932a09-8ca6-4cf5-aa39-f0c00f6e0a8b.__CR0,8,411,411_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0b9c507-1682-4e56-a96f-2ceda9d9fe21.__CR3,0,434,434_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "10 Frequently Asked Questions and Answers What is the load capacity of the LogarMéxico Portable Mini Washing Machine? The Clothes Washing Machines can handle up to 1.75 lbs of laundry in a single load. Can I use it for both washing and draining my clothes? Yes, this Folding washing machine functions as both a washer and a drainer. Is it suitable for delicate fabrics? Yes, your \"Mini Lavadora Portatil\" offers a soft wash cycle for delicate items. Does it require any special plumbing installation? No, simply plug it into a standard power outlet, and you're ready to wash. Can I adjust the water temperature for washing? Yes, you can choose between hot and cold water options for each cycle. (Not boiling) Is it energy-efficient? Yes, the LogarMéxico Portable Clothes Washer consumes only 60W of power, saving energy and money. Is it suitable for table-top use? Yes, the compact design allows for easy placement on most tables or countertops. How noisy is the Mini Clothes Washer during operation? The LogarMéxico Small Washer operates quietly, ensuring a peaceful laundry experience. Can I wash large items like bed sheets? While it's ideal for small loads, you can still wash larger items like bed sheets by adjusting the load size but is not recommended.",
                "media_link": []
            },
            {
                "media_text": "How to use our Portable Washing Machine? Our Mini Portable Washing Machine has 3 modes of use, standard wash, soft wash, and drain. The standard wash will work for thicker or dirty clothes that need longer washing time. The gentle wash will work for smaller clothing such as socks and underwear or for smaller loads of clothing less than or equal to 2 pounds. Finally, the drain mode will be useful to remove excess water from your clothes. 1) To start using your Mini Washing Machine Portable, press and hold the \"Switch\" button for 2 seconds to start the machine. A beep will sound at the same time. 2) Click once to switch the sync mode between the 3 modes. 3) The bell will ring once and the machine will start working. The disinfection lamp will always be on. 4) When your Mini Portable Washer Machine finishes washing or draining, the machine turns off and will beep 3 times and the disinfection lamp turns off. NOTE: If you are using the standard wash or the soft wash, you must remove the included drain basket. This is only used for drain mode. Your Indoor Laundry Machine is equipped with a locked rotor detection function. When the motor is stuck, the buzzer will beep an alarm and the disinfection lamp will flash twice and then turn off.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b7a51eb-21d3-4fae-a1bd-a9e7a5e6d3e9.__CR225,0,4042,2500_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "1) How much water do you add? It should be filled with warm or hot water (not boiling) until the clothes are completely submerged. It should not exceed the horizontal line marked on the outside of the portable washing machine. 2) Can I use laundry soap? Of course! You can use laundry soap as well as detergent, fabric softener, and other products. Use the amount of soap and fabric softener in proportion to the amount of clothes you are going to wash. The average measurement is 1/4 oz for .75lb, a full load. 3) Do I have to use the basket or can I wash items in it without the basket? If you are using the standard wash or the soft wash, you must remove the included drain basket. This is only used for drain mode.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6c5138c-4e15-4339-b5fd-618d35fe7579.__CR5,0,488,488_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d2d95ecd-d562-4eb6-8c97-1bad262ff856.__CR23,0,467,467_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cf932a09-8ca6-4cf5-aa39-f0c00f6e0a8b.__CR0,8,411,411_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0b9c507-1682-4e56-a96f-2ceda9d9fe21.__CR3,0,434,434_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b7a51eb-21d3-4fae-a1bd-a9e7a5e6d3e9.__CR225,0,4042,2500_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0370f3cd-88c6-4ab9-93f9-a749826bd225.__CR0,92,1007,302_PT0_SX600_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lori Leal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFATU6NIM47ZYHRIGTCXG7XWJPFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1R0UN0IUYF43A?ASIN=B0CD161M5P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect for small fabrics and delicates!",
                "reviewText": "This portable washing machine is pretty small, but it’s perfect for its intended use. I do a lot of DIY projects and oftentimes I use old fabrics to make pillow cases/covers (vintage throw pillows). I don’t like to sew with used fabrics that haven’t been washed. I used to just throw them in with a load of laundry, but I wanted something I could keep in my workshop. That’s where this small but mighty portable washing machine comes in. It’s perfect! I set it up beside my portable dryer and it barely takes up any space. It could also be used to wash any small items, and it would work great for delicates, like bras and underwear, although I haven’t tried it for that purpose yet. I also thought about how fun this set up would be for a child to use (with parental supervision/assistance) for doll clothes. It would be a fun activity that also teaches the responsibilities of clothes washing. You could set up a little clothes line to hang the doll clothes to dry. I just think it would be adorable! It would also work well for pet clothes if you have the need. Overall I’m impressed with this little washing machine. Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "UE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHDXUVKUCYWOCHKN6LUJXWWIEQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ULLF86MHL5H4?ASIN=B0CD161M5P",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 29, 2023",
                "reviewTitle": "4.0 out of 5 stars No instructions but does a good job on small items",
                "reviewText": "Since no instructions were included with the product, I had 0 idea how to use this. But I contacted the company and they sent me most of the instructions. Still, you have to figure a few things out, like that you have to empty the water each time. So you fill the water and detergent and wash. Then you dump out the water and put in fresh water to clean. Then dump that out. Then finally add the spin basket to spin. If you don't have a washer handy, like on a trip, this is a really nice portable option for small items like socks. If you had this and an 11L one then both would do a great job on most items. Here's the instructions they sent me if this helps you.How to use our Portable Washing Machine? Our washing machine has 3 modes of use, standard wash, soft wash and drain. The standard wash will work for thicker or dirty clothes that need longer washing time. The gentle wash will work for smaller clothing such as socks and underwear or for smaller loads of clothing less than or equal to 2 pounds. Finally, the drain mode will be useful to remove excess water from your clothes. 1. To start using your Portable Washing Machine, press and hold the \"Switch\" button for 2 seconds to start the machine. A beep will sound at the same time. 2. Click once to switch the sync mode between the 3 modes. 3. The bell will ring once and the machine will start working. The disinfection lamp will always be on. 4. When your portable washing machine finishes washing or draining, the machine turns off and will beep 3 times and the disinfection lamp turns off. NOTE: If you are using the standard wash or the soft wash, you must remove the included drain basket. This is only used for drain mode. Your Portable Washing Machine is equipped with a locked rotor detection function. When the motor is stuck, the buzzer will beep an alarm and the disinfection lamp will flash twice and then turn off. 1) How much water do you add? It should be filled with warm or hot water (not boiling) until the clothes are completely submerged. It should not exceed the horizontal line marked on the outside of the portable washing machine. 2) Can I use laundry soap? Of course! You can use laundry soap as well as detergent, fabric softener, and other products. Use the amount of soap and fabric softener in proportion to the amount of clothes you are going to wash. The average measurement is 1/4 oz for .75lb, a full load. 3) Do I have to use the basket or can I wash items in it without the basket? If you are using the standard wash or the soft wash, you must remove the included drain basket. This is only used for drain mode.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie Bug",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK6SFWWY33KYMK2P3NB6V2RVLPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EQ0L32EGZV7Z?ASIN=B0CD161M5P",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "3.0 out of 5 stars Great for baby clothes, two at a time",
                "reviewText": "I received my first washer weeks ago, and it was broke. It didn't spin, the motor was trying to spin but the plastic part broke after one wash which was a shame because that first wash really worked.I contacted the email that came in the package and they quickly agreed to send me a new washer, after sending them a video of the washer not spinning.My second washer didn't seem to spin as powerfully but at least it spun. This washer is cute, and I love the way it collapses. It's quite tiny and fits perfectly on my countertop.I can wash two articles of clothing at a time, if I add a third the machine struggles to spin.I can tell it actually works though, I washed a new set of pillowcases and a bunch of the dye came out.I think the uses for this are pretty obvious, if you have baby clothes you need to wash you can run them in this machine a few times, if you have clothes that really need a good sanitizing maybe choose a standard washer.I do believe this would be great for dyeing small items or washing things with grease if you don't want to wreck your big washer.For the price I was hoping for something a little more functional, but I'll keep using it. If you're spending a lot of time in a camper or van- living this might be a better option when you're away from laundromats or run out of quarters.I refuse to use the dryer basket. It's IMPOSSIBLE to remove and you feel like you're breaking the machine getting it unlatched.Tldr: it works for a few small articles of laundry.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}