{
    "remaining_requests": 25716,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Portable-Foldable-Spin-Dry-Apartment-Underwear/dp/B0CR1M7DBQ",
    "body": {
        "name": "Portable Washing Machine Mini Foldable Machine, Small Laundry with Spin-Dry for Apartment Camping, RV, Travel, Socks, Baby clothes, Underwear(Purple)",
        "price": "$49.99",
        "originalPrice": "$49.99",
        "rawPrice": 49.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Portable-Foldable-Spin-Dry-Apartment-Underwear/dp/B0CR1M7DBQ",
        "soldBy": {
            "sellerID": "A3JL9I03YT2KHS",
            "name": "Easy win",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3JL9I03YT2KHS&asin=B0CR1M7DBQ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CVHDG3L3"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CR1M7DBQ",
                "variationName": "Color",
                "variationValue": "Light Purple",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41GxFH+xC-L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41O6KafdcJL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Purple",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41x8Cd-tdbL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41GxFH xC-L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51FxbiOBT5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41eWzruV0cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418L9mwTigL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QymW4T cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512ulFeqfmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51fM7JRmCrL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the kwiwis Store",
            "link": "https://www.amazon.com/stores/Kwiwis/page/3C2228A7-B39E-420F-821B-E33C0F2FFF90?ref_=ast_bln"
        },
        "brand": "Kwiwis",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "3.2 out of 5 stars",
        "customerReviewCount": 16,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 7 hrs 20 mins",
            "FREE delivery Friday, February 23"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Portable Mini Machine】 Convenient mini washing machine is a bucket folding lavadora, with a bucket handle, easy to move. Mini washing machine is very small in size, does not take up extra space, suitable for apartment, office, camping, RV, outdoor and other scenes.",
            "【Foldable small laundry machine】 Mini washing machine is a foldable washer with compact design, when fully folding can be only 5.5 inches height , very easy to store and carry. There are four base small suction cups at the bottom, so it can be extremely stable when it working. The small collapsible washer can easily fits under a stool or bed without taking up too much space in your home.",
            "【Washer comes with Hanger】We will give you a folding hanger for free, and the washing machine comes with a basket to place clothes, which is well-configured and attaches great importance to user's experience.The mini washer is easy to use, compared with large washing machines, you only need to open the bottom piston when draining.",
            "【Three Modes washing machine】Mini folding camping washing machine, washing, drying in one-click button design, you can set 5 minutes of standard washing and 10 minutes of deep washing, saving your time. It's very smart and easy to use. What's more, the laundry machine have a blue light lighting special for baby clothes, socks and underwears, which let the machine has the stronger sterilization and decontamination ability.",
            "【Safety Material】Our tiny portable personal washing machine is made of ABS material, which is more resistant to aging, yellowing, high temperature and corrosion. The mini washing machine is very friendly to environment because it requires less water and electricity to wash clothing."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2619525011"
            },
            {
                "name": "Laundry Appliances",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18116194011"
            },
            {
                "name": "Washers & Dryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2383576011"
            },
            {
                "name": "Portable Washers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=9709422011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎kwiwis"
            },
            {
                "name": "Model Info",
                "value": "‎Purple-01"
            },
            {
                "name": "Item Weight",
                "value": "‎3.67 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "9.8\"D x 10.8\"W x 10.8\"H"
            },
            {
                "name": "Item model number",
                "value": "‎Purple-01"
            },
            {
                "name": "Capacity",
                "value": "6.5 Liters"
            },
            {
                "name": "Installation Type",
                "value": "‎Under Counter"
            },
            {
                "name": "Part Number",
                "value": "‎Purple-001"
            },
            {
                "name": "Special Features",
                "value": "‎Drum Clean"
            },
            {
                "name": "Color",
                "value": "Light Purple"
            },
            {
                "name": "Standard Cycles",
                "value": "‎1"
            },
            {
                "name": "Access Location",
                "value": "Top Load"
            },
            {
                "name": "Voltage",
                "value": "‎110 Volts"
            },
            {
                "name": "Wattage",
                "value": "‎40 watts"
            },
            {
                "name": "Certification",
                "value": "‎WaterSense"
            },
            {
                "name": "Material Type",
                "value": "‎ABS, Plastic"
            },
            {
                "name": "Included Components",
                "value": "‎Cover, Power Cord, Drain Hose"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B0CR1M7DBQ"
            },
            {
                "name": "Customer Reviews",
                "value": "3.2 3.2 out of 5 stars 16 ratings 3.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#526 in Appliances (See Top 100 in Appliances) #69 in Portable Clothes Washing Machines"
            },
            {
                "name": "Date First Available",
                "value": "December 27, 2023"
            },
            {
                "name": "Brand",
                "value": "kwiwis"
            },
            {
                "name": "Special Feature",
                "value": "Drum Clean"
            },
            {
                "name": "Cycle Options",
                "value": "Normal"
            },
            {
                "name": "Material",
                "value": "ABS, Plastic"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Residential"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Kwiwis mini portable foldable washing machine Why Choose Our Collapsible Mini Washing Machine? As a foldable mini washing machine, our product has the following advantages that make it a great choice for consumers:Wide range of applications: This mini washing machine is perfect for washing baby clothes, personal items, and other items that need to be washed separately, helping consumers take better care of themselves and their families' health.Safe and reliable: Our washing machine is made of TPE and food-grade silicone materials, which are safe and reliable and will not cause harm to clothes or the human body. It also meets international safety standards, so consumers can use it with confidence.Energy-saving: Our washing machine only requires 0.01 kWh/hour, which can save more energy and costs, making it more friendly and cost-effective.Convenient to carry: Our washing machine is very lightweight and easy to carry, making it suitable for use during business trips, travel, camping, and other occasions, allowing consumers to keep their clothes clean no matter where they are.Intelligent operation: Our washing machine uses smart imitation hand washing technology, which can gently wash clothes and eliminate the hassle of hand washing.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cef052d1-749b-47ae-be10-ad7286daceb6.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Hands-free for washing delicate items Portable Washing Machine: Gentle Care for Delicate Clothes on the Go Our Portable Washing Machine features an imitation hand washing spiral pulsator with precise speed for gentle care of delicate clothes. Made with high temperature resistant material, it allows you to soak clothes in hot water and remove tough stains. It's energy-efficient, collapsible, and perfect for travel or camping.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9cf48e2d-70ea-45c1-8e4e-f4644911937a.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Portable Washing Machine with Detachable Drain Basket Kwiwis Portable Washing Machine is a mini foldable washing machine that is perfect for washing your delicate items, baby clothes, and personal items separately from regular laundry. Made with high temperature resistant material and equipped with a filter basket and drain port, it allows you to soak clothes in hot water and remove tough stains.Kwiwis intelligent washing machine features an imitation hand washing spiral pulsator with precise speed for gentle care of delicate clothes. It also has a 10-minute standard wash, 15-minute slow wash, and 2-minute spin-dry timer function, allowing consumers to set different modes according to their needs for more convenience.Our compact washing machine is energy-efficient and collapsible, making it perfect for travel or camping. It is lightweight and portable, so you can take it anywhere you go.In summary, our mini foldable washing machine has selling points such as filter basket and drain port, drying function, timer function, hand washing simulation, high temperature resistant material, energy-saving features, and smart washing technology. It's perfect for personal hygiene, baby clothes, and even for patients' families!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15f0f926-29a9-4221-89c3-1c956dbe0a60.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Portable Washing Machine with Intelligent Technology and Gentle Care for Delicate Clothes Our Portable Washing Machine is designed with a convenient carry handle, making it easy to take with you wherever you go. Whether you're traveling, camping, or simply need a personal hygiene washing machine, our mini foldable washing machine is the perfect solution. The lightweight and collapsible design with a carrying handle allows you to easily transport the washing machine from one place to another.With its smart washing technology and advanced features, our washing machine is perfect for those who want to keep their clothes clean and fresh while on the go. Ideal for personal hygiene, baby clothes, and even for patients' families! The handle adds an extra level of convenience, making it easy to move the washing machine around as needed.Our compact washing machine with a carry handle is also energy-efficient, making it an friendly choice for consumers who want.With its filter basket and drain port, drying function, timer function, and gentle care for delicate clothes, our washing machine is a have for anyone looking for a portable and reliable washing machine.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4d5c3424-3928-4e5a-86d6-07104174439f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Perfect for Travel, Camping, and Personal Hygiene Our Foldable Mini Washing Machine offers the advantage of compactness and portability due to its ability to fold or collapse into a smaller size. This makes it an excellent choice for individuals with limited living space or those who travel frequently, such as those in small apartments, dormitories, RVs, or hotels.When folded, the machine can be easily stored in a closet, under a bed, or in a small storage area. This makes it a convenient and hassle-free solution for those who need a washing machine but don't have the space for a full-sized model.Despite its compact size, our mini washing machine is packed with features, including a filter basket and drain port, drying function, timer function, and gentle care for delicate clothes. It even has a convenient carry handle for easy transport.In summary, our Foldable Mini Washing Machine is the perfect solution for those who need a washing machine that is compact, portable, and easy to store. With its advanced features and smart washing technology, it's a great choice for personal hygiene, baby clothes, and even for patients' families!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d3561ddb-82a4-499c-8832-9697248a39bd.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Give the Gift of Convenience and Practicality with our Foldable Mini Washing Machine Perfect for College Students, Campers, and Outdoor Enthusiasts! As the holiday season approaches, our Foldable Mini Washing Machine makes for a thoughtful and practical gift for your loved ones. Whether it's for a college student living in a dormitory or someone who enjoys camping and outdoor adventures, our mini washing machine is the perfect solution for those who need a compact and portable washing machine.With its advanced features such as a filter basket and drain port, drying function, timer function, and gentle care for delicate clothes, our mini washing machine is not only convenient but also highly functional. It's a great way to show your loved ones that you care about their well-being and want to make their lives easier.In addition, our mini washing machine is an friendly choice. It's a gift that keeps on giving, both to your loved ones and to the environment.So why not give the gift of convenience and practicality this holiday season? Our Foldable Mini Washing Machine is sure to bring a smile to your loved one's face and make their life more comfortable and convenient.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/99200b6a-619b-4034-a3cd-19ea8ddead97.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cef052d1-749b-47ae-be10-ad7286daceb6.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9cf48e2d-70ea-45c1-8e4e-f4644911937a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15f0f926-29a9-4221-89c3-1c956dbe0a60.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4d5c3424-3928-4e5a-86d6-07104174439f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d3561ddb-82a4-499c-8832-9697248a39bd.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/99200b6a-619b-4034-a3cd-19ea8ddead97.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "redtapegrrl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSX5DR7ZESTNX4VUBIH3J5PN5LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FEV81CYV3Z?ASIN=B0CR1M7DBQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Laundry room essential",
                "reviewText": "This bag is better made than the big-box bags I've been using.It's the perfect size for small washables. The pull tab for the zipper will last longer than the big-box guys, as it already has. Lower quality zipper pulls come off in the first wash. This one didn't, thanks to an ingenious elastic that covers the pull tab when the zipper is closed.It's a useful addition to my laundry repertoire.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Giselle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDTNIOJB3BIUAVUX7DAQZOUVUFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ22MZP9QV4V7?ASIN=B0CR1M7DBQ",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "1.0 out of 5 stars Worked well at first then… disaster",
                "reviewText": "At first, the product was working well. Seemed to be a good purchase. One minor thing I didn’t like was the cord length (too short), but overall fine. A few days after my return period ended, the product became unsteady and started to sort of jump in place, tossing soapy water everywhere. Someone has to stand next to it, holding it down, or the clothes would come out during the spinning step. Wouldn’t recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hilda C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG73B2HAU5W7Y4NX4XMCWETRQO6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RARN06XMYZQ8S?ASIN=B0CR1M7DBQ",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "2.0 out of 5 stars Make sure the hose fits",
                "reviewText": "I returned this because the hose was too small to fit any of the faucets that I have",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Liz P. C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDT36IXCSMMNC3X3LD2HTAWNR3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21QHXX9HN3VTG?ASIN=B0CR1M7DBQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "4.0 out of 5 stars Water splashes out",
                "reviewText": "The media could not be loaded. It is good for washing a few, lightly dirty, items at a time.If you have size 3XL items, the guide on the site is NOT accurate. We put one pair of underwear, one pair of socks, and a camisole in it, size 3XL. I wouldn't want to put too much more in it. Those items are overflowing the spinner basket.It moves a LOT during the spin cycle.It does not come with good directions. It doesn't say how much soap to use. It doesn't say if the spinner basket should be installed during washing, or only during the \"dehydrate\" cycle. It doesn't have cleaning directions. It doesn't say how high to fill the water.The cord is pretty short, so it needs to be near a plug. Which wouldn't be a problem, except it wiggles a bunch and water spills out the sides, so we use it in the kitchen sink, and there is not a plug close enough without an extension cord.There is a little notch on the back of the bucket to hang the drain hose on, which is convenient.I also really like the drying hanger with clips.It spins for a bit, then stops and switches directions. We washed with the basket inside, which made a decent agitator. I was also very careful not to overload it.The motor is pretty noisy.The hose that is supposed to connect to the faucet doesn't connect to any of mine, but it wasn't a problem because the entire thing is already in the sink anyway because it splashes so much.The items we put in were VERY dirty. I put it through a 5min wash before I figured out how to access the other cycles, then a 10min wash, both with soap. The clothes still stunk. So I did a 5min cycle with baking soda and let it soak for half an hour. The water was brown, so I drained it and rinsed it out and ran another 5min cycle with baking soda and let it soak again. It was still pretty brown, but I drained and rinsed it, then ran a 10min wash with soap, which left the water still a bit brown, but definitely not as bad. Then another 10min soap wash, then finally a rinse cycle (just water). I used hot water for everything.It CAN get very dirty items clean, but they need soaking, and you have to run it multiple times, which requires you to drain and refill it a lot.We bought it for use mainly for period underwear, and it will work perfectly for that.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d97e40cc-f6b5-4b6a-b5aa-6b2ab745dd7b/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Marcie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2JM4UMXMKN5YQVWPWZLZ62GP5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G5OCK03B3JZE?ASIN=B0CR1M7DBQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice little bag",
                "reviewText": "A nice, 12X18 mesh bag for holding delicates in the wash, it is well made and has a good sturdy zipper. This bag also comes in handy for holding small pieces of jewelry or similar items. Very reasonably priced.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vadim Lutsenko",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNIJCWCMQUYT5I4MUCTT3YLWQFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32SPDITO76XXC?ASIN=B0CR1M7DBQ",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "1.0 out of 5 stars This is sucks!",
                "reviewText": "Do not buy this, not working normally. You are lost time with this washing machine!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "waleska   Adames",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGSA5GXV7WGHM7MAESQXWQXLVFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R906WY1KJBJC9?ASIN=B0CR1M7DBQ",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "1.0 out of 5 stars To small",
                "reviewText": "Junk",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYGC3PSUR5UZSIRUYKIZ3TJ6FIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KCGXTTWQRD52?ASIN=B0CR1M7DBQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Nice size for small clothing items",
                "reviewText": "Small sized wash bag suitable for baby clothing, socks, bras, or a shirt. The listing states suitable for towels but this bag would only fit a wash rag or hand towel. Zipper stays closed and clothing remains contained within the bag during the wash cycle. This bag has held up to daily washes and the quality is similar to that of other atore bought laundry bags.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}