{
    "remaining_requests": 25761,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Portable-Washing-Machine-Compact-Full-Automatic/dp/B08B4L4CGG",
    "body": {
        "name": "Comfee Portable Washing Machine, 0.9 cu.ft Compact Washer With LED Display, 5 Wash Cycles, 2 Built-in Rollers, Space Saving Full-Automatic Washer",
        "price": "$254.33$210.54",
        "originalPrice": "$254.33",
        "rawPrice": 254.33,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Portable-Washing-Machine-Compact-Full-Automatic/dp/B08B4L4CGG",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTK45JK2"
        ],
        "asinVariationValues": [
            {
                "asin": "B08B4L4CGG",
                "variationName": "Color",
                "variationValue": "Gray",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21ck6iqrEBL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31TXsj9E+zL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21iL9Luiq3L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31X47q9sDGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31iA9v5PybL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517KaBbZnXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gwodXAxsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51E jgS68BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41TDf XwliL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1dIFzQ9eWL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the COMFEE' Store",
            "link": "https://www.amazon.com/stores/COMFEE/page/438DE0E2-C51B-472D-A261-3372DE3CA939?ref_=ast_bln"
        },
        "brand": "COMFEE",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 7325,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 8 hrs 28 mins",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The full-automatic washing machine equipped with Heavy, Soft, Normal, Rapid, and Soak 5 programs and 3 water levels, you are allowed to quickly start the machine the way you like. You are also welcomed to customize your washing program by selecting load size, adding wash time, rinse time, and spin time.",
            "This top load compact washing machine with only 18.1 inches in width, 17.7 inches in-depth, and 31.5 inches in height, this portable washer is able to be stored easily. You can store it in your cabinet, RV, dorm, or even bathtub! Even better, it comes with wheels and handles for easy movement. It is a perfect choice for small households with limited space and minimal optimal.",
            "With the transparent lid design, this washing machine allows you to see and monitor the water and washing conditions. Featuring a durable rust-resistant steel inner tub, lint filter, water inlet and drain pump which allows you to easily drain out dirty water. In addition, this portable laundry washing machine has an LED display that shows the time left to finish.",
            "This compact design washing machine has DOE (Department of Energy) certificate that clearly shows how much energy would be consumed on national average conditions. Saving as much as 87.5% energy consumption comparing to similar models, it equips with a powerful and durable motor, up to 840RPM spin speed but quiet when running.",
            "Unbalance could be a very serious issue for washing machines. It could cause washing machine to \"dance on the floor\", or even worse, to unleash itself from the water inlet, leaking everywhere. Equipped with Auto Unbalance Detection (AUD), however, it's able to automatically fix the unbalance issue through allowing more water to come in. It will also alert the user if the problem can't be fixed, ensuring a safe and pleasant experience. NOTE : Refer to the PDF attached below in Technical Specification for the Installation and Troubleshooting Steps"
        ],
        "description": "Feeling unsafe going to Laundromat? Tired of sending and picking up clothes from public washer? Want to have your own laundry setup in your bathroom? Let this little machine do all the magic for you! It's small, space saving, and yet powerful to take care of your daily laundry needs.- Space saving, fits in your room/RV/dormetory nicely- High quality and durable motor, providing stable power- Stainless steel inner tub with multiple washing programs to choose from- See-through lid and LED display- Wheels to move aroud- Brand new washing machines come with a drain plug: don’t forget to remove it before you hook up the drain hose.",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2619525011"
            },
            {
                "name": "Laundry Appliances",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18116194011"
            },
            {
                "name": "Washers & Dryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2383576011"
            },
            {
                "name": "Portable Washers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=9709422011"
            }
        ],
        "productInformation": [
            {
                "name": "Manufacturer",
                "value": "‎Midea"
            },
            {
                "name": "Part Number",
                "value": "‎CLV09N1AMG"
            },
            {
                "name": "Item Weight",
                "value": "44.1 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "17.7\"D x 18.1\"W x 31.5\"H"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎CLV09N1AMG"
            },
            {
                "name": "Size",
                "value": "‎0.9cu.ft"
            },
            {
                "name": "Color",
                "value": "Gray"
            },
            {
                "name": "Style",
                "value": "‎Gray 0.9 cu.ft"
            },
            {
                "name": "Material",
                "value": "Stainless Steel, Plastic"
            },
            {
                "name": "Pattern",
                "value": "‎Washing Machine"
            },
            {
                "name": "Power Source",
                "value": "‎Electric"
            },
            {
                "name": "Voltage",
                "value": "‎120 Volts"
            },
            {
                "name": "Installation Method",
                "value": "‎Freestanding"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Sound Level",
                "value": "‎62 dB"
            },
            {
                "name": "Display Style",
                "value": "‎LED"
            },
            {
                "name": "Special Features",
                "value": "‎Full-automatic"
            },
            {
                "name": "Included Components",
                "value": "‎converter, water inlet hose"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "Warranty Description",
                "value": "‎One Limited Year Warrenty from original purchase date"
            },
            {
                "name": "ASIN",
                "value": "B08B4L4CGG"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 7,325 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#114 in Appliances (See Top 100 in Appliances) #14 in Portable Clothes Washing Machines"
            },
            {
                "name": "Date First Available",
                "value": "July 4, 2020"
            },
            {
                "name": "Brand",
                "value": "COMFEE'"
            },
            {
                "name": "Capacity",
                "value": "0.9 Cubic Feet"
            },
            {
                "name": "Special Feature",
                "value": "Full-automatic"
            },
            {
                "name": "Access Location",
                "value": "Top Load"
            },
            {
                "name": "Cycle Options",
                "value": "Soak, Gentle, Heavy Duty, Normal, Rapid"
            },
            {
                "name": "Controls Type",
                "value": "Push Button"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Enjoy Your Comfy Life Comfee is a professional manufacturer of home appliances. By providing high-quality products and good service, Comfee is earning a good reputation and a larger market share in the past days. Comfee purposed to build better living through affordability, enhanced experiences. Hope we can bring more joy and convenience to your family life. COMFEE' Portable washing machine Let this little machine do all the magic for you! It's small, space saving, and yet powerful to take care of your daily laundry needs. Space-saving fits in your room/RV/dormitory nicely High quality and durable motor, providing stable powerStainless steel inner tub with multiple washing programs to choose fromSee-through lid and LED displayWheels to move around Item Weight: 44.1 pounds Product Dimensions: 18.1 x 17.7 x 31.5 inches Package include: 1x full automatic washing machine, 1x Water inlet hose, 1x Converter",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/3b3f62d1-b39b-4ff2-9f55-fb193bda0f9f.__CR125,0,750,1000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/57f0ea76-4a0d-4c05-b6c9-f8a120f7e539.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Easy to Install Completes within 3 simple steps 1. Hook up the hose to a faucet Comes wiith a quick adaptor, you are allowed to easily srew the fill hose onto your kitchen or washroom faucet after removing the aerator. 2. Secure the drain hose to a sink to allow dirty water to drain. 3. Simply plugin the device, turn the water on, and you are all set! Easy to use Less is more Equipped with Heavy, Soft, Normal, Rapid and Soak programs, you are allowed to quickly start the machine the way you like. You are also welcomed to customize your washing program by selecting load size, adding additional wash time, rinse time and spin time. Easy to store and relocate Don't lift it, wheel it! With only 18.1inch in width, 17.7inch in depth and 31.5inch in height, this portable washer is able to be stored easily. You can store it in your cabinet, RV, dorm, or even bathtub! Even better, it comes with wheels so that it can show up anywhere it needs to be.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/1ecfd347-16ff-4dfd-a4ee-736ebb178954.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e9af43aa-5e88-4583-8f21-6251f746b56b.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/187a06d4-12c9-4d85-8c03-63f72b956669.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Auto Unbalance Detection Vibrate mode off! Unbalance could be a very serious issue for washing machines. It could cause washing machine to \"dance on the floow\", or even worse, to unleash itself from the water inlet, leaking everywhere. Equipped with Auto Unbalance Detection (AUD) , however, it's able to automatically fix the unbalance issue through allowing more water to come in. It will also alert the user if the problem can't be fixed, ensuring a safe and pleasant experience. Extremely Energy Saving Saves energy, and your money Our product has DOE (Department of Energy) certificate that clearly shows how much energy would be consumed on national average conditions. Saving as much as 87.5% energy consumption comparing to similar models. * *Based on DOE’s estimation on the average cost of energy when used with a natural gas water heater. See-through lid+LED Display Seeing is believing Transparent lid allows you to see and monitor the water and washing condition. LED display shows the time left to finish.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7a22690c-1e91-48dc-a27d-ed5b704f5435.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/590d74d7-ce1e-4990-a3e4-1c0b25a82d85.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e0e790a6-6707-4fdb-bb76-b5b9c332ba12.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/f923e801-d1aa-4172-b37b-2d2415cc9e6f.__CR15,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3b3f62d1-b39b-4ff2-9f55-fb193bda0f9f.__CR125,0,750,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/57f0ea76-4a0d-4c05-b6c9-f8a120f7e539.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1ecfd347-16ff-4dfd-a4ee-736ebb178954.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e9af43aa-5e88-4583-8f21-6251f746b56b.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/187a06d4-12c9-4d85-8c03-63f72b956669.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7a22690c-1e91-48dc-a27d-ed5b704f5435.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/590d74d7-ce1e-4990-a3e4-1c0b25a82d85.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e0e790a6-6707-4fdb-bb76-b5b9c332ba12.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "robin-m",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFRHJ75WUT72AUXOP5252DZCJZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PO7O7BPTYQ3Z?ASIN=B08B4L4CGG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Update to the update. I'm a dunce. This machine is 5 stars!",
                "reviewText": "UPDATE TO THE UPDATE: It was the Downy fabric softener ball. Please be advised that if you use one of these in this machine, it will make a lot of racket. The machine is fine. I am sorry I did not thoroughly investigate the noise issue before posting the negative review.UPDATE: I have loved using this little machine, but after 2 weeks of doing laundry for one person, it is making a horrible noise when agitating. I will contact the company and see what my remedies are, but for now I must change my review to one star. Quality washers should last longer than two weeks!ORIGINAL REVIEW:I researched the heck out of these portable washing machines before selecting this one. It seemed to have the best combination of price, reviews, appearance and reputation. I unpacked it earlier today and fired it up.My biggest concern was that it would be too small. It isn't. The only things in my over-filled laundry baskets that would't fit are a king-sized quilt and a queen-sized mattress pad. Also, I love that there are a variety of cycles to choose from. You can wash for 2-12 minutes, rinse 1-3 times, spin for 5-55 (?!) mins, and choose an optional soak if you want it. There's a rapid wash cycle that runs a total of 15 minutes! I love that. So, lots of options.It's light. I got it up 15 stairs alone, and I'm a 60-year-old woman. Unboxing was easy, but I had a hard time getting the plastic base plate to slide in. Be patient and bend it a little and it will go in. On first impression, this was a nice-looking little machine. Does not look cheap, just small. Like somebody shrunk a full-sized washer. It comes up to my hip. Stainless steel interior, real glass lid and nice touch-panel button controllers. The top and panel come wrapped in clear plastic, so make sure to peel that stuff off.It is covered with a bunch of ugly \"don't stick your head in this washer!\" type stickers. Most of them were easy to remove, and I will put some goo gone on the rest. Setup was relatively easy. I have a laundry room with hookups and a drain, so I just hooked it up to the cold water line (no hot water line in this unit) and put the drain hose down the drain pipe. (Setup out-takes: I forgot to put the drain hose down the drain pipe initially. Was grateful for that floor drain!) Also: do not just open the lid when the machine is on. It will scream at you like a smoke detector. Push the \"pause\" button and you can open the lid and throw that found sock in.I've been doing laundry all day, and this thing is fabulous. Gets things clean, is relatively quiet (except for the beeping; more on that later) spins out a ton of water so that clothes are dry-damp when you take them out and dry quickly, and does a good job cleaning everything from bras to towels to tablecloths. According to the Energyguide label on the front, it should cost me SEVEN dollars a year to run it.Here are the negatives: I will still need to take comforters, etc. to the laundromat, but that might be 1-2 times per year. It beeps too much: I hate being beeped at, and this thing beeps for no good reason. For example, it beeps every time you select a wash type, and sometimes you have to push 6 times, so 6 beeps. Beeps multiple times at the end of every cycle. As far as I know, there is no way to mute the unnecessary beeps. The lint trap is a little dicey. It works, but it doesn't work great. You're supposed to clean it out about every 10 loads, but clean it after something linty, like towels. I made the mistake of washing a load of black pants right after a load of towels and they were a mess. I cleaned out the full lint trap and re-washed the pants and they came out perfect. It only has *one* leveling leg, which is just weird. Thankfully my location is level.All of these negatives considered, I still feel like I got the deal of the century for getting this little tiger delivered to my door for a little over $200. Now to begin the great portable dryer hunt . . .",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric HarrisEric Harris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF25LWWCOYURRU5NIM55JKGELCZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MTJVDRW8DZT?ASIN=B08B4L4CGG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 29, 2023",
                "reviewTitle": "5.0 out of 5 stars So far a great little machine! Would recommend!",
                "reviewText": "I am coming from a larger washing machine and dryer. It was really too large for my space and the washing machine was in need of repair anyway. This washing machine fits the space much better and matches my needs well as I live alone.Let me say over all the machine is absolutely great for my needs but there are a couple of things that I immediately do not like though going with my first impressions. The first is that the skirt around the base is plastic. Aesthetically I think it would be better if it were metal like the rest of the washer, but it looks fine, and this is not at all a big deal nor a deal breaker. The second issue that I have is that I initially thought the washer control panel was a touch interface but instead it is soft touch buttons with a soft plastic cover over all of the buttons and the digital display. The RovSun Dryer that I paired with this machine is touch interface and I believe that it is going to be less prone to damage or issues from wearing out. That said I am ordering a cover for both.The Machine cleans clothes very well. I work outside frequently and it gets my clothes clean. I make use of both the hygiene setting and the turbo setting in my laundry cycles. The machine is very strong in agitating the clothes and the spin cycle works very well. I do use a second spin cycle to make drying even easier for my RovSun Dryer. I also make sure to do an alone spin and drain cycle after I have done all of my laundry to make sure that there is no water remaining in the very bottom of the tub. The detergent dispenser has two separate compartments one for liquid and the other for powder. I use liquid detergent and a powdered laundry booster. The liquid goes in the blue square and the powder goes in the one beside it with the large holes. You can use these for whatever you plan to run in the wash cycle except probably liquid bleach. I doubt that would be safe for most garments. I saw another review discuss they were annoyed that there was not a fabric softener compartment that would only run during the rinse cycle. Just use a Downy Ball. I typically just use a rinse and not a conditioner, but the Downy Ball works great for either. It will not release anything until the rinse cycle as you can see from my photo of it floating around in the middle of the wash cycle on turbo with the extra strong agitation. If you want to use liquid bleach just do it the old fashioned way. Fill the tub before you put clothes in add the bleach then add the clothes. Alternatively, you could use powdered bleach. It dissolves in cold water and is likely a perfect additive for the dispenser with the large holes. It’s generally very concentrated so a little goes a long ways. This little machine can wash two light king sized comforters with no problem. There’s no center agitator so more can fit in less space. The lint trap inside does a great job at trapping the lint in your wash. Make sure to empty it after every load. It’s incredibly simple to do. I also use two floating lint traps as well that help out. There is a pump filter that you will need to clean at least once a month. It is accessed in the back of the machine. I would advise a wheeled washing machine stand to make this chore that much easier. I also bought the extended coverage for this machine that way if something goes wrong it’s not a great hassle to mitigate it. I’ve only had the machine for about a week and I will update immediately if anything changes.",
                "reviewVotes": "75 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/513RUKifWXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51JtG2IE0dL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51hbCALHUWL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Q4WEn0FAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71jZTOmNo1L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "SI",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBHPAIODPHTD4UMUA2ANQRSULBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RHPX1ARDK7W2?ASIN=B08B4L4CGG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars My 2-Year Experience with This Compact Washing Machine",
                "reviewText": "I've owned this compact washing machine for two years, and it has been a game-changer. Living in an apartment without easy access to a washer and dryer used to make laundry a hassle. However, this machine excels in cleaning clothes and efficiently removes water during the spin cycle. For anyone hesitant about purchasing this machine, I assure you it's a worthwhile investment, even for smaller laundry loads.Initially, I had to set it up at my kitchen sink, as my bathroom is quite small and wouldn't accommodate it, but it has been working wonderfully. Despite its compact size, it's surprisingly capable of handling large items, including multiple big towels, sheets, and blankets, with ease. It's easy to move around yet powerful enough for significant laundry tasks. So, if you're considering this washer, don't overlook its potential!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mecanico242Mecanico242",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 31, 2024",
                "reviewTitle": "Trabaja muy bien",
                "reviewText": "Un muy buen producto, tiene diversos ciclos de lavado y es muy compacta, puede lavar toallas hasta pantalones de mezclilla. Es muy versátil, yo la tengo en la cocina y cuando lavo solo pongo la manguera en la tarja para desaguar. Usa poca agua en el lavado rápida y ese es el que uso. La recomiendo ampliamente. Llegó antes de la fecha indicada.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71PA+E4cxgL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "AlRos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 18, 2023",
                "reviewTitle": "Wow wow Wow",
                "reviewText": "An incredible solution for small apartments. All my laundry is done at home now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AMADA RODRÍGUEZ ORTEGA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 16, 2023",
                "reviewTitle": "EXCELENTE",
                "reviewText": "UNA EXCELENTE LAVADORA ME ENCANTÓ",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cowden too",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 11, 2023",
                "reviewTitle": "I am happy with this machine",
                "reviewText": "see above",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David ZazuetaDavid Zazueta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 4, 2023",
                "reviewTitle": "Me cobraron doble",
                "reviewText": "La lavadora me gusta, cero quejas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71uL4mttI-L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}