{
    "remaining_requests": 25744,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Deco-Home-Apartments-Agitation-Certified/dp/B08WFG5X92",
    "body": {
        "name": "Portable Washing Machine for Apartments, Dorms, and Tiny Homes with 8.8 lb Capacity, 250W Power, Wash and Low Agitation Spin Cycle, Includes Drainage Hose, ETL Certified",
        "price": "$119.99",
        "originalPrice": "$149.99",
        "rawPrice": 119.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Deco-Home-Apartments-Agitation-Certified/dp/B08WFG5X92",
        "soldBy": {
            "sellerID": "A13BNE3P7C8THK",
            "name": "Beach Camera Same Day Shipping",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A13BNE3P7C8THK&asin=B08WFG5X92&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CNSBW8SR"
        ],
        "asinVariationValues": [
            {
                "asin": "B08WFG5X92",
                "variationName": "Style",
                "variationValue": "WSHM01",
                "price": "$119.99",
                "variationImageURL": ""
            },
            {
                "asin": "B09HWVX1MH",
                "variationName": "Style",
                "variationValue": "WSHM02",
                "price": "$119.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "21",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41-5bZpGCHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51EXKFMomrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zsZ9G1bnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410Bc2IGKeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wPNgvFTQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51k8e7-wsHL.jpg",
            "https://m.media-amazon.com/images/I/51H wrzycIL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cdd5fb54-88ba-41ab-886b-650e26898db5/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Deco Home",
            "link": "https://www.amazon.com/Deco-Home/b/ref=bl_dp_s_web_20049813011?ie=UTF8&node=20049813011&field-lbr_brands_browse-bin=Deco+Home"
        },
        "brand": "Deco Home",
        "merchantInfo": "Ships from and sold by Beach Camera Same Day Shipping.",
        "customerReview": "3.5 out of 5 stars",
        "customerReviewCount": 527,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 23 hrs 56 mins.",
            "FREE delivery Thursday, February 22. Order within 22 hrs 26 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "CLEAN CLOTHES IN YOUR SMALL SPACE - With a compact and lightweight design, the Deco Home Portable 250W Washing Machine makes doing laundry in your small space possible! Perfect for apartments, dorm rooms, bathrooms, and RVs, this mini washing machine can save trips to the laundromat | VIDEO TUTORIAL: Be sure to watch our video on how to properly use this washing machine, including how to pack the spin drum.",
            "SMALL STATURE, BIG POWER - Using a powerful 250W motor, clothes are washed efficiently and fast using the detergent of your choice. Like larger household machines, the repetitive action of agitation and fast moving water combined with soap helps to remove dirt and stains, leaving you fresh laundry. With a transparent lid, you can watch it all happen. A Low Agitation Spin Cycle spin helps to dry your clothes without heat and helps to prevent stretching, tearing, or other damage to clothing items.",
            "ADJUSTABLE CONTROLS - Simple controls streamline an already fast process that doesn’t take any longer than 15 minutes. Set your clothes to wash or go through a light agitation spin cycle from 3 to 15 minutes, depending on the clothes you are trying to wash. We recommend washing up to 4.4 lb of clothes (8.8 lb when wet). Ensure that you do not exceed this weight in clothing and to pack the spin cycle drum evenly.",
            "EASY CLEANUP - Emptying the washing machine is easy! Attached to each unit is a flexible drainage hose that can be extended or bent to hang over your bathtub or sink. Down the drain goes the dirty water, and you’re left with clean fresh smelling laundry!",
            "READY FOR ANYTHING - No installation is required! As long as you have access to a wall outlet and a place to drain your dirty water, this compact washing machine can be used anywhere! This washing machine is ETL certified.",
            "DO NOT OVERFILL - This compact washer is intended to allow you to wash your clothes in spaces where a full-size machine won't fit, do not fill and treat this machine as a full-size washer. Follow the provided guidelines/weight limits and this washing machine will clean your clothes with ease!",
            "HOW MANY CLOTHES CAN I FIT IN THE WASHING MACHINE? - The max washing weight capacity is 4.4 lbs (8.8 lbs wet) and the max spin capacity is 4.4 lb. Before using a spin cycle to help dry your clothes, wring out your clothes to remove excess water. Use the following guidelines for determining the amounts of clothing to wash: 8 UNDERWEAR, 30 SOCKS, 4 BLUEJEANS, 5 T-SHIRTS."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b?ie=UTF8&node=2619525011"
            },
            {
                "name": "Laundry Appliances",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18116194011"
            },
            {
                "name": "Washers & Dryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=2383576011"
            },
            {
                "name": "Portable Washers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=9709422011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎Deco Home"
            },
            {
                "name": "Model Info",
                "value": "‎WSHM01"
            },
            {
                "name": "Item Weight",
                "value": "15 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "15\"D x 15\"W x 25\"H"
            },
            {
                "name": "Item model number",
                "value": "‎WSHM01"
            },
            {
                "name": "Capacity",
                "value": "8.8 Pounds"
            },
            {
                "name": "Part Number",
                "value": "‎WSHM01"
            },
            {
                "name": "Special Features",
                "value": "‎Portable,Lightweight,Compact"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Control Console",
                "value": "‎Knob"
            },
            {
                "name": "Standard Cycles",
                "value": "‎2"
            },
            {
                "name": "Access Location",
                "value": "Top Load"
            },
            {
                "name": "Voltage",
                "value": "‎120 Volts"
            },
            {
                "name": "Wattage",
                "value": "‎250 watts"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B08WFG5X92"
            },
            {
                "name": "Customer Reviews",
                "value": "3.5 3.5 out of 5 stars 527 ratings 3.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#357 in Appliances (See Top 100 in Appliances) #45 in Portable Clothes Washing Machines"
            },
            {
                "name": "Date First Available",
                "value": "April 24, 2021"
            },
            {
                "name": "Brand",
                "value": "Deco Home"
            },
            {
                "name": "Special Feature",
                "value": "Portable,Lightweight,Compact"
            },
            {
                "name": "Cycle Options",
                "value": "Spin, Drain"
            },
            {
                "name": "Controls Type",
                "value": "Knob"
            },
            {
                "name": "Model Name",
                "value": "DGWSHM01OB"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "DO NOT OVERFILL - This compact washer is intended to allow you to wash your clothes in spaces where a full-size machine won't fit, do not fill and treat this machine as a full-size washer. Follow the provided guidelines/weight limits and this washing machine will clean your clothes with ease!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2b0aac03-3d95-4e7d-aaf3-16b1739e437f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Please refer to the included instruction manual and instructional product video found on this listing page! No installation is required! As long as you have access to a wall outlet and a place to drain your dirty water, this compact washing machine can be used anywhere!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2c4d8c5f-8344-4fc0-bf48-ba6249cb0a0f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Just like its larger counterparts, our washing machine offers the best results when clothes are evenly distributed and as balanced as possible. Uneven clothing can make the machine become unbalanced. This portable washing machine is most effective when clothes are distributed evenly and carefully.",
                "media_link": []
            },
            {
                "media_text": "Compact and space-saving! With an ETL-certified 250-watt motor, get the power of rapid water agitation just like its full-size household counterparts.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/544ec932-4b7e-4a06-932d-fee164597606.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Clean your clothes fast in 15 minutes or less! Simple Controls Select wash or spin cycles to run for up to 15 minutes. Clean laundry fast! Included Spin Cycle Drum A removable spin basket lets you load clothes to help remove absorbed water before air drying outside of the machine. Quickly Add Water Use the provided flexible hose to add water directly from your tap faucet. Easy Drainage Hose When you're done, drain dirty laundry water right to your bathtub or sink. No mess, no fuss!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a7674b5-11d6-4b88-a0c2-0804d0b7093b.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f1530ec-ac41-4324-a50a-3a9c27536e08.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0dfad210-7cd4-48cb-ae84-b5ab818930a7.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/847b71ff-9ebc-4ba3-a024-aa2f82dd83db.__CR0,0,300,225_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "How many clothes can I fit in this washing machine? The max washing weight capacity is 4.4 lbs (8.8 lbs wet) and the max spin capacity is 4.4 lb. Before using a spin cycle to help dry your clothes, wring out your clothes to remove excess water. Wash up to 8 underwear, 30 socks, 4 jeans, and 5 shirts. Why did my washing machine suddenly stop? This machine features a built-in mechanism to stop the motor from overheating. If you overload the washing machine during wash or spin cycles, you may trip this motor brake designed to stop the motor to prevent damage. Stay within in weight limits. How does the spin cycle work? This cycle does not use heat - instead, it relies on spinning a light agitating drum that helps to fling water from the articles of clothing. For best results, wring soaking wet clothes by hand and ensure they are equally distributed around the drum How many clothes can I dry at once? Ensure you do not overload the machine - never exceed 4.4 lbs of wet clothes. The machine will not spin if weight limit is exceeded to protect the motor. My clothes are still wet after using the spin dry cycle? Just like larger washing machines, spin cycles do not completely dry clothes. If you don't own a dryer, your clothes will still need to air dry after the cycle is complete. However, with less water in the clothing they'll dry faster!",
                "media_link": []
            },
            {
                "media_text": "Product Specifications Voltage 110-120V Frequency 60Hz Current 2.1A Washing Input Power 250 Watts Washing Capacity 8.8 lb (4.4 lb dry clothes) Spin Capacity 4.4 lb (wet clothes) Product Size 15 x 15 x 25 in Product Weight 15 lb",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2b0aac03-3d95-4e7d-aaf3-16b1739e437f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2c4d8c5f-8344-4fc0-bf48-ba6249cb0a0f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/544ec932-4b7e-4a06-932d-fee164597606.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a7674b5-11d6-4b88-a0c2-0804d0b7093b.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f1530ec-ac41-4324-a50a-3a9c27536e08.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0dfad210-7cd4-48cb-ae84-b5ab818930a7.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/847b71ff-9ebc-4ba3-a024-aa2f82dd83db.__CR0,0,300,225_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lacie ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBNMPUSLSCR3X47BLYEEO3ZG5QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28D84AK79T6IE?ASIN=B08WFG5X92",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Works Great in a Pinch",
                "reviewText": "Is this going to replace your full sized washer? Absolutely not. Can you do a full sized load of laundry in here? No. Not even close. But, will it save you from trips to the laundry mat? Absolutely!You get what you pay for, and in my case I paid for a cheap, small washer to use after mine unexpectedly broke down. Doing laundry was more of a chore, and more time consuming after using this - But I had clean clothes, and didn't have to leave the house to do my laundry.It gets your clothes plenty clean, and is fairly simple to use: Keep it on a level surface, throw your clothes in, and fill it with water. Then set it to your preferred time, and you're good to let it do it's thing.The hardest part of the machine is it's spin function. The inner basket is much smaller than a typical load will be, and it is time consuming to transfer your laundry back and forth, spin it multiple times, and then finally put it up to dry (or put it in your dryer, if you have one). The spin cycle works plenty well and your clothes do get wrung out very decently, but it is a time consuming process.Overall, this light weight portable washing machine is perfect for emergencies. It is also ideal for camping, or vanlifers.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vinson rollevinson rolle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHENOXOCKOWFDHUJ7HQ5PTXNZBHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JRC9IUZRPTKD?ASIN=B08WFG5X92",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2022",
                "reviewTitle": "1.0 out of 5 stars what a complete disappoint",
                "reviewText": "I am disappointed with this product and I wish I could get my money back.After all the hype and expectations, I was excited to buy this deco home portable washing machine, but what a disappointment it is, at this point, I would have already be made recommendations to other people to by the same, but now, how do I fix my face to say to these same people, that ether this product is still in its experimental development stage, I was the customer” gunny pig” and sad to say, this experiment failed.I unboxed and use the portable washing machine for the first time yesterday. There was a clicking sound coming from the timer and that’s the only thing that was working on this washing machine. As for the twisting at the bottom, I heard it, only after several times playing with the niggle, but trust me, there was no washing going on in that bucket at all, and then I thought it had some time to do with the voltage or watts, but my research yield that this was not the case, I made several attempts to wash my clothes, but then I gave up, the thing is a failure, and I want a full refund.Question what about quality control, are these things not tested before you allow them to leave your factory, and yes, I see there is a one year warranty, but because I live outside the UNITED STATES, it would be too costly to return, and so there goes my lost. I thought that in the long run, I would save, but all I have in my bathroom is a plastic barrel which I currently have no use for. I will research what legal rights I have in this matter. What a complete disappointment and a waste of my hard-earned money. this is a great idea, however, especially in taught times where people like myself are trying to find ways to the same money, under the right conditions this product would be an asset to me. but guess I am that unlucky sucker. dam!",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/414pXXejX7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "EdwardEdward",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEY7PZHGZ3PUZTIEDFQW7I4YBHEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5VEPE6B2KOKF?ASIN=B08WFG5X92",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Great simple and easy to use machine - realistic expectations",
                "reviewText": "I was looking for a portable laundry machine as I live in a big apartment building and have had bad experiencess using the shared laundry facilitiy on each floor. I did a lot of research and given my price range, this product seemed to be the best fit. I was not expecting incredible performance for the price point, however, I was pleasantly surprised after I reieved it and actually started using it. Please either watch some other review videos or read other reviewers as there are certain things you should keep in mind/do when using it. For example, do not overfill and make sure you are not just putting massive weight of clothes in. If the load fails to move much, you probably have it overfilled. If you hear strange noises in the rotation, or smell burning plastic/rubber, you are probably overfilled. Watch/learn how to use the basket used for drying. It will remove like 90% of the water in just a few min. Then it only takes a few minutes to dry out competely after you hang them.I also have my machine a bit elevated which eliminates the need for any type of water pump for draining as gravity handles it pretty well. I also purchased some sound dampening feet and use ratchet/tie down straps (refer to pics) as I have my machine on elevated platform made of metal. The feet reduced the noise when operating significantly. The tie downs also made a huge difference.f this product is within your budget range, I would recommend using it. But you need to learn how to use it properly and have your expecations set realistically.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61OlJ1br3EL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71xrtOC7FoL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "DeeDee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTWCQOOATPU7UQIMHSTFOYY2SWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKU0NXMW5GVRN?ASIN=B08WFG5X92",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2023",
                "reviewTitle": "3.0 out of 5 stars High probability of belt snapping apart",
                "reviewText": "I really like this little washer. Convenient for a small load. Or in between going to laundromat. The washer side is great and so is the dryer side. Really surprised how dry it leaves the clothes. Only one problem , I was putting it away moving off of the counter when I noticed a dust of rubber underneath , mind you this is my first day using this. I looked underneath, and it appears to be a rubber belt , idk what’s it’s purpose but it looks like it might be rubbing up on something to its scrapping it leaving rubber dust all over underneath and falling thru. I’m not sure how long till it breaks apart. There’s no way of even getting a hold of customer support for this. Might just return before it’s too late.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61E5P2kqNzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/913JNRaQYnL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zeineb",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 19, 2023",
                "reviewTitle": "Made my life easier",
                "reviewText": "I bought it for my apartment to help me with the small stuff. And it did the job",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diane",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 24, 2023",
                "reviewTitle": "Very good washing machine",
                "reviewText": "Very easy to use and its light machine so I can move it very easily. I would recommended it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lillian  Nauss  ( Katt )Lillian  Nauss  ( Katt )",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 18, 2023",
                "reviewTitle": "My washer",
                "reviewText": "Very compact perfect size for my apartment. Haven't used it yet will update once used",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61NTMjf2oeL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nora",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 19, 2023",
                "reviewTitle": "Super short drain hose!",
                "reviewText": "Super compact! Works great! Clothes are virtually dry after spin out!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew Masoud",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 2, 2023",
                "reviewTitle": "Excellent performance",
                "reviewText": "Easy to operate. Outstanding performance",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$119.99",
                "sellerName": "Beach Camera Same Day Shipping",
                "sellerRating": "4.5"
            }
        ]
    }
}