{
    "remaining_requests": 44429,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/EVGA-GeForce-Passive-Graphics-02G-P4-6332-KR/dp/B073VPKV26",
    "body": {
        "name": "EVGA GeForce GT 1030 SC 2GB GDDR5 Passive, Low Profile Graphics Card 02G-P4-6332-KR",
        "price": "$119.99",
        "originalPrice": "$129.99",
        "rawPrice": 119.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/EVGA-GeForce-Passive-Graphics-02G-P4-6332-KR/dp/B073VPKV26",
        "soldBy": {
            "sellerID": "A20YSPW1I1I0OV",
            "name": "OnlineSellingPartner",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A20YSPW1I1I0OV&asin=B073VPKV26&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07418KF7N"
        ],
        "asinVariationValues": [
            {
                "asin": "B071LGVBDM",
                "variationName": "Style",
                "variationValue": "Low Profile",
                "price": "$164.63",
                "variationImageURL": ""
            },
            {
                "asin": "B073VPKV26",
                "variationName": "Style",
                "variationValue": "Low Profile, Passive",
                "price": "$119.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51790WZML L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51xKvuCnBXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Pwx1I38pL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wC9bH-45L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/318j1SwaTfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41UkRvQnngL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kI EF 5 L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the EVGA Store",
            "link": "https://www.amazon.com/stores/EVGA/page/F3029F7A-6B99-483C-A7DE-92C7C6057C6B?ref_=ast_bln"
        },
        "brand": "EVGA",
        "merchantInfo": "OnlineSellingPartner",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1025,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Wednesday, February 14. Order within 14 hrs 10 mins",
            "FREE pickup Saturday, February 17",
            "Or fastest pickup Wednesday, February 14. Order within 14 hrs 10 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Real Base Clock: 1290 MHz/Real Boost Clock: 1544 MHz; Memory Detail: 2048MB 64 bit GDDR5",
            "EVGA GeForce GT 1030 - Super clocked performance",
            "2x faster than Intel Core i5 integrated Graphics",
            "Includes Low profile bracket"
        ],
        "description": "Accelerate your entire PC experience with the fast, powerful EVGA GeForce GT 1030 graphics card. Its award-winning NVIDIA Pascal architecture, powerful graphics engine, and state-of-the-art technologies give you the performance upgrade you need to drive today's most demanding PC applications. Unleash your creativity with stunning HD video and picture editing and enjoy incredible gaming. Now, you can do it all 2x faster than with Intel Core i5 integrated graphics. You can even get easy driver updates and ONE click game Optimization with GeForce experience.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "Graphics Cards",
                "link": "https://www.amazon.com/Graphics-Cards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=284822"
            }
        ],
        "productInformation": [
            {
                "name": "Memory Speed",
                "value": "‎6008 MHz"
            },
            {
                "name": "Graphics Coprocessor",
                "value": "NVIDIA GeForce GT 1030"
            },
            {
                "name": "Chipset Brand",
                "value": "‎NVIDIA"
            },
            {
                "name": "Card Description",
                "value": "‎Integrated"
            },
            {
                "name": "Graphics Card Ram Size",
                "value": "‎2 GB"
            },
            {
                "name": "Brand",
                "value": "EVGA"
            },
            {
                "name": "Series",
                "value": "‎02G-P4-6332-KR"
            },
            {
                "name": "Item model number",
                "value": "‎02G-P4-6332-KR"
            },
            {
                "name": "Item Weight",
                "value": "‎1.15 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎5.7 x 2 x 2.71 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎5.7 x 2 x 2.71 inches"
            },
            {
                "name": "Manufacturer",
                "value": "‎EVGA"
            },
            {
                "name": "ASIN",
                "value": "‎B073VPKV26"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎July 10, 2017"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,025 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,256 in Computer Graphics Cards"
            },
            {
                "name": "Graphics Ram Size",
                "value": "2 GB"
            },
            {
                "name": "GPU Clock Speed",
                "value": "1544 MHz"
            },
            {
                "name": "Video Output Interface",
                "value": "HDMI, DVI"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "EVGA GeForce GT 1030 SC 2GB GDDR5 Passive Features: NVIDIA GameWorks Technology - NVIDIA GameWorks pushes the limits fo gaming by providing a more interactive and cinematic game experience and thus enabling next gen gaming for current games. OpenGL 4.6 Support- Supporting the latest standards in the OpenGL API. NVIDIA GPU Boost 3.0- Dynamically maximizes clock speeds based on workload and allows enthusiast-class controls such as temperature target and fan controls, extra over-voltage headroom, and optimizations for water-cooling solutions. This allows gamers to push performance to new levels. Built for EVGA Precision XOC -This new version of Precision is built for the NVIDIA Pascal architecture and combines the best of EVGA Precision and EVGA OC Scanner to give you never before seen overclocking features and built in automatic tuning.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/8f961131-c43e-4605-ab58-c89773ac42e4.__CR57,0,371,371_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "More Features Low-Profile Ready This graphics card may be used in a low-profile form factor chassis upon installation of a low-profile PCI bracket. PCI Express 3.0 This card is designed for the PCI Express 3.0 bus architecture, offering the highest data transfer speeds for the most bandwidth-hungry games and 3D applications. It also maintains backwards compatibility with existing PCI Express motherboards for the broadest support. Vulkan API A next generation graphics and compute API from Khronos Group that provides high-efficiency, cross-platform access to modern GPUs. Microsoft DirectX 12 API Support for the latest Microsoft DirectX API to enable next-generation gaming.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/031e1219-834a-4788-98b1-4c8ac135812f.__CR22,0,390,390_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/8f961131-c43e-4605-ab58-c89773ac42e4.__CR57,0,371,371_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/031e1219-834a-4788-98b1-4c8ac135812f.__CR22,0,390,390_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "rvalens2rvalens2",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEO3UETZD6BJBDGPTCSRJY6VENQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R44RKSGXDXHZ?ASIN=B073VPKV26",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2020",
                "reviewTitle": "5.0 out of 5 stars How I Modified the GT 1030 to Fit My Dell 980 Optiplex MT (Mid-sized Tower Case)",
                "reviewText": "If you don't need a top of the line video card for gaming, this is an excellent choice. It's a quality card and is far superior to the two prior cards I had previously mounted in my old Dell 980 (EVGA Nvidia GT 610 and GT 630).I purchased the GT 1030 card because I wanted to eliminate the digital breakup I was experiencing whenever I streamed movies. But once it arrived I ran into a big problem. It would not fit into the mounting slot on my PC. Why? Because the heat sink for the CPU and the PS2 connection box were getting in the way. However, after studying the problem for a while I realized that if I modified the plastic casing on the card I could get it to fit.Luckily, this card was a return that I purchased from Amazon at a great price. So, I decided it was worth the gamble, knowing full well that if something went wrong I wasn't going to be able to return it.(Please note, this modification will void the warranty for the EVGA Nvidia GT 1030 — do it at your own risk.)HOW I MODIFIED THIS CARD TO FIT MY DELL OPTIPLEX 980 MTI knew this video card would work in my Dell 980 Optiplex MT, but I had a problem, the plastic case covering for the card kept it from fitting in the mounting slot.The head of the card would not fit because of the PS2 connection box on the motherboard. On the other end, I had a similar problem where it was striking the heat sink for the PC's CPU. My solution? Modify the plastic casing on the video card by cutting it and the card's heat sink aluminum blades.How do you do the modification?First, you need to remove the four screws that hold the plastic casing to the GT 1030. They are located on the backside of the card (see pictures). Once you remove them, the case will come loose except for the power connector for the fan. Be careful with the fan's power plug, it's hard to disconnect from the card but can be done if you use a jeweler's slotted screw driver to release it from the mount by pushing on the plastic spring holding it in place. Once it's disconnected, you are free to work on the case.You now need to remove the seven screws that hold the fan and the heat sink to the casing. With the plastic case released from the fan and heat sink, you can cut the case in two places removing about two inches of the plastic on each end (see pictures). I used a fine toothed hacksaw to cut the plastic case. I then used a Dremel (rotary tool) with a cutting disc to shorten the heat sink's aluminum blades on the back end by about 1 1/2 inches. Cosmetically, the card won't look so hot, but the important thing once reassembled it will fit.Reassemble everything in reverse order and then mount the modified case and heat sink back to the card. Once everything is back together mount it in your PC, boot up your computer and update the drivers. Windows automatically updated the drivers to version: 23.21.13.9135 dated: 3/23/2018. I also downloaded and tried the latest drivers from Nvidia, but they caused problems so I just stayed with the ones I had.Important Note:1. The bottom of the aluminum heat sink has \"thermal heat sink compound.\" You'll need to have some just in case you accidentally remove it as you do the modification. It's available here on Amazon. It's cheap. When I did this modification, I decided the easiest think to do was to remove the compound and replace it afterwards during the reassembly process. Thermal heat sink compound is used to transfer heat from video card's CPU to the aluminum heat sink where the heat is dissipated and cooled by the internal fan.2. The 7 screws you remove from the fan and plastic casing are tiny. You will need a jeweler's set of screw drivers in order to remove them. Also, be careful not to lose them as they will easily roll off your work surface.3. The power plug for the fan is difficult to disconnect from the card — be careful when you pry on the tiny plastic spring. If you exert too much force on the connection point you can damage the mounting slot on the card.The GT 1030 has been in my PC for almost a week now and it's working flawlessly. I'll try update this review in six months.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71FuLZ8+MAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71LglxQRe3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71NYXCS1YtL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71YoTD5tciL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71u38TJ1vuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81HMkQ0J9ZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81Ii46xVGNL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81LWSUT0nmL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joani EnfieldJoani Enfield",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENRAADKVVAJWZZ4LCF3SD73KHJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IS7RTVYNOFKD?ASIN=B073VPKV26",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2020",
                "reviewTitle": "5.0 out of 5 stars One of the best video cards for less than $100",
                "reviewText": "I had been using an NVidia GeForce GT 740 since 2009. It had served me well at the time, but over time, I found an increasing number of video games that I wanted to play that it wasn't capable of running. I finally decided to bite the bullet and upgrade to a new video card this year. After a very long search for a video card that was superior to the 740, but that still cost under $100, I decided on this GT 1030.I used websites such as GameDebate and PCGameBenchMark to help me make sure that it would run the games I like best. This is highly recommended because it saves a ton of time over searching for sites about each individual game to read the system requirements.Will it run the very latest games that just came out? Not all of them, but it will run a few of the ones I'm interested in. For example, it'll run Valorant and Fortnite, even on recommended settings, which came out very recently. It'll run almost anything made before 2018 except for notoriously high system requirement games like the Far Cry series (which it can kinda handle on low settings). Most of the games I enjoy the most are older games anyway, so this is a good choice for me.Update: Since I wrote the initial review, I have upgraded my processor from an Intel Core i3 3.4 GHz to a Core i5 2.8 GHz. I was getting good performance from the GeForce GT 1030 before, but games run even better now with this better processor working with it. If you have a processor that's even better than an i5, you'll likely notice and even better gaming performance than I do. I've noticed that many of the games that I tried the card with before where it only did just okay, now play noticeably better. Upgrading the processor hasn't given this video card any new abilities that it lacked before, of course, but it takes some of the processing stress of the video card allowing it to do a better job of what it can do.I realize that it would also be helpful to list the system specs of what I'm running this video card on: Windows 8.1 Pro 64 bit, ASRock H55M-LE motherboard, 8 GB DDR3 RAM, Core i5 2.8 GHz processor (which will go up to 3.1 GHz when it needs to), 650 Watt Corsair power supply (a bit over-kill now since this video card has actually lower power requirements than my GeForce GT 740 had), 1TB Western Digital hard drive, Antec Nine Hundred case with all fans installed, Razer Cortex used on games that support it. With a 'legacy' system like this, the sub-$100 GT 1030 makes sense as an upgrade since it takes the system much closer to its performance limits so that gaming on it will be more fun without costing so much that I can't afford to get a new motherboard, RAM, etc. down the road for a more drastic upgrade.The card itself is surprisingly small for something that's more capable than the bigger GT 740. It is thinner and a little shorter than the GT 740. It also doesn't need you to plug in a power cable into the end of the card itself as it is more energy efficient and gets all the power it needs through the PCI express slot provided that you have a good enough power supply. You need at least a 300 Watt power supply for it. I have a 650 watt PSU, which is more than enough.The small size gives it more room for air flow in most cases. Some video cards today are so huge that they'll barely fit, even in a big ATX mid-tower case. This card has plenty of room in my Antec Nine Hundred case (which is excellent by the way, if you can still find one). This video card only takes up one slot on the motherboard, so if you want to install another card such as a sound card, in a PCI slot near the video card, there's plenty of room for it.The GT 1030 runs very quietly and coolly. It doesn't increase the fan noise of my computer at all. I use Piriform's Speccy program to monitor my PC and even when I've been playing a graphics intensive game like Diablo III for an hour or two, this card isn't even close to exceeding its maximum temperature threshold of 96 degrees C.It sports two DVI ports which let you hook up monitors and display at up to 7680×4320@60Hz resolution. I use it on twin Acer K202 HQL monitors running at 1600 x 900 @60 Hz resolution with no problems. Just be sure to get DVI cables with narrow frames around their plugs. If you can't find one that has narrow enough plugs, you can trim off the plastic frame on either side of the actual metal male DVI plug to make room without damaging the cable.It's not the prettiest video card I've ever seen, but it is quite capable for the price range and is a great choice for computer cases that are not very roomy.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71OWrjgbF+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81kxvJCqYEL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Warthog",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4NHXVHK2LI37G6ORIEDRV6LVPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DDRF04VUYNRB?ASIN=B073VPKV26",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 7, 2020",
                "reviewTitle": "4.0 out of 5 stars Good value",
                "reviewText": "These NVidia 1000 series cards are excellent. I purchased this to replace an older card that was failing to put the monitor into a low power idle mode after a Windows software update, presumably because the driver for the old card became unsupported. Microsoft :(It's perhaps overkill for the uses my machine is put to (little to no gaming), but I think these cards have such huge installed base that there will be driver support for them for the length of the life of the life of the hardware.The only downside is that I hate HDMI connectors. They are simply unreliable. Display port is so much better. So one star off for no DP.If this had a display port connector it would have gotten an enthusiastic 5 stars for value.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jose M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 9, 2021",
                "reviewTitle": "Muy bien",
                "reviewText": "Me habría gustado más una gtx de 4gb pero no había presupuesto para tanto debido a la escasez de chips en en mercado con precios inasumibles. La tarjeta funciona como debe funcionar con los controladores de Nvidia. Me gusta bastante.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jordan Galván",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 19, 2020",
                "reviewTitle": "Excelente compra",
                "reviewText": "La tarjeta supero mis expectativas, la compré porque se descompuso mi Xbox y quería jugar en algo, la instale con 8 de ram y un i5-3470 y da para mucho, sobrada en lol, csgo, valorant,etc, mueve overwatch a 60fps gráficos medios 1080, rise of tomb Raider 1080 medios a 30 estables incluso pude jugar en ella el resident evil 3 remake a 1080 medios con 40 fps estables, es decir no harás un súper PC Master race con ella pero alcanza para una calidad de consola en muchos casos (habrá juegos donde la optimización no ayude) también me ayudó porque ahora no conecto al monitor por HDMI y no por el VGA como antes. Conclusión. Recomendadisima para mejorar un PC con sus años incluso meterlo al gaming aunque si vas a armar un equipo nuevo de cero no sería la opción que recomendaría",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Phil A",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 21, 2017",
                "reviewTitle": "Works great after a few weeks of use, minor install software issue.",
                "reviewText": "A compact, single-slot card that doesn't require any 6-pin power inputs. Installed after a little fiddling on my dual boot win7 set-up.My 64-bit SSD boot set-up fine with the installer, but my (default) 32-bit multi HDD boot appeared to try find the temp files on my 5th HDD instead of my C drive. No idea why as I used the custom installer set-up and selected the same options as my other boot drive.I had to manually update the drivers using windows device manager before it stopped running the from the default low res mobo driver. Then it worked fine.Update-after 3 months, I thought I'd give a performance review, since there are no other reviews on the .ca site.Good solid card, used primarily for web surfing and videos on a dual monitor set-up. No issues and being an EVGA product am not expecting any. I haven't played any pc games at all with this card, but coming from a 9800gt card I would say this is definately equivalent and uses significantly less power.I have the nice big heatsink, but it still fits fine with plenty of room on my dual slot pci ATX mobo and in a Corsair multi-bay case.*edited review as it incorrectly indicated my DDR5 card was fanless, it is NOT. Apologies for any confusion, I can say in my set-up with my activities, videos but no games, my case temps never rise.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ItsYa165",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 15, 2018",
                "reviewTitle": "Quite strong for the little tyke",
                "reviewText": "Before, I had an R5 230 which is 2GB of DDR3 (not even GDDR). It's clock speed wasn't even 1000MHz in anything. It had no Display I/O, it was basically a sound card for video.But, I saw EVGA's Superclocked Edition of the decent GT 1030. I wasn't expecting 1080p120fps, but it certainly reaches 1080p90fps in medium settings for most games. This GT 1030 can be overclocked to get even more out of it, this card isn't even designed for gaming, it's supposed to be for HTPCs and Blu-Ray 4K. I was surprised to see that I reached out to 60fps gaming on this low end GPU.If you don't plan on heavy gaming, this item makes a very good compromise for playing cinematically at around 40fps in 1080p on high settings. If you do want to sweat, get a GTX 1050 or wait for Geforce 11.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcos Gonzalez ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 29, 2021",
                "reviewTitle": "Es buena en calidad-precio",
                "reviewText": "Para juegos yo lo probé con el GTA V y con calidad media arrancó bien. Creo que es un producto con buena relación calidad-precio, ya que es algo economica y cumple con mis expectativas.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}