{
    "remaining_requests": 44636,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/GIGABYTE-GeForce-Graphics-WINDFORCE-GV-N4060OC-8GL/dp/B0CDJLSZ73",
    "body": {
        "name": "GIGABYTE GeForce RTX 4060 OC Low Profile 8G Graphics Card, 3X WINDFORCE Fans, 8GB 128-bit GDDR6, GV-N4060OC-8GL Video Card",
        "price": "$329.99",
        "originalPrice": "$329.99",
        "rawPrice": 329.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/GIGABYTE-GeForce-Graphics-WINDFORCE-GV-N4060OC-8GL/dp/B0CDJLSZ73",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41UgD5gfZ8L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31Hn9FqL3qL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41min3ZDuaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31EMd9VPU1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31WTN0XlCSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31UJmIztgxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/315uSMQwzML.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the GIGABYTE Store",
            "link": "https://www.amazon.com/stores/GIGABYTE/page/854232BB-540A-4979-BE5B-6F3F3A530F1E?ref_=ast_bln"
        },
        "brand": "GIGABYTE",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 43,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Tomorrow, February 13. Order within 1 hr 8 mins",
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Friday, February 16. Order within 15 hrs 38 mins",
            "FREE pickup Saturday, February 17",
            "Or fastest pickup Thursday, February 15. Order within 15 hrs 38 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Powered by NVIDIA DLSS 3, ultra-efficient Ada Lovelace architechture, and full ray tracing",
            "4th Generation Tensor Cores: Up to 4x performance with DLSS 3",
            "3rd Generation RT Cores: Up to 2x ray tracing performance",
            "Powered by GeForce RTX 4060",
            "Integrated with 8GB GDDR6 128-bit memory interface",
            "WINDFORCE Cooling System, Dual BIOS"
        ],
        "description": "Powered by NVIDIA DLSS 3, ultra-efficient Ada Lovelace architechture, and full ray tracing 4th Generation Tensor Cores: Up to 4x performance with DLSS 3 3rd Generation RT Cores: Up to 2x ray tracing performance Powered by GeForce RTX 4060 Integrated with 8GB GDDR6 128-bit memory interface WINDFORCE Cooling System, Dual BIOS. Ahead of its time, ahead of the game is the GIGABYTE GeForce RTX 4060 OC Low Profile 8G Graphics Cards. Powered by NVIDIA's new RTX architecture, the GeForce RTX 4060 OC Low Profile 8G brings stunning visuals, amazingly fast frame rates, and AI acceleration to games and creative applications with its enhanced RT Cores and Tensor Cores, along with a staggering 8 GB of GDDR6 memory.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "Graphics Cards",
                "link": "https://www.amazon.com/Graphics-Cards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=284822"
            }
        ],
        "productInformation": [
            {
                "name": "Memory Speed",
                "value": "‎17000 MHz"
            },
            {
                "name": "Graphics Coprocessor",
                "value": "NVIDIA GeForce RTX 4060"
            },
            {
                "name": "Chipset Brand",
                "value": "‎NVIDIA"
            },
            {
                "name": "Card Description",
                "value": "‎Dedicated"
            },
            {
                "name": "Graphics Card Ram Size",
                "value": "‎8 GB"
            },
            {
                "name": "Brand",
                "value": "GIGABYTE"
            },
            {
                "name": "Series",
                "value": "‎GV-N4060OC-8GL"
            },
            {
                "name": "Item model number",
                "value": "‎GV-N4060OC-8GL"
            },
            {
                "name": "Item Weight",
                "value": "‎1.26 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎7.17 x 2.72 x 1.42 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎7.17 x 2.72 x 1.42 inches"
            },
            {
                "name": "Manufacturer",
                "value": "‎GIGABYTE"
            },
            {
                "name": "ASIN",
                "value": "‎B0CDJLSZ73"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎August 1, 2023"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 43 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#65 in Computer Graphics Cards"
            },
            {
                "name": "Graphics Ram Size",
                "value": "8 GB"
            },
            {
                "name": "GPU Clock Speed",
                "value": "1830 MHz"
            },
            {
                "name": "Video Output Interface",
                "value": "DisplayPort, HDMI"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "AndreyAndrey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5GWOFZZW5I2AGTU4KJMP5E7SSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3O1GNH7V5RJTL?ASIN=B0CDJLSZ73",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent for 1080 gaming (can play on 1440 as well). Only 8 PCIe lanes",
                "reviewText": "In general - all mentioned in this review products are as described and working as described. Almost all deserve 5 stars (commented if one or more stars are taken off). Instead of reviewing item by item I decided to write one review for all products used for one specific PC build. The purpose of this PC build - compact gaming system which is able to play all recent games on adequate settings and can fit into a backpack or carryon bag. The recent attempts were not succeeded just because there were no powerful low profile (half height) graphics cards on the market (used PowerColor AMD RX 6400 LP and MSI Gaming GeForce GTX 1650 LP with a very little success) until the GIGABYTE GeForce RTX 4060 LP GPU came out. I did spend a lot of time researching for a proper small form factor case and finally succeeded.Items used in this build:--Item 1) Case: Micro ATX Case PC Case, Amazon https://www.amazon.com/gp/product/B0BY1PWP61/- Besides of compact size and good ventilation nothing special about this case, build quality is just ok, should be priced no more than $50 in my opinion. Anyway, this MicroATX case gives more breathing room with the Mini-ITX motherboard (item#5) and works perfectly for my project. I was able to significantly improve airflow by installing two 80mm fans. After components migrating from mini-ITX case (item#15) and installing 2 slots wide GPU (item#7) AIDA64 Extreme system stability full load test (all tests checked-CPU,FPU,Cache,RAM,Disks,GPU - simulates heavy intense gaming) after 3 hours with ambient temperature 20°C(68°F) gave me followed results: i7-11700K (125W TDP)(item#4) with all turbo boosts turned on in BIOS - temperature 82-85°C (100°C Max recorded) and cores runs at 3700-3900 MHz (above 3600MHz stock), Motherboard temperature 60°C (60°C Max recorded), GPU 81-84°C (85°C Max recorded), GPU hot spot 101-105°C (108.7°C Max recorded), GPU Max recorded power consumption is 132.37W, System disk 57°C (57°C Max recorded). System under load still adequately responsive and stable. Very impressive result. Monitoring was performed with CPUID HWMonitor ver 1.52.Case modifications (See attached photos): Drilled and painted 8 holes for two 80mm fans (have to be done precisely and carefully) and removed 1 Micro ATX pcb standoff because it interfered with fan installation (have to be done carefully). For improving airflow used adhesive pads (item#2) for increasing space between case bottom and surface and for case positioning with power supply on the top (not an option from the case manufacturer). Plate for disks mounting removed to improve airflow around GPU. Also the power led (white) too bright and making hdd activity led (red) almost not noticeable. I did swap them on the connector and got an excellent result. Also used cable ties of different sizes (not provided in any reviewed items)I wish the case manufacturer will make a similar but smaller (240 mm wide) mini ITX only variant with only 2x USB3.0 but with 2 x 80mm fan option on the front panel.--Item 2) Rubber Feet for Electronics Adhesive bumper pads. Amazon https://www.amazon.com/gp/product/B085DMB1XV/-Does the job - exactly what I need for the project.--Item 3) Power supply: FlexGURU Pro 500W Flex ATX, Amazon https://www.amazon.com/gp/product/B08BF1H5R1/- Little powerful workhorse, works very well.--Item 4)* CPU: Intel i7-11700K, Amazon https://www.amazon.com/dp/B08X6ND3WP?th=1- Good CPU, working well in gaming. The performance is behind the Ryzen 7 5800X, but i7-11700K cheaper. CPU i7-11700K is not the bottleneck in this specific project.--Item 5)* Motherboard: ASROCK Z590M-ITX/AX LGA1200, Amazon https://www.amazon.com/gp/product/B08X1MQL1L/- It is not a gaming motherboard but as far as I'm concerned, the bottleneck in this project is the GPU (still), so the ASROCK Z590M-ITX/AX with i7-11700K and 64MB DDR4 at 3600MHz fits well here. Everything on the motherboard is working as described and supposed to. The PCH heats up the M.2 SSDs, but this is what you expect from a small form factor mb. Using item#9 for better cooling. I bought 3 of these motherboards for different projects and all 3 performs very well.As a person working in the electronics device manufacturing business (position related to quality and defects analyzing) I can tell you that the chance to get defective (DOA) motherboard if it is new in the unopened and undamaged package is about 2:1000000 (or even less). My suggestions to avoid \"defective\" motherboard experience - always do this: check full compatibility of components before assembling the system, read the manual carefully before assembly (pay special attention to * notes), update BIOS to latest version as early as possible (some MB manufacturers offering the option to update BIOS before CPU installation), double check all cabling and connectors (especially check if RAM and GPU seating properly) before 1st power up and the most important things - do not rush, do all installations patiently and very carefully, use ESD protection (ESD gloves are the best), do not apply excessive force, do not overtighten the screws, be very careful with the screwdriver - do not touch the motherboard (one inaccurate touch with screwdriver can knock off a small component from the MB or cut the trace). In almost 30 years I never received a defective (DOA) new undamaged PC component. But I admit that I once returned the motherboard for replacement as defective because during installation of the aftermarket CPU cooler the screwdriver fell out of the groove and cut one of the northbridge bus traces.--Item 6)** Memory(low profile-34mm toll): Corsair Vengeance LPX 64GB (2x32GB) DDR4 3600, Amazon https://www.amazon.com/gp/product/B07YV9VYYY/-Very good product, works as described--Item 7) Graphics Card: GIGABYTE GeForce RTX 4060 OC Low Profile 8G, Amazon https://www.amazon.com/gp/product/B0CDJLSZ73/- Nothing much to say in addition to already posted reviews for this GPU - excellent for 1080 gaming (can play on 1440 as well but have to lower the settings because only 8GB of video memory), adequate power consumption and temperatures under load. For now this card has no competitors on the low profile (half height) GPUs market. I wish RTX 4060 had 12GB memory like RTX 3060. Also because RTX 4060 has only 8 PCIe lanes this GPU might not perform very well in older motherboards with PCIe Gen3X16 slot.--Item 8)*** SSD Disks:8.1) Primary (system): SAMSUNG 980 PRO SSD 2TB PCIe Gen4 NVMe M.2 SSD, Amazon https://www.amazon.com/gp/product/B08RK2SR23/8.2) Secondary (backup and media data): Crucial P3 4TB PCIe Gen3 NVMe M.2 SSD, Amazon https://www.amazon.com/gp/product/B0B25P44CL/- Very good products, works as described, no problems.--Item 9) M.2 Heatsink SSD Cooler (Black 2 Pieces) Amazon https://www.amazon.com/gp/product/B082VTVP51/- Very good and inexpensive product. Use these heat sinks instead of motherboard stock M.2 ARMOR (item#5) and under load get 3-4°C lower SSD temperature and 3°C lower PCH (chipset) temperature.--Item 10)** *** CPU cooler: DeepCool AN600 Low Profile CPU Cooler, Amazon https://www.amazon.com/dp/B0C4P8ZPWT/- Excellent construction design, keeps i7-11700K adequately cool in good ventilated case with installation B (low profile RAM)--Item 11) two 80mm fans (there are no significant differences during system stress test between these 2): 2 x Noctua NF-A8 PWM 80mm (better airflow), Amazon https://www.amazon.com/gp/product/B07ZH1F2KH/ or 2 x be quiet! Pure Wings 2 80mm PWM (cheaper), Amazon https://www.amazon.com/gp/product/B016XWZ5CQ/- Working fans, nothing else to say.---Item 12)**** Winncon PWM Fan Splitter Cable 1 to 2 Converter, Amazon https://www.amazon.com/gp/product/B07WN4G7KC/- good product, works as described--Item 13) Thermal Paste: ARCTIC MX-6. Optional - I have a very good experience using this thermal paste brand and always using it for the builds (so thermal paste provided by DeepCool was not used). Amazon https://www.amazon.com/gp/product/B09VDLH5M6/-----------------------------Notes:* - As the motherboard is not available now similar option is (or any compatible contemporary CPU / Mini-ITX MB combination): 3*) CPU: Intel i7-12700KF, Amazon https://www.amazon.com/dp/B09FXKHN7M/ 4*) Motherboard: ASRock H670M-ITX/AX LGA1700 DDR4, Amazon https://www.amazon.com/dp/B09PYP9HSM/** - Memory with normal height can be used but, in that situation, have to implement the installation A for the CPU cooler - worse airflow and as a result higher CPU and MB temperature - found by system stress testing with different installations (A and B) of CPU cooler.*** M.2 only - Top plate have to be removed to improve airflow around GPU, so no regular HDD or SSD can be installed in presented configuration**** - Optional: Using the fan splitter because CHA_FAN2 on ASROCK Z590M-ITX/AX looks like not PWM and same fans runs on different speeds if connected to CHA_FAN1/WP and CHA_FAN2 connectors (swapping fans - same result). Used the splitter to connect both fans to CHA_FAN1/WP connector for more precise fan speed control-----------------------------Products not in this build:--15) Goodisory A02 0.12in Mini-Itx Aluminum Desktop HTPC Chassis, Amazon https://www.amazon.com/gp/product/B07TDKCY1P/- Gave this case 3 stars only. I have used for a while Goodisory A02 0.12in Mini-Itx case and this product has multiple issues (excess heat the main problem):a) Airflow in this case is not good at all. If using graphics card side fans almost blocked and airflow in this case became terrible - AIDA64 Extreme system stability full load test (all test checked):Using i7-11700K (125W TDP) with all turbo boosts off (runs on stock speed only) after 45 minutes MB temperature reaches 82 degrees and CPU 105 degrees, blue screen appears and the system shuts down.In order for the system to be stable in case of graphics card installed I have to use i5-11600 (65W TDP) - this CPU became a bottleneck in some games. In my opinion the PSU and fan’s locations have to be swapped for better airflow.b) Vertical positioning is not an option from the case manufacturer - had to find out own solution (I did use side panels screws from old PC case)c) not enough vent holes on the lid and they are in weird positions - not providing the best airflowd) SSD activity LED basically not visible (using blue power LED for HDD activity – barely visible)",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61tLqqx5Z2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71s14h+1LaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Qx3JoQ5QL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81tI+HOxevL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "well-read and still learningwell-read and still learning",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHROOJPG5VUXYVMMTRTXWPXNGNZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGR8JNEGT2WWC?ASIN=B0CDJLSZ73",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Finally, a cost-effective low profile GPU",
                "reviewText": "Whether you need a low profile video card or not, this one holds its own against other, full-size RTX 4060s. It makes a good case for buying, because if you're like me and tend to change PC cases, this card means it'll fit in anything, even the smallest of cases.With a Ryzen 5600G and 16GB of 3200Mhz memory, I'm getting 10,500 scores in Time Spy, and it plays Cyberpunk 2077 at 70 fps with RTX on. Everything I've thrown at it plays really well.Best part is that my build only has a 450W power supply and at best I'm drawing around 280W. So, lower power means less-expensive power supplies.Personally, I love it. I bought it to replace an RTX a2000 and it's easily 30-40 percent faster depending on the game.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717PKDdFBWL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "carljdrexler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDLKHHVNQAYQQYPHXXOHOYUJVFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GNQUOANI1HHI?ASIN=B0CDJLSZ73",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Finally a RTX that is low profile",
                "reviewText": "I bought this RTX4060 to replace a GTX1650 that was low profile also. This video card has 8GB vs the 1650's 4GB. The cooler is a nice heat pipe cooler in a compact space with the 3 small fans. This 4060 has 2 Display ports and 2 HDMI ports. This card also needs a 8 pin PCIe connector that I needed a adapter for. and it states on the box the need for a 500w psu. The psu I'm using is 300w, by Silverstone. The psu came with a 6 pin connector I extend to a 8 pin adapter. The CPU I'm using is 65w Ryzen 7 2700 though too..I only am playing 1080p and with the games I play and this card can run at max other settings. I'm not having any issues with the card at all.Pros:small form factor low profile perfect for a HTPC or mini computer.fairly quietCons:-The 4060 can get pretty hot in the low profile case but that seems the issue with all the low profile video cards, in low profile cases...-needs a 8 pin PCIe connector that most TFX or low profile PSUs do not have.-needs a hard to find 500w psu, but I'm finding my 300w psu fine...",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BlakeBlake",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGU4X6BKRMWCGJBZ6WUWF3MI5VBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ICJGI91W7LAK?ASIN=B0CDJLSZ73",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Tiny but mighty!",
                "reviewText": "This is a far cry from the previous best half height gaming gpu, the 1650 (I’m ignoring the a2000 since it’s a workstation card and usually goes for more than it’s worth), in both power and performance. It does fall into niche category since it does require a PCIe power connector, which is a little odd since this form of gpu is popular in older/retired business desktops that don’t have those connectors, but this also means it’s a full 4060 with no limitations. At 100% usage, 110-120 watt power consumption, it definitely gets hot at around 72c on the core and 85c on the hotspot with definitely audible fans, not screaming loud like laptop or blower styled cooler audible but enough to tell that it’s working but putting on headphones will block out most of the noise, in ideal conditions and 76c on the core and 90c on the hotspot when closed up in the optiplex shell with bad airflow.Overall, a nice little card with no restrictions and not many caveats in an Uber-small form factor that’s currently the cheapest variant of this card. 10/10",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ERKdkeK8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 2, 2023",
                "reviewTitle": "Finally, a worthy successor to Nvidia 1650 / AMD RX 6400",
                "reviewText": "Low profile GPU fans have a tendency to be annoying loud.However, because this card has got three fans, they don't spin as high and are not loud. I was actually surprised how quiet it was. The three fans remained at 3,000 PRM at full load and kept the card at around 65c.Pretty good if you ask me.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Duderino",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 12, 2024",
                "reviewTitle": "Überraschend gut!",
                "reviewText": "Ich kaufte die Low-Profile Karte im Dez. 2023 um eine Geforce 1060 in einem Midi-Wohnzimmer PC zu ersetzen.Für die Größe, Stromverbrauch und Preis bin von der Leistung sehr positiv überrascht. Ich habe an einem anderen PC noch eine Geforce 4070 im Einsatz und der Unterschied fällt deutlich geringer aus als gedacht.Von Hogwards Legacy bis Cyberpunk ist alles butterweich spielbar. Klare Empfehlung für Geräte mit wenig Platz!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 6, 2023",
                "reviewTitle": "Great performance for half height systems",
                "reviewText": "As of now its the best low profile GPU available, the \"4060\" is generally not viewed well but in this form factor it makes more sense, its quiet, even in my very poorly ventilated chassis it stays cool enough.This card does require an 8 Pin PCIe power plug and the card draws 115w max, so you may need an adapter if your PSU hasn't got one if you plan to install this in an OEM type machine.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717Cn9rxp3L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}