{
    "remaining_requests": 44706,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/XFX-Speedster-QICK319-Graphics-RX-675XYJFDP/dp/B0B34M1YLW",
    "body": {
        "name": "XFX Speedster QICK319 Radeon RX 6750XT CORE Gaming Graphics Card with 12GB GDDR6 HDMI 3xDP, AMD RDNA 2 RX-675XYJFDP",
        "price": "$380.04",
        "originalPrice": "$399.99",
        "rawPrice": 380.04,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/XFX-Speedster-QICK319-Graphics-RX-675XYJFDP/dp/B0B34M1YLW",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51SdIAQ2xrL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31Aii9MUMzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31V1lhzcwkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31jx2J6dIGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31uPFI6cBQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31W8VhejQcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31p34cWObAL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the XFX Store",
            "link": "https://www.amazon.com/stores/XFX/page/D3547155-194B-48EF-8FD5-BAA21265DC12?ref_=ast_bln"
        },
        "brand": "XFX",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 830,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Tomorrow, February 13. Order within 8 hrs 32 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Chipset: AMD RX 6750",
            "Memory: 12GB GDDR6",
            "Cooling: XFX QICK 319 Triple Fan",
            "Boost Clock: Up To 2600MHz"
        ],
        "description": "The Speedster series exemplifies a modern aerodynamic style though clean and elegant design. It is a thoughtful design with the sole purpose of maximizing airflow to improve cooling and performance",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "Graphics Cards",
                "link": "https://www.amazon.com/Graphics-Cards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=284822"
            }
        ],
        "productInformation": [
            {
                "name": "Memory Speed",
                "value": "‎18"
            },
            {
                "name": "Graphics Coprocessor",
                "value": "AMD RX 6750 XT"
            },
            {
                "name": "Chipset Brand",
                "value": "‎XFX"
            },
            {
                "name": "Graphics Card Ram Size",
                "value": "‎12 GB"
            },
            {
                "name": "Brand",
                "value": "XFX"
            },
            {
                "name": "Series",
                "value": "‎RX 6750XT CORE Gaming"
            },
            {
                "name": "Item model number",
                "value": "‎RX-675XYJFDP"
            },
            {
                "name": "Item Weight",
                "value": "‎3.91 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎12.72 x 5.2 x 0.04 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎12.72 x 5.2 x 0.04 inches"
            },
            {
                "name": "Color",
                "value": "‎Black"
            },
            {
                "name": "Manufacturer",
                "value": "‎XFX"
            },
            {
                "name": "Language",
                "value": "‎French"
            },
            {
                "name": "ASIN",
                "value": "‎B0B34M1YLW"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎June 23, 2022"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 830 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#86 in Computer Graphics Cards"
            },
            {
                "name": "Graphics Ram Size",
                "value": "12 GB"
            },
            {
                "name": "GPU Clock Speed",
                "value": "2150 MHz"
            },
            {
                "name": "Video Output Interface",
                "value": "HDMI"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Travis byersTravis byers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHQ2VCU7C24C72SQM2M3EHEMHXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20JLM1LG3A2H6?ASIN=B0B34M1YLW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Impressive Performance and Value for Money",
                "reviewText": "I recently upgraded to the Radeon RX 6750 XT, and I couldn't be happier with my purchase. This graphics card offers a fantastic blend of performance and affordability, making it a compelling choice for gamers on a budget.Performance: The Radeon RX 6750 XT handled every game I threw at it with ease. Whether I was exploring open-world titles, engaging in fast-paced shooters, or immersing myself in the latest AAA releases, this GPU consistently delivered smooth and responsive gameplay. With its generous VRAM and excellent cooling solution, I never experienced any overheating or frame drops, even during extended gaming sessions.Value for Money: What truly sets this graphics card apart is its exceptional value for money. It competes admirably with more expensive options on the market, providing nearly the same level of performance at a fraction of the cost. It's the perfect choice for gamers who want high-quality visuals without breaking the bank.Ray Tracing and DLSS Support: The inclusion of ray tracing capabilities and support for AMD's version of DLSS (Deep Learning Super Sampling) is a game-changer. It brings a new level of realism to my gaming experience, making reflections, lighting, and shadows look incredibly lifelike.Efficient Cooling: The cooling system on the Radeon RX 6750 XT is highly efficient. It keeps temperatures in check while remaining relatively quiet, ensuring a comfortable gaming environment. The dual-fan design is both aesthetically pleasing and functional.Reliability: AMD has a reputation for producing reliable and durable graphics cards, and the Radeon RX 6750 XT is no exception. It's built to last and comes with a warranty for peace of mind.Final Thoughts: In conclusion, the Radeon RX 6750 XT is a stellar graphics card that offers remarkable performance, excellent value for money, and support for cutting-edge technologies like ray tracing and DLSS. If you're in the market for a mid-range GPU that can handle today's demanding games with ease, this card should be at the top of your list. AMD has delivered a winner with the Radeon RX 6750 XT, and I couldn't be happier with my purchase.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Q0Yocd-ML.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "G. Ritter von Olfers-Batocki",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHX2HTUL6WAUWPLXISRLHDHRCOEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GY46RRN5W1AC?ASIN=B0B34M1YLW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 30, 2023",
                "reviewTitle": "5.0 out of 5 stars 95% satisfied. Works as advertised but is overpriced with 359$ I paid for.",
                "reviewText": "UPDATE 01.10.2023. If you have an UPS between the wall plug and you PC make sure that can deliver enough Watt. My UPS beeps if the power draws more than 350 Watt. So I had to undervolt and tweak heavily the RX 6750 XT in order the UPS does not beep becauso of overload constantly while gaming. Since this GPU is super power efficient on idle, it draws only 5 Watt on idle, that is on normal tasks obviously not an problem. I play only Enlisted as game. So on Enlisted I had to adjust Adrenalin to follows so the entire system stays around 330 Watt as of the power drawing from the wall (UPS). Power % is on -6%, Max Frequency of the GPU is limited to 2425 Mhz and Voltage is reduced to 1170 mV. Undervolting the GPU on Adrenaline automatically gives me an value of 1175 mV so my manual undervolting is close to that. At 1160 mV undervolted the drivers tend to crash sometimes while gaming so 1170 mV is a stable value for this RX 6750 XT card. With these setting the Watt stays around 330 Watt as drawn from the UPS and on Medium settings on Enlisted I get around 330 fps, on High settings I get around 270 fps and on Ultra I get around 190 fps. At High settings and 270 fps the Hotspot temp of the RX 6750 XT shows 83 degrees Celsius and the GPU temp shows 73 degrees Celsius while the card is loaded to 97%. Mostly I sync the fps to my monitors Herz and that is 60 Hz in Enlisted and then the Hotspot temp is around 63 degrees Celsius (card load is around 20%).So make sure your UPS is capable enough for this card if not you can adjust on Adrenaline by limiting the GPU.MAIN ReviewI will update this review if in the future happens an issue.This works like advertised. The box came pretty much banged up but the inner box did not show any damages or tampering.The card had all plastic covers still on so this is an new product despite the banged up outer box.I recommend this RX 6750 XT.It showed at first installing and booting up the picture without any drivers installed. It gave me at booting up an picture. Then I installed Adrenalin and all is fine and adjusted.I installed this card in an XPG Invader case and it fits. It is an medium (midi) ATX tower case. It works together with the Ryzen 5900X, 64 GB DDR4 3200 MT/s Teamwork T-Expert RAM, 4 x 120 mm Arctic case fans, 600 Watt PSU, 120 GB Adata SSD, 256 GB Teamwork SSD and the MSi B450-A Max Pro motherboard. My first own build and allmost all components come from Amazon. This my own built was an \"proof of concept\" build.Be aware that your UPS must be big enough to deliver enough Watt for this GPU since my APC 500 beeps if the whole system draws over 350 Watt. Same UPS did not do that when in another similar sistem with the Ryzen 5700G and RX 6600 installed. Even undervolted this RX 6750 XT makes the whole sistem draw over 350 Watts from the socket and the UPS starts to beep so I have to limit the fps on the Enlisted game I play with this to 60 fps since my monitor is 60 Hz. I can go as high as 120 fps on the RX 6750 XT in that game without any problems but soon as I set the fps to 144 then the UPS beeps continuously. At 60 fps on high or ultra settings this RX 6750 XT draws around 70 Watts and on 120 fps it draws around 113 Watts.I tried to undervolt the GPU on Adrenalin already to 95% and -6% power but the UPS still starts to beep att 144 fps. At undervolting to 92% drivers crash. So one can undervol this RX 6750 XT only safe to about 95% while maintaining -6% power. Since it did not do a noticeable difference I just hit the undervolt automatically button instead of custom and it undervolts to 1175 mV. This GPU is indeed a bit to big of an power draw for my UPS but by careeful managing it will work.At idle this RX 6750 XT is very power saving drawing only 5 Watts (5 to 8 Watts). My RX 6600 draws on idle 4 Watts so this one is allmost as efficient.The fans of this XFX Qick stop below 60 degrees Celsius and turn only while gaming (Enlisted) on when the temps go over 60 degrees Celsius. At gaming the card is at hotspot mosttly at 64 degrees Celsius and the fans turn at 660 rpm. So this card stays cool due to it's massive cooler. Since my UPS does not allow for testing the maximum on fps I get with this card, I can not tell you in the Enlisted game how hot this XFX RX 6750 XT would get on full performance and without any fps restrictions.The end point of the GPU is somewhat flexible so you better use an GPU bracket holder to stabilize GPU drag.The quicker VRAM speed of this versus the RX 6600 makes that it uses less VRAM on the Enlisted game.Other than that this card has the potential to be one of the coolest cards due to it's superb cooling system.The backplate is metal (Aluminum) and acts as an heat sink which has heat transfer pads on both sides.Normally I go for the Asus or MSi brand and this XFX brand is new to me but it outperforms coolingwise already now my other Asus RX 6600. I chose the XFX brand since it is an american brand.I just read in the manual of the XFX that drivers and Adrenalin is not supposed to be installed before the GPU is istalled since the GPU will give the monitor automatically an signal or picture as it seems. After that you can install the Adrenalin software. Exactly as that it worked as well in my case. No problems whatsoever to get a signal, that is a picture on the screen.Only 359$ is a bit a steep of a price for this as this should be the price of the RX 6800 and the RX 6750 XTt should price around 300$ only. The price is a bit high at 360$, basically 60$ to expensive about.Specially no one knows the quality of the components used by XFX while one can be sure Asus will use most likely quality components which have an long durability. I have no clue what components and quality is XFX using in their GPU's. XFX cooling system is however superb and better than others as it seems.The cooling system of the XFX cards is held simple: massive grid cooler with slaped on fans and use of heat transfer pads. On the backside the aluminum backplate acts as an heat sink since it is connected with heat transfer pads for processor, VRAM and the like. Then 4 bigger heat pipes. An simple but effective cooling system.This XFX Qick RX 6750 XT has \"zero frost\". \"zero dB\" fans which are off below 60 degrees Celsius and the card is super quiet. No noise at all. No coil wind noise at all on mine.If the components hold up and are durable, then I recomment this brand. This card AMD RX 6750 XT is a good mid level card even in 2023.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mazen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 8, 2024",
                "reviewTitle": "Good",
                "reviewText": "Works great and as mentioned, recommended",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "alex Raigoalex Raigo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 21, 2023",
                "reviewTitle": "Va excelente",
                "reviewText": "Me salian siempre esos errores en warzone sin parar no podia jugar un dia sin que me salieran, algo que no me permitia jugar, pero el error era de Windows 11 y cambiandome al 10 dejo de pasar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71dl6Cdz+cL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71S+xZZL1qL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leonardo ZappiLeonardo Zappi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 25, 2024",
                "reviewTitle": "Rapporto Prezzo-Performance imbattibile",
                "reviewText": "Scheda robusta, performante e bella da vedere. Ottima per il 2k e incredibile per il FHD.Alcuni esempi:• Cyberpunk 2077 impostazioni ultra FHD ~85 fps medi.• Red dead redemption 2 impostazioni ultra FHD ~90 fps mediAlimentata con due pin da 8 e inizialmente impostata, con l’ultimo driver disponibile ad oggi, a 200w di consumo massimo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71NtLlDBoKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/812oz02nvmL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71BNZs-HSwL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jordan Relf-Haines",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 14, 2024",
                "reviewTitle": "Incredible build quality",
                "reviewText": "I decided to choose this card over the 6700 xt as this was cheaper and was essentially an overclocked version of the 6700 xt. I was not disappointed at all, I have been running 1080p at ultra settings whilst waiting for my new monitor and it has no issues with frame rate with me getting and average of 1700 fps on Farcry 6 which I was simply stunned to see those figures.I would greatly recommend this GPU to anyone looking at a mid priced build and as for the VRAM I haven’t even gotten close to maxing it out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aysko",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 3, 2024",
                "reviewTitle": "Satisfait",
                "reviewText": "Les performances sont au rendez vous pour un bon rapport qualité/prix permet jouer facilement en 1080p tout comme en 1440p en ultra, un peu de coilwhine pendant les grosses sollicitation (inaudible avec un casque) dans l'ensemble bonne carte graphique (sag légèrement)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$379.99",
                "sellerName": "Platinum Micro, Inc.",
                "sellerRating": "4.5"
            },
            {
                "price": "$379.99",
                "sellerName": "Fennec, Inc",
                "sellerRating": "5"
            }
        ]
    }
}