{
    "remaining_requests": 44426,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ADT-Link-External-Graphics-Bracket-GTX1080ti/dp/B07XYZ89J7",
    "body": {
        "name": "ADT-LINK M.2 Key M NVMe External Graphics Card Stand Bracket with PCIe3.0 x4 Riser Cable 25cm 50cm 32Gbs for ITX STX NUC VEGA64 GTX1080ti (50CM,R43SG)",
        "price": "$80.33",
        "originalPrice": "",
        "rawPrice": 80.33,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/ADT-Link-External-Graphics-Bracket-GTX1080ti/dp/B07XZ1F65H",
        "soldBy": {
            "sellerID": "A2LNZEPI7X9Y44",
            "name": "JMT Direct Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2LNZEPI7X9Y44&asin=B07XYZ89J7&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07XZ1F65H"
        ],
        "asinVariationValues": [
            {
                "asin": "B07XYZSX55",
                "variationName": "Color",
                "variationValue": "25CM,R43SG",
                "price": "$80.33",
                "variationImageURL": "https://m.media-amazon.com/images/I/416mvtPFJwL._SS36_.jpg"
            },
            {
                "asin": "B07XZ22HQ3",
                "variationName": "Color",
                "variationValue": "25CM,R43SG-TU",
                "price": "$79.18",
                "variationImageURL": "https://m.media-amazon.com/images/I/411SSZG5ofL._SS36_.jpg"
            },
            {
                "asin": "B07XYZ89J7",
                "variationName": "Color",
                "variationValue": "50CM,R43SG",
                "price": "$74.22",
                "variationImageURL": "https://m.media-amazon.com/images/I/416mvtPFJwL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31elgVJ9ZGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41a7Lkx1ebL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31AS9YbUnGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31h7OZfipbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31FsHM5nkIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41itDmCvneL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71HTNTNzCYL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a52b77d5-d3e0-4faf-90ec-43565260bd42/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the ADT-LINK Store",
            "link": "https://www.amazon.com/stores/ADT-LINK/page/04CF973A-B639-4C70-84C1-9B620F5FF29B?ref_=ast_bln"
        },
        "brand": "ADT-LINK",
        "merchantInfo": "JMT Direct Store",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 201,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Wednesday, February 14. Order within 2 hrs 10 mins",
            "FREE pickup Saturday, February 17",
            "Or fastest pickup Wednesday, February 14. Order within 16 hrs 40 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Graphics card compatibility: Only support for new graphics cards shipped after 2015 (old graphics cards shipped before 2014 are not supported).Does not support Mac.",
            "Motherboard compatibility: Notebook, ITX/STX motherboard, NUC, only supports M.2 NVMe interface Does not support M.2 SATA interface, does not support M.2 WiFi interface, does not support M.2 WWAN interface",
            "Power Description: The model that supports the power supply is DELL 12V/18A/220W power supply, or the standard ATX power supply. Please prepare or purchase the power separately.",
            "Bandwidth speed: PCIe3.0x4 (32G/s)",
            "Supporting power supply is DELL 8-pin 12V/18A/220W, or standard PSU power supply. The power supply should be prepared by the buyer or purchased separately."
        ],
        "description": "Features: Brand: ADT-Link Product model: R3G series products Product Name: Graphics card external adapter board extension cable Wire length: 25cm, 50cm (other length bulk orders can be customized) Graphics card compatibility: support for new graphics cards shipped after 2015 (old graphics cards shipped before 2014 are not supported) Motherboard compatibility: Notebook, ITX/STX motherboard, NUC, only supports M.2 NVMe interface Does not support M.2 SATA interface, does not support M.2 WiFi interface, does not support M.2 WWAN interface Power Description: The model that supports the power supply is DELL 12V/18A/220W power supply, or the standard ATX power supply. Please prepare or purchase the power separately. Bandwidth speed: PCIe3.0x4 (32G/s) Model Description: R43SG (M.2 NVMe interface) Installation steps: 1. Install the hexagonal copper pillar and insert the graphics card into the PCIe x16 slot. The screw is tightened so that the graphics card will not shake or fall off. 2. Install ATX power supply or DELL power supply, including graphics card power cord should also be connected, after installed, DELL power supply will light orange lights. 3. You can plug in the M.2 cable when the computer is off. After power on, the ATX power supply will automatically start the fan to turn. If you use the DELL power supply, the green light will turn on. At this time, the R3G board will turn on two green lights. The system will recognize the card automatically. Please install the graphics card driver. The installation of the driving process may prompt the computer to restart. 4. finish.Note:Our all cables doesn't support the machine with 2x CPUs.PC system requires WIN10 1909 version or higher. If it is lower than WIN10 1909 version, pls upgrade the system or reinstall before use.Otherwise the connected GPU doesn't recognize by system.Does not support Mac.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "Graphics Cards",
                "link": "https://www.amazon.com/Graphics-Cards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=284822"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "9.84 x 2.78 x 0.1 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.13 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "ADT-LINK"
            },
            {
                "name": "ASIN",
                "value": "B07XYZ89J7"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "N29511"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 201 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#251 in Computer Graphics Cards"
            },
            {
                "name": "Date First Available",
                "value": "September 17, 2019"
            },
            {
                "name": "Brand",
                "value": "ADT-LINK"
            },
            {
                "name": "Video Output Interface",
                "value": "PCIE"
            },
            {
                "name": "Graphics Processor Manufacturer",
                "value": "NVIDIA"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "专业"
            },
            {
                "name": "Included Components",
                "value": "power cable"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Gary",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW3FXKJXTL24GKEWZE2LABVFE7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RKKLXCWQSLO9?ASIN=B07XYZ89J7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "5.0 out of 5 stars This thing is awsome!",
                "reviewText": "Used this to add an external gpu to my emulation station build. Worked out really well!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Theresa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUAXDYYQ5WUZHQ6Q6CW4FKD2CVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QULAMD2X8JCC?ASIN=B07XYZ89J7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Works well",
                "reviewText": "Used it with a Lenovo laptop and used a etc 3080 10gb card. Works great!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tatan01Tatan01",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZXANJ36554Y4NULMS5CGIACQTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18EST8IGA1KU9?ASIN=B07XYZ89J7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Good shipping, technicall details are not fully stated",
                "reviewText": "The processing of the order took the 4 days time as specified with the provider, this component arrived in the lapse of 2 weeks and a few days in with other two components I needed for attempting to make a eGPU set up.The quality of the package is good, not premium, but it grants a secure shipping of the components, comes with propper bags to protect the electronics component (adapter itself) and the accesories to secure and isntall your GPU card. The quality of the componnent is quite optimal, material has a good resitance (treat with care nontheless, be sure to manipulate it releasing electrostatic charge).The only dissappointing point of the product description is that you don't have a direct warning about its exclusive compatibility with a thunderbold compatible mini pc or an adapter extension for mini PCIe for thunderbolt laptops, you must do proper research and ask around to secure your investment and make sure you have the proper complimentary hardware to make this purchase worth your money (Regular ATX power supply unit and the mentioned additional components).",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61bBmczIfAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71z4WeuD9IL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "GGS EngineeringGGS Engineering",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLJKVSSZZR2MBHHKJ65JB3NVFSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QQE2BMW6STOO?ASIN=B07XYZ89J7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Beelink 5560u and external GTX1060 on ADT dock",
                "reviewText": "Having available an unused older but good Geforce GTX 1060 GPU and a power supply, I saw the opportunity to speed up my Beelink SER 5 5560U mini desktop computer at a reasonable cost.I mounted the GPU externally on the ADT-LINK M.2 Key M NVMe. With an LG 27UN850 4K, 27 inch monitor, on start up, resolution was automatically set by W11 to 3840x2160. The results were immediately noticeable and excellent, with faster booting of W11 and loading and viewing beautiful 4K highly defined and nicely colored images and videos, and no pixilation.For my Beelink plus external GPU setup, the GPU benchmark test score is 34.689, comparable to latest high end GPUs (although this number does not guarantee the GTX 1060 will run more demanding modern games at full settings.) UserBenchmark test reports: “With a brilliant single core score, this CPU (AMD Ryzen 5560U) is the business: It demolishes everyday tasks such as web browsing, office apps and audio/video playback. Additionally this processor can handle moderate workstation, and even light server workloads. Finally, with a gaming score of 85.4%, this CPU's suitability for 3D gaming is very good.” Regarding graphics, “53.3% is a reasonable 3D score (RTX 2060S = 100%). This GPU can handle the majority of recent games but it will struggle with resolutions greater than 1080p at ultra detail levels. (Note: general computing tasks don't require 3D graphics).”I’m not over clocking, so CPU and GPU temperatures are in the 50s to 60s C. The system is absolutely quiet, no fan noise.The project required preparation, aided by YouTube videos (ADT’s instructions are basic.) The ADT’s Link m.2 cable plugs into the Beelink m.2 NVME slot. To free it up I purchased a 250 GB SSD for W11 system and applications, and a one TB SSD for Dropbox documents, files, family photos and videos. The new 250 GB plugs to SATA ribbon inside the mini, and the one TB data SSD is plugs to an external USB 3.2 port via a SATA to USB cable. For the leftover original 500 GB m.2 storage card, I purchased a SATA to USB enclosure adapter.To free up the m.2 slot before plugging in the 250 GB system SSD, I moved my Dropbox folder to the one TB SSD (using Dropbox’s move instruction.) I then connected the 250 GB SSD to a USB port and cloned W11 and system from the m.2 storage to it. For the cloning, I used the trial home version of Macrium Reflect. These operations required a couple of hours.The GPU on the ADT dock, and power supply connections were straightforward and easy, thanks to keyed plugs. And YouTube videos.Everything worked on power up! W11 recognized the external GPU, installed the driver and adjusted the monitor resolution to the maximum. No configurations were required.Was it worth spending $182 on the ADT dock, two SSDs, one enclosure and a cable? Given that I already had the excellent value and current Beelink 5560U, plus a dated but good GPU and a power supply, for the maxed out 4K resolution, speed and quality I’m seeing, absolutely, yes! Would I buy it all separately and assemble? No.However, with this ADT external GPU dock and the Beelink 5560U CPU, I can keep my gear current by upgrading to more RAM memory and later to a newer more powerful GPU, especially if I return to MS Flight Sim, and maybe VR. If you’re a gamer, however, to save money in the long run, buy the right gear the first time around.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71X4BLNdnTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marshall AMarshall A",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQSS6YI6ZAHE6IPR2EU2CWXDJTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LN2YBSOP6LYU?ASIN=B07XYZ89J7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2023",
                "reviewTitle": "5.0 out of 5 stars IT DOES WHAT YOU WANT VERY WELL!",
                "reviewText": "I added this to a TrigKey S5 Ryzen 7 5800H mini computer. Needless to say that if I wanted to play every game possible on that computer, then I would need a graphics card, but I wanted it without having to buy a whole new PC. The computer is great. The ADT link is great. Here is a list of my Pros and Cons to help you decide if this is right for you.Pros:- You can run a graphics card off of a laptop, mini computer, or anything with an m.2 NvMe slot I imagine. This makes everything extremely versatile.- You can turn off the driver to the integrated graphics and solely rely on the GPU which may free up the CPU so that it can work a little harderCons:- The m.2 adapter can get pretty hot inside the computer or laptop. This can be fixed with some simple thermal pads. I highly recommend it for anyone doing this to a mini computer.- There will be a cap. The M.2 slot can only process information so quickly. I run an RTX 3060 12GB VRAM from this and I don't have anything to compare it to. Eventually the GPU will be held back by the processing speed of the m.2 just beware of that before going out a blowing a bunch of money on an awesome graphics card unless you plan to use it in a build later.- I'm sure you've read it by now, but the computer can power a GPU, so you will have to buy a PSU. You can buy on of the 8 pin dell cables, but I recommend getting a PSU so that you can get more out of your GPU",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710fJgx0gtL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stanley Thuy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFACUTSEFGE6CB233GRGTRLH2B3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIQDJK68RJU1X?ASIN=B07XYZ89J7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars A must need for any old pc, laptop, or mini pc",
                "reviewText": "I used this to turn my mini pc into and full functioning gaming computer. My mini pc was really limited, this brought up the frames and functionality of my pc. I would recommend looking into this product before you buy it because you will be needing a power supply inorder to use it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donghyun Lim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNYEPPHFWIWVWR5D4K4RXL6H5UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R206PWR96KO4R3?ASIN=B07XYZ89J7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Working very well",
                "reviewText": "Working perfectly as intended. The power was the issue.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDG3EILXDPIR6ATOA6ZHUCDCFFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26D4HT8YAYP4K?ASIN=B07XYZ89J7",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2022",
                "reviewTitle": "1.0 out of 5 stars Useless. Manufacturing customer service told me: \"Go figure our yourself\"",
                "reviewText": "Bought this product to link my 11800h+3070 laptop to an external 3080 GPU. Turns out that the system can recognize the graphics card but have no video output. Tried all things there is, including watching videos online and contacting everyone who might have a clue. After 2 days of waiting (The weekend), we finally get the factory on the China side to respond. The service team told me to: Go reinstall the system. I asked if there was any reason for him to believe a new system is needed, and the agent told me to do it or leave it.The service includes the reseller on the US side as well, added their Whatsup, and called their number. No one answers.I will give it 0 out of 5 if I can. If you buy this product, you are pretty much on yourself. If you cannot figure it out, then no one will help.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 26, 2022",
                "reviewTitle": "Easy to setup",
                "reviewText": "Work great right out of the box",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RazorXYZRazorXYZ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 2, 2023",
                "reviewTitle": "Polished product",
                "reviewText": "I was skeptical about the eGPU bootleg solutions available, however the product works just as described. 'Plug and play' in my case, using a Lenovo ThinkBook 14 G3 ACL and using ASUS GTX 770 or ASUS Strix GTX 980 TI. The device is connected to the laptop's internal M.2 NVME PCIe 3.0 x4 port and running Windows 10. Note that this laptop model comes with either two M.2 ports (one PCIe x4 and one x2) or one M.2 and one SATA - so check what is your exact configuration prior. The laptop detected the GPU as a generic display device and after installing the connected GPU specific drivers it identified them as the correct model showing up both in device manager and task manager. I didn't need to make any adjustments in BIOS or Windows other than installing the respective nVidia GPU drivers.Testing the solution didn't require me to fiddle with any special Windows settings, just set the Windows power settings to performance and plugged in the power adapter for the laptop; the graphical load was automatically sent to the external GPU and the performance was exponentially better than the onboard graphics. I left Unigine test to run for one hour - all temps were in spec for both the eGPU and the laptop. I also tested a few games (WARNO, DarkSouls 3, Dying Light), all working without any issues with >1080p @ 60-120 FPS with High-Ultra settings.Bottom line, the product exceeded my expectation both in build quality and ease of use. Looking forward to see how it will behave in time. 5 starts and fingers crossed that it won't explode my - still in warranty - laptop.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51OZqol5BnL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Pereira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on May 29, 2023",
                "reviewTitle": "É impossível eu conseguir usar propriamente",
                "reviewText": "Para referência, estou a usar um pc com um i7-6700 e a gpu é uma asus turbo gtx1070. Não consigo usar isto com windows 10, deixa-o muito lento. Tenho tido resultados menos maus com o ubuntu, mas também há problemas que tiveram que ser corrigidos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mathieu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in France on May 22, 2023",
                "reviewTitle": "Inutilisable après 6 mois",
                "reviewText": "BonjourAprès 6 mois et à peine une dizaine d'utilisation, le produit est devenu inutilisable. La carte graphique n'est plus reconnue. J'ai essayé sur d'autres PC et avec d'autres carte graphique et le résultat est toujours le même.J'aimerai entre en contact avec le vendeur pour un remboursement ou un échange mais je n'ai pas de lien pour le faire...",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BLACKWEI",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 12, 2023",
                "reviewTitle": "Bueno",
                "reviewText": "está bueno pero es muy caro para lo que ofrece y su cable es muy corto, ya aviso, la banda de memoria no supera los 128gb por segundo, o ni eso, asi que la experiencia máxima de la gráfica que uses no será alcanzada.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}