{
    "remaining_requests": 44707,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/N730K-2GD3H-LPV1-NVIDIA-GeForce-GDDR3/dp/B0972NWRDY",
    "body": {
        "name": "MSI N730K-2GD3H/LPV1 NVIDIA GeForce GT 730 2 GB GDDR3",
        "price": "$60.99$60.99",
        "originalPrice": "",
        "rawPrice": 60.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/N730K-2GD3H-LPV1-NVIDIA-GeForce-GDDR3/dp/B0972NWRDY",
        "soldBy": {
            "sellerID": "A3DIOR28F6LKC9",
            "name": "My Secret Style",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3DIOR28F6LKC9&asin=B0972NWRDY&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/410iTGpNFiL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41oEudIs0cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41VfqTSpF2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41q 6fkh9NL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YtADj2tfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31TRhpk10KL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the msi Store",
            "link": "https://www.amazon.com/stores/MSIGaming/page/4B9191C5-F3E7-4101-993F-ABD067C141BB?ref_=ast_bln"
        },
        "brand": "MSIGaming",
        "merchantInfo": "My Secret Style",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 653,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Tomorrow, February 13. Order within 1 hr 2 mins",
            "FREE pickup Saturday, February 17",
            "Or fastest pickup Tomorrow, February 13. Order within 11 hrs 32 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Memory: 2GB, GDDR3",
            "PCI Express 2.0 interface type",
            "Memory clock speed: 1600MHz",
            "Ports: 1 x HDMI, 1 x VGA (D-Sub)",
            "Chipset: NVIDIA"
        ],
        "description": "MSI NVIDIA GeForce GT 730 2GB GDDR3 Graphics Card has a low profile design to save more space. It makes building slim or smaller systems easier.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "Graphics Cards",
                "link": "https://www.amazon.com/Graphics-Cards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=284822"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "1.54 x 5.75 x 2.72 inches"
            },
            {
                "name": "Item Weight",
                "value": "10.2 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0972NWRDY"
            },
            {
                "name": "Item model number",
                "value": "912-V809-3861"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 653 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#462 in Computer Graphics Cards"
            },
            {
                "name": "Date First Available",
                "value": "June 11, 2021"
            },
            {
                "name": "Manufacturer",
                "value": "MSI COMPUTER"
            },
            {
                "name": "Language",
                "value": "English, English, English"
            },
            {
                "name": "Graphics Coprocessor",
                "value": "NVIDIA GeForce GT 730"
            },
            {
                "name": "Brand",
                "value": "MSI"
            },
            {
                "name": "Graphics Ram Size",
                "value": "2 GB"
            },
            {
                "name": "GPU Clock Speed",
                "value": "902 MHz"
            },
            {
                "name": "Video Output Interface",
                "value": "HDMI"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Antonio  Di Gregorio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEE3GFMTWXBK736ZZUZTPTWK4DEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPK63NKJHR81F?ASIN=B0972NWRDY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great. Has advertized.",
                "reviewText": "Works great. Has advertized.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on January 26, 2024",
                "reviewTitle": "excellente carte graphique, à recommander pour pc de bureau.",
                "reviewText": "je recommande d'installer le driver suivant qui supprime l'ancien de ma carte gt630 2 Go, bruyante à cause de son ventilo HS et réinstalle correctement le panneau de configuration nvidia qui ne répondait plus.pc asus desktop cm6330 8 Go devenu silencieux avec une diminution du bruit de 16 dB (de 66 à 50dB).https://www.nvidia.com/download/driverResults.aspx/112197/en-us/GeForce Game Ready Driver Version: 376.19 WHQLRelease Date: 2016.12.5Operating System: Windows 10 64-bitLanguage: English (US)File Size: 375.91 MB",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis H Segovia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on October 29, 2023",
                "reviewTitle": "MUY BUENA A ESE PRECIO",
                "reviewText": "Instalación fácil y puesta en marcha prácticamente inmediata. Tardó unos minutos en detectar el segundo monitor ( el secundario) pero finalmente lo detectó y se puso a funcionar sin que yo hiciera nada....imagino que lo que tardara el PC en encontrar los drivers en internet",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alan Herd",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 6, 2023",
                "reviewTitle": "Easy to Install, Silent and works well. Highly recommended.",
                "reviewText": "Arrived quickly and came complete with optional brackets so can be used in either a full size slot or as a side by side. Installed without any issues on Windows PC. Runs 140fps at low quality on World of Tanks and around 90fps at medium quality. Silent version with large passive heat sink, ideal for bedroom. No overheat issues. Excellent upgrade to home PC and great value for money. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "QuirinusB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on March 19, 2023",
                "reviewTitle": "Perfect 2e kans product",
                "reviewText": "Perfect 2e kans product en ook heel snel geleverd. Niet van nieuw te onderscheiden.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FFrankFFrank",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 6, 2022",
                "reviewTitle": "📢 Une excellente carte graphique d'entrée de Gamme Nvidia. Parfait pour une 2 GO ! 👍👍😊",
                "reviewText": "The media could not be loaded. 💡 Motif de l'achat de cette carte graphique :👉 Acheté pour récupérer les 2 GO alloués à la carte graphique intégrée à mon PC. Passant ainsi de 14 GO à 16 GO.☑️ Après l'installation de cette dernière, les performances de mon PC ont tout de même augmentées tant au niveau de la vitesse et de la fluidité que de la qualité graphique et vidéo.☑️ Cette carte est parfaite pour des applications en bureautique. Par contre, pour le gaming, c'est un peu juste il vous faudra opter pour une carte graphique offrant plus de GO, ce qui tout est à fait normal et ne remet nullement en cause la qualité et les performances de cette dernière.💡 Installation de la carte graphique :☑️ Facile et rapide, il suffit de d'insérer la carte dans la baie PCI Express 16x de votre PC, y brancher votre écran, et voilà c'est terminé. Celle-ci sera reconnue automatiquement lors du redémarrage de votre PC.👉 Je précise que mon équipement est un PC HP EliteDesk 800 G1 Intel G3220 et mon système d'exploitation est Windows 10 professionnel💡 Caractéristiques de la carte GeForce GT 730 :☑️ La carte GeForce GT 730 est une carte Nvidia d’entrée de gamme. Elle fonctionne à 902 MHz en utilisation normale.☑️ Cette carte est dotée de 2 Go de mémoire DDR3 fonctionnant à 1,8 GHz.☑️ Elle transite de données sur le bus 128 bit avec une bande passante de 25,6 Gb/s.☑️ Elle est munie d’une interface PCI Express 2.0 x16 pour être insérée sur la carte mère.☑️ La carte dispose de 3 sorties vidéo : 1 VGA, 1 HDMI et 1 DVI. Cette carte peut ainsi être utilisée pour upgrader les Unités Centrales qui ne comportent qu’une sortie VGA.☑️ L’Unité Centrale upgradée peut ainsi être connectée sur les appareils nouvelle génération adoptant des connectiques d’entrée vidéo DVI ou HDMI.☑️ La GT 730 est en \"Low Profile Format\", ce qui permet de la placer sur n’importe quelles Unités Centrales présentes sur le marché.💡 Performance de la carte :☑️ Cette carte consomme une puissance TDP de 49 Watts. La puissance conseillée minimale pour le boitier d’alimentation du PC hébergeant la GT 730 est de 300 Watts.☑️ Pour la vitesse de texturation, la GT 730 transfère 11,2 GT/s.☑️ La GT 730 traite 268,8 gflops en virgule flottante.☑️ La MSI GT 730 est silencieuse car la conception du système de refroidissement a été bien pensée.☑️ Grâce au radiateur imposant posé tout le long de la carte, le GPU et la mémoire ne sont pas en surchauffe.☑️ L’ESR est de ce fait plus faible.☑️ La GT 730 fournit une résolution maximale analogique 2048 x 1536 et une résolution maximale numérique 2560 x 1600.☑️ Elle peut prendre en charge 2 écrans simultanés.☑️ Les limitations matérielles sur la GT 730 sont comblées par les différentes fonctionnalités logicielles prises en charge par la carte pour booster ses performances.☑️ La carte supporte notamment Microsoft DirectX 12, NVIDIA 3D Vision Ready, NVIDIA Adaptive Vertical Sync, NVIDIA CUDA Technology with OpenCL support, NVIDIA FXAA Technology, NVIDIA PhysX technology, NVIDIA PureVideo HD Technology, NVIDIA TXAA Technology …☑️ La carte supporte notamment Microsoft DirectX 12. DirectX 12 permet une gestion multitâche des instructions graphiques. Avec la DirectX 11, les tâches graphiques étaient groupées sur un seul core CPU, ce qui entrainait une latence de traitement assez notable. Par contre, avec la DirectX 12, les tâches graphiques peuvent être réparties sur différents cores CPU. Ce qui rend les traitements rapides et sans à-coup.☑️ NVIDIA 3D Vision Ready permet à la carte de prendre en charge les écrans et lunettes 3D en stéréoscopique. La carte fournit de ce fait une résolution Full HD assez fluide et sans cassure pour le plus grand bonheur des amateurs de jeux 3D.☑️ Elle prend également en charge la NVIDIA Adaptive Vertical Sync. Lorsqu’elle est activée, elle permet d’éviter les saccades et les cassures d’image en sortie. On observe généralement des images saccadées quand le frame rate est assez faible et des images en cassure en FPS trop élevé. L’Adaptive Vertical Sync active ainsi la V-Sync quand le frame rate est trop élevé pour éviter les cassures d’image et le désactive en frame rate trop bas pour fournir des images non saccadées.☑️ La NVIDIA FXAA Technology assure quant à elle un temps de traitement minimal en utilisant un shader post-traitement qui analyse les images et ne traite que les zones assez différentes. C’est donc le système anti-aliasing de NVIDIA en réponse au MLAA d’AMD.☑️ Elle prend en charge également TXAA. Cette dernière permet de réduire les scintillements. Elle gère efficacement l’anti-aliasing mais consomme plus.☑️ La PhysX permet de profiter d’un moteur physique qui fournit des effets réalistes. Il permet aussi aux 96 cœurs de la GT 730 de prendre en charge certains calculs, soulageant ainsi le CPU de certaines charges.☑️ Le CPU pourra ainsi traiter d’autres tâches plus importantes. L’ensemble serait ainsi plus efficace et ne subira point de saturation. PhysX est en effet pris en charge par les cartes telles que la GT 730 ayant plus de 32 cœurs CUDA et 256 Mo de mémoire.☑️ Cette carte graphique arrive à fournir un frame rate de 47,5 FPS en 720p. Par contre, si on augmente la résolution de sortie, la GT 730 atteint ses limites. En ultra 1080p, on obtient 3,5 FPS et en QHD le frame rate moyen obtenu est de l’ordre de 0,5 FPS. Cette carte peut donc être utilisée en résolution 720p et inférieure. Elle n’est pas conseillée pour jouer au-delà de cette résolution, car vous aurez des images moins fluides voire saccadées.💡 Conclusion :☑️ C'est une excellente carte graphique qui en offrant de nombreuses caractéristiques de qualité a répondu bien au delà de mes attentes. Le prix de cette dernière est largement justifié par ses diverses performances et de sa large compatibilité. Elle mérite donc amplement ses 5 étoiles avec une recommandation toute particulièrement positive.👉 Pour plus de détails, j'ai joint quelques une vidéo et quelques photos à mon commentaire , en espérant que l'ensemble vous sera utile pour vous aider à faire votre choix. 📹📷",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Ong+Iy-xL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71-bRqrSRkL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51Sk+dEjYJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71GFLNDZyGL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71jVAT4pSxL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/F13i6rZQDUL.mp4"
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$60.99",
                "sellerName": "BesTechDeal",
                "sellerRating": "4.5"
            },
            {
                "price": "$60.99",
                "sellerName": "AIO Mall",
                "sellerRating": "3.5"
            },
            {
                "price": "$88.80",
                "sellerName": "My Secret Style",
                "sellerRating": "4.5"
            }
        ]
    }
}