{
    "remaining_requests": 44719,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/XFX-Radeon-1386MHz-Graphics-RX-580P8DFD6/dp/B06Y66K3XD",
    "body": {
        "name": "XFX Radeon RX 580 GTS XXX Edition 1386MHz OC+, 8GB GDDR5, VR Ready, Dual BIOS, 3xDP HDMI DVI, AMD Graphics Card (RX-580P8DFD6)",
        "price": "$129.99",
        "originalPrice": "$129.99",
        "rawPrice": 129.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/XFX-Radeon-1386MHz-Graphics-RX-580P8DFD6/dp/B06Y66K3XD",
        "soldBy": {
            "sellerID": "AVXAH5375YZB8",
            "name": "Fennec, Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AVXAH5375YZB8&asin=B06Y66K3XD&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08CBNMV1R"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "11",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41yVQQIoz1L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41T58w9INrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NhQzxS0CL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418RqUe9dlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41oG1wTKpiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sfGqDpQPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Rd9R3UFaL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef4b85b0-176c-4c82-95b5-7c87d7494cca/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b55467f5-eccb-4eeb-899c-246c340aa7f3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ec0add7-06e2-4777-89a5-3a38f651632e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6a23c6e6-5dca-4fce-b504-9d78b427f227/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/617iBJug0NL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91QJyGaMv-S.pdf"
        },
        "byLineInfo": {
            "name": "Visit the XFX Store",
            "link": "https://www.amazon.com/stores/XFX/page/D3547155-194B-48EF-8FD5-BAA21265DC12?ref_=ast_bln"
        },
        "brand": "XFX",
        "merchantInfo": "Sold by LIFEANDUS and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 7580,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Wednesday, February 14. Order within 15 hrs 49 mins",
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Wednesday, February 14. Order within 8 hrs 4 mins",
            "FREE pickup Tuesday, February 20",
            "Or fastest pickup Wednesday, February 14. Order within 15 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The XFX RX 580 series graphics card feature the latest Polaris architecture which includes the 4th gen GCN graphics cores, a brand new display engine, new multimedia cores, all on the revolutionary next finfet 14 process technology for enhanced performance and efficiency",
            "Equipped with XFX double dissipation cooling technology for optimal cooling and performance. Minimum power requirement is 500 watts. Memory clock true: 8.0GHz, boost OC : 8.1GHz",
            "Multiple factory GPU overclocked settings - 1366 MHz true clock and 1386 MHz OC",
            "AMD VR ready premium - Experience the new generation of compelling virtual reality content with the Radeon RX GTS graphics card paired with the leading VR headsets. The Radeon RX GTS graphics card coupled with AMD LiquidVR technology delivers a virtually stutter-free, low latency experience, essential for remarkable virtual reality environments"
        ],
        "description": "XFX Radeon RX 580 GTS XXX Edition 1386MHz OC+, 8GB GDDR5, VR Ready, Dual BIOS, 3xDP HDMI DVI, AMD Graphics Card (RX-580P8DFD6) Product description (optional): XFX Radeon RX 580 GTS XXX Edition 1386MHz OC+, 8GB GDDR5, VR Ready, Dual BIOS, 3xDP HDMI DVI, AMD Graphics Card (RX-580P8DFD6) XFX Dual BIOS Mining - We know enthusiast like options, our RX 570 and 580 graphics cards are shipped with a Dual BIOS. If you want optimal gaming performance just install it and go. For cryptocurrency mining, simply shut the system down and flip the BIOS switch on the card. Our mining BIOS is already tuned to give increased mining hashrates without hassle. Radeon CHILL Technology - Radeon Chill is an intelligent power-saving feature for Radeon graphics that dynamically regulates framerate based on your movement’s in-game. During peak gameplay, Radeon Chill works to deliver the full framerate potential of Radeon graphics. As movement decreases, Radeon Chill reduces your gameplay framerate. Designed to save power, lower temperature, and increase GPU life, Radeon Chill enables high performance graphics when you battle and saves power when you explore. High Performance Unibody Heatsink - The XFX RX RS series features our all new Unibody VRM Heatsink construction enable direct transfer to the primary heatsink and heat pipes. This unique combination of material and construction enhances thermal efficiency by a total of 40%. XFX Exclusive Ultra Low Noise XL Inductors - GPU inductors are notoriously noisy with that tiny buzzing noise caused by traditional low quality inductors but XFX's exclusive premium quality XL Inductors utilize multiple layers to seal the Inductors completely and securely nearly eliminating inductor noise.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "Graphics Cards",
                "link": "https://www.amazon.com/Graphics-Cards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=284822"
            }
        ],
        "productInformation": [
            {
                "name": "Standing screen display size",
                "value": "‎1"
            },
            {
                "name": "RAM",
                "value": "‎8 GB"
            },
            {
                "name": "Memory Speed",
                "value": "‎1386 MHz"
            },
            {
                "name": "Graphics Coprocessor",
                "value": "Radeon RX 500 RX 580"
            },
            {
                "name": "Chipset Brand",
                "value": "‎AMD"
            },
            {
                "name": "Graphics Card Ram Size",
                "value": "‎8 GB"
            },
            {
                "name": "Brand",
                "value": "XFX"
            },
            {
                "name": "Series",
                "value": "‎RX-580P8DFD6"
            },
            {
                "name": "Item model number",
                "value": "‎RX-580P8DFD6"
            },
            {
                "name": "Item Weight",
                "value": "‎1.85 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎10.63 x 1.57 x 4.88 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎10.63 x 1.57 x 4.88 inches"
            },
            {
                "name": "Computer Memory Type",
                "value": "‎DDR5 SDRAM"
            },
            {
                "name": "Flash Memory Size",
                "value": "‎8"
            },
            {
                "name": "Manufacturer",
                "value": "‎XFX"
            },
            {
                "name": "Language",
                "value": "‎English"
            },
            {
                "name": "ASIN",
                "value": "‎B06Y66K3XD"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎April 18, 2017"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 7,580 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#28 in Computer Graphics Cards"
            },
            {
                "name": "Graphics Ram Size",
                "value": "8 GB"
            },
            {
                "name": "GPU Clock Speed",
                "value": "1.37 GHz"
            },
            {
                "name": "Video Output Interface",
                "value": "DVI"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "XFX True Clock Technology BIOS Controlled overclocking. Software controlled clock speeds can be hindered by overall computer performance. XFX's True Clock however is hardware controlled clock speed performance optimization, so your card is always running at an optimized performance level",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/254f6607-383b-43e9-b2c9-0952429358e0._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "XFX OC+ Capable Going Beyond True Clock. While True Clock locks in a super fast optimal speed on a hardware level, RX Series cards with an OC+ rating are tested at the factory to go even beyond XFX's True Clock. We encourage you to try these factory tested speeds by using the simple to use AMD Wattman utility, letting you squeeze every last bit of performance out of your card.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/afb31ca9-2a3c-4f36-85e0-d5ee09f684e1._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "Enhanced VRM and Memory Cooling Cooling technologies don't stop at just the GPU. After countless hours of research, development, and testing our engineers have developed all new VRM and Memory cooling technology, reducing temperatures VRM by up to 30' C and GDDR temperatures by 20' C, all while reducing dB noise by an additional 5%.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/40a59704-a662-4f27-a5a3-5ab72dc7c681._CR0,0,300,300_PT0_SX300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/22066af2-a557-4473-bb21-f1c857551ed6._CR0,0,970,300_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/254f6607-383b-43e9-b2c9-0952429358e0._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/afb31ca9-2a3c-4f36-85e0-d5ee09f684e1._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/40a59704-a662-4f27-a5a3-5ab72dc7c681._CR0,0,300,300_PT0_SX300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marvin Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGM6XF3FXZBNNAENPHF4TZC2WRBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BTI3DVCZR731?ASIN=B06Y66K3XD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Unleash Your Gaming Potential with the XFX Radeon RX 580 GTS XXX Edition!",
                "reviewText": "I recently upgraded my gaming rig with the XFX Radeon RX 580 GTS XXX Edition, and I couldn't be happier with the results. This graphics card delivers a stellar performance that exceeds expectations, making it a fantastic choice for both casual gamers and enthusiasts alike.The first thing that caught my attention was the sleek design of the card. The red and black color scheme gives it a stylish and aggressive look that adds a touch of gaming flair to my system. The build quality is excellent, and the card feels robust and well-constructed.But looks aren't everything, and the RX 580 GTS XXX Edition truly shines when it comes to performance. The 8GB GDDR5 memory and 2304 stream processors ensure that demanding games run smoothly with high frame rates. Whether I'm exploring open-world landscapes, engaging in intense firefights, or enjoying the latest AAA titles, this graphics card handles it all with ease.One of the standout features is the XFX True Clock Technology, which optimizes clock speeds to maximize performance. This ensures that the GPU operates at its peak potential, resulting in a more responsive and immersive gaming experience. I've noticed a significant improvement in graphics quality and fluidity, even when playing at higher resolutions.The cooling solution on the RX 580 GTS XXX Edition deserves special mention. The dual-fan design effectively dissipates heat, keeping the card at optimal temperatures during extended gaming sessions. The fans are also remarkably quiet, contributing to an overall quieter gaming environment.Installation was a breeze thanks to the user-friendly design and clear instructions provided by XFX. The card supports multiple display outputs, including HDMI and DisplayPort, offering flexibility for different setups.In addition to its impressive gaming performance, the RX 580 GTS XXX Edition is also a solid choice for cryptocurrency mining, adding extra value to the investment.Overall, the XFX Radeon RX 580 GTS XXX Edition is a powerhouse that delivers exceptional performance, striking aesthetics, and reliable cooling. Whether you're a gamer or a content creator, this graphics card is a fantastic choice that won't disappoint. It has certainly elevated my gaming experience, and I wholeheartedly recommend it to anyone in search of a high-quality, budget-friendly graphics card.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G.S. FordhamG.S. Fordham",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGM2FXCQZLLSBUPQYYR6ZYPFZDKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TCOS24CH2YPL?ASIN=B06Y66K3XD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2019",
                "reviewTitle": "5.0 out of 5 stars Works great, except OC or downclocking the VRAM on Linux, great benching, MST works fine",
                "reviewText": "EDIT 2: Have now tested the card with 6 monitors (first newest pic -- not to be confused with the older, mismatched size monitors in previous pics, where one was running off an RPi). The active/powered MST hub I attached works, and it DOES support all 6 screens, no additional configurations needed (even on Linux! as that's what I use).[NOTE: MST stands for Multi-Stream Transport, and it is the ability of later DisplayPort and Mini DisplayPort to attach 2 or 3 monitors to the same DP connector that show as physically separate screens (NOT just duplicating the screen the way some HDMI \"splitters\" do)].I have tested this with both 1080p and 720p (I use 720, because my eyes are just too bad to see the smaller text, and previous scaling settings sometimes conflicted with certain programs), and both settings work fine.I am very impressed, overall, with how much this card is able to do.Other than OC on Linux or downclocking the VRAM, the only other things I can think another user might need to test are higher res monitors (I will NOT be testing that, due to eyes) and VR performance (probably will not be able to test this myself for at least a while, if I even am able to, at all, with my awful eyesight).Looking back at the original review, though, I DO have to update a couple other things:1) I have not experienced that screeching noise in a long time. It might have been a wire I was using.2) When I wrote that fan controller, it is no longer quieter than my RPi, although it is still quieter than my new high-powered fans (in other newest pic).3) I have tried it with some games, and it plays them fine. It also benches really well on Heaven -- I tested it a while back across a 2x2 of my monitors (before buying the newest ones) with max spec and 3D anaglyph, and it still ran well, so you can easily use this for most games.-----EDIT 1: Have now had card for about a year, and I've added more monitors to it, as you'll see in my newest pics. It's still going strong, but I did replace the thermal paste on the sink with Arctic MX 4.I find that I was able to lower temps on it by getting more powerful fans and improving cable management.Have written software to control the fans and clock on it from a Web UI, but I have had no luck getting it to overclock to the supposed 1386MHz, nor have I had any luck clocking down the VRAM. Perhaps that is the curse of using Linux, but I USUALLY use it just to run many screens, so I don't particularly NEED to OC the GPU clock. Would be nice if the VRAM clock rate could stay down, though, to save power -- the issue I've had with that is that it keeps going back up to 2000MHz right after I write to the /sys/ driver file; screens flicker as it clocks the VRAM down, but then it goes right back up. IDK if such an issue exists on other 580s, so I can't rate that down, b/c it might not have anything to do with XFX.---------ORIGINAL REVIEW:So far, seems to be working quite well. I am currently using it with 3 displays (2x 1080p monitors and 1x 1680x1050 TV -- aspect ratio sucks on the TV and can't display 1080p w/o part of the screen falling off the sides -- not the card's fault; it does that on whatever it's connected to).All of them are connected to the displayport connectors using DP to HDMI cables.Monitoring it from my sensors program, it tends to run (after having warmed up) between 47-50°C idle, or around 49-52° with a YT video playing. Have not actually tried it for gaming or mining yet, though.Pretty much noiseless. My Rasp Pi with coolers is actually louder than this card.Do, however, recommend that your case be designed with airflow in mind, and maybe get more powerful fans. When I was using a positive-pressure design, the air passing over it and through the holes in the PCIe slots was not enough, and it both idled around 53-55°C, AND it pushed my CPU temps up by around 5-7°, as well (CPU is right above it). Changed this, and both cooled down by several degrees.Running it with Debian GNU+Linux, and as long as you have the amdgpu driver installed, it seems to have no issues. Sadly, have not found any software to control its clocks or fans through GNU+Linux, though.NOTE: It's important to know that it actually registers as an RX 470/480. I talked with someone about this, and it's because it uses the same Polaris chips, just clocked up and updated.Couple little glitches that sorta irk me, but not enough to bring down score:1) Sometimes, it produces a low screeching-like noise on startup for each monitor. Probably a signal transfer thing. Weird, only happens sometimes, a little annoying, scared me a bit at first.2) It also causes my BIOS screen to flicker several times after POSTing and before the bootloader runs. Also freaked me out the first couple times, but now I'm used to it.Neither of the aforementioned glitches occurred when using my Ryzen 5 2400G iGPU (before purchasing this card), so I think it has something to do with the card itself (could be the wires, though, but I have no other DP devices to test them with). Not major, but things that I paid attention to, nonetheless. As far as I'm aware, if you experience this, it's not an actual issue, just a quirk -- will update on that if I need to, though.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/712T+-eQ6JL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/717TMwV4VlL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71CbqAPyx-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71E7c2cgAxL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71S5a2i8+GL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71UwW93hI3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71nLb2Z2M0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71pjFoaflUL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin Espinoza",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQRWPNQTWU3QXEZ3XACZFDGJH5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35ZZQ9ZO3JIZO?ASIN=B06Y66K3XD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Good for the price",
                "reviewText": "I’ve been using this card for around a month and I could say it’s definitely worth the money. The card is amazing in performance and can run games like Ark Survival Evolved on epic settings. Although there is a little issue which is the Gpu fans they do not turn on unless under load, this is an easy fix you have to go into the AMD adrenaline software and go into the Gpu tuning section and adjust fan speed. By doing this it keeps the Gpu cooler. It also seems other people had this same issue so I hope this helps someone.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEATCKZ65W5AASTBCEJDTBY7F6PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34KYISI4YG2WR?ASIN=B06Y66K3XD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "4.0 out of 5 stars Good price for great performance in previous generation GPU!",
                "reviewText": "Good price for great performance in previous generation GPU! I purchased the XFX Radeon RX 580 GTS XXX Edition in the following condition:\"Condition: Used - Very Good - Cleaned, Thermal paste freshly re-applied, may have some scratches.\"The GPU was relatively clean, however, the heatsink fins were dust encrusted and there was some pet hairs that collected in the corners of the heatsink. In addition, there was quite a bit of fine dust on the front and back of the GPU card. I would recommend that if you buy this GPU in Used condition, you should examine it carefully and clean it if you find it in similar condition as mine. Keep in mind, this is a used GPU, so you have to expect to find some dust on the card and heatsink - it probably will not have been deep cleaned.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danrlei",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 19, 2022",
                "reviewTitle": "Excelente placa de vídeo",
                "reviewText": "Excelente custo benefício",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ash",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 10, 2023",
                "reviewTitle": "Ziemlich klasse Gerät",
                "reviewText": "Temperatur steigt bei manchen Spielen auf gut 42Grad (7 Days to Die zB.), aber ansonsten kann ich nichts neatives über die Karte sagen, sie tut was sie soll, das genügt mir.Die Radeon Treiber machen mukken, wenn man 2 Bildschirme laufen hat und bei etwas anspruchsvolleneren Spielen auf dem 2. Bildschirm z.B. ein YT Video laufen hat, dann gibts fehlermeldungen und man muss YT schließen.Aber ansonsten alles TOP.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Natalia Cza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 7, 2023",
                "reviewTitle": "GPU",
                "reviewText": "This GPU is great for the fact its a few generations behind and it runs many games on medium to high quality. Only downside is the fans are a little loud.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 8, 2019",
                "reviewTitle": "buen producto a buen precio",
                "reviewText": "pues bien conseguí la tarjeta a precio reducido , me anime a comprar esta tarjeta por el buen rendimiento que en la mayoría de juegos supera la gtx 1060 de 6gb pero a un precio mucho menor y también por la promoción de 2 juegos a elegir de CAPCOM Y UBISOFT (mas adelante les diré como conseguir el cupón)pues bien con cierto nerviosismo por comprar o no una tarjeta grafica de AMD por la fama de gastar mucha energía y las temperaturas al final me decidí a comprarla por el buen precio y al ver gameplays en donde su rendimiento era algo que me animo mucho a comprarla , si bien en sus primeros días de lanzamiento no se veía muy convincente su compra pero al día de hoy con las actualizaciones de drivers la rx580 se ha vuelto una tarjeta grafica de gran peso en su rendimiento , en mi caso pude jugar the shadow of the tom rider en graficos altos y 1080 con un framerate de 60 fps en su mayoria con el vsync activado , y es impresionante lo bien que va y también con el demo de resident evil 2 es brutal el rendimiento logrando el mismo rendimiento que con tom rider , lamentablemente no todo es miel sobre hojuelas y pues al final la fama de las tarjetas graficas es cierta la temperatura si son altas en donde me vi obligado a elaborar un perfil para el ventilador para mantener la temperatura a los 70°c dicho perfil con juegos de alta demanda gráfica alcanza el 80% de la velocidad máxima del ventilador en donde el ruido si es muy perceptible pero pues nada esta perdido se puede elaborar un undervolt para bajar el consumo y las temperaturas de la tarjeta sin sacrificar el rendimiento , en stock la tarjeta consume 145w en su carga máxima , sinceramente me apareció un consumo muy por de bajo del que tenia previsto el cual era de unos 180 a 195 w en cual nunca alcanzopues bien para conseguir el cupón de los juegos lo que hice fue mandar un inbox al facebook de AMD mexico , en mi caso ya me había comunicado en el chat de atención a clientes de amazon en donde no tuve una respuesta satisfactoria para la entrega de el cupón de los juegos , les comente en el facebook de AMD mi situación y me pidieron el comprobante de compra de amazon y el mismo día que envié el comprobante me enviaron el cupón , en amd rewards te solicitaran hacer un formulario en donde pondrás tus datos y el cupón con capturas de pantalla de donde recibiste el cupón y el comprobante de compra y listo después de unos días tendrás tus juegos (ojo después de enviar el formulario revisen su cuenta de amd rewards constantemente para que vean los juegos en la pestaña de mis recompensas , no siempre recibirás un email en tu correo avisando de que ya están disponibles los juegos)",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ange",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 21, 2020",
                "reviewTitle": "Bonne carte pour les budgets moyens",
                "reviewText": "J'ai acheté cette carte pour monter mon propre pc gamerJ'avais avant cela un pc tous monter que j'ai gardé 5 ans et qui commençais un peu à vieillir (elle comportait une GTX 750 pour vous dire)Et après plusieurs comparatif je suis parti sur cet achat pour mon nouveau pc- La carte est arrivé dans les temps bien emballé, aucuns problèmes à ce niveau la- Très bon design (elle rend encore mieux en vrai que sur les photos)- Assez simple à installer (c'est un peu la même chose pour toute les cartes graphique)- Une fois le pc allumé j'ai directement installer les drivers nécessaire (ce qui est fortement conseillé dans la notice car cela permet de tirer les meilleurs performance sur la carte)J'ai ensuite installé tous mes jeux et commencer à jouerVoici quelques bench (en 1080p)Warzone : entre 70 et 90 fps avec les setting haut et quelques réglagesFortnite : environ 70 à 80 fps avec tous les settings au max, et plus de 144 fps avec quelques réglagesCS:GO : Entre 300 et 400 fps par moment, ce qui ma permit de profiter du 144hz sans soucis (pensez à bloquer à 144 fps sinon ça sert pas à grand chose)League Of Legends/Valorant : la même que pour CS:GO pour atteindrez très facilement les 144 fps sans aucun soucisGTA V : 50 à 60 en full ultra avec quelques réglagesATTENTION : je tiens à notifier que ses benchmark ne reflètent en rien les performances de cette carte graphiqueTous va dépendre de la config que vous utilisez derrière, je conseille fortement de regarder des benchmark directement sur YouTube ou sur des sites spécialisésMais concrètement cette carte graphique est très bonne pour le prix auquel je l'ai acheté (175 euros)Et je la conseille fortement pour les personnes qui veulent se monter leurs pc gamer",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$129.99",
                "sellerName": "Fennec, Inc",
                "sellerRating": "5"
            }
        ]
    }
}