{
    "remaining_requests": 13334,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wantdo-Womens-Hooded-Thicken-Quilted/dp/B09P8L5LLN",
    "body": {
        "name": "wantdo Women's Plus Size Lightweight Puffer Jacket Packable Hooded Winter Jacket Long-Sleeve Quilted Coat",
        "price": "$69.98 - $79.98",
        "originalPrice": "",
        "rawPrice": 69.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/wantdo-Lightweight-Packable-Long-Sleeve-Quilted/dp/B09P8J5HM9",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B09P8J5HM9"
        ],
        "asinVariationValues": [
            {
                "asin": "B09P8KSKSG",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31wbpa6Qx9L._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09P8JSMJ4",
                "variationName": "Color",
                "variationValue": "Light Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41bYsKd01aL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09P8L7JDB",
                "variationName": "Color",
                "variationValue": "Navy",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31jlyPIsRGL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09P8KPF5R",
                "variationName": "Color",
                "variationValue": "Rose Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41OW-FB-txL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09P8JZ94B",
                "variationName": "Color",
                "variationValue": "Wine Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31NDLWnCLhL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09P8JT655",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41f52-+uyvL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09P8KSKSG",
                "variationName": "Size",
                "variationValue": "1X",
                "variationImageURL": null
            },
            {
                "asin": "B09P8KDZZH",
                "variationName": "Size",
                "variationValue": "2X",
                "variationImageURL": null
            },
            {
                "asin": "B09P8KFJLG",
                "variationName": "Size",
                "variationValue": "3X",
                "variationImageURL": null
            },
            {
                "asin": "B09P8KFRHY",
                "variationName": "Size",
                "variationValue": "4X",
                "variationImageURL": null
            },
            {
                "asin": "B09P8L5LLN",
                "variationName": "Size",
                "variationValue": "5X",
                "variationImageURL": null
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31wbpa6Qx9L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31Ta-8Wn2eL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xWUsVsxwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61JU5-aw9SL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4117z2RUweL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41eSvY F65L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41RyQINSjAL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the wantdo Store",
            "link": "https://www.amazon.com/stores/Wantdo/page/A1352C62-3AB6-4A73-BCBA-993F74F4F881?ref_=ast_bln"
        },
        "brand": "Wantdo",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 210,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Global Recycled Standard (GRS) verifies the percentage of recycled content and tracks it from the source to the final product."
        },
        "features": [
            "Fabric type Recycled Polyester",
            "Care instructions Machine Wash",
            "Origin Imported",
            "100% Recycled Waterproof Fabric- Our women’s plus size puffer jackets are made with recycled polyester, which requires far fewer resources than new fibers and generates fewer CO2 emissions. The shell fabric with a 3,000mm waterproof rating effectively keeps out light rain.",
            "Big is Beautiful - This plus size winter coat for women is made available in different modern and stunning colors. Choose from size 1X to 5X to ensure a custom, comfy, and figure-flattering fit, and show off your classic taste in clothing by sporting this zip-up jacket.",
            "Travel in Style - Made of 50D 400T nylon, our stylish, compressible, and lightweight down jackets for women are ideal for on-the-go use with this packable down jacket's carrying pouch - perfect to bring on travels and commutes.",
            "Windproof & Warm - Battle strong winds without worry with the women's winter jackets women can count on. Our bubble jacket for women lets you indulge in superior support and warmth even under challenging weather conditions.",
            "Exceptional Quality - This fully-zippered and hooded packable jacket boasts a windproof design and robust construction, perfect for slight rain and snowy weather. This packable puffer coat also employs 2 zippered pockets which keeps what you need within reach."
        ],
        "description": "A good choice for fashion and warmth with plus size down jacket By Wantdo What you need is a warm enough women's outdoor jacket that doesn’t skimp on quality, performance, and style! Our women's winter jacket and puffer jacket collection is designed to keep you warm and cozy in any weather condition. The puffer jacket is durable, lightweight, and incredibly warm. And if you are still troubled by the limited size chosen, our plus size puffer jacket would add 1X-5X options to your wardrobe, with features such as windproof cuffs, SBS zippers, and 3000MM waterproof index. This women's down jacket is waterproof up to 3000mm, effectively repelling rainwater. Lightweight and Warm: this women's packable puffer Jacket is made with lightweight materials for a comfortable fit, while providing warmth and protection. Down Alternative: This women‘s winter jacket is filled with high-quality down alternatives, providing the same warmth as down while reducing harm to animals. Windproof with Elastic Cuffs: Designed with elastic cuffs, this windproof jacket fits snugly around the wrists, effectively blocking out cold winds. The fully-zippered and hooded women's jacket : The down alternative jacket provides exceptional warmth and gives optimum insulation and heat preservation. Durable SBS Zipper: Equipped with SBS zippers, this lady's jacket is durable and easy to use, ensuring long-lasting wear. The women's winter jacket with multi zipper pockets keeps everything you need within reach.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Women",
                "link": "https://www.amazon.com/Womens-Fashion/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7147440011"
            },
            {
                "name": "Clothing",
                "link": "https://www.amazon.com/Womens-Clothing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1040660"
            },
            {
                "name": "Coats, Jackets & Vests",
                "link": "https://www.amazon.com/Womens-Coats/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1044646"
            },
            {
                "name": "Down Jackets & Parkas",
                "link": "https://www.amazon.com/Womens-Down-Coats-Parkas/b/ref=dp_bc_aui_C_5?ie=UTF8&node=12643250011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 14.02 x 10.94 x 5.94 inches; 1.57 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ WDNV3848"
            },
            {
                "name": "Department ‏",
                "value": "‎ Women"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ December 27, 2021"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B09P8KSKSG"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#15,705 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #140 in Women's Down Jackets & Parkas #2,111 in Climate Pledge Friendly: Apparel"
            },
            {
                "name": "#2,111 in Climate Pledge Friendly",
                "value": "Apparel"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 210 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About Us Our mission is to build products that are essential for active performance wear users. We aim to create versatile products that can be worn in various conditions, whether it's hiking in the mountains or strolling around town. By designing active performance wear with features such as waterproofing, stain repellency, fast-drying capabilities, and warmth, Wantdo becomes an indispensable part of our customers' daily lives. Lightweight Women's Winter Jacket Responsibly Sourced Puffer Jacket Warm Down Alternative Jacket Plus Size Windproof Jacket with Ribbed Cuffs Plus Women’s Jacket with Durable SBS Zipper Waterproof Jacket Which is Waterproof Up to 3000 mm. Wantdo Women‘s Winter Jackets are Available in a Variety of Colors A good choice for fashion and warmth with plus size down jacket By Wantdo What you need is a warm enough women's outdoor jacket that doesn’t skimp on quality, performance, and style! Our women's winter jacket and puffer jacket collection is designed to keep you warm and cozy in any weather condition. The puffer jacket is durable, lightweight, and incredibly warm. And if you are still troubled by the limited size chosen, our plus size puffer jacket would add 1X-5X options to your wardrobe, with features such as windproof cuffs, SBS zippers, and 3000MM waterproof index. This women's down jacket is waterproof up to 3000mm, effectively repelling rainwater. Lightweight and Warm: this women's packable puffer Jacket is made with lightweight materials for a comfortable fit, while providing warmth and protection. Down Alternative: This women‘s winter jacket is filled with high-quality down alternatives, providing the same warmth as down while reducing harm to animals. Windproof with Elastic Cuffs: Designed with elastic cuffs, this windproof jacket fits snugly around the wrists, effectively blocking out cold winds. The fully-zippered and hooded women's jacket : The down alternative jacket provides exceptional warmth and gives optimum insulation and heat preservation. Durable SBS Zipper: Equipped with SBS zippers, this lady's jacket is durable and easy to use, ensuring long-lasting wear. The women's winter jacket with multi zipper pockets keeps everything you need within reach.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6875568-b292-4b25-a3a6-00dcb58738f7.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9aa2f543-ca8c-4193-bf37-9d8a23a61c55.__CR0,0,700,350_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Wantdo Women's Plus Size Puffer Jacket Our Wantdo women's winter coat is made with imitation down cotton filling to provide maximum comfort. This puffer jacket is breathable, soft, and warm, making it a must-have for cold seasons, so it can easily fit in your backpack, luggage, and duffel bag. Responsibly Sourced & Skin Friendly This women's plus size puffer jacket that you can purchase confidently, especially knowing that our products are sustainable, long-lasting, ultra-clean, and hypoallergenic. 100% Recycled Materials Women's renewable down jackets are the perfect combination of style and sustainability. Made from recycled materials, these winter jackets are not only fashionable but also protect the environment. By using renewable down alternatives, we are reducing our reliance on non-renewable resources. Toasty Warm This women's winter puffer jacket is also lightweight and incredibly warm, making them perfect for outdoor activities in cold weather. With features such as wind-resistant cuffs, durable SBS zippers, and 3000MM waterproof index, the renewable down alternative jacket is designed to keep you comfortable and protected in any weather condition. Key Features: - This women's winter essential jacket can seamlessly be layered over your favorite shirts or base layer. - This women's plus size down alternative jacket by Wantdo performs well in large temperature differences between day and night and seasons.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8012e687-8f8e-4369-82cb-d93f0ca72c54.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Zipper Pockets This plus size winter coat features 4 big pockets to keep everything you need within reach. This down jacket for women features 2 zipped side pockets. You can place your hands in the slanted pockets to keep hands warm and snug. These are also perfect for storing your essentials when you are outdoors, or traveling. Windproof Hood This Wantdo women's puffer jacket is constructed to offer superior performance across various scenarios. The hood of this winter coat for women is elastic and windproof which provides the maximum protection for your face and neck from the raging and chilly winds. Durable Zipper Durable zippers extend the service life of clothes, are easy to use to open and close big & tall coats, effectively prevent the cold wind from piercing, and warm your every day. Don't let sharp and icy air currents stop you! This winter thick jacket features a SBS zipper, wear this women's jacket every day with confidence.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ab4c1913-d179-45de-b47c-e6de6bb92956.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e368d609-ea60-4038-b3a7-3b171bfb9648.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/031ab228-973a-4acd-a7ff-1b3cc487f1a5.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Wantdo Lightweight and Packable Jacket Collection E60- Plus Size The Must-Have Women's Puffer Jacket For The Cold Seasons Multifunctional and Versatile This Wantdo women's winter coat is packed with practical features. It has two zippered hand-warming pockets and two deep interior pockets for storing essentials. You can stay fashionable and always ready for the frosty weather with this Wantdo winter jacket. Lightweight and Warm This puffer jacket for women is made with lightweight materials for a comfortable fit while providing warmth and protection. This warm and cozy essential jacket for cold weather is perfect for both fashion and function. A Stylish Wardrobe Staple Confidently wearing our expertly designed women's winter outerwear, which is available in a diverse variety of colors. Our warm puffer jackets for women are also crafted after thorough, in-depth research and analysis across 1 million+ customer data for precise sizing and optimum fit. This Wantdo winter coat for women has undergone more than 10 modifications to create the perfect version that suits you best. Grab and Go - 3000mm/H2O Waterproof Plus size puffer jacket for women is constructed to offer superior performance across various scenarios. No matter rain or shine, grab our mountain jacket and shuttle from the city to the backcountry. This Wantdo down jacket for women is perfect for the morning commute, working, traveling, and other outdoor activities.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bd98a3cf-94b1-4015-9c37-3f8bfed4d536.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Women's Plus Size Puffer Jacket Thick Warm Winter Coat Women's Plus Size Warm Winter Parka Mid Length Coat Women's Plus Size Winter Parka Coat with Removable Hood Women's Plus Size Quilted Puffer Coat with Removable Hood Women's Plus Size Double-Breasted Trench Coat with Belt Women's Winter Coat Warm Puffer Jacket Lightweight Winter Jacket Main Features Thick jacket makes your outdoor activities more flexible; Keeping warm with better wearing experience. Thicken parka jacket make a stylish statement, fur collar allows you to a more warm winter in cold weather. This puffy coats for women provide the basic and essential insulation for winter,which keep you warm anywhere. The high quality filling makes a stylish statement, detachable collar allows you to wear more diversified. Hign-density shell outer layer provides additional warmth；classic style can match with sweaters, skirts,jeans. This winter coats for women are made available in different modern and stunning colors.,Lightweight. Hood Type Removable Fur Hood Fur Hood Removable Fur Hood Removable Fur Hood Removable Hood Removable Hood Pockets 2 hand pockets 2 hand pockets 2 hand pockets; 2 chest pocket 2 hand pockets; 1 chest pocket 2 hand pockets; 1 inner pocket 2 hand pockets; 1 inner pocket Thickness Thick Thick Thick Lightweight Thick Lightweight Waterproof Index 3000 mmH2O 3000 mmH2O 3000 mmH2O 3000 mmH2O 3000 mmH2O 3000 mmH2O Style Type Plus Size Plus Size Plus Size Plus Size Plus Size Standard Size Best Use Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Meetings, Appointments,Travelling, Commuting, Gathering Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e7fc5854-0c55-45a3-b8dc-f0ca075957d1.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6875568-b292-4b25-a3a6-00dcb58738f7.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9aa2f543-ca8c-4193-bf37-9d8a23a61c55.__CR0,0,700,350_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/727661a5-ca9d-4f46-9a98-3e1a7a690584.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8012e687-8f8e-4369-82cb-d93f0ca72c54.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ab4c1913-d179-45de-b47c-e6de6bb92956.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e368d609-ea60-4038-b3a7-3b171bfb9648.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/031ab228-973a-4acd-a7ff-1b3cc487f1a5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bd98a3cf-94b1-4015-9c37-3f8bfed4d536.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f1112a9b-4a61-4c71-a30a-9073c18ab2de.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7c43a789-15b9-4431-8a35-04b808e8b9dd.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/98361109-bd11-4730-b093-141db94248e1.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2b6bf2eb-745b-40b0-994a-1726855db1ec.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/082abc38-ae4c-4049-8922-edea978fdcea.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/902c683d-7d28-4ba3-a794-8e36a2a39f0e.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lena Burke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLIJP2FJ2C4VZLEIHKJYGDPPBVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFZXEVFHIEN6X?ASIN=B09P8J5HM9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Warm",
                "reviewText": "Fits just right true to size",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jada McNeal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEN2DJ252HDMTTQJQ7M3ADWAJLLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16P4E2X49VQ15?ASIN=B09P8J5HM9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Not a slim fit",
                "reviewText": "I sized up because I returned a ski jacket with the same measurements that was a slim fit. This jacket is not a slim fit. I could’ve sized down a size (maybe two). It’s fine, I can layer comfortably. I bought this to wear walking the dogs over the winter. It’s light, but warm. Four deep pockets! Big hood.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nichole ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWXOIG6YNHDV54O4AZXN5SZP44A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RF9F2DMAW1364?ASIN=B09P8J5HM9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars It’s warm",
                "reviewText": "I love that it is stylish",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5AJGGN7XZ4RR3QHHONLOWC4K6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ICYM5KKME7SM?ASIN=B09P8J5HM9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Nice Jacket",
                "reviewText": "Pros: warmComfortableFits in my chest area wellCons: sleeve length is a bit longNo way to secure hood around head.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMVC2WDXST3M6SZ23ERQVD2PKDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XKEOBR9MG0J8?ASIN=B09P8J5HM9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Runs small",
                "reviewText": "I liked the jacket. It runs small tho and they need to put a better zipper in it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Phalne H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE65MBQV2RK3IUVMGQTAWANLBXGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9RKJ5QLW003O?ASIN=B09P8J5HM9",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "3.0 out of 5 stars Cute but sized wrong",
                "reviewText": "I got a 2X and I can’t zip up the coat. However, I gave it a 3 star because it fits well otherwise and it VERY well insulated.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monique ReaMonique Rea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRDH5RSG2MIQND35ILEOYKZXZKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JGMKEA9904SO?ASIN=B09P8J5HM9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Very light weight",
                "reviewText": "This jacket is fantastic because it’s lightweight and easily stored. When I hike I warm up fast I need to start shedding layers. This jacket is perfect.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71-Lhsl5igL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laurie ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3IPQM37MIWVD6AQZ5LFRT5OK3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VRNB3E05TP8A?ASIN=B09P8J5HM9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Winter Jacket",
                "reviewText": "The best jacket ever. It’s warm and cozy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ginette Laflèche",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 11, 2023",
                "reviewTitle": "Very nice",
                "reviewText": "Beautiful coat, nice material but it was too big for me. True to size though.... I just misjudged my size.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dixie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 26, 2023",
                "reviewTitle": "Nice Jacket it is a good buy for the money.",
                "reviewText": "I bought size 3X for I am a big person but needed something roomy and light weight for I am disabled. You can move better. This jacket was exactly what I needed. Nice looking also.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 29, 2022",
                "reviewTitle": "Beautiful warm Jacket. Very Fast shipping!!",
                "reviewText": "This jacket is amazing!!! It's always so hard to find a nice jacket for plus size ladies. I love this!! Fits perfectly and so warm. It also shipped very quickly!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kimberly m.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 5, 2023",
                "reviewTitle": "Warm",
                "reviewText": "This coat is beautiful! Wonderful color, light weight and warm. Wish I got smaller size",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patricia Sousa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 14, 2023",
                "reviewTitle": "Great coat",
                "reviewText": "Light weight, keep you warmGreat product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}