{
    "remaining_requests": 13423,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wantdo-Womens-Thickened-Removable-XX-Large/dp/B01M3XIHK5",
    "body": {
        "name": "wantdo Women's Quilted Winter Coat Warm Puffer Jacket Thicken Parka with Removable Hood",
        "price": "$79.97",
        "originalPrice": "",
        "rawPrice": 79.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wantdo-Womens-Thickened-Parka-Removable/dp/B01MFF7XYQ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B01MFF7XYQ"
        ],
        "asinVariationValues": [
            {
                "asin": "B01M74CYB6",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/418hNOBR3rL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07QPFGPGL",
                "variationName": "Color",
                "variationValue": "Navy",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/4139G-N-YnL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B074GVZMQ2",
                "variationName": "Color",
                "variationValue": "Army Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ZCV-Ww8fL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07MLHYNR8",
                "variationName": "Color",
                "variationValue": "Grayish White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41m6X4nc9nL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07PFCSL8M",
                "variationName": "Color",
                "variationValue": "Wine Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41qotwmgIKL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07PFCRCGD",
                "variationName": "Color",
                "variationValue": "Khaki",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ClBgD9QZL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0919N4JSL",
                "variationName": "Color",
                "variationValue": "Blackish Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41b+iqXe28L._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09WDHDWYR",
                "variationName": "Color",
                "variationValue": "Blue Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41m1pRVCuhL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B08M3SKGPH",
                "variationName": "Color",
                "variationValue": "Beige",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41NFi3iFo3L._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09WDHMWKH",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/416pv7MS6IL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B01M74CYB6",
                "variationName": "Size",
                "variationValue": "Small",
                "variationImageURL": null
            },
            {
                "asin": "B078J1BZ4N",
                "variationName": "Size",
                "variationValue": "Medium",
                "variationImageURL": null
            },
            {
                "asin": "B01M7X6JMI",
                "variationName": "Size",
                "variationValue": "Large",
                "variationImageURL": null
            },
            {
                "asin": "B01M6BKZV3",
                "variationName": "Size",
                "variationValue": "X-Large",
                "variationImageURL": null
            },
            {
                "asin": "B01M3XIHK5",
                "variationName": "Size",
                "variationValue": "XX-Large",
                "variationImageURL": null
            },
            {
                "asin": "B08T6ZSC9J",
                "variationName": "Size",
                "variationValue": "3X-Large",
                "variationImageURL": null
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418hNOBR3rL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/319oMd1TaaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Tr3IPJQEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41K8xYb-LUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/416CpsGEWPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41fVHYqhVEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/813Zu3WRC9L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c301fb2f-cc1b-423e-b174-89a6c921edec/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the wantdo Store",
            "link": "https://www.amazon.com/stores/Wantdo/page/A1352C62-3AB6-4A73-BCBA-993F74F4F881?ref_=ast_bln"
        },
        "brand": "Wantdo",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 4440,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Global Recycled Standard (GRS) verifies the percentage of recycled content and tracks it from the source to the final product."
        },
        "features": [
            "Fabric type Recycled Fabric",
            "Care instructions Hand-wash and Machine washable",
            "Recycled Fabric and Insulation - The women's winter coat is made with recycled fabric and filled with synthetic, recycled insulation. It reduces carbon emissions and keeps you dry in the rain or warm in snowy weather at all times!",
            "A Warm Embrace - The winter jacket for women seals body warmth in and keep cozy on chilly days. This thicken puffer coat is made with soft and light filling, a diamond pongee lining, and an adjustable fur-lined hood.",
            "Full Body Protection - Protect yourself against mild wind, snow, and rain with the long coat for women. Boasting a detachable hood and fur lining, elastic waist, snap-button cuffs, DWR finish, and PU membrane, it's your go-to coat for any forecast!",
            "Built to Last - Rely on the women's parka, constructed with sturdy buttons and zippers that fasten seamlessly. The durable outer shell stands up to tears and wears, ensuring lasting protection.",
            "Style Meets Storage - Not only is this windproof winter coat stylish, but it also offers 5 convenient pockets for all your must-have items! Plus, the invisible drawstring lets you adjust the silhouette for a perfect, flattering fit."
        ],
        "description": "Stay warm and comfy during cold nights or windy days. What you need is a warm enough women's winter coat that doesn’t skimp on quality, performance, and style! Wearing a winter coat for women before heading outdoors is a must if you don't want to feel cold or cut your camping trip short. You'll need a windproof puffer jacket for women with features such as windproof cuffs, durable zippers, and 3000MM waterproof index that can keep you warm and allow for a full range of motion at the same time to fully enjoy all the wonders winter has to offer. Recycled Fabric and Insulation - The women's winter coat is made with recycled fabric and insulation, providing excellent warmth for its weight and reducing carbon emissions. Waterproof Protection - The winter coat for women is designed to keep you dry in even the wettest conditions with a waterproof rating of 3000mm, making it the perfect choice for outdoor adventures. Adjustable Waist - The women's long winter coat also features an adjustable waist that can be cinched or let out for a straight silhouette. Pocket Features -The women's jacket features two large pockets that are accessed under the top flap and secure with snaps, while an interior security pocket keeps your valuables safe and secure. Durable Zipper - The lady's winter coat features durable zippers, ensuring durability and easy use for long-lasting wear.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Women",
                "link": "https://www.amazon.com/Womens-Fashion/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7147440011"
            },
            {
                "name": "Clothing",
                "link": "https://www.amazon.com/Womens-Clothing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1040660"
            },
            {
                "name": "Coats, Jackets & Vests",
                "link": "https://www.amazon.com/Womens-Coats/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1044646"
            },
            {
                "name": "Down Jackets & Parkas",
                "link": "https://www.amazon.com/Womens-Down-Coats-Parkas/b/ref=dp_bc_aui_C_5?ie=UTF8&node=12643250011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 8 x 8 x 8 inches; 1.54 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ WomensZHGOV04K0S"
            },
            {
                "name": "Department ‏",
                "value": "‎ womens"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ March 13, 2018"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B01M74CYB6"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,339 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #60 in Women's Down Jackets & Parkas #1,421 in Climate Pledge Friendly: Apparel"
            },
            {
                "name": "#1,421 in Climate Pledge Friendly",
                "value": "Apparel"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 4,440 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About Us Our mission is to build products that are essential for active performance wear users. We aim to create versatile products that can be worn in various conditions, whether it's hiking in the mountains or strolling around town. By designing active performance wear with features such as waterproofing, stain repellency, fast-drying capabilities, and warmth, Wantdo becomes an indispensable part of our customers' daily lives. Recycled Women Winter Coat 3000mm Index Waterproof Puffer Coat Windproof and Warm Women Coat Adjustable Waist Winter Pakra Jacket Multi-pockets Long Winter Coat Women's Winter Coat Available in a Variety of Colors Puffer Jacket with Smooth Zipper Stay warm and comfy during cold nights or windy days. What you need is a warm enough women's winter coat that doesn’t skimp on quality, performance, and style! Wearing a winter coat for women before heading outdoors is a must if you don't want to feel cold or cut your camping trip short. You'll need a windproof puffer jacket for women with features such as windproof cuffs, durable zippers, and 3000MM waterproof index that can keep you warm and allow for a full range of motion at the same time to fully enjoy all the wonders winter has to offer. Recycled Fabric and Insulation - The women's winter coat is made with recycled fabric and insulation, providing excellent warmth for its weight and reducing carbon emissions. Waterproof Protection - The winter coat for women is designed to keep you dry in even the wettest conditions with a waterproof rating of 3000mm, making it the perfect choice for outdoor adventures. Adjustable Waist - The women's long winter coat also features an adjustable waist that can be cinched or let out for a straight silhouette. Pocket Features -The women's jacket features two large pockets that are accessed under the top flap and secure with snaps, while an interior security pocket keeps your valuables safe and secure. Durable Zipper - The lady's winter coat features durable zippers, ensuring durability and easy use for long-lasting wear.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/50ca3ada-edaf-4869-98cb-61cb1cba2fa6.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2cf307e7-f0f4-46db-8594-dd498926b681.__CR0,0,700,350_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "4-layer Thick Construction for Ultra Warmth The women’s windproof winter coat is comfortable, so it won’t slow you down. Enjoy form and function while you’re knee-deep through your snowy adventures. At the same time, the women’s winter coat featuring 4-layer thick construction keeps you warm against the chilly breeze. Recycled Raw Materials The women’s warm winter jacket is made with recycled materials. Extracting and processing virgin materials takes a toll on land, water, and air. To do our part, Wantdo is moving toward renewable and recycled raw materials. Using recycled polyester lessens our dependence on fossil fuels and keeps plastic bottles out of landfills. It is a wise choice to choose to buy a women’s puffer jacket made from recycled fabrics. 3000mm Index Waterproof Protection The women’s waterproof puffer coat has a waterproof fabric with an index of 3000mm that keeps you dry and comfortable all day. You can continue your outdoor activities on heavy fog, rainy, or snow days. The waterproof winter jacket for women provides warmth and keeps you dry in damp or cold weather. Superior Cold Protection The women’s waterproof winter coat is filled with premium fluffy synthetic fibers that limit air circulation while preserving your body heat. This means you can enjoy ice skating at the park or hiking around the Rockies without getting distracted by cold winds or chills. The women’s parka jacket is also not only protects against water, wind, and cold, but it can also be customized to flatter any body type.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90aa9435-2d5a-46e5-b964-672328b99e8d.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "The ladies' winter coat performs well against mild wind, snow, and cold. The adjustable placket effectively prevents gusts of cold winds. You may feel free to button the placket up during those cold winter days with Wantdo women's long puffer coat. The women's winter coat with a hood is made to help you maintain a full range of motion while providing a flattering silhouette. An adjustable waist drawstring at the women's jacket waist part pulls attention to your curves. The women's warim winter coat is tailored with pockets for keeping your hands warm and storing essentials. Designed with convenience in mind, the warm puffer jacket for women keeps what you need within reach.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c1d42be-267c-471a-9ede-b6d9b172a8cf.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ceaceb63-7a15-4a56-98c6-c69a6e9542cd.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/76a5f4c0-5f6a-46fb-aea0-1661c571b77e.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Wantdo Recycled Winter Coats Collection GOV04 The classic winter parka makes you stay both warm and fashionable. Responsibly Sourced Winter coat for women is sourced from recycled raw materials and has a lower impact on the environment than traditional textiles. More Than Just A Winter Coat The women's parka coat does a great job of keeping you warm, but that's not all. It’s also fitted with several pockets, including hand-warming and buttoned slits. These women's hooded winter jackets can be worn on more than one occasion. Made for comfort, you can easily use them to go shopping in town, work, or attend class, even in non-sub-zero weather. Waterproof & Windproof Protection The long winter coat for women is engineered with adjustable features, providing a bespoke fit. The women’s puffer jacket's adjustable features protect your head and body from cold air while effectively protecting against outside moisture seeping through on rainy days and cold weather. Made to Last Wear women’s coat every day with the utmost confidence. It is designed to withstand wind, water, tears, and abrasion. The quilting of the women's winter coat with a hood provides added strength to the fabric. Warm and Stylish in One The women’s waterproof coat with hood not only protects against water, wind, and cold, but it can also be customized to flatter any body type. Fitted with an adjustable waistband and durable, coated fabric and insulation, the long coats for women will look good and feel toasty. Versatile Puffer Coat The ladies' winter coat is the core item to make a stylish statement whenever you head outdoors on a cold day. It pairs well with your favorite shirt, sweater, or sweatshirt. Take the winter jacket for women with you whenever you go on holiday travels, outdoor adventures, camping trips, or whenever you play winter sports.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6874a37c-2c83-4eb1-802e-4ae006bc8e26.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Women's Hooded Winter Coat Thicken Quilted Puffer Jacket Wantdo Women's Recycled Puffer Jackets Warm Winter Coats Long Winter Jacket Women's Recycled Long Puffer Jackets Winter Coats Winter Parka Women's Winter Hooded Coat Waterproof Warm Long Puffer Parka Wantdo Women's Warm Winter Coat Thicken Puffer Jacket Parka Wantdo Women's Long Quilted Winter Coat Thicken Puffer Jacket with Faux Fur Hood Choose from other Wantdo jacket styles Block the air circulation, prevent the wind from pouring into the gaps and achieve the effect of keeping warm. The lady's winter coat features durable zippers, ensuring durability and easy use for long-lasting wear. The waist drawstring, adjustable hem, elastic cuffs efficiently traps warmth, and creat a figure-flattering silhouette. A winter parka combined with warmth, style and functionality, which is a perfect gift choice for your family. A waist buckle creates a figure-flattering silhouette; Thicken Parka jacket make a stylish statement A quilted coat designed to handle extreme cold and inclement weather；Advanced Teflon waterproof coating keeps you dry and comfortable all day Main Features Windproof, Waterproof, Warm Windproof, Waterproof, Warm Windproof, Waterproof, Warm Windproof, Waterproof, Warm Waterproof, Windproof, Warm Waterproof, Windproof, Warm Waterproof Index 3000 mmH2O 3000 mmH2O 3000 mmH2O 3000 mmH2O 3000 mmH2O 3000 mmH2O Pockets 2 hand pockets, 2 inner pockets 2 hand pockets, 2 inner pockets 2 hand pockets, 2 inner pockets 2 super warm hand pockets,1 secure pocket 2 hand pockets, 2 chest pockets, 2 inner pockets 2 hand pockets, 2 inner pockets Hood Type Removable Fur Hood Removable Fur Hood Removable Fur Hood Attached Fur Hood Removable Fur Hood Removable Fur Hood Best Use Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9b26398b-d54e-4d4c-b2e9-47831779b95a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/50ca3ada-edaf-4869-98cb-61cb1cba2fa6.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2cf307e7-f0f4-46db-8594-dd498926b681.__CR0,0,700,350_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90aa9435-2d5a-46e5-b964-672328b99e8d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c1d42be-267c-471a-9ede-b6d9b172a8cf.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ceaceb63-7a15-4a56-98c6-c69a6e9542cd.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/76a5f4c0-5f6a-46fb-aea0-1661c571b77e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5d4b8808-d36c-439a-819c-2fa83787dbde.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6874a37c-2c83-4eb1-802e-4ae006bc8e26.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d2742869-3376-4014-8fc1-bd276e0aea6c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95bf738d-ff64-4b86-a69c-36c5817c0683.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0583455d-0384-4f10-abca-3bdc54888bbb.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/341d6ef4-dc68-493d-82c1-a7e731852c39.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b1e2392-d6de-42fe-a077-ac8f97402e29.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/05a333db-3bb2-44be-928f-4b57fbeb32a4.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "stephanie asselin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5FY2RHYHWR3BZ5E3BA5E4O5L4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RP4OVUOKSITD5?ASIN=B01MFF7XYQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Worth it",
                "reviewText": "Went to Canada in February and had -17 celcius weather the entire week.We did alot of outside sport like skiing and snow mobile and not even once did I feel cold. The jacket was very hot and waterproof. It stood against all Canada winter element.TBH this jacket was way better than I expected and worth every $.Definitely a good purchase.Size - Size up... I'm a large and took x-large so if needed I can layer upFit - perfect. Not to tight and not to loose.Style - definitely a pretty looking jacket and fits with today morden style. Keep in mind to brush the head piece to make it look more fluffy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JulieBJulieB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGTZM5MO2D6CZGPYUI6MQ6JFGQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R278O6FXL8EWXX?ASIN=B01MFF7XYQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome Jacket!! However.....",
                "reviewText": "I’m 5’6” tall and weigh 170 lbs. Amazon said an X-Large would fit me perfectly…. Well almost.It fits just fine, but it’s a tad snug in the hips. If you’re planning on wearing a big, bulky sweater underneath it or if you’d like a little more wiggle room around your butt, go up a size.It’s poofy and warm and beautiful and I love the knitted wrists. They keep the sleeves from falling down over your hands and if you forget your mittens, you can just pull them down over your hands.I Love all the pockets and all of them are Deep!! You can easily fit your phone or a wallet in any of them, to include the 2 top zippered pockets and the inner zippered pocket!! We’re going to Europe in April (to two of the pickpocket capitals of the world ☹) and with all the pockets, I won’t have to carry a purse!!P.S. I thought for sure the first thing I would do is get rid of the hood, but it actually works! I’ll just have to get used to all the fur around my face 😊P.P.S. Not having side pockets to slip your hands into is a bummer, but I’ll live.",
                "reviewVotes": "47 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51L1PGIPuJL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEOG5FRQNRRZARYQOYFJHQ3ECXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G4JC1I3TDVHZ?ASIN=B01MFF7XYQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 31, 2023",
                "reviewTitle": "4.0 out of 5 stars Is outstanding in a city with heavy snowfall and winds",
                "reviewText": "This coat is phenomenal! It fits perfectly, and it's incredibly warm. It's very sturdy, with no buttons, snaps, or lining coming off. The pockets are big, which is always a plus as a girl. The colour is exactly as pictured as well. It is the warmest jacket I have ever owned. I live in a place with intense lake-effect snow and very high winds with wind chills that freeze cars into blocks of ice, and this coat actually leaves me over-heating slightly at times while out braving the elements.The only downside is how big and baggy the hood is. I know this is because it's space for a winter hat, but for when you're not wearing one, the hood just flaps and falls all over the place. It doesn't have drawstrings, unfortunately. When I'm walking in the wind, I'm usually holding the hood for dear life. It does have clasps that help hold it in place that cross a bit around my mouth but it's still pretty baggy after that. I know the answer is \"well, wear a hat\" but that's not always doable.Regardless of the hood, I have recommended this to so many people. I am always getting compliments on it and I am rarely cold (in the areas it covers, anyways). It might be too much for people in warmer climates, but if you're up north or somewhere with strong cold wind and low temps, absolutely look into this.",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rhonda E.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5DIHD6PF6QMW6K7Z3QC3UYH34Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM1ORL3UAT2CW?ASIN=B01MFF7XYQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome coat!",
                "reviewText": "Fit is right. Very warm and comfortable. Big pockets.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pandora Lee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCW33J6XOPAJBBAE4WCEIIHW76A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LIQVLKDG9MVD?ASIN=B01MFF7XYQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Coat for a Great Price",
                "reviewText": "I recommend this even though I had to return mine because it was too big and I looked like a Yeti!! So definitely check your measurements and size before ordering. But what I could tell, this jacket was very well made, comfortable, warm and stylish.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Granny9",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYWM57TY6GHXP5GQWTRPLXDSU7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13HBUCCDO6RN2?ASIN=B01MFF7XYQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Very warm and comfortable",
                "reviewText": "Very pleased. Very warm coat for this artic blast. Sleeves are perfect for my long arms. Thankfully the ugly, fake fur trim on the hood zippers off. Otherwise stylish, warm coat for frigid weather.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CapeBuyers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7K6X6YOZZ3QZMYGJLYO7GLPWBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IOC2D6AWVICP?ASIN=B01MFF7XYQ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "3.0 out of 5 stars Warm but fur around hood is flat and ugly",
                "reviewText": "I'm keeping it because it is very warm and keeps my rear end covered and warm as well. The size was just right.. I thought it would be more of an army green but it's a dark olive/ black green..Most disappointing was the fur around the hood...It looks flat and matted compared to the picture that shows a fluffy, pretty collar with a nice soft gold coloring..The fur on my coat looks like a wet dog..not attractive at all. I will wear it out walking in cold weather when I don't really care the way I look.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "b.horn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRGFKASSFCZB3CJ4NFMVHJZ5MBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X3PHQO7O6UTA?ASIN=B01MFF7XYQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Well made coat",
                "reviewText": "Love this coat. Well made,warm, & true to size. I have received many compliments on it. So glad I bought this!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mimi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 4, 2022",
                "reviewTitle": "le tableau ou l étiquetage du produit est erroné .",
                "reviewText": "j ai achete un XL en me fiant au tableau . j ai recu un XL qui en fait c est un médium selon les mesures du manteau et les renseignement du tableau je suis décu c est un beau manteau qui semble etre chaud et de bonne qualité",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ManishaManisha",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 4, 2023",
                "reviewTitle": "Good quality",
                "reviewText": "Liked it …warm…good quality….but the most disappointing part the fur….it looks so bad….lef me wear in winter than can feel how much warm or comfortable it is…otherwise it’s nice…",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ZQWI4T-QL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marie Myrtha Alexandre",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 10, 2022",
                "reviewTitle": "The material not a quality product",
                "reviewText": "Too expensive for the quality",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paula",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 8, 2023",
                "reviewTitle": "Super nice look",
                "reviewText": "Fits perfect, light weight, lots of pockets, hood fits great (not floppy) BUT not for our northern Ontario -30 or more weather. -15 to -20 you would stay warm with a sweater underneath",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "frances",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2020",
                "reviewTitle": "Very low quality",
                "reviewText": "The seems keep coming apart. I feel it was poorly made",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}