{
    "remaining_requests": 13236,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wantdo-Womens-Quilted-Thicken-Removable/dp/B09P8KWSNH",
    "body": {
        "name": "wantdo Women's Plus Size Winter Coat Water-Repllent Puffer Jacket Warm Thicken Parka Overcoat with Removable Fur Hood",
        "price": "$95.98 - $99.97",
        "originalPrice": "",
        "rawPrice": 95.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/wantdo-Water-Repllent-Thicken-Overcoat-Removable/dp/B0CP7WQW6T",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B0CP7WQW6T"
        ],
        "asinVariationValues": [
            {
                "asin": "B09P8K4H9S",
                "variationName": "Color",
                "variationValue": "Army Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ZhiKxQ3ML._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09P8JZ7FX",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/418PPYQ4JnL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09P8JZDHQ",
                "variationName": "Color",
                "variationValue": "Gray",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41+07OTx--L._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09P8K9ND3",
                "variationName": "Color",
                "variationValue": "Wine Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ChsuopMCL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0BZH1XLLB",
                "variationName": "Color",
                "variationValue": "Blackish Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41h3UM10KjL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0BZH4Q17F",
                "variationName": "Color",
                "variationValue": "Navy",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41jTjMWrmkL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09P8K4H9S",
                "variationName": "Size",
                "variationValue": "1X",
                "variationImageURL": null
            },
            {
                "asin": "B09P8JZ7FX",
                "variationName": "Size",
                "variationValue": "2X",
                "variationImageURL": null
            },
            {
                "asin": "B09P8KWSNH",
                "variationName": "Size",
                "variationValue": "3X",
                "variationImageURL": null
            },
            {
                "asin": "B09P8LTFQM",
                "variationName": "Size",
                "variationValue": "4X",
                "variationImageURL": null
            },
            {
                "asin": "B09P8HW562",
                "variationName": "Size",
                "variationValue": "5X",
                "variationImageURL": null
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418PPYQ4JnL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/315emy3yHWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41RTg HES8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61K2vErOJeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41h3lOmBrcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pHkLJFVML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Vr48SWIoL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the wantdo Store",
            "link": "https://www.amazon.com/stores/Wantdo/page/A1352C62-3AB6-4A73-BCBA-993F74F4F881?ref_=ast_bln"
        },
        "brand": "Wantdo",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 221,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Global Recycled Standard (GRS) verifies the percentage of recycled content and tracks it from the source to the final product."
        },
        "features": [
            "Fabric type Recycled Polyester",
            "Care instructions Machine Wash",
            "Origin Imported",
            "Big is Beautiful - This plus size winter coat for women is made available in different modern and stunning colors. Choose from size 1X to 5X to ensure a custom, comfy, and figure-flattering fit, and show off your classic taste in clothing by sporting this women's zip-up long puffer jacket.",
            "A Warm Embrace - Plus size parka jackets for women use soft 240 grams of imitation down cotton padding and skin-friendly pongee liner. This women's warm winter jacket is made with a pure durable shell having a DWR finish and PU membrane, adding an adjustable detachable hood with vegan fur trim, fleece-lined hand pockets, elastic waist, and snap-button cuffs. Every detail is exquisitely designed to make you enjoy winter.",
            "100% Recycled Waterproof Fabric- Our winter jackets for women are made with recycled polyester, which requires far fewer resources than new fibers and generates fewer CO2 emissions. The shell fabric with a 3,000mm waterproof rating effectively keeps out light rain. Stay protected no matter where your adventures take you with our warm puffy coat.",
            "Protects Against Wind - This oversize winter parka for women is designed with full front zippers, a button placket, and adjustable features, you can customize the fit of your removable hood, hem, and cuffs to keep you safe from the elements. This winter coat for women is made with a detachable hood and fur lining, elastic waist, snap-button cuffs, DWR finish, and PU membrane. Get yourself more stylish with the hooded puffer jacket on meanwhile shield against cold air as a thick snow jacket.",
            "Fashion Jacket That Lasts - This quilted puffer jacket is tailored using heavy-duty buttons and zippers that can be secured without a hitch. Tighten the waist-invisible drawstring of the women's long parka for a better, lets you adjust your silhouette as you, please. This windproof women's padded puffy coat has 6 pockets that keep essentials like phones or passports within reach."
        ],
        "description": "Wear Heavy & Bulky Winter Coats By Wantdo Let's face it, the first thing you think of when you hear the words \"women's winter coats\" is the familiar sight of bright green or neon yellow coats they rent out in the Alps. There's not much to look forward to beyond staying warm. Engineered to keep you warm without sacrificing style, these Wantdo winter jackets boast superior heat retention while flaunting a form that flatters your silhouette. No woman wants or deserves to be seen in anything less than functional and stylish. This is a reliable winter jackets for women in chilly days. 100% Recycled Shell Fabric and Insulation - Made with recycled materials, the winter coat provides excellent warmth for its weight and reduces carbon emissions. Waterproof Protection - With a waterproof rating of 3000mm, the winter jacket for women is designed to keep you dry in even the wettest conditions, making it the perfect choice for outdoor adventures. Stay protected no matter where your adventures take you with this winter jacket with a hood. This women's winter jacket with soft and skin-friendly lining provides a warm and cozy feeling of your body.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Women",
                "link": "https://www.amazon.com/Womens-Fashion/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7147440011"
            },
            {
                "name": "Clothing",
                "link": "https://www.amazon.com/Womens-Clothing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1040660"
            },
            {
                "name": "Coats, Jackets & Vests",
                "link": "https://www.amazon.com/Womens-Coats/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1044646"
            },
            {
                "name": "Down Jackets & Parkas",
                "link": "https://www.amazon.com/Womens-Down-Coats-Parkas/b/ref=dp_bc_aui_C_5?ie=UTF8&node=12643250011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 14.88 x 11.65 x 7.2 inches; 3.11 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ WDNV4156"
            },
            {
                "name": "Department ‏",
                "value": "‎ Women"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ December 27, 2021"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B09P8K4H9S"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,479 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #169 in Women's Down Jackets & Parkas #2,755 in Climate Pledge Friendly: Apparel"
            },
            {
                "name": "#2,755 in Climate Pledge Friendly",
                "value": "Apparel"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 221 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About US Our mission is to build products that are essential for active performance wear users. We aim to create versatile products that can be worn in various conditions, whether it's hiking in the mountains or strolling around town. By designing active performance wear with features such as waterproofing, stain repellency, fast-drying capabilities, and warmth, Wantdo becomes an indispensable part of our customers' daily lives. 3000mm/H2O Waterproof Jacket Windproof and Warm Winter Jacket Removable Hood Puffer Coat Multi-pockets Women's Coat Warm Down Alternative Jacket with Elastic Cuff Wear Heavy & Bulky Winter Coats By Wantdo Let's face it, the first thing you think of when you hear the words \"women's winter coats\" is the familiar sight of bright green or neon yellow coats they rent out in the Alps. There's not much to look forward to beyond staying warm. Engineered to keep you warm without sacrificing style, these Wantdo winter jackets boast superior heat retention while flaunting a form that flatters your silhouette. No woman wants or deserves to be seen in anything less than functional and stylish. This is a reliable winter jackets for women in chilly days. 100% Recycled Shell Fabric and Insulation - Made with recycled materials, the winter coat provides excellent warmth for its weight and reduces carbon emissions. Waterproof Protection - With a waterproof rating of 3000mm, the winter jacket for women is designed to keep you dry in even the wettest conditions, making it the perfect choice for outdoor adventures. Stay protected no matter where your adventures take you with this winter jacket with a hood. This women's winter jacket with soft and skin-friendly lining provides a warm and cozy feeling of your body.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5cf7cfd2-c15f-4054-9419-af381d6c401b.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9aa2f543-ca8c-4193-bf37-9d8a23a61c55.__CR0,0,700,350_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Perfect for Winter Holiday This winter plus size puffer jacket is warmful, so it can send you body surface protection. At the same time, the Wantdo warm winter coat’s 4-layer thick construction keeps you warm against the chilly breeze. Enjoy form and function while you’re knee-deep through your snowy adventures. This high-fill power padding helps reduce air circulation, maximizing heat retention to keep you warm for longer periods. Comfy for Body The Wantdo winter parka is also not only protect against water, wind, and cold but also can be customized to flatter any body type. Say goodbye to over-layering and motion-inhibiting apparel. Key Features Against Cold - The Wantdo winter jacket for women combined with both functionality, versatility, and style. - This Wantdo puffer coat for women provides the basic and essential insulation for the winter and soft and skin-friendly lining provides a warm and cozy feeling in your body. - This women’s winter jacket with waterproof fabric with an index of 3000mm keeps you dry and comfortable all day. - The plus size winter jacket for women with a detachable hood and fur suits for your daily wearing.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a223446d-6ba8-4512-b13e-294adabab28f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Pocket with Buttons This Wantdo Women's winter coat is tailored with 5 big enough pockets for keeping your hands warm and storing essentials. Designed with convenience in mind, these Wantdo warm puffer jackets keep what you need within reach in cold weather outdoors. Don't let sharp and icy air currents stop you! Detachable Hood Wantdo women's hood fur coat gets you full body protection. With the detachable hood via a button, the men’s jacket fits the body better, effectively prevents gusts of cold winds from penetrating, and lets you play with different looks and styles. Wantdo Big & Tall jacket prevents snow and rain from seeping in. Durable Zippers This women's thick winter jacket features a high-quality zipper. Wear this womne's windproof jacket every day with confidence. Durable zippers extend the service life of clothes, are easy to use to open and close big & tall coats, effectively prevent the cold wind from piercing, and warm your every day.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9cdefd48-46a7-46cc-b530-9f4c5675104d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/38ec422a-be24-495e-93c4-d4b65578391f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/045f8eb7-f329-43fc-a705-4406065a7c0d.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Wantdo Classic Plus Size Winter Parka Coat Collection Makes you stay both warm and fashion This Wantdo women's parka coat does a great job of keeping you warm, but that's not all. This plus winter puffer coat for women is also fitted with several pockets including hand-warming and buttoned slits. These Wantdo women's hooded jackets can be worn on more than one occasion. Made for comfort, you can easily use them to go shopping in town, work, or attend class even in non-sub-zero weather. Waterproof and Windproof Protection Engineered with adjustable features, each of these Wantdo long winter jacket for women provide a bespoke fit. The adjustable features protect your head and body from cold air. This Wantdo thicken plus size puffer jacket also effectively protects against outside moisture seeping through on rainy days and cold weather. Warm and Stylish in One The Wantdo warm puffer jacket for women is not only protective against water, wind, and cold but it can also be customized to flatter any body type. Fitted with an adjustable waistband and durable, coated fabric and insulation, these Wantdo casual jackets will look good and feel toasty. Superior Cold Protection Each women's winter coat is filled with premium fluffy synthetic fibers that limit air circulation while preserving your body's heat. The Hooded winter jacket also not only protects against water, wind, and cold but they can also be customized to flatter any body type. Notes: - This winter parka is combined with warmth, style, and functionality. - The waterproof and windproof jacket ensures ultra warmth on cold days. - The premium filling provides high insulation and a comfortable wearing experience.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c4c9e27f-c5cf-4544-84db-e37462dd317d.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Women's Plus Size Hooded Light Weight Puffer Jacket Women's Plus Size Puffer Jacket Thick Warm Winter Coat Women's Plus Size Warm Winter Parka Mid Length Coat Women's Plus Size Quilted Puffer Coat with Removable Hood Women's Plus Size Winter Coat Women‘s Winter Coat Ski Jacket with Hood Main Features The thin and light type design facilitates your daily travel and meets your needs in various occasions. Thick jacket makes your outdoor activities more flexible; Keeping warm with better wearing experience. Thicken parka jacket make a stylish statement, fur collar allows you to a more warm winter in cold weather. The high quality filling makes a stylish statement, detachable collar allows you to wear more diversified. Brave the elements with our cozy plus size winter coat. The soft lining and fabric make your life happier; Thickened winter jackets show stylish personality. Hood Type Windproof Hood Removable Fur Hood Fur Hood Removable Fur Hood Removable Fur Hood Removable Fur Hood Pockets 2 hand pockets; 2 chest pocket 2 hand pockets 2 hand pockets 2 hand pockets; 1 chest pocket 2 hand pockets; 1 chest pocket and 1 inner pocket 2 hand pockets; 1 inner pocket Thickness Thick Thick Thick Lightweight Thick Thick Waterproof Index 3000 mmH2O 3000 mmH2O 3000 mmH2O 3000 mmH2O 5000 mmH2O 5000 mmH2O Style Type Plus size Plus size Plus size Plus size Plus size Plus size Best Use Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Meetings, Appointments,Travelling, Commuting, Gathering Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9edb5f5-cba4-451e-a9dd-400f823a12c7.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5cf7cfd2-c15f-4054-9419-af381d6c401b.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9aa2f543-ca8c-4193-bf37-9d8a23a61c55.__CR0,0,700,350_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b54d508-d263-4f50-9aae-80c0b1afed5b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a223446d-6ba8-4512-b13e-294adabab28f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9cdefd48-46a7-46cc-b530-9f4c5675104d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/38ec422a-be24-495e-93c4-d4b65578391f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/045f8eb7-f329-43fc-a705-4406065a7c0d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c4c9e27f-c5cf-4544-84db-e37462dd317d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/947b35b2-6b45-40e9-bce3-a2d402b56090.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f1df2df-6c7d-4278-8e49-9b83218665c5.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c9733520-8184-4125-93e8-8c41b9c3f197.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2b6bf2eb-745b-40b0-994a-1726855db1ec.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df117c1d-b022-4a46-9b72-1832196a8be9.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0f63d49-e3cd-4f50-b25b-b2fc200c0683.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J. Townsend",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJR7DAPZIHVD2K7LXP4GTX44EUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37EQ6HDW04Q8S?ASIN=B0CP7WQW6T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Very Nice wintercoat!!!",
                "reviewText": "This winter coat is stylish, fits well not too snug and not overly puffy. Warm,Hood can be taken off, fur on hood is nice. .Very happy with this coat!!! Thank you!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cami 56",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEX4RGKI3L6Q3RGCLE4BSFRSJ5QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH6D3RM1L30N3?ASIN=B0CP7WQW6T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome look",
                "reviewText": "I ordered the Navy coat one size up to accommodate a bulky sweater or coat. The hoodie. That was the right move. The coat is a comfortable length, a tad shorter than standard \"car coat\" length. I feel warm as toast when I wear it. The faux fur is a bit cheesy but I'm still brushing it smooth. This was a smart purchase. I can snap it closed or use the zipper for especially cold days. Definitely waterproof. Love the look and feel of this outerwear and I will definitely repurchase in another color.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CortneyCortney",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4IO3DBHXGZK3VBYAS3E2PPQO4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R4FRVWFOPG9H?ASIN=B0CP7WQW6T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Even better than expected!",
                "reviewText": "This coat is awesome! I bought this coat for a recent trip to Maine in January 😅. I am from Oklahoma & was worried about my other coats not cutting it. I can’t saw enough good things about this coat. Excellent quality, kept me toasty, wasn’t too bulky or heavy, & it was cute. I tested it on the bay all day & during the night. Weather was mainly 28F to 12F. Kept me warm the whole time. Several of my Maine friends even asked where I got it & asked me to send them the link 😎 Maine approved. I’m a curvy girl & the fit was great. I usually wear a 16-18 & I got a 4x ( I could have sized down, but I wanted an oversized look). The adjustable waist made it easy to cinch in if you wanted oversized with a little more structure/shape. Hood is big & a little floppy which I prefer. I wear a lot of high messy buns in my hair & it fit perfectly. 10/10 Recommend.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71YmKy7428L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "swimsalot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEN4GPLV2DCSNT5TH7GTP4XSJREA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSIZS5QAYWMR1?ASIN=B0CP7WQW6T",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2023",
                "reviewTitle": "4.0 out of 5 stars Really warm even in the arms but runs small",
                "reviewText": "This jacket is well made and looks great. It is very warm even in the arms. The only problem is that it runs small. It also is not lengthy by any means. It won't cover your bum.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura L.Laura L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVCW6UXBCP3Q5BJQBUNLMXIRTXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16B808AGP4BNK?ASIN=B0CP7WQW6T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Alaska Tested & Approved!",
                "reviewText": "I took this coat to Alaska & it was perfect. The overall feel of this coat was great from the time I unboxed it! It’s thick without being too bulky and is perfectly weighted. My only complaint is that there aren’t any pockets that go in at an angle for your hands but there’s plenty of pockets overall. It did get rained on a little and it repelled it nicely. Overall, I would definitely recommend this coat! I sized up just to be on the safe side with my trip being less than 3 days from time of order but this product does fit true to size so you’ll be fine ordering your regular size. I’m hoping they make the pants to match because I love this coat lol",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71RW35Ef3rL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "froggyjoe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNSOXY25IHJWBCXDHFAGYFI4ZZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AMMI9RGOCIXX?ASIN=B0CP7WQW6T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2023",
                "reviewTitle": "5.0 out of 5 stars warm in 20's",
                "reviewText": "The pro: color is pretty, I got the green, its comfortable standing up, and stylish, has a high neck , removable hood I have big arms and has plenty of room Cons: sleeves are s bit long and the shoulder area is bulky, I do not mind. when I sit down I can only snap the middle snap I am 5'7 230 lbs ordered the 3 X and does not fit around my legs I have to leave that open . Other than some bulkiness I am still happy with my purchase it keeps me warm is the main thing lol.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sean Garton Jr.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVFC5I3HRRKIJ4SC6YMFEPJ3S2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NXV1ZZF1SX1U?ASIN=B0CP7WQW6T",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "3.0 out of 5 stars Could be improved",
                "reviewText": "The jacket keeps you warm. BUT the hoodie is way too big. It won't stay put even if you button it. It keeps falling over your face. Also, the main zipper is a horrible design. It sucks. It is already starting to rip.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debra Medina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4F6SCN5V5J6N2ZWKMCBCS3IVWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD4CLWNCO68K8?ASIN=B0CP7WQW6T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars It fits perfectly and keeps me warm.",
                "reviewText": "A second winter coat.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie Corbett",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 21, 2024",
                "reviewTitle": "Warm and comfortable",
                "reviewText": "Love this jacket! Hood just needs a bit of fluffing when comjng out of the bag, but this is perfect for Canadian winter ❤️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kimberley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 26, 2023",
                "reviewTitle": "Beautiful color",
                "reviewText": "Perfect for cold days and I am exposed to cold blustery days. Price was great. I did have to go to a size bigger",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Val",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 17, 2023",
                "reviewTitle": "Beautiful",
                "reviewText": "This jacket is very lovely. The fit is perfect. I have had alot of compliments on it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shane S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 20, 2023",
                "reviewTitle": "Wanted to love it.",
                "reviewText": "Likely warm but sounded like a plastic bag when you move. lined with a plastic type layer to stop heat leak and protect against wind. fit weird on me. Bought an Arctic north at twice the price and fits like a glove and no noise.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy g.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 25, 2023",
                "reviewTitle": "🤩 WoW",
                "reviewText": "Super beau !! pas lourd mais très chaud j’adore la coupe il est parfait mais d’habitude je prend du 2x et là pour être sûr j’ai pris un 4 x un poil grand mais avec un gros Cotton ouater c super je peut bien bouger dedans pas serrer du tout ! Je recommande vivement",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}