{
    "remaining_requests": 13318,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wantdo-Winter-Padded-Puffer-Removable/dp/B073J74KB2",
    "body": {
        "name": "Wantdo Boy's Warm Winter Coat Waterproof Thicken Puffer Jacket with Removable Fur Hood",
        "price": "$39.98 - $45.98",
        "originalPrice": "",
        "rawPrice": 39.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wantdo-Winter-Padded-Puffer-Removable/dp/B073M7N9Q9",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B073M7N9Q9"
        ],
        "asinVariationValues": [
            {
                "asin": "B073J6J6W2",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41mIkjrztZL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09WHB9NJ4",
                "variationName": "Color",
                "variationValue": "Gray",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41QqeezJKPL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B073J5RDFQ",
                "variationName": "Color",
                "variationValue": "Navy",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41wjfL+QDjL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07PK3396K",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41h-Q1S4N+L._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B073J6L3VF",
                "variationName": "Color",
                "variationValue": "Army Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41NfpiCnhNL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B073J6J6W2",
                "variationName": "Size",
                "variationValue": "10-12",
                "variationImageURL": null
            },
            {
                "asin": "B073J74KB2",
                "variationName": "Size",
                "variationValue": "14-16",
                "variationImageURL": null
            },
            {
                "asin": "B073J52L9G",
                "variationName": "Size",
                "variationValue": "6-7",
                "variationImageURL": null
            },
            {
                "asin": "B073J6TPJ8",
                "variationName": "Size",
                "variationValue": "8",
                "variationImageURL": null
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41mIkjrztZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31jz0LvF4VL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MdSXe48QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nqngA-FjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41RdIuZlbCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411okgyfkEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LlEhLKqOL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the wantdo Store",
            "link": "https://www.amazon.com/stores/Wantdo/page/A1352C62-3AB6-4A73-BCBA-993F74F4F881?ref_=ast_bln"
        },
        "brand": "Wantdo",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 511,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fabric type 100% Pongee",
            "Care instructions Hand-wash and Machine washable",
            "Origin Imported",
            "Embraced with Warmth & Comfort - The boys' padded winter parka with a detachable faux furry hood could keep your kids warm and protected from the cold with, designed to provide warmth and style.",
            "Stay Dry - The kids boys' puffer coat features a PU membrane and DWR coating of 3000mm waterproofing index, making sure an unparalleled level of water resistance and keeping your kids dry and comfortable.",
            "Stretchy Feel on Free Movement - The quilted winter jacket for kid boys is made of soft and stretchy materials to provide maximum comfort and flexibility, allowing them to explore the world around them with ease.",
            "Keep Cold & Snow Out - The winter outerwear jacket & coat for kid boys has elastic cuffs, making sure that no snow seeps into the sleeves, and keeping your child warm and comfortable during all outdoor winter activities.",
            "An Essential Winter Jacket for Kids - The winter puffer jacket comes with SBS zippers on the hand pockets, extremely rugged and ideal for extended use. Equally, the padded interior means your child's hands will stay warm in the winter months."
        ],
        "description": "Wantdo Boy's Warm Winter Coat Collection: A Durable Winter Parka with Furry Hood for Winter Adventures By Wantdo Even on cold and rainy winter days, boys still love to venture out and have fun in the outdoors. Parents need to choose the right waterproof winter jacket for their lovely boys. Wantdo boys Winter offers warmth, comfort, water resistance, and durability, the important aspects that every parent considers. The waterproof fleece-lined winter coat for boys is pretty much the best choice for daily school or outdoor wear. Stay warm and cozy with the fleeced lining and hood of this essential daily boy winter outerwear coat. It's thick enough to keep your boys warm even during very cold weather. The windproof boy puffer jacket with furry hood is designed with elastic cuffs, keeping rain and cold air from entering the sleeves. The wide, soft collar on the fleeced winter coat fully covers your child's neck. The boy's waterproof winter fleece parka is made with stretchy material, allowing your child to move freely and enjoy playing in the winter to the fullest. The boy's thick snow jacket could stand strongly against tearing and abrasion well. The boy's waterproof winter jacket has two hand pockets to keep boys' hands warm.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Boys",
                "link": "https://www.amazon.com/Boys-Fashion/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7147443011"
            },
            {
                "name": "Clothing",
                "link": "https://www.amazon.com/Boys-Clothes/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1040666"
            },
            {
                "name": "Jackets & Coats",
                "link": "https://www.amazon.com/Boys-Jackets-and-Coats/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1046120"
            },
            {
                "name": "Down & Down Alternative",
                "link": "https://www.amazon.com/Boys-Down-Jackets-Coats/b/ref=dp_bc_aui_C_5?ie=UTF8&node=2422521011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 11.81 x 7.87 x 0.79 inches; 10.58 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ WDHW1875"
            },
            {
                "name": "Department ‏",
                "value": "‎ boys"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ January 7, 2019"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B073J6J6W2"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#88,256 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #16 in Boys' Down Jackets & Coats"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 511 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Our mission is to build products that are essential for active performance wear users. We aim to create versatile products that can be worn in various conditions, whether it's hiking in the mountains or strolling around town. By designing active performance wear with features such as waterproofing, stain repellency, fast-drying capabilities, and warmth, Wantdo becomes an indispensable part of our customers' daily lives. Windproof Puffer Jacket Warm Winter Coat Waterproof Winter Jacket: 3000 mmH2O Heavy Winter Parka Coat Quilted Parka with Faux-Furred Hood Daily School Wear , Outdoor Adventure, Hiking & Travel. Wantdo Boy's Warm Winter Coat Collection: A Durable Winter Parka with Furry Hood for Winter Adventures By Wantdo Even on cold and rainy winter days, boys still love to venture out and have fun in the outdoors. Parents need to choose the right waterproof winter jacket for their lovely boys. Wantdo boys Winter offers warmth, comfort, water resistance, and durability, the important aspects that every parent considers. The waterproof fleece-lined winter coat for boys is pretty much the best choice for daily school or outdoor wear. Stay warm and cozy with the fleeced lining and hood of this essential daily boy winter outerwear coat. It's thick enough to keep your boys warm even during very cold weather. The windproof boy puffer jacket with furry hood is designed with elastic cuffs, keeping rain and cold air from entering the sleeves. The wide, soft collar on the fleeced winter coat fully covers your child's neck. The boy's waterproof winter fleece parka is made with stretchy material, allowing your child to move freely and enjoy playing in the winter to the fullest. The boy's thick snow jacket could stand strongly against tearing and abrasion well. The boy's waterproof winter jacket has two hand pockets to keep boys' hands warm.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6099ff82-f293-4090-9fd7-923029bf7167.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7fe1e754-c4c1-435f-a729-bed6d2f04692.__CR0,0,700,350_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Wantdo Boys' Waterproof Puffer Jacket Warm Winter Outerwear Coat Winter's cold temperatures and damp air make it crucial for parents to find a winter jacket that keeps their children both warm and dry while providing comfort and ease of movement. The Wantdo boy's puffer coat offers full protection and ensures that boys stay comfortable even on very cold or snowy days. Advanced Waterproofing Technology The Wantdo boy's winter coat has an outer surface with a 3000mm waterproofing index, providing ample protection from rain or snow, which performs well to keep water from seeping into boys' bodies to cause chills. The waterproof winter jacket with fur could make boys stay dry and warm while playing outdoors. Whole Body Warmth System The boy's warm winter parka is designed to withstand various weather conditions, from rain to snow, and cool to cold temperatures. The boy's fleece-lined winter outerwear jacket for boys comes with a detachable hood, adjustable drawstring, and full zip placket, which work together to create a seal against the cold air that rushes in while sliding down the mountainside. Key Features for Winter Daily Wear The winter fleece jacket has SBS zippers, which are easy to zip up or down and are durable with an anti-corrosion function that allows for years of use.The warm winter jacket has two hand pockets to keep boys' hands warm. This fleeced snow parka's wide, soft collar fully covers your child's neck.The waterproof snow jacket is made of stretchy materials, allowing your children to move freely.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/685204c7-214c-461f-9265-4eeff701bac6.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Windproof Placket With a smooth and durable built-in SBS zipper, this boys' waterproof winter jacket greatly keeps cold air from penetrating inside. The good-quality anti-corrosion and non-deforming materials of the boy's fleeced winter jacket ensure that they will provide optimal performance for years to use. Detachable Hood The boy's warm winter coat has a detachable hood, which is easy to zip on and off. Its wide and soft collar provides ample coverage for the neck to keep the cold and snow out. Additionally, the fleeced hood of the boys' thick winter parka helps keep your child's head warm and cozy for added comfort. Elastic Cuffs The boys' warm puffer coat comes with elastic cuffs, ensuring that no cold air or water enters the sleeves of the winter puffer parka, keeping your child's arms dry and warm.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a04ac2f9-0e38-4a73-8e57-6ac5e9fbf1e2.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fef0735e-f2b6-490a-9501-41c81a13edf6.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/92bb4f34-de37-42ea-b90b-25351f87ecd5.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Wantdo Boys’ Waterproof Fleeced Parka Insulated Puffer Coat ET004 The winter jacket for boys could be an essential piece of clothing in this cold & wet winter for your child. Play, Run, Freely Enjoy. Water-Resistant Puffer Jacket The boy's puffer coat is made of advanced PU membrane, which has a waterproof performance of 3000mm, resisting light rain and snow. Breathable Winter Outerwear Jackets The boy's winter fleece coat has good breathability, suitable for light-intensity outdoor activities such as traveling, hiking, and camping. The boys' winter coat is wear-resistant, so there is no need to worry about the child slipping and causing friction with the ground, or being scratched by branches and twigs. Warm Fleeced Winter Jacket with Removable Fur Hood The boy's warm winter jacket has a fleece lining, which is soft and breathable. The hood is also fleece-lined. This winter puffer jacket could provide full-body warmth for boys and boys. Padded Parka Coat Windproof The winter snow coat features a large hood with a hook and loop, an SBS-zippered placket, and adjustable cuffs. These designs of the winter coat can effectively resist the entry of cold winds and cold snow, providing children with comprehensive warmth inside and out. Comfortable Winter Snow Coats with Pockets The boys' warm puffer jacket is made of soft fabric, which is convenient for children to move freely. The winter jacket has 2 large hand pockets, enough for storing small items such as tissues, chocolates, gloves, mobile phones, etc. Active and Fashionable Outerwear Jackets & Coats for Little & Big Boys The boy's winter clothing adopts a bubble style, with bright and fashionable colors. Multiple colors and sizes (6-16) are available for children of different ages to choose from. Whether playing in the snow outdoors or having daily school wear, the boys' winter outerwear jacket is a great choice for boys. Notes: Regular fit. Please refer to our size chart and measurement method to ensure that you choose the right size. Hand or machine washing is okay.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b58a52c8-d33d-41b5-b175-f4eeb29a5e47.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Wantdo Boy's Padded Winter Coat Thicken Warm Puffer Jacket Wantdo Boy's Hooded Warm Winter Coat Thicken Puffer Jacket Wantdo Boy's Padded Winter Coat Thicken Warm Puffer Jacket Wantdo Boy's Warm Winter Coat Waterproof Down Parka Wantdo Boy's Water-resistant Lightweight Winter Coat Fleece Lined Vest Wantdo Boy's Lightweight Puffer Jacket Water Resistant Choose from other Wantdo jacket styles Combining high quality synthetic insulation that offers a better resistant to outdoor elements including wind, water and snow. Puffer jackets with fur hood for boys protects against wind & water, keep warm and comfy even during chilly days or frosty weather. Combining high quality synthetic insulation that offers a better resistant to outdoor elements including wind, water and snow. This thicken padded jacket keeps you warm and comfy even during chilly days or frosty weather The thick padding in this puffer sleevesless jacket could keep boys warmer and drier with stylish, comfortable, and reliable. Lightweight puffer jackets with hood for boys protects against wind & water, keep warm and comfy even during chilly days or snowy weather. Main Features Waterproof, Windproof, Soft lining Waterproof, Windproof, Soft Lining Waterproof, Windproof, Soft lining Waterproof & Windproof Elastic Hem, Waterproof, Windproof Lightweight & Warm Insulation Type Fleece lining & thick padding Fleece lining & thick padding Fleece lining & thick padding Fleece lining & thick padding Fleece lining & thick padding Padded Lining Hood Type Detachable Hood Detachable Hood Detachable Hood Detachable Hood Detachable Hood Attached Hood Waterproof Index 3000 mmH2O 3000 mmH2O 3000 mmH2O 3000 mmH2O 3000 mmH2O 3000 mmH2O Pockets 2 hand warm pockets 2 hand warm pockets 2 hand warm pockets 2 hand warm pockets 2 hand warm pockets 2 hand pockets Thickness Thick Thick Thick Thick Thick Lightweight Best Use Daily Wear Outdoor Adventure Skiing Snowboarding Skating Hiking Climbing Travel Daily Wear Outdoor Adventure Skiing Snowboarding Skating Hiking Climbing Travel Daily Wear Outdoor Adventure Skiing Snowboarding Skating Hiking Climbing Travel Daily Wear Outdoor Adventure Skiing Snowboarding Skating Hiking Climbing Travel Daily Wear Outdoor Adventure Skiing Snowboarding Skating Hiking Climbing Travel Daily Wear Outdoor Adventure Skiing Snowboarding Skating Hiking Climbing Travel Best Match Jeans, casual pants, snow pants Jeans, casual pants, snow pants Jeans, casual pants, snow pants Jeans, casual pants, snow pants Jeans, casual pants, snow pants Snow Bibs & Jeans",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9b2d7324-af31-45da-977a-c533779547aa.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6099ff82-f293-4090-9fd7-923029bf7167.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7fe1e754-c4c1-435f-a729-bed6d2f04692.__CR0,0,700,350_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/576ddb35-d26f-4144-b55b-9e930b8d9bef.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/685204c7-214c-461f-9265-4eeff701bac6.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a04ac2f9-0e38-4a73-8e57-6ac5e9fbf1e2.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fef0735e-f2b6-490a-9501-41c81a13edf6.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/92bb4f34-de37-42ea-b90b-25351f87ecd5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b58a52c8-d33d-41b5-b175-f4eeb29a5e47.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/a351f89c-69d3-4e89-8c51-15efcd75538a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/fcad3aa7-71f6-4cb7-a393-a6a80d2f0f12.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4dfeb20c-d1c2-4fdd-852e-eb2558278c03.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a677914-bc28-428b-b5dd-142e35dca52b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4ac3c1e9-47cb-4156-ba0b-0b73471ff0a8.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f82705e7-5864-48af-8ecd-45f854341908.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Selena Lindsay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXLM4QHDIXULLVWL74VTJPDR5JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HHPH3TY231D8?ASIN=B073M7N9Q9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars My son loves his new coat!!!",
                "reviewText": "Great buy warm and stylish",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tykesha Sampson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXO2AZMPEKTE3MD27KJB6QQLS7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R58PI24K2YT3P?ASIN=B073M7N9Q9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Quality",
                "reviewText": "The quality of this coat is PERFECT. It’s light weight but thick enough to keep my five year old warm. It’s not bulky at all. hood is detachable, so this coat can be worn two different ways.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQLW5SRTMGM25SR5VMEP4ZTNBBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EF69OEOXYIUA?ASIN=B073M7N9Q9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Very good coat",
                "reviewText": "This is a very thick good coat. Very durable. Great buy for the coat. I bought it for my ten yr old who is rough on everything and this coat lasts. It fits true to size.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Montessa Paige",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENA3DNQRQ5ZGNTCRTW3QFJALYJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SGN0M52L5IO3?ASIN=B073M7N9Q9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "4.0 out of 5 stars Comfortable fit",
                "reviewText": "Comfortable fit, could of been a bit larger for a kids 14-16 but nice overall!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carolyn N West",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQP4ZZJXKTSDL7CLCCEGFP2WVLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13FRW98N8R962?ASIN=B073M7N9Q9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Love it",
                "reviewText": "He likes it and it is nice and warm",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZHL23VZ3X6ONZGLI3ULN4VW7BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G7ZEST3YFJAL?ASIN=B073M7N9Q9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect for our needs",
                "reviewText": "The detachable hood fits our needs perfectly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ismahan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAAXKO3PYN5BALKETGSPWTCEK3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22TYDSRKYIGVI?ASIN=B073M7N9Q9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2021",
                "reviewTitle": "5.0 out of 5 stars Worth the price",
                "reviewText": "It’s so soft on the inside and warm the material is really nice I wouldn’t classify it as a puffer tho it’s a great winter jacket for my son haven’t seen if it’s actually waterproof or not but the warmth of it is worth the price",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shane Falls",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPBQK5IDO4XKCBYAFIWFDUZUDZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DY1MV0BLP5WR?ASIN=B073M7N9Q9",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2023",
                "reviewTitle": "3.0 out of 5 stars Thin Coat",
                "reviewText": "Product was built okay and looked nice but we ordered it as a winter coat. something that my son could ear in 5 degree weather if needed and this coat was only a little thicker then a hoodie.I wouldn't recommend this to anyone unless you need something that will be in the high 30's and up.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}