{
    "remaining_requests": 13348,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/wantdo-Womens-Recycled-Windproof-Thicken/dp/B07F8Q2SGX",
    "body": {
        "name": "wantdo Women's Warm Winter Coat Heavy Puffer Jacket Parka with Fur Trimmed Hood",
        "price": "$78.97",
        "originalPrice": "",
        "rawPrice": 78.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wantdo-Womens-Thicken-Outwear-Removable/dp/B07F8NHKBN",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B07F8NHKBN"
        ],
        "asinVariationValues": [
            {
                "asin": "B07PHPSZ87",
                "variationName": "Color",
                "variationValue": "Army Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31jY5fWSovL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07F8M6CV9",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31BxIctPhJL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07Z49QKHQ",
                "variationName": "Color",
                "variationValue": "Gray",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31WTPrjOtDL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07RBK9B34",
                "variationName": "Color",
                "variationValue": "Navy",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31Hrivj507L._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07PDLNZYQ",
                "variationName": "Color",
                "variationValue": "Teal Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41bOIJhoP2L._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07Z4CCC8N",
                "variationName": "Color",
                "variationValue": "Wine Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31dRRFWYhgL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B08M3K63R8",
                "variationName": "Color",
                "variationValue": "Beige",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/318GguQcRQL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B08M3RDYMB",
                "variationName": "Color",
                "variationValue": "Purple",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41qV4gd4AnL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07F8M6CV9",
                "variationName": "Size",
                "variationValue": "Small",
                "variationImageURL": null
            },
            {
                "asin": "B07F8MKM47",
                "variationName": "Size",
                "variationValue": "Medium",
                "variationImageURL": null
            },
            {
                "asin": "B07F8KDC8V",
                "variationName": "Size",
                "variationValue": "Large",
                "variationImageURL": null
            },
            {
                "asin": "B07F8Q2SGX",
                "variationName": "Size",
                "variationValue": "X-Large",
                "variationImageURL": null
            },
            {
                "asin": "B07PHRLQRX",
                "variationName": "Size",
                "variationValue": "XX-Large",
                "variationImageURL": null
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31BxIctPhJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31Aq5L5u-QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31YsWSzzZOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41024M9CxsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qPpZsQlUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WI ZRBCRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/619mgSNa7KL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/57b9c2b5-3652-4157-9a11-986f40b50f08/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the wantdo Store",
            "link": "https://www.amazon.com/stores/Wantdo/page/A1352C62-3AB6-4A73-BCBA-993F74F4F881?ref_=ast_bln"
        },
        "brand": "Wantdo",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2969,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fabric type 100% Pongee",
            "Care instructions Hand-wash and Machine washable",
            "Recycled Fabric and Filling - The women's winter coat is made with renewable fabric and filling, which requires far fewer resources than new fibers and generates fewer CO2 emissions. With a 3,000mm waterproof rating, the long puffer coat keeps you dry in the rain or warm in snowy weather at all times",
            "Full Body Protection - Made with an anti-water fabric shell, filled with synthetic insulation. Protect yourself against wind, snow, and rain with the quilted parka jacket. The waterproof puffer jacket is made with a detachable hood and fur lining, elastic waist, snap-button cuffs, DWR finish, and PU membrane",
            "A Warm Embrace - The winter jacket seals body warmth in and keeps cozy. The winter coat for women is made with soft and light filling, a diamond pongee lining, and an adjustable fur-lined hood",
            "A Long Parka Coat You Can Trust - Women's coat with a removable fur hood is tailored using heavy-duty buttons and zippers that can be secured without a hitch. And the puffer jacket's durable outer shell protects against tears and abrasions",
            "Made for Women - Each of the long winter coats boasts 6 pockets that keep essentials within reach. A waist buckle of the women's warm parka jacket creates a figure-flattering silhouette despite the loose hood, sleeves, and hem"
        ],
        "description": "Winter coats help insulate the heat and let you move as you please. What you need is a warm enough women's winter coat that doesn’t skimp on quality, performance, and style! Wearing a winter coat for women before heading outdoors is a must if you don't want to feel cold or cut your camping trip short. You'll need a windproof puffer coat for women with features such as windproof cuffs, SBS zippers, and 3000MM waterproof index that can keep you warm and allow for a full range of motion at the same time to fully enjoy all the wonders winter has to offer. Recycled Fabric and Insulation - The women’s coat is made from recycled materials, providing excellent warmth without contributing to carbon emissions. Waterproof Protection - The waterproof puffer jacket has a waterproof rating of 3000mm, ensuring that you stay dry in the wettest conditions and making it an excellent choice for outdoor adventures. Pocket Features - The women’s puffer coat has two double-entry front patch pockets and two deep inner pockets to hold your valuables. Detachable Hood - The women’s winter jacket has a detachable hood that offers versatility in different weather conditions, providing added convenience for storage and travel. Durable Zipper - The long winter coat for women features a high-quality zipper, ensuring durability and easy use for long-lasting wear.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Women",
                "link": "https://www.amazon.com/Womens-Fashion/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7147440011"
            },
            {
                "name": "Clothing",
                "link": "https://www.amazon.com/Womens-Clothing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1040660"
            },
            {
                "name": "Coats, Jackets & Vests",
                "link": "https://www.amazon.com/Womens-Coats/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1044646"
            },
            {
                "name": "Down Jackets & Parkas",
                "link": "https://www.amazon.com/Womens-Down-Coats-Parkas/b/ref=dp_bc_aui_C_5?ie=UTF8&node=12643250011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 13.66 x 11.85 x 7.24 inches; 2.2 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ WDNV1756"
            },
            {
                "name": "Department ‏",
                "value": "‎ womens"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ March 5, 2019"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07PHPSZ87"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#64,249 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #68 in Women's Down Jackets & Parkas"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,969 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About Us Our mission is to build products that are essentials of active performance wear for our users. We want to create products that are wearable in a lot of different conditions, whether one wears it to hike in the mountains, or stroll around town. By making active performance wear with features such as waterproof, stain-repellent, fast-drying, and warm, Wantdo becomes a daily essential in our customers' lives. Recycled Winter Coat 3000mm Index Waterproof Puffer Coat Windproof and Warm Down Alternative Jacket Removable Hood Puffer Jacket Multi-pockets Long Pakra Jacket Women’s Coat with Smooth Zipper Women's Winter Jackets are Available in a Variety of Colors Winter coats help insulate the heat and let you move as you please. What you need is a warm enough women's winter coat that doesn’t skimp on quality, performance, and style! Wearing a winter coat for women before heading outdoors is a must if you don't want to feel cold or cut your camping trip short. You'll need a windproof puffer coat for women with features such as windproof cuffs, SBS zippers, and 3000MM waterproof index that can keep you warm and allow for a full range of motion at the same time to fully enjoy all the wonders winter has to offer. Recycled Fabric and Insulation - The women’s coat is made from recycled materials, providing excellent warmth without contributing to carbon emissions. Waterproof Protection - The waterproof puffer jacket has a waterproof rating of 3000mm, ensuring that you stay dry in the wettest conditions and making it an excellent choice for outdoor adventures. Pocket Features - The women’s puffer coat has two double-entry front patch pockets and two deep inner pockets to hold your valuables. Detachable Hood - The women’s winter jacket has a detachable hood that offers versatility in different weather conditions, providing added convenience for storage and travel. Durable Zipper - The long winter coat for women features a high-quality zipper, ensuring durability and easy use for long-lasting wear.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/663ffa24-c838-4423-a70e-b0338e39c57c.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2cf307e7-f0f4-46db-8594-dd498926b681.__CR0,0,700,350_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "4-layer Thick Construction for Ultra Warmth The women’s windproof winter coat is comfortable, so it won’t slow you down. Enjoy form and function while you’re knee-deep through your snowy adventures. At the same time, the down alternative jacket featuring 4-layer thick construction keeps you warm against the chilly breeze. Recycled Raw Materials The women’s puffer coat is made with recycled materials. Extracting and processing virgin materials takes a toll on land, water, and air. To do our part, Wantdo is moving toward renewable and recycled raw materials. Using recycled polyester lessens our dependence on fossil fuels and keeps plastic bottles out of landfills. It is a wise choice to choose to buy a women’s puffer jacket made from recycled fabrics. 3000mm Index Waterproof Protection The women’s waterproof winter jacket has a waterproof fabric with an index of 3000mm that keeps you dry and comfortable all day, you can continue your outdoor activities on heavy fog, rainy, or snow days. The waterproof puffer coat for women provides warmth and keeps you dry in damp or cold weather. Superior Cold Protection The women’s warm puffer jacket is filled with premium fluffy synthetic fibers that limit air circulation while preserving your body heat. This means you can enjoy ice skating at the park or hiking around the Rockies without getting distracted by cold winds or chills. The women’s parka jacket is also not only protective against water, wind, and cold but it can also be customized to flatter any body type.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cbabcf33-b3b2-4e8f-8d51-7ee4e9c56a02.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "The long coat for women is tailored with pockets for keeping your hands warm and storing essentials. Designed with convenience in mind, the warm puffer jacket keeps what you need within reach. The women’s heavy winter parka is designed with convenience in mind, featuring two deep inner pockets. They safeguard items that you want to secure the elements. The thick puffer coat can get your storage needs covered. The women's winter jacket with hood is made to help you maintain a full range of motion while providing a flattering silhouette. An adjustable snap button at the puffer jacket's waist part pulls attention to your curves.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/09291b5a-49c5-4c66-916c-137c92448280.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b459a9d4-52db-4e9a-a0a8-1e33dbde39d1.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c5f3b52-66f7-4f78-adb3-612179a88bed.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Wantdo Recycled Women’s Winter Coats Collection E27 The women’s winter parka combined with warmth, flexibility, and functionality. Responsibly Sourced The winter coat for women is sourced from recycled raw materials and has a lower impact on the environment than traditional textiles. Women's puffer jackets made from recycled fabric are not only high quality but also low carbon. They are manufactured using sustainable materials and help create a greener planet. More Than Just A Winter Coat The hooded women's coat does a great job of keeping you warm, but that's not all. It's also fitted with several pockets, including hand-warming and buttoned slits. The women's jacket can be worn on more than one occasion. Made for comfort, you can easily use them to go shopping in town, work, or attend class, even in non-sub-zero weather. Waterproof & Windproof Protection The women's warm winter jacket features an adjustable snap button on the waist, allowing for a customized fit and secure positioning. The snap button can be tightened or loosened to suit individual preferences, ensuring both warmth and comfort. The ladies' winter coat also effectively protects against outside moisture seeping through on rainy days and cold weather. Made to Last Wear a women's hooded puffer jacket every day with the utmost confidence. The down alternative coat is designed to withstand wind, water, tears, and abrasion. The quilting of the women's long parka provides added strength to the fabric. Function and Form in One The women's long winter coat brings together comfort and impeccable style. Enjoy form and function while you’re knee-deep through your snowy adventures. You also get your pick of size and color as the puffer jacket for women comes in a wide variety of stunning hues, all of which will look fantastic against the natural backdrop of the great outdoors. Versatile Puffer Coat The women's puffer coat pairs well with your favorite shirt, sweater, or sweatshirt. Take the hooded jacket for women with you whenever you go on holiday travels, outdoor adventures, camping trips, or whenever you play winter sports. Make a stylish statement whenever you head outdoors on a cold day.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ba41d9df-8f9e-4a56-b2f6-040318196d13.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Women's Hooded Winter Coat Thicken Quilted Puffer Jacket Women's Quilted Winter Coat Puffer Jacket Thicken Parka Wantdo Women's Recycled Puffer Jackets Warm Winter Coats Long Winter Jacket Women's Recycled Long Puffer Jackets Winter Coats Winter Parka Women's Winter Hooded Coat Waterproof Warm Long Puffer Parka Wantdo Women's Long Quilted Winter Coat Thicken Puffer Jacket with Faux Fur Hood Choose from other Wantdo jacket styles Block the air circulation, prevent the wind from pouring into the gaps and achieve the effect of keeping warm. Thicken Parka jacket make a stylish statement, detachable fur collar allows you to wear more diversified. The lady's winter coat features durable zippers, ensuring durability and easy use for long-lasting wear. The waist drawstring, adjustable hem, elastic cuffs efficiently traps warmth, and creat a figure-flattering silhouette. A winter parka combined with warmth, style and functionality, which is a perfect gift choice for your family. A quilted coat designed to handle extreme cold and inclement weather；Advanced Teflon waterproof coating keeps you dry and comfortable all day Main Features Windproof, Waterproof, Warm Windproof, Waterproof, Warm Windproof, Waterproof, Warm Windproof, Waterproof, Warm Windproof, Waterproof, Warm Waterproof, Windproof, Warm Waterproof Index 3000 mmH2O 3000 mmH2O 3000 mmH2O 3000 mmH2O 3000 mmH2O 3000 mmH2O Hood Type Removable Fur Hood Removable Fur Hood Removable Fur Hood Removable Fur Hood Attached Fur Hood Removable Fur Hood Pockets 2 hand pockets, 2 inner pockets 2 hand pockets, 2 chest pockets,1 inner pocket, 1 patch pocket 2 hand pockets, 2 inner pockets 2 hand pockets, 2 inner pockets 2 super warm hand pockets,1 secure pocket 2 hand pockets, 2 inner pockets Best Use Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities Daily Wear,Casual,Working,Shopping,Running,Hiking,Cycling,Camping,Fishing,Outdoor Activities",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7e48fe0b-5875-4562-b424-6e6ef350b52b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/663ffa24-c838-4423-a70e-b0338e39c57c.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2cf307e7-f0f4-46db-8594-dd498926b681.__CR0,0,700,350_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cbabcf33-b3b2-4e8f-8d51-7ee4e9c56a02.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/09291b5a-49c5-4c66-916c-137c92448280.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b459a9d4-52db-4e9a-a0a8-1e33dbde39d1.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c5f3b52-66f7-4f78-adb3-612179a88bed.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95e9e1d1-f0a5-46d2-927c-bc3976a64558.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ba41d9df-8f9e-4a56-b2f6-040318196d13.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d2742869-3376-4014-8fc1-bd276e0aea6c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5b0f6607-be2f-4a94-8c88-2c6b4a74d843.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95bf738d-ff64-4b86-a69c-36c5817c0683.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0583455d-0384-4f10-abca-3bdc54888bbb.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/341d6ef4-dc68-493d-82c1-a7e731852c39.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/05a333db-3bb2-44be-928f-4b57fbeb32a4.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Missouri Deb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBNZC2XTJPUJJHZVJKJUAVN5J3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCVS4VDT8OECT?ASIN=B07F8NHKBN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars I LOVE this coat!",
                "reviewText": "This is the perfect coat for COLD weather! I was looking for something that would keep me warm walking my dog in the sub-freezing weather we've been having--he has a nice warm puffer dog coat so I chose this one for me and I'm glad I did. It fits well, not too loose and not too tight--I could layer under it but I don't need to. Just took a mile walk in 0 degrees with only a t-shirt and jeans under this coat and I was toasty warm the whole way. The zipper feels strong and serviceable, the coat material feels light but durable, not slick or easily snagged, and the \"fur\" around the hood looks ok. I wanted a warm coat long enough to keep me warm from head to thighs and this one is just what I wanted.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHAJ7WRWX6EIF6QWVK5SLRFLS7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVZGTS37C3C4U?ASIN=B07F8NHKBN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2022",
                "reviewTitle": "5.0 out of 5 stars Great value and performance",
                "reviewText": "For the price point this is a well made coat that performs well. It's keeping me toasty warm in the mid-west winter. I love that the hood is detachable since I prefer hats, but I also am glad it's an option if I want to use it. I love the cuffed sleeves. I have trouble finding coats that have long enough sleeves. These hit just right and the cuff keeps the cold out and fits nicely over gloves. The longer length is perfect. I have a long torso and I, again, have trouble finding coats that are a good length. This is long enough to keep you really warm, keep out the draft, but it's not hard to sit in or get in and out of a car it. While the neck zips up high, the fit at the neck is sort of loose, so on windy days you may want a scarf, but this is not a big issue for me. I am 5 foot 9 inches and weigh about 145 pounds and I got the large. I am glad I did, but I would not mind if it was a bit more snug fit around the waist. But I think a medium would be too small. It's thick without being bulky. It does well in wind and I've been out in snow and single digits in it and it did great for me. I hate cold weather but this has made walking the dogs so much less awful. I also like the multiple pockets - 4 outer ones on the front. I put my phone in a top one so they lower ones are free for my hands. They are nice and deep and a great extra layer when gloves are not quite enough. I liked mine so much I recommended the brand to my son and he got one of the men's coats and he loves it as well. Overall it's a great buy that performs well and it has a great profile that looks good on. Would buy again.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daisy May",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNHXRUEJ5ZIQX6LCM7YJYCJHPOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23KVOX9EC1IJD?ASIN=B07F8NHKBN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice jacket and warm.. Love the cuffed sleeves.",
                "reviewText": "So far no dislikes at all. I found this jacket very comfortable and warm. I really liked the longer length for added warmth. I am not a fan of hoods and especially with fur but knew it was a removeable hood which I made sure of before buying. I also like that the side pockets snap and not zippers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sierrasierra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG66JKQO5IKYNOQCCBVCIE4DJULQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OAOOR9PO4C5K?ASIN=B07F8NHKBN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "4.0 out of 5 stars Warm coat",
                "reviewText": "The coat is nice and warm. It is heavier than I expected. The fur does not look like the fur in the picture on Amazon. It’s a bit thin. It took a lot of brushing with a fleece brush to get it fluffed from packaging. The chest pockets work great for cell phones. The hand warmer pockets are well placed. I added ties to the fur to keep the hood on in wind. It does not have a draw string closure. For the price, it’s a good jacket.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61JlFj2I1vL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ZKbcTcM7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lady Journalist",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAKYMJJDE2EQXX6ALTOZDIS4MTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31CHVRIASPZZR?ASIN=B07F8NHKBN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Very Nice Coat",
                "reviewText": "This coat is attractive and fits well. I had concerns that it would be too heavy and boxy but it is not. It's a medium weight, not too stiff material. The color is a bluish grey. I wanted a coat that would be a happy medium between a long jacket and a coat that's just above my knees (I'm 5\"7,) and this coat meets that requirement. I also found it to be very warm. The one thing I don't like about it is the fur around the hood. It looks ratty and sparse, not befitting such a nice coat, so I unzipped and removed it. If I could make one suggestion to the manufacturer, it would be that they should consider providing a more attractive piece of faux fur or eliminate that part altogether.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMICK4N53WDYBWXG24DY2KV3QKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO3VTDWPMBRV9?ASIN=B07F8NHKBN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars If you've got my coat, I've got the hood.",
                "reviewText": "This is a great, versatile jacket. The trim zips offthe hood and the hood can be zipped off the jacket. It's warm, has plenty of pockets and is nicely fitted. As a matter of fact, I liked it so much that I bought a second one after I accidentally left the first one in a hotel room. I'm guessing whoever found it liked it too since they never turned it in.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lynn CLynn C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7Y7F4PCAX7WF2CDLAAB7UDQNBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVUXBHIC952QI?ASIN=B07F8NHKBN",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2023",
                "reviewTitle": "3.0 out of 5 stars Cute, but the fur is awful + other icks",
                "reviewText": "The Good:* The teal color is really pretty.* The coat is really warm. I bet it would keep me toasty in 15° weather.* The XXL fit across my chest. I wear a 40H bra, And it's very difficult to find a coat that doesn't make me look and feel like a sausage.* I'm 5'9, and I have a regular length torso. The coat hits just below my butt. I wish it was a couple inches longer but it's fine.* The construction is mostly good.The Not-So-Good:* The hood is a big negative. I like the fur look, but this faux fur looks incredibly cheap and feels worse. I tried to comb it out a little when I got it. That made no difference. I am sensitive to textures. I cannot handle touching this stuff. Gross.* Yes, the fur comes off. You unzip it. But I think this function is so you can wash it at home. Without the fur, the hood becomes quite shallow. I don't think it would work at all without the fur.* As you can see in the picture, The hood is a fashion statement only. There is no way that I could find to tighten it around my face. That means any breeze is going to wrap around your face and push the hood off your head.* The fabric gets dirty very quickly. I wore this to run one quick errand, brushed against my car, and spent some time scrubbing (not wiping) to get that little bit of dirt off the fabric. Not good.* I like that the cuffs have extra fabric at the opening, but at least on the jacket I got it does not have enough elastic to stay tight around my wrist. The purpose of this is to keep wind and snow from getting up your sleeves. Those cuffs would fail at the at their job.* The main pockets have snaps, not zippers. I know for sure that I would lose my keys, my phone, my sunglasses, anything I put in those pockets except for the receipts I need to throw away anyway.* The coat is quite heavy.I decided to go with a lightweight Columbia jacket instead, and I'm returning this. Bummer.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61fX9MyUN7L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71EKZvSzmDL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71LDfzgTjZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71k3brOcpjL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81jM0LrpI1L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "M&M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQ5O43DEGVVXWOGL5FQD3RSXI6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROODSN120MRCI?ASIN=B07F8NHKBN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Great fit",
                "reviewText": "Gave as a gift. She loves this coat for the length (mid thigh- height 5'5\") and good arm length (other coats always riding up to high, but not this one). It is warm & cozy too. She also loved that she could remove the faux fur around the hood.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Happy customer ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 11, 2023",
                "reviewTitle": "Great for the cost",
                "reviewText": "Love thus jacket. Waterproof, lightweight, warm and comfy..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MelodyBlake",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 26, 2023",
                "reviewTitle": "Jacket feels great looks like picture.",
                "reviewText": "Love the quick delivery great packing nothing to dislike so far not wear yet cannot say how warm it yet looks good .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doll carrier",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 29, 2023",
                "reviewTitle": "Great winter coat",
                "reviewText": "Warm and wonderful,",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Valerie Sten",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 7, 2023",
                "reviewTitle": "Fits good and really warm.",
                "reviewText": "For personal use but the outside is cheaper looking material but warm",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "karen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2024",
                "reviewTitle": "Winter coat",
                "reviewText": "Very warm very nice quality looks great on",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}