{
    "remaining_requests": 38051,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/WE-Furniture-AZTOLSL-Grey-Silver/dp/B00F91J0WO",
    "body": {
        "name": "Walker Edison Silver Metal Twin over Loft Bunk Bed Twin Size Bedframe with Ladder Computer Gaming Desk",
        "price": "$228.99",
        "originalPrice": "",
        "rawPrice": 228.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/WE-Furniture-AZTOLSL-Grey-Silver/dp/B00F91J0WO",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CLVXSHDY"
        ],
        "asinVariationValues": [
            {
                "asin": "B003B3NQUO",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$235.20",
                "variationImageURL": "https://m.media-amazon.com/images/I/31ZcvC3fiQL._SS36_.jpg"
            },
            {
                "asin": "B00F91J0WO",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "$228.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31Yiog0y8lL._SS36_.jpg"
            },
            {
                "asin": "B003B3NQVI",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$317.82",
                "variationImageURL": "https://m.media-amazon.com/images/I/31s++Ja1pCL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "Only 8 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61B1LkgT8WL._AC_SY450_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Walker Edison Store",
            "link": "https://www.amazon.com/stores/WalkerEdison/page/D0D2A602-6790-40E0-91C5-CF992DB24FF4?ref_=ast_bln"
        },
        "brand": "WalkerEdison",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 4462,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 13 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Dimensions: 71” H x 41.75” D x 79” L, Loft: 57.25” H x 41.75” D x 79” L",
            "Twin bed supports up to 200 Ibs.",
            "Fits most twin beds, 5”- 9” mattress thickness recommended",
            "Integrated guardrails and ladder included",
            "Ships ready-to-assemble with step-by-step instructions"
        ],
        "description": "Our functional premium metal twin loft bed gives you more floor space in your kid’s bedroom. Features a sturdy metal frame with a powder coated finish, in a simple, contemporary design. Room below the bed can be used to place a dresser, nightstand, lounge chair or even a desk for your computer to play video games or browse the web.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Bedroom Furniture",
                "link": "https://www.amazon.com/Bedroom-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063308"
            },
            {
                "name": "Beds, Frames & Bases",
                "link": "https://www.amazon.com/Bed-Frames-Headboards-Bedroom-Furniture/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3733101"
            },
            {
                "name": "Beds",
                "link": "https://www.amazon.com/Beds/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3248804011"
            }
        ],
        "productInformation": [
            {
                "name": "Size",
                "value": "Twin Loft"
            },
            {
                "name": "Product Dimensions",
                "value": "79\"L x 41.73\"W x 71.12\"H"
            },
            {
                "name": "Special Feature",
                "value": "Space Saving"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Finish Type",
                "value": "Powder Coated"
            },
            {
                "name": "Included Components",
                "value": "Guardrails, Hardware Packet, Assembly Instructions, Bed frame"
            },
            {
                "name": "Brand",
                "value": "Walker Edison"
            },
            {
                "name": "Furniture Finish",
                "value": "silver"
            },
            {
                "name": "Product Care Instructions",
                "value": "Wipe with Dry Cloth"
            },
            {
                "name": "Assembly Required",
                "value": "Yes"
            },
            {
                "name": "Item Weight",
                "value": "80 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Walker Edison"
            },
            {
                "name": "ASIN",
                "value": "B00F91J0WO"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "AZTOLSL"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 4,462 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#380,862 in Home & Kitchen (See Top 100 in Home & Kitchen) #476 in Beds"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Form Factor",
                "value": "Loft"
            },
            {
                "name": "Finish types",
                "value": "Powder Coated"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "30 day manufacturer defect."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Style Orion"
            },
            {
                "name": "Maximum Weight Recommendation 200 Pounds",
                "value": "Item Weight 80 Pounds"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Brandon Pekarek",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQB3UDXSXJSSRCYA25B4ELPUE5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R324J02O5EHJUS?ASIN=B00F91J0WO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 23, 2016",
                "reviewTitle": "5.0 out of 5 stars My son loves his new bed!",
                "reviewText": "This bed is by far my son's favorite item in his room. The bed is not that difficult to assemble, however it is time consuming and takes a while if your doing it by yourself. The height on this item was an issue for us and I had to remove my sons ceiling fan in order to install the bed. Once assembled the space underneath it is nice and allows him to put his bean bag under the bed for video games and movies. I have read other comments about the rungs hurting the feet of some, however my son had never made that complaint. I went ahead and bought some pipe insulation and wrapped the rungs and went over them with electrical tape to secure them in place. I also purchased a clip fan and clipped it to the foot of the bed for my son on those warm evenings and its working well. The box that it is delivered in is bulky and heavy so be prepared for that. My son loves being able to use the bed to help make forts in his room when his friends come over and also loved being high up while he is asleep. I feel that compared to other models being sold at other stored like Ikea and Wal-Mart, this bed is very nice and of better quality.As mentioned my only piece of advice is to have at least one other person available to assist with assembly if possible. Other than that the quality and the price are very good and I am certain your child will love the new addition to their room.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUNCVEYSKCVJFORXFSWT7DD36FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWVSKT6MMK08R?ASIN=B00F91J0WO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2022",
                "reviewTitle": "5.0 out of 5 stars I love this over my bedroom couch 178#male 6'",
                "reviewText": "This loft bed is surprisingly nice. I got the white color which I didn't think I'd like but was cheaper(I can't help sale shopping) than grey and I like it a lot. It didn't start wobbling until 2-3 weeks after using it but the wobble makes me think the side rail might fall off eventually if I don't keep re tightening a few \"screws\" every few weeks. I think I might have less wobble than most people because I have one end of the loft bed wedged in between my wall and my couch. Then one side has a metal shelf with same height against it. I only banged my head under it 5 times before the first few days now I don't. One problem I still have is accidentally scraping or lightly punching my wall or ceiling when stretching or repositioning my blanket. I like to watch tv before bed so really the only thing I can think of that would make this loft bed better is the choice of removing the top TWO rails out of the FOUR rails of the, \"front\" side(or maybe just remove the second down from the top rail of that piece..). I have to peek in between the bars with my crappy two separate visions and it gives me a slight headache and neck crap. Kinda annoying. This thing also makes creaking noises if you make repetitive motions. My mattress is 10 inches and fit fine. Even with my cons I'm giving this 5 stars for saving space and not breaking. I would definitely NOT recommend more than one adult on this at a time.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rabbitlover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2YGJARKP54C6Z7IGXUJ4M6RALQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3606RB34B55TM?ASIN=B00F91J0WO",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2021",
                "reviewTitle": "4.0 out of 5 stars Thumb-Destroying, Wiggly-Wobbly, Cat Palace",
                "reviewText": "Very good bed for the price, in my opinion! Super easy to assemble for one person alone, even standing it upright and moving it around. Plenty of spare hardware, too! Some things I will HIGHLY suggest for the assembly process: 1, obey the directions. Do not get ahead of yourself, no matter how much you might want to jump the gun and juuust put that ooone little part in before the other. And obey the directions when they tell you not to tighten the screws all they way until you're done. Trust me on this. And 2, no matter what the other reviews say, DO NOT SKIP THE LITTLE GREY SQUARES!!! They are absolutely vital to the integrity and stability of the bed! Prepare your thumbs, because it WILL hurt like hell. Use something to apply pressure to help snap them in that will save your fingers, but DON'T hammer them!!Now, the bed is pretty stable for a loft bed, but could stand to be a lot better, like a thin bar across the floor to keep the front legs a little more secure. The height is great, even for a lower ceiling. I can sit up just fine and not bump my head, and was able to fit a full desk under the bed on one side, and a full size table on the other, with plenty of room for my rolling chair underneath and plenty of head room. It's an INCREDIBLE space saver! My only problems with the bed are that it's scarily wobbly, especially when climbing up. If you have any kind of molding on your baseboard, the bed is going to be a bit further from the wall than you'll want. The L brackets included will not reach, and you'll have to get creative with how you secure it to said wall. Make SURE you secure it to studs only. Even secured though, it's still frighteningly wobbly, so be aware of that. Every tiny movement you make, you WILL feel dramatically in the entirety of the bed. It's very audibly creaky, too. It is the shakiest when climbing up into the bed, and the lack of a dip or space in the railing makes it a bit of an annoying challenge to get in and out of. My other complaint is shared by everyone else in that the ladder rungs are INCREDIBLY narrow, at best approx 5/8ths of an inch diameter, and are very painful on the feet. They're also super smooth and offer zero traction. HOWEVER, my biggest complaint is that the motion of climbing in and out happens to force the rungs to loosen and turn little by little, unscrewing them from the ladder. Climbing up one night, the middle rung turned on its screws and rotated inward like a smooth little conveyor belt roll, flinging my leg through and causing me to fall. If I hadn't had an excellent grip on the top rail at the time, I absolutely would have broken that leg. Thankfully I was only left with a substantial amount of paint. So, daily tightening of the rungs is what I'm reduced to, and considering a contact cement on the bolts. Instead of the pool noodle trick most folks do to make the rungs more comfortable, I instead chose a route of safety, and used reflective-striped non-skid stick-on stuff used for outdoor stairs, cut into strips that fit the rungs and circled them around completely. This way has kept my feet from slipping off and makes me more aware if the rungs start to become slightly loose again. Definitely recommend this trick, especially more than pool noodles which can also themselves spin around the rungs.All-in-all, decent product, even for an adult like me, which is great for anyone who doesn't mind climbing into and out of it. Excellent for anyone in college who needs to save space in small living quarters. I prefer the top bunk in a military barracks to this loft bed, is that says anything, but it's not the worst bed by any means. Definitely recommend it over anything a certain large Swedish store sells for your own assembly. It's the perfect game changer for a tiny room, regardless of your age. Just know that if you have to pee in the middle of the night, you will hate life. If you get thirsty, then it sucks to be you. If you have diarrhea, vomiting, or are drunk, then you're better off sleeping on the floor. Do NOT use ANY amount of haste getting in or out of this bed, period. It's really a pain to get in and out of, due to the height of the railing that sticks up higher than the mattress. If you have male anatomy, you're going to rack it multiple times, and there's no avoiding that. Even as a female, there's no avoiding it. Despite it's flaws, it's actually the best loft bed I've found, especially for the price, after doing a LOT of research. I do recommend it, just beware that nothing is perfect.Cat absolutely loves it.",
                "reviewVotes": "86 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SAMUEL MONTEJO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 17, 2023",
                "reviewTitle": "Ideal para espacios pequeños",
                "reviewText": "Al ser una cama elevada el espacio que queda debajo lo puedes aprovechar poniendo lo que desees, soy de México y me llegó como importación así que me salió algo cara pero es cuestión de esperar ofertas porque he visto que mueven los precios. La caja llegó bastante mal pero afortunadamente las piezas de dentro estaban bien, quizás deberían tener más cuidado con eso. Tienes que agarrarla a la pared con los tornillos que te trae para mayor estabilidad.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paula",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 18, 2014",
                "reviewTitle": "Great bed!",
                "reviewText": "Amazon.ca shipped for free with a trial of Amazon Prime. Arrived in two days (from ON to BC!) with UPS and shipped right to my garage. All pieces were there and none damaged - with the exception of one piece that was slightly bent, but didn't affect assembly or integrity of the bed.This is an amazing bed! It took just over 2 hours for mom and kid to put together. It was pretty easy - aside from these tabs that snap the slats into place under the mattress - that was difficult. It's very, very solid. There's L-brackets for mounting to the wall too, as the bed is a tad wobbly without it. There's enough space up top for even taller kids to sit up, plus there's still enough room underneath for a large desk or a smaller desk and a comfy chair beside it. Kids 5 feet and under can even stand underneath. The metal ladder is hard on some feet, but it doesn't bother my kid.I highly recommend this bed and buying it from Amazon.ca! Cheapest place in Canada to buy it from!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steven",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 10, 2022",
                "reviewTitle": "Solid but a bit shakey",
                "reviewText": "Solid frame, great support setup.It is roughly 6 feet tall and only has 4 small points of contact (the legs). The cross beams do a good job of supporting/stabalizing the bed, but the frame should definately be secured to the wall or with something sturdy to brace against.You can fit a Full/Double bed with an end table or possibly a queen size bed, under this frame which is pretty great. It is tall enough that an adult can sit on a bed underneithe without issue.It appears to have holes cut for \"optional accessories\"... possibly some sort of desk attachment... but it does not mention what the \"optional accessories\" actually are. It DOES however come with gray plastic caps to cover a few of the opion connections, as well as screws to fill in the other holes.It can rock quite a bit when mt 6 year old climbs up or moves around, but if it is secured to the wall there shouldbe no issueAssembly was simple and straight forward, took around an hour or 2 to throw it together.After a week of use, none of the bolts have loosened which is impressive when compared to the rocking.Overall i would highly recommend this as an alternative to a traditional bunk bed, With the ability to fit another bed underneith you can find what you like, and you wont need to lose both levels if you have a problem with the top or bottm.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John cassidy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 17, 2021",
                "reviewTitle": "Very pleased",
                "reviewText": "Really impressed with this loft bed. We purchased it for my daughter's room to save space and it definitely helps. My husband and I built the bed with ease, the instructions were very straight forward and it took less than hour to assemble it. The ladder is a bit tricky, however my daughter has managed to figure it out. I would definitely recommend this bed to someone looking for an affordable, well built option.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "isaac hammisaac hamm",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 8, 2021",
                "reviewTitle": "Versatile space-saving sleeping space",
                "reviewText": "We bought this to maximize the sleeping spaces in our tiny mobile home bedrooms. Were able to squish a Twin XL mattress into it, but it really takes a Twin.Pros: - ladders at both ends of bed make it versatile for positioning - it can fit over a queen bed. Inside Length is 78\", so if your queen is not longer than this, it may be able to fit length wise over the bed, as well as over the head. - light enough that it can be moved quite easily around once it is assembled. - straightforward assembly (my husband did it singlehandedly) - no defects in paint or otherwiseCons: - not sure an adult would feel secure sleeping on it. It wobbled a lot when I (155 lb. woman) climbed up on it to make the bed - the ladder is a bit tricky to dismount from with the rail going all around the entire circumference, rails may be a bit hard on tender feet",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/813h-VgDL6L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$227.52",
                "sellerName": "Cymax",
                "sellerRating": "4"
            }
        ]
    }
}