{
    "remaining_requests": 46672,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Saiyin-Bluetooth-Bookshelf-Turntable-Subwoofer/dp/B0BJK7B1GR",
    "body": {
        "name": "Saiyin Bluetooth Bookshelf Speakers, 40W X 2 Powered TV Speakers with 4 Inch Woofer, Turntable Speakers with Optical/AUX Input/Subwoofer Line Out for PC and TVs",
        "price": "$79.99",
        "originalPrice": "",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Saiyin-Bluetooth-Bookshelf-Turntable-Subwoofer/dp/B0BJK7B1GR",
        "soldBy": {
            "sellerID": "A1RXN56EQGDNCX",
            "name": "Saiyuan",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1RXN56EQGDNCX&asin=B0BJK7B1GR&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CB3PWNLC"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BZPD48R6",
                "variationName": "Size",
                "variationValue": "3.5 Inch Woofer",
                "price": "$69.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BJK7B1GR",
                "variationName": "Size",
                "variationValue": "4 Inch Woofer",
                "price": "$79.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41byMhCYtbL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51o803eg1bL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51O sVoiOBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JsV3cP8 L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/610gO1utG0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZZlkAqKxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51BR4GdJnLL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f5527b88-7470-49fa-81b1-722228f57d8e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fbde25ca-e8e3-4a02-a2f0-6ad9d0919ae2/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/97d456d8-27e9-400c-8452-d6cfe168b4c0/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a99d9199-8146-400d-8255-891d523772b8/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Saiyin Store",
            "link": "https://www.amazon.com/stores/Saiyin/page/E303D535-ACC7-463E-B35D-9247F6589994?ref_=ast_bln"
        },
        "brand": "Saiyin",
        "merchantInfo": "Saiyuan",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 658,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Wednesday, February 14. Order within 1 hr 53 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐁𝐥𝐮𝐞𝐭𝐨𝐨𝐭𝐡 𝐁𝐨𝐨𝐤𝐬𝐡𝐞𝐥𝐟 𝐒𝐩𝐞𝐚𝐤𝐞𝐫𝐬- Pair the bookshelf speakers with your smartphone, tablet, Mac, or PC to play music wirelessly, no need to deal with messy wires.",
            "𝐀𝐝𝐝 𝐚 𝐒𝐮𝐛𝐰𝐨𝐨𝐟𝐞𝐫 𝐭𝐨 𝐭𝐡𝐞 𝐁𝐨𝐨𝐤𝐬𝐡𝐞𝐥𝐟 𝐒𝐩𝐞𝐚𝐤𝐞𝐫𝐬 - The active bookshelf speakers are built with 0.5 inch silk dome tweeter and 4 inch woofer, bringing you a surround home theater listening experience with a SUB OUT jack which supports connecting to any powered sub woofers you have at hand.",
            "𝐌𝐮𝐥𝐭𝐢𝐩𝐥𝐞 𝐖𝐢𝐫𝐞𝐝 𝐈𝐧𝐩𝐮𝐭𝐬- The monitor speakers are built with Optical and coaxial inputs support 24 bit 192k digital audio and ensure a lossless connection to TVs,and Convenient connect to any device that has a RCA output enables you to connect to the TV via optical, and to the turntable via rca at the same time, saving you the cost of another stereo speaker. Note:Please switch the turntable to LINE OUT instead of PHONO OUT when setting up with the speakers with a turntable",
            "𝐑𝐞𝐦𝐨𝐭𝐞 & 𝐁𝐮𝐭𝐭𝐨𝐧𝐬 𝐂𝐨𝐧𝐭𝐫𝐨𝐥 - The active bookshelf speakers (Dimension : 150*170*240mm) comes with a remote control allowing you to adjust the volume and toggle inputs at your fingertips: mute/unmute, switch to OPT/COAX mode, line-in, and Bluetooth modes. Remote is replaceable lifetime. You can also control the speakers via buttons on top of it. NOTE: Remote is NOT compatible with TV remotes or universal remotes.",
            "𝟑 𝐘𝐞𝐚𝐫𝐬 𝐖𝐚𝐫𝐫𝐚𝐧𝐭𝐲 - Guaranteed high quality and reliability with hassle-free parts and labor warranty for three years in USA.Please contact us via after sale email and we will deal with it within 12 hours."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Home Audio",
                "link": "https://www.amazon.com/Home-Audio-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=667846011"
            },
            {
                "name": "Speakers",
                "link": "https://www.amazon.com/Speakers-Audio-Video/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172563"
            },
            {
                "name": "Bookshelf Speakers",
                "link": "https://www.amazon.com/Bookshelf-Speakers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3236451011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "11.8 x 9 x 6.7 inches"
            },
            {
                "name": "Item Weight",
                "value": "10.2 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B0BJK7B1GR"
            },
            {
                "name": "Item model number",
                "value": "DS6701"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 658 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,094 in Electronics (See Top 100 in Electronics) #3 in Bookshelf Speakers"
            },
            {
                "name": "Date First Available",
                "value": "October 18, 2022"
            },
            {
                "name": "Manufacturer",
                "value": "zhenzhenshi saiyin dianzi youxiangongsi"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Speakers Maximum Output Power",
                "value": "80 Watts"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Saiyin"
            },
            {
                "name": "Model Name",
                "value": "4 Inch Bookshelf Speakers DS6701"
            },
            {
                "name": "Speaker Type",
                "value": "Surround Sound"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Special Feature",
                "value": "Bookshelf Speakers with SUB OUT, Bookshelf speakers for record player, Bookshelf speakers with Optical input, Computer speakers for desktop, Speakers for tv, computer, turntable See more"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Warm Tips The speakers set is composed of an active speaker and a passive speaker. Wire connection is required between the speakers(speaker wire is included). When the bookshelf speaker is connected to the record player, please switch the audio output of the record player to LINE instead of PHONO.If your record player has no Line out audio output, only PHONO output, please connect the bookshelf speakers to the record player through a preamplifier. For optical connections, please change your TV audio output to optical, and change the audio format setting to PCM. Please make sure the protective caps at the ends of the optical cable are removed before plugging it in. Sub Out can only be connected to powered subwoofer. if the bass is poor, please try to switch the polarity of the subwoofer.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5ace849c-387c-4c19-8927-ffab337b3382.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Speakers for Desktop Computer The bluetooth bookshelf speakers are built with 0.5 inch silk dome tweeter and 4 inch woofer Speakers for Record Player Please switch the record player to LINE OUT instead of PHONO OUT when setting up with the bookshelf speakers with a record player. Bluetooth Bookshelf Speakers Wired and Wireless Inputs: optical, coxial, RCA inputs are availableSUB OUT jack supports connecting to any powered subwoofers you have at hand",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e7c078a4-7a15-4dee-94c6-fb61380c6749.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/da4a85ec-0898-4457-8c45-8b2a503b0036.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/457f20b3-8573-488e-85dd-cfa9a653cd70.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Frequently Asked Questions Q: When I use APPs such as Netflix on the TV, the speakers have no sound. A: The speakers do not support Dolby and DTS, please kindly disable the Dolby and DTS on your TV audio settings or streaming video APPs like Netflix, Amazon Prime Video, HBO, Hulu, Youtube. Q: How to quickly disconnect the current Bluetooth device connected with speakers? A: Press and hold the BT button on remote /M button on speakers for about 2 seconds to disconnect the current Bluetooth device. Q: My dog chewed my remote, how do l get a replacement remote? A: We provide free replacement speakers accessories, including remotes. Q: How do I use TV remote to control the speakers? A: The IR code of the remote control is not compatible with universal remotes and TV remotes.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d853c460-c932-47a3-aef0-28386a6e3f5b.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "What's in the Box An active bookshelf speakerA passive bookshelf speakerUS power adapter: 100-240V, DC 20V 2.5A, MAX 4.8ARemote control Battery Operated, requires 2 X AA' Batteries (Not included)Optical cable3.5mm to RCA cableSpeaker wire: 2 metersSpeaker Dimensions (L X D X H): 5.9\" x 6.7\" x 9.4\" -inches (Each)",
                "media_link": []
            },
            {
                "media_text": "What's in the Box An active bookshelf speakerA passive bookshelf speakerUS power adapter: 100-240V, DC 20V 2.5A, MAX 4.8ARemote control Battery Operated, requires 2 X AA' Batteries (Not included)Optical cable3.5mm to RCA cableSpeaker wire: 2 metersSpeaker Dimensions (L X D X H): 5.9\" x 6.7\" x 9.4\" -inches (Each)",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5ace849c-387c-4c19-8927-ffab337b3382.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d3011f0-f99c-4b27-853d-91ee9cb50609.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e7c078a4-7a15-4dee-94c6-fb61380c6749.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/da4a85ec-0898-4457-8c45-8b2a503b0036.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/457f20b3-8573-488e-85dd-cfa9a653cd70.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d853c460-c932-47a3-aef0-28386a6e3f5b.__CR0,0,300,300_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "PaulB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7DTCCE7BCALVRIC3PKCNRLNJZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TTTDIIRD90BR?ASIN=B0BJK7B1GR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 14, 2023",
                "reviewTitle": "5.0 out of 5 stars deep bass, mid-high and high somewhat lacking but there, Still great sound for the money",
                "reviewText": "I am somewhat disappointed in the sound these produce. - This is my experience, with my discerning ears and taste in audio. - But i also realize the price range, the expectation cant be for $1000, or even $500 speakers, and not like my JBL 305'sI like high Hi's ....middle of the way Mid's and deep punchy bass without forgetting the mid to high bass.These speakers do cover a lot of those bases, and for many it may be an outstanding deal.For me, given the reviews here, i was a little put off when i got them, not totally disappointed, just let down a little.I considered keeping them for my son but opted not to and returned them once Saiyin replaced them for the 6801K - though they sent me the old version when advised i would get the newer version with the horn tweeter, not the done tweeter.***Build qualityVisual quality - excellent, super nice looking speakers with the grill on or off, although the LED lights in the front should not be the size (actually larger) than a pencil erasure and should only light up based on the input selected (color coded lights per input method maybe.Saiyin - all that is needed are tiny lights, you don't need big led's like you have now.They are not very heavy and the external aesthetics are very appealing.Vibrations/Rattle at high volume - nonexistent - perfect.***Audio QualityLoudness - Oh my gosh yes, very loud, i did not test distortion much but they handle and extremely high volume level.Treble - This is one of my sticking points, though its not BAD, just not what i want in a speaker.The version without the Treble and Bass are limited, they don't offer any wiggle room without a pre-amp/EQ, which for those who have one, many lucky you, get these speakers!If you don't, then you should look at the 6801K for the Treble controlDon't get me wrong, the treble is there, its nice, but it wasn't what i wanted.Bass - more than enough for such a small little woofer and small enclosure, in fact wow, WOW, huge bass for what they are.Its tuned perfectly, for what they are but what would be nice, really nice, is maybe an alternate version that uses a Bass Reflex type ported enclosure because it offers an extremely elevated level of punch to your bass. even porting it from the rear so that bass bounces off the walls.a full 5\" and 8\" woofer/subwoofer version with larger horn tweeters and a midrange speaker would be putting many speaker people out of business - Edifier i am talking to you.***Customer ServiceMy experience with Saiyin has been nothing but phenomenal, the rep I dealt with was polite, understanding, helpful and even replaced the speakers I was not personally happy with, with the 6801K speakers which offer separate bass and treble, and a MIC input (which i think is pretty cool)This greatly helped tone down the extra bass because of the chipset tuning and bring up the treble to where i want it (which is treble maxed out, and Bass about 60%)I really really which they offered a 3-way speaker though, man i would replace my JBL305's with those.I still liked the original model, they are 10000% worth every penny, but don't buy them thinking they are JBL Monitors, or B&W or any other high end speaker.Envision cheaply priced speakers, that blow you away, and then blow you away again when you realize that the things are less than $100.They promote them as phonograph speakers, but let me tell you whether its this model or the 6801K they make AMAZING home theater speakers.And depending on how you position them, the need for a sub is down to personal preference, not out of necessity.Original -YES i realize these are TWO-WAY speakers but with a separate tweeter horn there should be more treble here.So far I have only tested Bluetooth and this is what i am basing my reply on, so for now i am keeping the review the way it stands.On the Iphone i had to use the Treble Booster EQ setting which does a lot more than boost trebles, but it made it sound better.I have had other BT adapters that caused heavy bass too so i am hopeful with the RCA or Optical inputs the audio will level out. (hoping)I did not test those as i later reached out to Saiyan and they resolved it (per my above remarks)",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charles",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5R2EMVG6Q53HE4GVNYRXGXHHEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VUTCTNCVMEAH?ASIN=B0BJK7B1GR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Value Proposition",
                "reviewText": "I have been living with these speakers for several weeks now and I am quite pleased. Reasonable sound, great value.These are definitely near field speakers. At high volume, treble is too sibilant and quickly fatiguing. Bass has some punch but gets fairly muddy at the lows. I believe they are rated down to 54 – 3.5” woofer. These speakers will not fill a moderate to large room with sound. Mine are set 3 feet from a back wall, 4 feet apart, toed in slightly to hit the listener position about 4 feet out. Separation is good, but soundstage is flat – nothing up front or behind and little dispersion of the mids and treble.They appear well made – feels solid and are heavy for their size. They are butt-ugly and have 5 orange indicator lights that are hideous. RCA, Toslink and Bluetooth connectivity – I’m running RCA out of a TV and BT out of a laptop. Remote is good, BT connectivity good.I live in a studio apartment and never listen loud. Clarity of the mids is excellent at moderate to low volumes and bass is present and pleasant. For my use case these speakers are excellent. This price for powered BT speakers is remarkable. Will they last? Well, made in China so we shall see.With the above considerations – highly recommended.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stratton Brooks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY6G3ENTRCHFMZUACRFSBELUUDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18LV98R9B1M97?ASIN=B0BJK7B1GR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars It's great for vinyl",
                "reviewText": "I've been pleased with the price point and sound quality. It's easy to set up and the blue tooth works great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Armstrong",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERJLMTSYVXPRIBCHSAZEO776BOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G28S0HB30RGE?ASIN=B0BJK7B1GR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Really nice except for the hiss",
                "reviewText": "These desk speakers are truly great for the price point but still have an annoying hiss/static to them. I tried moving the cables and even tried entirely different AUX to RCA cables yet none fixed that hiss. It's enough to be noticeable especially at lower volumes. The actual sound quality has a nice richness to it. I wouldn't recommend these for desk use due to the hiss that these speakers have, but for general room speakers they are a great buy. The Bluetooth functionality is also very easy and well programmed.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ryan HRyan H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGG224YQOE6FXX6HDBVJXHIXLVTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23IWDGAA2SBZQ?ASIN=B0BJK7B1GR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing value powered bookshelf speakers.",
                "reviewText": "To start I don’t have any hissing noises as other reviewers have mentioned. I was mainly looking for inexpensive powered speakers with a sub out that I could connect to my tv. These are exactly what I was looking for and I am genuinely impressed with what you get at this price point.Sound quality: excellent at this price point. They get loud enough for a medium size room (I got around 95db average with a meter). They surprisingly have quite a bit bass for such a small speaker. Only con is I wish they had some kind of real equalizer but not the end of the world.Fit/finish: they seem to be put together well with only small imperfections in the vinyl and nice and snug speakers grills. The only con I have is the led lights, I wish there was on option to turn them off but that is just personal preference.Connecting to tv (tips): like I mentioned, I mainly got these to connect to a tv using an optical cable and I wanted to give the people in the same boat some tips. I used a Samsung tv with a firestick and amazon pro remote. Make sure you go to your tv sound settings and change your output to PCM. You can also use your Amazon pro remote to control your speakers (turn on and off and change volume) so you don’t need to use 2 remotes. The way to do this is to set up a soundbar on your firestick and use the meidong soundbar option.Final thoughts: I don’t know the longevity of these speakers but at this price you can’t beat the sound quality and connectivity you get. You basically get bookshelf speakers, a receiver/amp, and soundbar all in one. Speaking of sound bars, this probably sounds better than any soundbar at 200 and below. I will update if I have any issues but as of now I would highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Xxk7CPHJL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis MIguel Chong",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 19, 2023",
                "reviewTitle": "Gran calidad",
                "reviewText": "Excelentes bocinas, el sonido es de calidad de estudio y los materiales se sienten de primera, son potentes y no distorsionan una compra 100% recomendada",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CUAUHTEMOC V.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 23, 2023",
                "reviewTitle": "Extraordinarias bocinas con sonido incomparable",
                "reviewText": "Un producto extraordinario realmente fuera de serie.Una calidad de sonido fuera de serie.Valen cada peso pagado por ellasSu presentación, terminado y belleza deslumbra.Súper contento con ésta magnífica compra.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juan jose",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 1, 2023",
                "reviewTitle": "Excelente Producto.",
                "reviewText": "Tiene buena definición de sóndo, la ocupo para mi laptop y celular por BT muy bien equipo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}