{
    "remaining_requests": 46525,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sonos-Play-Compact-Wireless-Speaker/dp/B00EWCUK1Q",
    "body": {
        "name": "Sonos Play:1 - Compact Wireless Smart Speaker - Black (Discontinued by manufacturer)",
        "price": "$199.93$155.00",
        "originalPrice": "",
        "rawPrice": 199.93,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sonos-Play-Compact-Wireless-Speaker/dp/B00EWCUK1Q",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "21",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51C17DrwacL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51jdrWe37HL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Mh7su8LoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hhqal7UgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 iWTmdvjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511HKgmBR L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61BFAWAxdcL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/376eb11d-88b5-4c67-8eea-76e9443c4bf2/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/14a2aad4-09d0-4d08-b6f0-1832f0ba0b03/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d83ac75-7416-4a15-876c-e0a81478c0ba/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d824974f-3f84-402d-9a41-2c675213dba6/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6a1281c2-21af-430e-a5d1-f654f0ea0ed0/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1777075a-2ec6-4e35-ae9f-e7b759d643e3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/706a0068-e6de-41f4-a73d-d456f9d7a016/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 7,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1AxdYt24ML.pdf",
            "userManualLink": "javascript:void(0)"
        },
        "byLineInfo": {
            "name": "Brand: Sonos",
            "link": "https://www.amazon.com/Sonos/b/ref=bl_dp_s_web_2530477011?ie=UTF8&node=2530477011&field-lbr_brands_browse-bin=Sonos"
        },
        "brand": "Sonos",
        "merchantInfo": "Sold by Renovar Tech and Fulfilled by Amazon. Ships from and sold by CellularStream.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 4848,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tuesday, February 13. Order within 19 mins",
            "FREE delivery February 14 - 16.",
            "Or fastest delivery Tuesday, February 13. Order within 13 hrs 19 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Small yet powerful speaker for streaming music and more. Get rich, room-filling sound with Play:1, and control it with the Sonos app",
            "The compact design fits just about any space. Put it on your kitchen countertop, or tuck it away on your office bookshelf",
            "Go from unboxing to listening in minutes with just 1 cord and step-by-step guidance in the Sonos app",
            "Pair 2 Play: 1's in the same room for stereo separation and more detailed sound.\""
        ],
        "description": "Sonos Play:1 Compact Wireless Speaker for Streaming Music. Works with Alexa. (Black).",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Portable Audio & Video",
                "link": "https://www.amazon.com/Portable-Audio-Video/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172623"
            },
            {
                "name": "Portable Speakers & Docks",
                "link": "https://www.amazon.com/Speaker-Systems-MP3-Player-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=689637011"
            },
            {
                "name": "Portable Bluetooth Speakers",
                "link": "https://www.amazon.com/bluetooth-speakers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7073956011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "4.69 x 4.69 x 6.36 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.85 Kilograms"
            },
            {
                "name": "Manufacturer",
                "value": "Sonos"
            },
            {
                "name": "ASIN",
                "value": "B00EWCUK1Q"
            },
            {
                "name": "Item model number",
                "value": "PLAY1US1BLK"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 4,848 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,239 in Portable Bluetooth Speakers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 14, 2013"
            },
            {
                "name": "Speakers Maximum Output Power",
                "value": "10 Watts"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Sonos"
            },
            {
                "name": "Model Name",
                "value": "Play:1"
            },
            {
                "name": "Speaker Type",
                "value": "Bookshelf"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Special Feature",
                "value": "Speaker Systems, Multiroom Digital Music Systems"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mathlete",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2IAGS5GNZ4JLS62VGJU53ZRWBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V4T4M782H3CI?ASIN=B00EWCUK1Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 5, 2014",
                "reviewTitle": "5.0 out of 5 stars SONOS PLAY 1 vs. DENON HEOS 3",
                "reviewText": "Full disclosure, I am a Sonos user and have fully adopted into their wireless speaker ecosystem. I currently have two Play 5s (Dining Room & Great Room), two Play 3s (Living Room, Guest Bedroom), and a Sonos Home Theater setup in my Media Room (one Sonos Playbar, one Sonos Sub, and two Play 1s).After hearing all of the pre-release hype about the Denon HEOS Wireless speaker system, I want to compare it to my Sonos system. So I picked two HEOS 3s up this weekend and tried them out.In my opinion, the Sonos Play system provides a slightly better overall experience and value for the money you spend. However, the Denon HEOS system has a distinct edge over Sonos - not requiring the $99 Denon HEOS Extend Wireless Range Extender just to use the system. News reports have leaked that Sonos is working on a solution to remove the requirement of their $40 SONOS BRIDGE Instant Set-up Solution for SONOS Wireless Network, but until that software/firmware release comes, I can definitely see why the HEOS system will be a serious contender and solid alternative for some households.MUSIC SOURCES:Both Sonos and Denon work with the following music service providers:- Pandora- Spotify- Rhapsody- Tune-InHowever, Sonos is able to work with the following additional music services:- Amazon Cloud Player,- Google Play Music- Beats Music- SiriusXM Internet Radio- Slacker- Stitcher SmartRadio- Songza- Rdio- Last.fm- iHeartRadio- SoundCloud- Audible- and many more lesser known digital music sourcesAs of the date of this review, Denon has only been able to gain partnerships with Pandora, Spotify, Rhapsody, andTune-In. That's nothing to sneeze at, however if you are a subscriber to any other music service, you may want to wait before giving the HEOS system a try. In my opinion, just having access to Google Play Music is a deal maker for me with Sonos. And the ability to control what plays through my Sonos speakers with the native Google Play Music app (versus having to be in the Sonos app) is a serious step in the right direction to satisfy my needs as a customer.** Point Goes to Sonos **THE LOOKS:Cosmetically, the look of the Sonos Play 1 is considerably more traditional versus the HEOS 3. The HEOS 3, measuring 10.7\" x 5.1\" x 6.5\" is taller, sleeker, and stylish than the 6.36\" x 4.69\" x 4.69\" cylindrical Sonos Play 1. However, in my opinion, the Sonos Play 1 has a more solid feel with its metal mesh front plate and and smooth lines with no major edges. It also has a denser feel than the HEOS 3, packing in just over 4lbs of audio hardware in such a small casing.Depending on your personal style and if you want your speakers to blend in to your room, the winner of the looks category is totally up to you. While I like the minimalist look of the Sonos, the clean edges and sleek design of the Denon is very eye catching. And if you like to have cool lines in design to draw attention to an exceptional piece of audio equipment, the Denon is a clear winner. So for being different by blending elegance with a touch a touch of flash, the winner for this category is Denon.** Point Goes to Denon **UNDER THE HOOD:Both speakers house two class D digital amplifiers pushing a tweeter and mid-woofer that generates a crisp, clean sound for both higher frequency vocals and mid level bass tones. There is no doubt that both Sonos and Denon installed great amplifiers and speakers into their systems as they both generate a solid range for all genres of music - equally.The HEOS 3 does have a ported designed enclosure, which the Sonos Play 1 does not. I found that the ported enclosure was a nice touch to add a little more depth to the bass, but for certain music tracks played through the device, it seemed the sound was muddier than the Play 1. Nothing horrible, but very noticeable depending on where you have the Play 3 placed in the room.** Point Goes to Sonos **THE APP:Sonos recently changes their app's user interface for iOS, Android, Mac, and PC. This was another big development for Sonos as the old user interface for their controller looked like it was stuck in the early 2000s. And while it still leaves mush to be desired, the Denon HEOS controller app is not much better. It adds features like grouping rooms by dragging widgets together within the app and other functions that seem to be geared towards easier control. However, depending on the phone you are using, pinching and dragging are more cumbersome than tapping to select. Again, this is not a big issue, but something I found slightly clunky and annoying with my smaller iPhone screen.Again, this is a personal preference. I like the new Sonos controller app, but can definitely understand why Denon went a different direction. Denon seems more built for a tablet experience, in my opinion as some of the key actions call for pinching, dragging, and precision dropping.** Sonos & Denon Tie **THE SETUP:Both Denon and Sonos are extremely easy to setup and both customer service teams are OUTSTANDING. However, given the fact that Sonos currently requires more steps in their setup process (connect a Sonos Bridge), the point goes to Denon for sure.During the initial setup of your first Sonos speaker, you must either connect it directly to your network router or purchase a Sonos Bridge, connect the bridge to the router, then wirelessly connect the speaker to the SONOSNet network created by the Sonos Bridge. Did that sound confusing? Well, it may be for the first time user of novice electronics buyer. The really nice people at Sonos customer service had to hold my mother's hand in setting up her first Play 1 and it took almost an hour as she was not familiar or comfortable with making changes to the router the cable company had installed in her home - true story. On the other hand, once you have a bridge set up, adding additional Sonos components is extremely easy.Denon, on the other hand, has an extremely easy setup from the beginning. Plug the speaker in the wall, download the app, use the supplied cable to connect the speaker's AUX jack into your phone's headphone jack, follow the in-app directions to connect to your network, unplug the speaker from the phone, place the speaker in any room, blast music from the app. Simple!** Point Goes to Denon **EXPANDABILITY:Both the Sonos and Denon systems allow for multiple speakers to be added. Additional speaker may be played independently, paired as a group, or paired as a stereo pair. In my test, I only purchased two HEOS 3s. So, I cannot speak for pairing different size HEOS speakers together.The biggest advantage regarding expandability goes to Sonos. With a playbar and subwoofer in their arsenal of components, Sonos has a huge advantage for users who also want to bring the wireless music technology to home entertainment. The Sonos Playbar and Sonos Sub can run as a 2.1 home theater or 5.1 home theater system when paired with two Play 1s. And believe me the sound is amazing. So, with Denon only building an ecosystem for music based consumption, I think it leaves room for growth to catch up with Sonos' expandability into home entertainment. Again, this is not a deal breaker for getting into the HEOS ecosystem, but should definitely be considered before going too far down the Denon rabbit hole.** Point Goes to Sonos **THE RESULTS:The Sonos Play 1 is a great, compact speaker that will definitely bring attention to your home's sound system. It has a bigger sound than you would expect from such a small speaker and having two play 1s paired together can fill most rooms with a crisp, clean sound.The Sonos Play system does require a Sonos Bridge (for now) and that is the biggest negative that I would give it in my book. But that is not a deal breaker as the Play ecosystem as a whole is much more powerful than the Denon HEOS ecosystem is currently.At a $199 price makes me give the Sonos Play 1, 5 out of 5 stars. I definitely don't think you will be disappointed with the performance or functionality of the HEOS system. I just believe that you can get more for your money with Sonos.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bart Motes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHTE2TSRQVOUF5DERVN3V5W7EMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ATUK8SUNP768?ASIN=B00EWCUK1Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 7, 2014",
                "reviewTitle": "5.0 out of 5 stars Expensive but worth every penny and more.",
                "reviewText": "If you're reading this review, you're probably where I was a few months ago. I had two burning questions in my mind: (1) how good is the SONOS system (is it worth it?), (2) which speakers should I get (what does my initial/total investment need to be)?SHORT ANSWER: IT IS WORTH IT.As to the first question: it is fantastic. Yes, it is expensive. But there's absolutely no doubt that SONOS delivers exactly what it promises. You can play music wirelessly anywhere that your wireless reaches. It just works. It took about two minutes to set up and it was incredibly easy. (See below)A PAIR OF PLAY-1s SOUND FAN-F-ING-TASTICTwo Play 1s, in stereo sound great. (Turn loudness off, set treble up to 70-80%.)I stressed this so hard. Initially I thought, man, can I even get two Play 3s or do I have to get two Play 5s? Play 1 did not enter my initial considerations at all. I read too much from serious audiophile folks. So here's what I did: I bought two Play 1s and 1 Play 5. After listening for about ten minutes, I returned the Play 5. The Play 5 sounds fantastic, don't get me wrong. But unless you have a big space to fill, two Play 5s would just be overkill. Meanwhile, the two Play 1s in stereo arguably outclass the Play 5 for the same price. (You'll see debate on this point on the SONOS forums.)If you want to get started, a single Play 1 still sounds better than almost any bluetooth speaker you care to mention.So your initial investment can be simply a single Play 1 and a bridge. You will be hooked, I'm afraid. I now have four play 1s and a PlayBar. (A separate review may follow for the Playbar or be amended to this--suffice it say for now that my only complaint is that it would be nice to be able to set separate volume levels for tv and music playback, otherwise it works amazingly well. I do not use a sub and don't think it is necessary, though I may add it at some point when the pocket book allows.)APPLE HARDWARE, MICROSOFT SOFTWARESONOS is all Apple on the hardware end and all Microsoft on the software side. If you're the literary sort, you could say that the hardware is the fox and the software is the hedgehog--the fox knows many things but the hardware knows one big thing.The speakers are elegant looking and everything just works. On the flipside, tech geeks will point out that you pay a style and performance premium. Yes, there are other solutions that are cheaper and I'm sure deliver better sound. And much harder to set up, much buggier, and more frustrating.On the software side, things are not quite as elegant. Are the software guys the big dummies or Achilles' heel of the SONOS operation? No. The software actually has amazing challenges and does some amazing stuff. It's just ugly. The SONOS software integrates every conceivable music source. SONOS supports Amazon Music (formerly Amazon Cloud Player), Spotify, Pandora, Rdio, Rhapsody, pretty much anything you can think of, including, now, Google Play.Better: it allows you to create playlists from multiple sources.So, I can pull tracks from Amazon Music, Google Play, my iphone, any networked drive, and have it all play together. Great stuff. SONOS also has sleep and alarm/wake functionality and a few other little bells and whistles.The problem is that by stuffing so much stuff under the hood and trying to be jack of all trades, the SONOS controller is almost unavoidably clunky. SONOS recently updated the software controller, preserving all the functionality, but attempting to streamline and make the controller less ugly. It didn't really work. It's a little annoying, but still works fine. I hope further updates will be coming because intuitiveness has taken a step backwards, unfortunately.INTERFACE AND OPTIONSWould be nice if you could set volume levels and other specs for each music source. For instance, Sirius plays at a level lower than Amazon Cloud Player.SETUPInitial problems trying to use one component but once I connected bridge the setup took 30 seconds. It was not obvious to me from instructions that you need to press BOTH volume + and play/pause together, either.CONCLUSIONYou will not regret this purchase. My wife thought I was nuts to spend all this money, but she now agrees that the SONOS system is the most life changing and awesome piece of tech we own.Highly recommended. (I usually don't make this plea, but: please vote helpful if you found this helpful. And if you're an audiophile who is thinks Sonos is not up to snuff, keep in mind this review is aimed at ordinary folks and don't downvote me on that basis, please. THANKS!)",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sidhu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 27, 2017",
                "reviewTitle": "Must buy. Every home should have.",
                "reviewText": "Best network player at this price range. I have 5 of them. Stereo setup in 2 bedrooms. Have to buy 3 more. Then i will have stereo setup in all 4 rooms. Works like charm. Buy western digital my cloud and use it as media server. Then your setup can compete with anything. Excellent sound quality. I have denon av receiver and stereo amplifier too. After buying sonos they almost retired as it is so easy to control & play sonos from your mobile. One thing more buy subscription from gaana or saavn.com. voila.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rancher",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 21, 2015",
                "reviewTitle": "... and the Sonos family in my opinion are the best out there in this price range",
                "reviewText": "This product and the Sonos family in my opinion are the best out there in this price range. The Play 1 does a great job by itself, but put two together and they are notably better. And put them with their sub and it is pretty amazing. You can move them around the house and with the Sonos software you can pair them together for sound throughout the house or set them up in stereo in one room. And in either situation you can use their new Truplay app software to analyze the sound and reconfigure it to optimize their room placement.Their software and app are fantastic. Some have problems with interrupted play or cant find the system, but a good router makes this all seamless. Some complain about the updates not working but they do work and as all of this stuff today, sometimes you have to start and restart the mobile device, or router no different that your satellite receivers, pc's and smart TV's, etc.But every update that Sonos makes has improved my experience. Had these products through multiple generations of portable and mobile devices and have to say that every update that Sonos has done has made it better for the customer vs others who make it better for the company.For example it has never lost my music, it has never put multiple copies of my music different on every device, unauthorized play back of some songs on the same album, remove all of my music from my portable devices and put it up in a cloud requiring me to pay for gigabytes of data to download it all back, and do this with both your own music that you copied off CD's and others that you purchased, and on and on.The system works slick and the music is awesome. And had a faulty ConnectAmp out of warranty and they looked after me! You get what you pay for, at least in the case of Sonos.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 27, 2017",
                "reviewTitle": "Go for it........!",
                "reviewText": "Very good sound- bass & treble.Lots of free radio stations.Plays from stored songs from my device.Needs wifi at home.No battery back-up. 240 v connection is fine (needs an adaptor)Meets expectations of music lovers.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rpm007",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 12, 2016",
                "reviewTitle": "Addicted to Sonos!",
                "reviewText": "I bought this as an expansion to my existing setup with a Play:5, which I have in my kitchen. I placed this in my living room, and it blends in nicely with the decor that I have in that part of the house.Setup:It was setup very easily, like all Sonos. Plugged it in, and then drove the setup from my phone. This includes the room sensing and optimization which happened seamlessly. I paired it to my existing setup through the app easily. Now my music is synced perfectly between the rooms. I love that I can both adjust the volume control for the group, or individually, very easily.Sound quality:I was very impressed with my first P:5, and knew that this wouldn't have as much low end. However, even with high expectations after my fantastic P:5 experience I was still surprised at how good this sounded. It's a HEAVY speaker, which to me indicates high build quality. There's more low end than I expected. But don't think that this will produce the same as a 12\" subwoofer. It goes up loud without any distortion. Just sounds like a high quality speaker. Pair it with some bigger speakers in other rooms, and you won't miss the sub (which isn't as location-specific to our ears).Overall, I would definitely buy this again. I'm now addicted to sonos and want them all over my house!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chortick",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 21, 2015",
                "reviewTitle": "I am completely satisfied with this product",
                "reviewText": "I am completely satisfied with this product, with the supplier, and with the software and music ecosystem around it. Setup could not have been easier, and I did the most complex thing available, connecting two of these as a stereo pair to their mesh network device. Was a snap. Sonos helped me with a technical question that led to a return of another item (not these) and were great to deal with. I have already bought more of their products, and am planning my next purchase. Could not be happier with those aspects. Audio-wise, I am perhaps not qualified to step into the esoteric distinctions that others perceive in high end audio. As a baseline to an audiophile reading this, I have a bunch of music encoded in FLAC and Ogg Vorbis... I find the sound more than satisfactory for the large room I placed these in. Good stereo field, distinct highs and lows. Adding a subwoofer might be gilding the lily a bit, I think I will save that for the home theatre room. For the non-audiophile, easy to set up, easy to use and welcomes your music no matter where you got it or how it's stored. Software controls run best on iPad or other tablet, but phones and iPods work just fine (it's a screen real estate problem).",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}