{
    "remaining_requests": 46403,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Two-Way-Stereo-Sound-Speaker/dp/B000CHVLSQ",
    "body": {
        "name": "Pyle Two Way Stereo Sound Speaker - Dual Professional Audio Speakers System - In Wall / In Ceiling White Mount Flush, 6.5\" Midbass, 1/2 Inch Polymer Tweeter - Indoor Home Theater - Pyle PDIW65 (Pair)",
        "price": "$54.99",
        "originalPrice": "$65.99",
        "rawPrice": 54.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Two-Way-Stereo-Sound-Speaker/dp/B000CHVLSQ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00LRTM4BG"
        ],
        "asinVariationValues": [
            {
                "asin": "B000CHTHDC",
                "variationName": "Size",
                "variationValue": "5.25 in",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B000CHVLSQ",
                "variationName": "Size",
                "variationValue": "6.5 in",
                "price": "$54.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41AzofeiMcL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51-q9LXuzfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Nv-diQ-vL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41uYGL6YcYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JZfySjevL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1HEbiSQ92S.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1HEbiSQ92S.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Pyle Store",
            "link": "https://www.amazon.com/stores/PyleUSA/page/D79E9149-99F8-49A4-8E8C-D24560694FC2?ref_=ast_bln"
        },
        "brand": "PyleUSA",
        "merchantInfo": "Ships from and sold by Spreetail.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 309,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 1 min",
            "FREE delivery February 14 - 16. Order within 14 hrs 31 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "200 watt power: This White high powered Audio projection speaker system by PYLE home has a maximum power output of 200 watt peak power/ 100 Watt RMS so you can play your favorite tracks as loud as you want and with style",
            "6.5\" Midas, 1/2\" Tweeter: the dual speaker is equipped with 6.5\" Midas and high performance 1/2 inch polymer tweeter with 1'' High temperature voice coil for full range surround stereo sound reproduction and impressive bass response",
            "70 he - 20 kHz frequency response: This 2 way stereo sound speaker pair has a frequency response of 70Hz - 20kHz to achieve wide range sound performance and the convenient speaker terminal allows quick and hassle-free speaker wire Connection",
            "4-8 ohm impedance: This in wall/ in ceiling speakers features 4-8 ohm impedance rating and has an impressive power handling capability to withstand long hours of playtime. It ultimately reduces distortion so you can enjoy a crisp and clear sound",
            "Wall/ ceiling mount: includes cut-out template for easy installation and mounts flush on walls or ceilings to deliver stereo sound for home theater or office without cluttering floor space. Perfect for custom installations and applications"
        ],
        "description": "In-wall/ in-ceiling 6.5'' stereo speakers, 2-way, flush mount, whitefeatures:2-way stereo sound speakers6-1/2'' Mid bass speaker1'' High temperature voice coil1/2 inch polymer tweeter200 watts rated peak power4-8 Ohm impedance frequency response: 70Hz - 20khzmounts flush on walls or ceilings perfect for custom installations & applications includes cut-out template for easy installation cut-out dimensions: 7 3/4''W x 11 3/8''H x 2 7/8''doverall dimensions: 8 3/4''W x 12 1/2''H x 2 7/8''dthe PYLE PDIW65 speaker system delivers Stereo sound to any room in your home or office without cluttering floor space. This pair of 6.5'' speakers can be used for in-wall and in-ceiling applications as they mount flush for a clean look. Perfect for custom installations, The dew Series speakers feature impressive power handling capability, high-temperature voice coils and high-efficiency response rates – all to produce more Full and rich sound. Convenient speaker terminals allow for quick and hassle-free speaker wire connection. System includes cut-out template for easy installation. Achieve wide-ranged sound performance and add audio to any room with the dew speaker systems. Sold as pair.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Home Audio",
                "link": "https://www.amazon.com/Home-Audio-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=667846011"
            },
            {
                "name": "Speakers",
                "link": "https://www.amazon.com/Speakers-Audio-Video/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172563"
            },
            {
                "name": "Ceiling & In-Wall Speakers",
                "link": "https://www.amazon.com/Ceiling-In-Wall-Speakers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12097474011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "7.5 x 9.5 x 13 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.22 Pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Sound Around"
            },
            {
                "name": "ASIN",
                "value": "B000CHVLSQ"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "PDIW65"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 309 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#117,673 in Electronics (See Top 100 in Electronics) #183 in Ceiling & In-Wall Speakers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "December 7, 2005"
            },
            {
                "name": "Speakers Maximum Output Power",
                "value": "200 Watts"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Pyle"
            },
            {
                "name": "Model Name",
                "value": "Sound Around"
            },
            {
                "name": "Speaker Type",
                "value": "Outdoor"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired"
            },
            {
                "name": "Special Feature",
                "value": "Speakers"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "PDIW55 PDIW65 PDIW67 PDIW87 High Temperature Voice Coil 1'' 1'' 1'' 1\" Polymer Dome Tweeter 1/2'' 1/2\" 1'' 1\" Rated Peak Power 150 Watts 200 Watts 360 Watts 400 Watts Frequency Response 80Hz - 20kHz 70Hz - 20kHz 65Hz-22kHz 50Hz-20kHz Ohm Impedance 4 - 8 4-8 4-8 4-8 Cut-Out Dimensions (W x H x D) 6 5/8'' x 10 1/8'' x 2 3/4'' 7 3/4'' x 11 3/8'' x 2 7/8'' 8.24'' x 11.76'' x 3.68'' 8.84'' x 13.02'' x 4.01'' Overall Dimensions (W x H x D) 7 5/8'' x 11 1/4'' x 2 3/4'' 8 3/4'' x 12 1/2'' x 2 7/8'' 9.52'' x 13.02'' x 4.28\" 10.24'' x 14.4'' x 4.44''",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/c3ad7b99-b548-4b4a-8d29-41a3bf1c6c99._SR970,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2ba16e83-d4a7-4d25-88f2-a310cbccb28d._SR970,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2a880f11-1738-4772-b7a9-75530a433e25._SR970,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8509c4a4-21e9-4879-ae86-f74fd9fbaeda._SR970,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e17699f7-e9e8-46a0-946c-b3751241fa63._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bbcd0dad-dad1-40da-8abe-a4d482948da1._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c52b8922-b644-4e5f-a5fe-9e111262c6c5._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c94321a7-e535-42a9-9340-3f35bae27e61._SR150,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "OhhWell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AES2R7NAGG3QMNR4HH2XUIPU7JSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X422UY515HY0?ASIN=B000CHVLSQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 22, 2013",
                "reviewTitle": "5.0 out of 5 stars Probably the best you are going to find for the price",
                "reviewText": "Update 8-17-2022 - Yeah, they are still working.-----------------------------------------------------------------First off, the price is for a pair of speakers. That makes it less than $20 a piece. That is insanely cheap for two way speakers. The build quality is actually pretty good! The only slight issue I had is that the mounting frame mount points flexed a little when I tightened them down. Still, they are solidly attached to the ceiling. The pair I received did have spring loaded quick connect terminals for the speaker wire so there was no soldering or having to wrap wire around terminals. They look great when installed.Probably the most important question with speakers is how do they sound? Well, these do not sound amazing but they did sound better than I expected once I had them installed. From what I remember, there is not crossover on the \"woofer\" and just a resister to cross over the tweeter. The low end was rather punchy and a little deeper than I expected. The high end is not all that great but serviceable. The tweeter is a little subdued and isn't exactly what I would call crisp BUT still way better than expected. Remember, in this price range, typically you don't even get a tweeter but just a dual-voice \"full range\" driver. Their sensitivity is rated at 87db but they seem a little worse like maybe 85db but that could either vary depending on installation or just my tainted review based on my mains being very sensitive.I installed these as rear speakers in my surround system and they work marvelously in that capacity. They would also be sufficient for casual listening or mood music at a party etc. I had to give 5 stars not because they are 5 star speakers but because they are 5 star speakers in this price range.Update : Yeah, they are still working fine. Yeah, they are not amazing but for surround speakers? I still have no complaints even matched to floorstanding Klipsch towers. I keep thinking I should put something much better up there but... why?",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tina Richardson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYWO34A3ZXCY5ZTHSY6IBE3VGCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IW615GZ1CBR?ASIN=B000CHVLSQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 12, 2016",
                "reviewTitle": "5.0 out of 5 stars Great Value",
                "reviewText": "They're great for the price, bought 3 pair's for a 7.1 system and sound pretty good. Used them for the Left and Right channel and the two sets of Surround Sound (back left, back right, upper left and upper right)Not turned them much past halfway on my Sony STR-DN850 and no distortion whatsoever, not sure how they'll perform if I cranked them all the way up, but to be honest I'd need to be in next doors yard for that anyway.Fitting was pretty straight forward, the template worked perfect (little tip, put a small piece of double sided tape on the back of the template before you start cutting, that way you can step back and make sure they're positioned right first, also use a stud finder or drill small hole and use a bent coat hanger to ensure you've got sufficient clearance before you cut)Make use of the little wire tool to remove the grill and note that the speakers (the black part) only fits one way, so easy to put the outer frame in upside down and end up with the tweeter on the bottom.I've seen some people comment on the 'clips' that clamp onto the dry wall. I found the easiest way was to turn these clips to the correct position and push them up to the inside of the dry wall before you start turning the screws, this will stop them from breaking or griping at the wrong angle.I used 14 gauge wires and they fit easily into the connectors on the speakers.Delivery was quick and they arrived undamaged.Recommended.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHKPPC7LWYZPLVNHIYNAE4T5ITQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PBEMBX1VS4X4?ASIN=B000CHVLSQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Installed these outside!",
                "reviewText": "Mounted a projector screen on the side of my garage in the backyard, installed these speakers in the outside wall next to the screen to use them with the movie or for music out back.Sprayed them with a coating of some waterproofing aerosol spray, but even without it, I think they’d have been just fine.Been out in MANY severe rainstorms and they’re still kicking great! Sounds awesome too.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roy Cox",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKCL2ELWMEZ2IFZM46LDBZCQAEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VT2UOAMVYQ9F?ASIN=B000CHVLSQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2014",
                "reviewTitle": "4.0 out of 5 stars better than expected!",
                "reviewText": "I recenlty built a new photo studio and wanted to do all of my own work when it came to the sound system. I chose these when searching around on amazon and was a little skeptical of the price. I do not own the office Im renovating so I didn't want to put anything super high end in the walls, only to potentially leave them there if I go so I ended up purchasing 6 of these and 2 of the round ceiling ones. I mounted these across from one another in the large main area and in my hair and makeup rooms and I have to say Im quite impressed. The installation was fairly easy, especially considering it comes with a template that you can place on the wall and trace around and then just cut your hole. Buy a cheap drywall jab saw, sold at any hardware store and you are good to go. I ended up painting mine to match the wall so they were blended into the room and they work great. I have all high end klipsch in my own and I paid a small fortune for those so honestly I wasn't expecting much other than a semi decent, slightly distorted signal but I was overly impressed with the clear, detailed sound I heard from these. They do not push out a ton of bass as you would probably expect, however my receiver has a bass boost button on it which really seemed to help a lot. I do not find a need to use a sub to enhance these and I have received many compliments on both the look, installation and the sound from my clients. At less than 40.00 a pair, you would be a fool not to use these. If you want good sound but do not want to go high end, this is your answer in my opinion. Be careful when tightening the little brackets that grab the wall during installation. They can be brittle and break. However, even if you do break one or two of them, there are 6 total holding the speaker firmly in the wall so it will still install properly and firmly. Great buy overall. I added a monster speaker selector to this whole thing and it looks and sounds like a 2500.00 setup already. Give them a try!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Troy Schaefer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 12, 2023",
                "reviewTitle": "They do not come with enclosed so you will have to build or buy some",
                "reviewText": "For the price I'm very happy with the way they sound. Currently using as in ceiling speakers. They sound good without enclosure but with enclosure and sound proofing they sound great for the price. And you get 2 speakers not just 1..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ruben lopez ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 6, 2020",
                "reviewTitle": "Sonido envolvente y fácil instalación",
                "reviewText": "Excelente sonido",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "john dennisjohn dennis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 16, 2021",
                "reviewTitle": "Great in wall solution",
                "reviewText": "The media could not be loaded. I’m very pleased with these speakers. They were purchased as the soundbar was just not doing it. They don’t disappoint with their sound.The only issue I had was they wasn’t detatchable as was shown however they were no problem to fixOverall I’m very happy with my purchase.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/C1FulImy0uS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/C1UVU8ZNLVS.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/A1lQ8npefXS.mp4"
                }
            },
            {
                "reviewerName": "David Santos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 3, 2017",
                "reviewTitle": "Buena calidad",
                "reviewText": "Buen sonido buena estética buena calidad son recomendables en todos los aspectos con una instalación sencilla y un tamaño apropiado",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "alessandro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on April 3, 2018",
                "reviewTitle": "buon prodotto",
                "reviewText": "prese in sostituzione dei cubi bose. Salto di qualità eccellente. rapporto qualità prezzo buono. Ne sono soddisfatto visto il prezzo pagato.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$54.99",
                "sellerName": "Spreetail",
                "sellerRating": "4.5"
            },
            {
                "price": "$58.99",
                "sellerName": "GEP Sales",
                "sellerRating": "5"
            },
            {
                "price": "$64.02",
                "sellerName": "High Volume Sales (Serial numbers recorded)",
                "sellerRating": "4.5"
            }
        ]
    }
}