{
    "remaining_requests": 46383,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Logitech-LIGHTSYNC-Gaming-Speakers-Lighting/dp/B07B2WLS17",
    "body": {
        "name": "Logitech G560 PC Gaming Speaker System with 7.1 DTS:X Ultra Surround Sound, Game based LIGHTSYNC RGB, Two Speakers and Subwoofer, Bluetooth, USB, Immersive Gaming Experience - Black",
        "price": "$179.36",
        "originalPrice": "$199.99",
        "rawPrice": 179.36,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Logitech-LIGHTSYNC-Gaming-Speakers-Lighting/dp/B07B2WLS17",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CM6X6G91"
        ],
        "asinVariationValues": [
            {
                "asin": "B07B2WLS17",
                "variationName": "Pattern",
                "variationValue": "Speakers",
                "price": "$179.36",
                "variationImageURL": ""
            },
            {
                "asin": "B0CKCP1SWC",
                "variationName": "Pattern",
                "variationValue": "Speakers + Gaming Light",
                "price": "$325.49",
                "variationImageURL": ""
            },
            {
                "asin": "B0CKCSTNGJ",
                "variationName": "Pattern",
                "variationValue": "Speakers + Gaming Mic",
                "price": "$317.31",
                "variationImageURL": ""
            },
            {
                "asin": "B0CKCJQV44",
                "variationName": "Pattern",
                "variationValue": "Speakers + Keyboard",
                "price": "$366.70",
                "variationImageURL": ""
            },
            {
                "asin": "B0CKCQZDLJ",
                "variationName": "Pattern",
                "variationValue": "Speakers + Mouse",
                "price": "$319.31",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/312Ql0MVNKL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51NL5Vo0CML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iqRCE094L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41dQgHOF5QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/3135OQIqOXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/317dJCqBiHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QrgcnZwgL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/62543d88-1880-5bd1-97d5-8793e9d8cbf9/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3618fa89-11f2-4377-990c-c04066465f25/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/251c6e50-e195-404b-8141-28fa25f547ec/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/D1fCi8OoxRS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/D1fCi8OoxRS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Logitech Store",
            "link": "https://www.amazon.com/stores/Logitech/page/01EFDE77-7D1A-41D7-9EEA-7C2FA22AB12F?ref_=ast_bln"
        },
        "brand": "Logitech",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 3907,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Wednesday, February 14. Order within 22 hrs 57 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Carbon Neutral Certified by SCS Global Services means the product’s carbon emissions have been measured and reduced, with any remaining emissions offset."
        },
        "features": [
            "Built-in LIGHTSYNC RGB lighting blasts game driven lighting colors and effects activated by the audio in many popular games.Waterproof : No",
            "Explosive 240 Watts Peak power and unique driver design deliver a huge soundscape for a heightened gaming experience",
            "Integrated DTS:X Ultra surround sound renders 3D positional audio so you hear your gaming environment from every angle",
            "Easily customize four speaker lighting zones with Logitech Family Software for both front and rear light projection in your choice of 16.8 million colors",
            "Works with Windows based PCs and Bluetooth enabled devices including computers, smartphones and tablets (DTS:X not supported on Mac OS X)",
            "Sound Pressure Level (SPL Max) - 97decibel @426B"
        ],
        "description": "Experience new levels of intensity with logitech G G560 LIGHTSYNC PC Gaming Speakers with lights. This 2.1 speaker system reacts to in-game action and music. Customize effects across nearly 16.8 million colors with four lighting zones: front-facing and rear ambient projection. 240 Watts Peak (120 Watts RMS) power feeds an explosive, down-firing subwoofer and two satellite RGB speakers with wide-angle drivers for clear, pure sound. DTS:X Ultra engine renders 3D surround sound from PC games and music, delivering positional game audio for heightened realism. G560 connects to and mixes multiple sources: USB, 3.5mm, and Bluetooth (4.1). Seamlessly switch between up to 4 devices with Logitech Easy-Switch.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Audio & Video Accessories",
                "link": "https://www.amazon.com/Computer-Audio-Video-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548951011"
            },
            {
                "name": "Computer Speakers",
                "link": "https://www.amazon.com/PC-Speakers-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=172471"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "10 x 8.1 x 15.9 inches"
            },
            {
                "name": "Item Weight",
                "value": "12.1 Pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Logitech"
            },
            {
                "name": "ASIN",
                "value": "B07B2WLS17"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "980-001300"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 3,907 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,146 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #38 in Computer Speakers #334 in Climate Pledge Friendly: Computers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "March 15, 2018"
            },
            {
                "name": "Speakers Maximum Output Power",
                "value": "240 Watts"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Logitech"
            },
            {
                "name": "Model Name",
                "value": "G560"
            },
            {
                "name": "Speaker Type",
                "value": "Subwoofer"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, Auxiliary, USB"
            },
            {
                "name": "Special Feature",
                "value": "USB Port"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBSINQ5J4IUH3VJOC6U3PCT44MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32JG2X4369L9K?ASIN=B07B2WLS17",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 19, 2020",
                "reviewTitle": "5.0 out of 5 stars Amazing product all-around.",
                "reviewText": "TL;DR- Speakers sound amazing regardless it being games, movies or music. Lighting rarely doesn't change to colors set to certain games and stay in the default settings (whatever you have them set to.) Again very rarely. Lighting is done amazingly. Audio visualizer is my personal favorite, screen sampler is just okay. Depending on the game, screen sampler can really shine, or really be a little too chaotic.Man these speakers are the truth. I've used these for about 3 months now. I held off a review until I really got to try them out. Games sound amazing on this. I recently finished the Doom 2016 with these and it was such an experience. I have it set to where every time I'd shoot the speakers would flash red on this game and it really just added more to an already awesome game with really good sound designs. From music, to movies, to games, these speakers handle everything with ease. Watching the movie Interstellar on these was something else. The sound quality was out of this world.Sometimes the they can get a little finicky. You can have different effects/colors for different games if you so chose to, but sometimes it won't switch over to that and stay whatever the default lighting you have is. Randomly happens, but not often at all. Bluetooth was quick and easy to set up for my phone if I felt like just listening to music. The lighting is so clean and well done. They have multiple options. Static color, Cycle, Breathing, Screen sampler, and audio visualizer.My personal favorite is audio visualizer. More specifically for games. I can set them to whatever colors I'd like them to be. Like Doom for example. I have it with orange and red. When it's a lighter sound, it'll be orange, but let's say an explosion happens, a much louder sound, it'll flash red instead. I pretty much use this lighting for most my games but switch them up depending on the game. Screen sampler is interesting. I think it's just okay. Screen sampler does the best job it could at mimicking what the colors on your screen are doing and attempting to visualize it with the lighting. Some games work better than others.With Screen Sampler, it really depends. For example, I was playing Call of Duty's Warzone. The scene that happens right before everybody jumps, the plane starts flashing red to signal the characters to get ready to jump. The speakers flashed red with the plane which added some immersion. If you're in an environment that's predominately one very strong color, it does a decent job and mimicking the colors. Like walking through a forest area in Red Dead Redemption 2. But if there are multiple things going on is where it shines the least. Besides that, these speakers sound amazing, and really just throws you in to the world of whatever game you're playing. I highly recommend these. These have been a HUGE step-up compared to the speakers I had before.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nathan bremer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMQHJVERVAATD3DD2JQJYQ7QJCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GLS6CY4V5MMA?ASIN=B07B2WLS17",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Very loud",
                "reviewText": "Wow, the bass is amazing and the spearks look very modern.Holy cow, these speakers are amazing they get super lound and the bass, even though it is under my desk and out of the way still sounds amazing! I was a little sceptical when I was hooking it up because it uses old VGA style cables to attach bolth speakers to the...",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vicky Westerman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAXQPDDCXRCA3WYTGT4GB6TT34Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29XL3HBF4Y6QE?ASIN=B07B2WLS17",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars So far, so good...",
                "reviewText": "This is pretty cool. Great sound, no issues setting up and connecting. Unlike other reviews... no issues with software. I don't even know what they are talking about. Connected, set up and ...perfect.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jared",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJNRFUP373V5NZ23UPCHUPKS72A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VE9P55FMZ16R?ASIN=B07B2WLS17",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Pretty awesome speaker for a gaming PC setup 🔊🔊🔊",
                "reviewText": "I was looking into upgrading my gaming setup for my PC. I was looking into some new speakers, and the look of these Logitech speakers caught my eye. I have to say that I am not disappointed with how it came out. I like the backlighting for the two main speakers on the desk, and it shines well up on a wall to do some light-spilling effect. The cables for the two speakers on the desk are a little different than what I was expecting (they looked like monitor cables from the early 2000's). The bass unit delivers some nice, hefty bass, especially in intense scenes. The Bluetooth on the speakers is a little touchy, but I don't use them for Bluetooth speakers. Would recommend, if you don't mind spending a little more for just the look of the light effect on the speaker. It does pair well with the Logitech G app, so you can do some neat effects based on audio or what is displayed on your screen. So far, pretty happy with them and would recommend them.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ryan Manning",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG73XDWG7C5SA3BD4C5AOWDFRMNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2K68MBGOSIZX1?ASIN=B07B2WLS17",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2019",
                "reviewTitle": "4.0 out of 5 stars From an Audiophile Perspective",
                "reviewText": "I'll preface, I've spent a good amount of time (and money) on audio equipment over the years; ultimately trying to find the balance between value and quality. That being said...here's my review of the Logitech G560 Speakers.Quality:The quality is actually quite good; on par with what I expect from higher-end Logitech Speakers. Are they studio quality like you would find in $300-500 studio speakers? Not particularly, but they work very well for everyday use and even for content creation where you need a full range of frequencies (Low-end to High-end). Playing through a series of HQ audio (Classical, Jazz, Acoustic, Rock, Electronic, Vocal, etc) produced very pleasant results. (Note: all of my tests were done using the \"Flat\" EQ setting in the Logitech G Hub control panel. Any other setting was either muddy or otherwise unpleasant). Overall the speakers sound very nice!Responsiveness:Audio was clear, crisp and bass was tight and not overly powerful. (Note: like stated above...I'm using the \"Flat\" EQ setting). I did notice some gaps in frequency responsiveness, particularly in the Mid-Low region. While not overly \"hollow\", the DB for some of the lower-end frequencies need a boost to sound more uniform. The higher frequencies are crisp and not overly \"bright\", producing a very well rounded sound.The RGB:Is it worth the extra $$$ for RGB....honestly, no. The pictures of the RGB make the light appear much brighter than it actually is. Even at 100% brightness, they barely illuminate their surroundings and thus making it (IMO) fairly useless. For all intense purposes the lights are just dim accent lights and not capable of bright illumination like you can find with LED Bulbs or Strip lights.Volume Control:This is where the G560 takes the biggest hit on quality. Like previous reviews, the volume is very touchy. To the point where a volume of 28% (windows volume level) is extremely quite and 52% is very loud. Around 37-40% the volume curves louder faster, thus leaving you with an effective volume control range from 32-42%. Everything outside of these values is either too quiet or too loud. The easy fix is for Logitech to adjust the sensitivity of the volume attenuation of the amplifier, thus giving you a broader range of volume control.Summary:These are good speakers with lackluster RGB and highly sensitive volume control. If you can get these on sale for around $100-120, they're a good purchase but IMO aren't worth paying full price for.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM2UJPG7F7XBHTMJUII2WHAAGNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HCXV0X2GUVR3?ASIN=B07B2WLS17",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Love the light and sound",
                "reviewText": "These work well. At first they seemed to cut out occasionally, but for some reason, that don't happen anymore. They sound good. Easy to hook up. I don't game. Just wanted new speakers. My old harmon/kardon were still working fine, I just felt like I needed an upgrade since they were about 25 years old.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ricardo Velázquez R.Ricardo Velázquez R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 4, 2023",
                "reviewTitle": "¡LO MEJOR DE LO MEJOR!",
                "reviewText": "Graves muy potentes por su tremendo subwoofer.para jugabilidad el sonido es muy nítido y preciso. tanto para juegos donde el soundtrack es una maravilla como para juegos que requieren escuchar pisadas y estar atento.Las tengo conectadas por auxiliar 3.5mm (no incluido) al monitor de mi xbox (no se le saca tanto provecho como en PC pero están excelente anyway)tambien lo tengo siempre conectado via bluetooth con mi alexa de la habitacion y la música se escucha 20/10sin duda una excelente compra. cuando migre a una PC sin duda mi reseña cambiará.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ED+YgqLFL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "CraigCraig",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 13, 2021",
                "reviewTitle": "amazing speakers, super pretty and sound amazing",
                "reviewText": "I bought this while looking for speakers with good quality without buying a whole amp assembly and bookshelf speakers. This is the perfect speaker for me. Not only is it the right size to fit just behind my monitors as I intended, these little speakers are powerful and sound amazing. The dedicated downward-firing bass is super powerful and I had to tune it down because I have downstairs neighbours. at setup, the right speaker wasn't showing any RGB, but I fiddled around with the connector and it works flawlessly. The Bluetooth integration is another bonus. It is so convenient to hook up my phone to the Bluetooth because there is no transition between devices that are connected to the speaker. I can watch a meme on my phone and it comes through the speakers with the sound on the computer. This is most convenient when it is late and I plug my headphones into the speakers' AUX port. I don't need to take off my headphones to hear what's on my phone. It comes right through the headphones.Overall, I had a good experience and I am continuing to have a good experience with these speakers and I would highly recommend these to someone looking for computer speakers at this price point.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81FXLo+b22L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81j28v+rXYL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "umesh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on March 19, 2019",
                "reviewTitle": "Good one",
                "reviewText": "Great lighting and sound quality",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CEO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 14, 2020",
                "reviewTitle": "Great Sound & Cool RGB Effects",
                "reviewText": "Absolutely love these speakers, and such a steal at their current price point.Some people aren't into RGB, but these are very customizable and you can dim them or have them completely turned off. However, while in voice chat, it's funny to have different colours flashing in sync with whoever you're talking to, aha.Only word of caution is that this has a down firing sub. So for those of you like myself that are in a top floor apartment, you will be restricted to playing this loud to only during the day.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Connor Carlson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 21, 2023",
                "reviewTitle": "Great sound",
                "reviewText": "I have these speakers linked to my race steering wheel through the ghub and the lights on them are synced to the games I play. Really good sound, great all around.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$178.78",
                "sellerName": "Busy Bee Sales",
                "sellerRating": "4.5"
            }
        ]
    }
}