{
    "remaining_requests": 46518,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/PERLESMITH-Adjustable-Stands-Extends-Satellite-8lbs-Heavy/dp/B07925B8PD",
    "body": {
        "name": "PERLESMITH Speaker Stands Height Adjustable 19.29-44.29 Inch with Cable Management, Hold Satellite Speakers and Small Bookshelf Speakers up to 9lbs -1 Pair",
        "price": "$49.99",
        "originalPrice": "$59.99",
        "rawPrice": 49.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/PERLESMITH-Adjustable-Stands-Extends-Satellite-8lbs-Heavy/dp/B07925B8PD",
        "soldBy": {
            "sellerID": "A354B2RYDHS9BX",
            "name": "Bestqi US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A354B2RYDHS9BX&asin=B07925B8PD&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "20",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31jCSgoQ42L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41sab88jDWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kOezoXMTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51IbF8OIwQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nss416eLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413X6 edyML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wPtYaRaqL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the PERLESMITH Store",
            "link": "https://www.amazon.com/stores/PERLESMITH/page/D2B5E6EB-DD2C-459B-A60D-71C7DE8AF3C8?ref_=ast_bln"
        },
        "brand": "PERLESMITH",
        "merchantInfo": "Bestqi US",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 8123,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Tuesday, February 13. Order within 13 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【ADJUSTABLE & CUSTOMIZABLE】PERLESMITH speaker stand of the extendable tube is adjustable from 19.29\" to 44.29\" to ensure perfect and customized sound. Bookshelf speaker stands can adjust the post assembly for puts sounds at ear level.",
            "【STABILITY & SECURITY】Speakers stands have heavy-duty cast iron construction with a triangle base that provides more stability. Please attach rubber pads to the base feet for wooden, cement, or tiled floors. Speaker stands support speakers up to 9 lbs per stand.",
            "【STRONG COMPATIBILITY & EASY TO USE】 Speaker stands pair includes all the required hardware so you can easy to install it. Bookshelf speaker stand compatible with Bose, Harmon Kardon, Roku, Polk, JBL, KEF, Klipsch, Sony, Samsung, Vizio, and other speakers. Stands can be free to move to your living room, bedroom, and study room.",
            "【UPGRADED CABLE MANAGEMENT】Hidden wire paths create a neat and organized look. Speaker stands pair bookshelf upgraded the tube to wider diameter and divided the tubes into three parts(1.18\" H x 0.55\" W), so the cable can through the pipe easier. NOTE: The cable hole does not fit for model Samsung HW-Q90R.",
            "【THREE MOUNTING CONFIGURATIONS】Includes L-shaped, keyhole, and top plate options. L-shaped for vertical hole/key hole, adapter bar for horizontal holes, and top plate for 2 holes on the bottom of the speaker. Our experts will reply within 24 hours if you have questions or problems."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Home Audio",
                "link": "https://www.amazon.com/Home-Audio-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=667846011"
            },
            {
                "name": "Home Audio Accessories",
                "link": "https://www.amazon.com/Home-Audio-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3236443011"
            },
            {
                "name": "Speaker Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=24046930011"
            },
            {
                "name": "Stands",
                "link": "https://www.amazon.com/Speaker-Stands/b/ref=dp_bc_aui_C_5?ie=UTF8&node=509308"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "‎10.76 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "15.59\"L x 15.59\"W x 44.29\"H"
            },
            {
                "name": "Item model number",
                "value": "‎PSSS1"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Weight",
                "value": "‎12.3 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B07925B8PD"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 8,123 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,781 in Electronics (See Top 100 in Electronics) #5 in Speaker Stands"
            },
            {
                "name": "Date First Available",
                "value": "January 17, 2018"
            },
            {
                "name": "Brand",
                "value": "PERLESMITH"
            },
            {
                "name": "Material",
                "value": "Wrought and Cast Iron"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Load Capacity",
                "value": "9 pound"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Best Choice You Can Make Amazon's choice Add to Cart Universal Add to Cart Premium Add to Cart TV Stand PSTVS17 Add to Cart TV Stand PSTVS03 Add to Cart TV Stand PSTVS21 Add to Cart TV Stand PSTVS11 Add to Cart Customer Reviews 4.6 out of 5 stars 8,123 4.3 out of 5 stars 5,089 4.6 out of 5 stars 3,104 4.7 out of 5 stars 4,100 4.7 out of 5 stars 1,733 4.8 out of 5 stars 2,712 4.7 out of 5 stars 5,722 Price $49.99$49.99 $49.99$49.99 $79.99$79.99 $39.99$39.99 $56.30$56.30 $69.99$69.99 $67.99$67.99 Weight Capacity 9 lbs 11 lbs 22 lbs 88lbs 88lbs 99lbs 99lbs Compatibility Most speaker brands Most speaker brands Most speaker brands 32''-60'' TVs 32''-70'' TVs 37''-70'' TVs 37''-70'' TVs Height 19.29-44.29 Inch 30.7-42.5 Inch 28 Inch 12.6''-16.6'' 19''-25.5'' 14.76''-21.46'' 14.8''-21.5'' Height Adjustable ✔ ✔ ✘ ✔ ✔ ✔ ✔ Cable Management ✔ ✔ ✔ ✔ ✔ ✔ ✔",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1646ecfe-28e2-4173-b743-aacab6d19bbd.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f4ca2a61-ef65-44bf-8fb5-8fb959602c63.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/50c7c1c8-5705-40db-8fc3-2fe46558b817.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/77fda589-e278-4337-a081-4fafb0c5a59d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cb38236c-24c8-4109-b50a-9eeb40e5cfcb.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e2d8420b-db58-450e-aafb-5272aab96028.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/def50181-27c0-4c37-96e6-2f5289420fab.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e68924fa-9e34-437f-9ca5-43cf34953f9b.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d2c5b237-cd4b-43b4-8bca-fc2e8c3d5aba.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b69c5344-2adb-4146-a056-89a9e40d2784.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6bbf5d04-965f-436a-84db-a35447f7ca62.__CR0,0,200,225_PT0_SX200_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "ADY G.ADY G.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLAQRCOSCJYT4MTZEDFCRWD4MBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GN69GT54BDA2?ASIN=B07925B8PD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Attractive, sturdy, cost effective, highly recommended",
                "reviewText": "Besides the in time delivery, easy to follow assembly instructions. In less than an hour my surround speakers were in place. As a \"hack\" have ready a hanger wire and same tape to make it easier to pull the cables through the tubular stands. The plugs for the speakers and power cord are tucked so nicely into the cut in the tube, they do not obstruct the cords and they are easy on the eye. What is visible is the speakers and the stands. That's it! I love these speaker stands. They are attractive, small and better than expected. Yes, I highly recommend them.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61O+dnVpzEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61YfZkHwMrL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Caveat Emptor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZPQOERAGGVHIU7K4H23FFCI5AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXXRXQTQ1U900?ASIN=B07925B8PD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 21, 2020",
                "reviewTitle": "5.0 out of 5 stars Great Buy for SMALL Speakers",
                "reviewText": "Well, I can’t imagine many stands are easier to assemble than these. I can’t vouch for them on larger speakers, but for really small speakers these fit the bill perfectly, at least for my personal needs.1. Inexpensive but decent build quality2. Tallest I could find, given my speaker size and price range3. Floor base size and overall stand design allows close placement to walls4. Stand poles are robust and fit together well with no wobble (as opposed to being thin and shaky, as were the many other small pole-based stands I previously tried and returned)5. Base is sturdy enough, weighted about right to eliminate excessive wobble with SMALL speakers without weighing a ton.6. Easy assembly with multiple mounting options.7. At least in my case, they arrived with no missing parts, no misaligned holes, no stripped threads.First, let me stress that I used these with SMALL speakers. I paired them with the old Energy Take Classic 5.1 speakers that are ~4” width and depth, ~7” tall. I would NOT use these stands for speakers much larger/heavier than those. I used the horizontal, bottom-of-speaker mounting plate to affix each speaker directly centered over stand poles (as opposed to the L-shaped key hole option for rear speaker mount, also included). Rear mounting the speakers will probably shift their center of gravity off pole-center for all but the tiniest of speakers. I wouldn’t recommend that method, but I didn’t try it, it might work just fine for you. The keyholes in my speakers were too small for the included keyhole screw, anyway. The included under-speaker-bottom mounting plates are small enough to be fully covered by most any speaker without any speaker overhang. The installation pack comes with double sticky sided sponge/felt pads, cut to exactly fit the contour of the base mount plates and has precut screw holes matching those in the mounting plate. You’ll need to supply your own screws if drilling your own holes into your speakers. I wouldn’t use the sticky felt as your only means of final mounting. I think they’re included just to help you keep speakers stuck in place while drilling holes into speaker bottoms and to prevent sonic vibration after final speaker mounting with screws. I wouldn’t trust the sticky felt pads as the only means of attaching my speakers, but you might get away with it if your speakers are tiny and you never bump your speaker stands with any great force.A tri-foot base will never be as stable a four footed base, or a single flat base, but this one is plenty stable for small speakers centered over the speaker pole. The tri-foot base is part of the design-plus that allows close placement to walls, so for me it is an acceptable, minor trade off in form and function. All in all, the base is stable enough.I can’t vouch for the other mounting options I didn’t use. I absolutely would NOT use these stands for heavy speakers, but if you have small speakers of a size and weight to the ones I mentioned above, and you use the bottom-of-speaker mounting plate, these are about the best option you’ll find on amazon at this price point (probably much higher). If you have kids or larger pets that will bump them often, you might want to rethink speaker stands of any kind because there are no stands that can’t be knocked over unless they’re bolted to the floor.Here are a couple mounting tips, should you decide to purchase these speakers:Mounting Tip 1 (for base plate/sticky felt option):Put small strips of masking tape (or similar) on the bottom edge of each speaker side and face before final mounting. Temporarily place speaker in position, on mounting plate (without sticking the sponge/felt pad down yet, or peeling off sticky side protector sheets). Center each side of speaker to pole, by eye. Use a sharpie/marker to mark the tape at pole-center of each speaker side/face. Remove speaker, apply sticky pads to mounting plate. Sit in a chair (or on a stool) in front of the stand with mounting plate at eye level, close enough that you can lean comfortably to see tick marks on tape of each speaker side. Grasp the speaker pole with fingers of one hand as close to mounting plate as possible, one thumb sticking up. Use that hand to steady the pole. While lowering speaker on to sticky pad, use your thumb (now sticking up) as a lever to partially rest the speaker on and to aid in physically guiding the speaker down as you align the center marks you made on the tape to the stand poles. At the same time, use the other hand to hold most of the speaker weight, and slowly lower the speaker onto the sticky pad using the tick marks you made on the tape on each speaker face to line up speaker center to pole. If you drill into your speakers to use screws as well, you’ll still want to press down a little on top of your speaker to keep from pushing the speakers off the sticky pads while drilling from underneath.Mounting Tip 2 (to base plate, no drilling):If you don’t want to drill into your speakers to use the base plate mount, and you don’t trust the included sticky pads to be sticky enough, you can use an alternative attachment method. But honestly, who cares about tiny holes in the bottom of your speakers? It’s the bottom, for Pete’s sake! No one will see them, they won’t hurt or effect speaker performance, and your speakers will never fall off the stand, even if you knock the stand over (unless they physically break off and tear out the screw holes). However, if you’re squeamish about drilling into your speakers, you can purchase Dual Lock strips instead of using screws or trusting the sticky pads. And no, I don’t work for the Dual Lock company, but that stuff is da bomb. (Aside: If you’re a guitarist with a pedal board and you aren’t constantly rearranging your rig, you really want to try Dual Lock). In my book, Dual Lock is a superior alternative to Velcro, if your goal is a kinda-permanent fixture that is rock steady and stuck together like it’s welded... until you don’t want it to be any more. When you want to unstick it, it comes off, but only after no small amount of tugging. I’ve found the adhesive bottom side stays stuck, but peels off when you need it to without damaging surfaces. Instead of “hook and loop” that require male and female strips, its a one part system made of strips with sticky adhesive on the underside (like Velcro) but uses a single type of latching system. The mounting strip (one type used on both things to be stuck together) is covered in tiny interlocking plastic “mushrooms”. Dual Lock, in my experience, has far greater “grab” than Velcro, is a one part fixture instead of 2 parts, and doesn’t wobble around, back and forth like Velcro does. The adhesive side sticks firmly to most surfaces, and stays put even when yanking the “mushroom” sides apart from each other, but doesn’t damage or leave residue when removed. The downside: Once you press two pieces of Dual Lock together, they ain’t comin’ apart without a fight, but that’s what you want anyway. Bigger downside: The stuff ain’t cheap, but it costs less than replacing speakers that wound up in a damaged heap on your floor.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kirk S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFELDMZ2GO6YJ4XZYI7XZBUB2OYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y2CRD37MWKST?ASIN=B07925B8PD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2023",
                "reviewTitle": "4.0 out of 5 stars Nice, solid speaker stands; look good, functional",
                "reviewText": "Quick, easy to assemble. Solid, came with fittings to allow about any satellite speaker (Rear / Surrounds) to be mounted.Four stars only due to the openings at the top... I was unable to feed the power cord through it (wireless speakers but still need AC power) as the hole wasn't large enough. (unless I cut the cord, feed it through, then re-attach ends).Still recommend these stands, as they look good and are stable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WireDWireD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPJQ3PT3LMTOJF3K4AYZGEOKONQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DOAY80XOCM0U?ASIN=B07925B8PD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2019",
                "reviewTitle": "5.0 out of 5 stars Outstanding speaker stands! Far better than expected.",
                "reviewText": "I purchased 4 of these speaker stands to hold the 4 (left and right front and rear) for Logitech Z906 Surround Sound system. Here's my personal review of several categories:Packaging, condition, shipping: 5/5The speaker stands were shipped 2 to a package in durable cardboard containers that are re-usable and re-closable using a front flap with insertion tabs. All materials were separated and packaged well in their own individual compartments. All screws/hardware were separated into pouches with letter codes to identify them (similar to assembled furniture). Everything was shipped correctly and packaged securely.Construction/Materials: 5/5I was extremely pleased and surprised. I was expecting thin and flimsy plastics and metals as with other products, but was very happy to find that the poles and base are thick heavy durable metals The stand sections are threaded on the ends and screw into the heavy/sturdy base. The base itself reminds me of a heavy cast-iron kitchen pan. Either rubber caps or threaded nails (both included) can be attached to the bottom depending on your needs. These bases are stable and will not tip over easily. They stand upright and level and are well-made. The extension pole on the top (used to change the height) is durable and comes apart easily when needed. Although screw-tension rods like this are not perfect, they work quite well overall. The finish is black, uniform and slightly rough and is only slightly reflective.Assembly and instructions: 5/5The instructions are simple and adequate. They show various configurations for assembly and speaker-mounting. The rod is in 2 main pieces (the longer rod contains the telescoping extension rod which can be separated if necessary). height adjustment is easy. Both rods are threaded and screw into each other and then to the base. The threads are machined well and are made of metal unlike many stands (like those used for many rotating floor fans). The wire-hiding channel works extremely well. The wire goes through a slit near the top and comes out the bottom of the rod. You can't even tell (unless you're looking hard) that there's a wire at all.Speaker Mounting: 4/5This is the area that could use some improvement. The hardware that comes with the stands works as advertised, is durable, and allows for various configurations, however the hardware for at least one common speaker configuration is missing (and my speakers happen to be these). Many small satellite speakers like the ones that come with the Logitech system have a single hole in the back with threads that are meant for a machine screw. Nothing that I saw in this kit will accommodate this. HOWEVER, I was able to use the threaded-nails that are meant for the base for these speakers by attacking one end (the one with the nail) into the speaker (the threads actually fit) and then using the threaded cap for the other end (see attached photo for example). This configuration seems to be working well. I suggest that the company include hardware (caps with a threaded male end, or a double-threaded screw) for these speakers.OVERALL: 5/5I like these speaker stands very much. They are well-built, sturdy, attractive, small, and cost effective. The range of height adjustment is perfect for most applications. I highly recommend them.",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71c1NGo3hxL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81kO1WYtUIL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gene Bates",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG74HB2MYZUZRIOMJ4NPSW33ZAVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XK5RVOGVRAMH?ASIN=B07925B8PD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy Set-up in a Variety of Ways",
                "reviewText": "These are really nice in terms of quality and adjustability. They come with different mounting brackets and screws that work with a variety of speakers. My speakers are rather large with top firing Dolby Atmos speakers on the top of the enclosure and the stand worked out well. The base is lighter weight than my Atlantics with a similar design. You will need to place one of the three \"feet\" forward under the weight of your speaker for the necessary support; otherwise it could topple over.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMH4GPSLNN73C6EK4BNEMZJ5JFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35YHBDIFHKT18?ASIN=B07925B8PD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice quality speaker stands",
                "reviewText": "Highly recommended. Easy to assemble. The base has some weight to it which makes it very sturdy. Speaker wire feeds through pole. Several different options of mountings to cover a realm of speaker manufacturers. I would buy again if needed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Max",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 7, 2022",
                "reviewTitle": "Could of been a bit bigger base for the size of my speaker but it all worked out!",
                "reviewText": "Sturdy built and looks great in the living room for my stereo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shelly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 21, 2023",
                "reviewTitle": "Good Solid Speaker Stands",
                "reviewText": "Bought these recently. Solid construction. Nicely blend with living room without much disturbance. I use them for Q990C satellite speakers. Holds them very well and steady. Comes with different mounting screws and brackets which is really handy. Tube diameter is not enough to insert 90deg power cable. However, supplied velcro straps can be used to tie them along the tube. Only downside is they are a bit pricy. But you get what you pay for.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robin Bouchard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 16, 2022",
                "reviewTitle": "Bon produit et qualité",
                "reviewText": "Très bon rapport qualité prix",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John mckay",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 21, 2023",
                "reviewTitle": "Well made stands that look good.",
                "reviewText": "I like the way the stands are made and how stable they are when fully extended",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 2, 2023",
                "reviewTitle": "1st class seller, quality product",
                "reviewText": "Good solid stands, very easy to assemble and adjust, put my new samsung satellite rear speakers on them with ease.Don't look anywhere else other than this seller, excellent service and communicationAAA+",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}