{
    "remaining_requests": 46671,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Introducing-sound-compact-speaker-Glacier/dp/B09ZXLRRHY",
    "body": {
        "name": "Amazon Echo Pop | Full sound compact smart speaker with Alexa | Glacier White",
        "price": "$24.99$24.99",
        "originalPrice": "$39.99",
        "rawPrice": 24.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Introducing-sound-compact-speaker-Glacier/dp/B09ZXLRRHY",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BZTVZ4XV"
        ],
        "asinVariationValues": [
            {
                "asin": "B09WNK39JN",
                "variationName": "Color",
                "variationValue": "Charcoal",
                "price": "$24.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/01kh5LKrhYL._SS36_.jpg"
            },
            {
                "asin": "B09ZXLRRHY",
                "variationName": "Color",
                "variationValue": "Glacier White",
                "price": "$24.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/01IeTMj-k9L._SS36_.jpg"
            },
            {
                "asin": "B09ZXJDSL5",
                "variationName": "Color",
                "variationValue": "Lavender Bloom",
                "price": "$24.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/013Q-JyAU5L._SS36_.jpg"
            },
            {
                "asin": "B09ZX1LRXX",
                "variationName": "Color",
                "variationValue": "Midnight Teal",
                "price": "$24.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/01bfAeZGoSL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41vTlVx2FFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21XGJez7BqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nkdm17QML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kpvT9jjkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411CoJdO25L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ClW9IFfsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31tow7sS-2L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 31296,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 13. Order within 14 hrs 8 mins",
            "FREE pickup Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 13. Order within 18 hrs 23 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Reducing CO2 products reduce their carbon footprint year after year. Certified by the Carbon Trust."
        },
        "features": [
            "ECHO POP – This compact smart speaker with Alexa features full sound that's great for bedrooms and small spaces. Small enough to blend in and mighty enough to stand out.",
            "CONTROL MUSIC WITH YOUR VOICE – Ask Alexa to play music, audiobooks, and podcasts from your favorite providers like Amazon Music, Apple Music, Spotify, Pandora, Sirius XM and more. Connect via Bluetooth to stream throughout your space.",
            "MAKE ANY SPACE A SMART SPACE – Easily control compatible smart home devices like smart plugs or smart lights with your voice or the Alexa App.",
            "LIFE JUST GOT EASIER – Have Alexa set timers, check the weather, read the news, re-order paper towels, make calls, answer questions, and more.",
            "ALEXA HAS SKILLS – With tens of thousands of skills and counting, Alexa can help you do more or do less - like playing relaxing sounds and testing your music knowledge.",
            "ABOUT THE LIGHT BAR – Alexa doesn’t begin listening until your device hears you say “Alexa” and the light bar turns blue.",
            "DESIGNED TO PROTECT YOUR PRIVACY – Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls, including a mic off button.",
            "DESIGNED FOR SUSTAINABILITY – This device’s fabric is made from 100% post-consumer recycled yarn and aluminum is made from 80% recycled aluminum. The device packaging is 100% recyclable."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Size",
                "value": "3.9” x 3.3” x 3.6” (99 mm x 83 mm x 91 mm)"
            },
            {
                "name": "Weight",
                "value": "6.9 oz (196 g) Actual size and weight may vary by manufacturing process"
            },
            {
                "name": "Audio",
                "value": "1.95” (49.5 mm) front-firing speaker, Lossless High Definition"
            },
            {
                "name": "Wifi connectivity",
                "value": "Dual-band Wi-Fi supports 802.11a/b/g/n/ac (2.4 and 5 GHz) networks. Does not support connecting to ad-hoc (or peer-to-peer) wifi networks."
            },
            {
                "name": "Amazon Sidewalk",
                "value": "A shared network that helps compatible devices work better at home and beyond the front door. If wifi is lost, Sidewalk enables certain devices to stay connected. Also, Sidewalk helps devices like water sprinklers and pet locators work over longer distances. Sidewalk uses a small portion of your internet bandwidth to provide these benefits to you and your neighbors via Sidewalk Bridges (participating Echo and Ring devices), and is turned on for your device unless you have previously turned off the setting. You can turn off Sidewalk at any time. Learn more about Sidewalk."
            },
            {
                "name": "Smart Home Device Compatibility",
                "value": "Wifi, Bluetooth Low Energy Mesh, and Matter."
            },
            {
                "name": "Bluetooth connectivity",
                "value": "Advanced Audio Distribution Profile (A2DP) support for audio streaming from your mobile device to Echo Pop or from Echo Pop to your Bluetooth speaker. Audio/Video Remote Control Profile (AVRCP) for voice control of connected mobile devices. Hands-free voice control is not supported for Mac OS X devices. Bluetooth speakers requiring PIN codes are not supported."
            },
            {
                "name": "eero Built-in",
                "value": "Your wifi network must use a compatible eero router and your Echo device must stay in range of a compatible eero device. You will need to link your eero and Amazon accounts and manage eero Built-in from the eero mobile application to use this feature. eero Built-in compatible Echo devices support up to 1,000 sq. ft. of additional coverage, speeds up to 100 Mbps, and 10 or fewer connected devices in the 5 GHz band. Actual performance can vary and certain eero, Echo, or Alexa features may be incompatible with eero Built-in. Learn more about eero Built-in performance, availability and compatibility. Use of eero and eero-related products and services, including eero Built-in, requires creation of an eero account and agreement to eero’s Terms of Service. Review eero’s Privacy Notice."
            },
            {
                "name": "System requirements",
                "value": "Echo Pop comes ready to connect to your wifi. The Alexa app is compatible with Fire OS, Android, and iOS devices and also accessible via your web browser. Supported operating systems. Certain skills and services may require subscription or other fees."
            },
            {
                "name": "Setup technology",
                "value": "Amazon wifi simple setup enables customers to connect smart devices to their wifi network in a few easy steps. Wifi simple setup is another way Alexa is always getting smarter. Learn more about wifi simple setup."
            },
            {
                "name": "Warranty and service",
                "value": "90-day limited warranty and service included. Optional 1-year, 2-year, and 3-year extended warranty available for U.S. customers sold separately. Use of Echo Pop is subject to these terms."
            },
            {
                "name": "Accessibility features",
                "value": "To enable features that personalize Alexa to your abilities, go to Settings → Accessibility in the Alexa App. • Adaptive Listening provides customers more time to finish speaking before Alexa responds. • Preferred Speaking Rate allows customers to control how fast or slow Alexa speaks. To enable, say “Alexa, speak slower” or “Alexa, speak faster.” • Request Sound will play an audible tone in addition to the visual indicator when you speak to Alexa. To enable, say “Alexa, turn on Start of Request Sound.” • Kindle Assistive Reader will have Alexa read your Kindle books aloud. • Notify When Nearby will play notification sounds when you’re detected near your Echo device. • Alexa Accessibility features also include several other settings for customers with accessibility needs related to vision, hearing, mobility, and speech."
            },
            {
                "name": "Included in the box",
                "value": "Echo Pop, glacier white power adapter (15W), and Quick Start Guide."
            },
            {
                "name": "Generation",
                "value": "Echo Pop – 2023 release (1st Gen)."
            },
            {
                "name": "Privacy features",
                "value": "Wake word technology, streaming indicators, microphone off button, the ability to view and delete your voice recordings, and more. Visit the Alexa Privacy Hub to explore how Alexa and Echo devices are designed to protect your privacy."
            },
            {
                "name": "Language",
                "value": "Alexa speaks English and Spanish."
            },
            {
                "name": "Alexa Skills & Features",
                "value": "Alexa makes your life easier, more meaningful, and more fun by letting you voice control your world. Alexa can help you get more out of the things you already love and discover new possibilities you've never imagined. Discover and learn what Alexa can do."
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own an Amazon Echo, visit Manage Your Content and Devices for information specific to your device."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Room 888",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFL6O6G2V64QG2WEPW262SRBVYQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R2RU2P9JWNZX?ASIN=B09ZXLRRHY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars I love this thing!",
                "reviewText": "I had a \"hockey puck\" style Alexa speaker in my bedroom that just bit the dust, so I decided to upgrade to the Pop. It was cute, reasonably priced, and seemed to be more suitable for my room than the old unit (the Pop's speaker can be turned in any direction.)I was not expecting to be as impressed by this unit as I was.Setup was a breeze-I was able to transfer the settings from my old unit to the new one painlessly, and I was up and running in about 10 minutes.Out of the box I was impressed by its appearance, its lovely shade of teal that contrasts nicely with my peach walls, a lighter weight, and a smaller footprint.The best thing is that the notification light is at the Top of the Pop. :) I keep my speaker in a corner of an entertainment centre so the bass can be amplified - the hockey puck unit and the big ugly \"dome\" unit in my bathroom have the notification lights in locations that are much harder to see at a distance, and I like the fact I can see the notification \"arc\" clearly from across the room.Another plus: This unit also seems to respond to my commands faster than my older ones.The biggest advantage the pop has, however, is the SOUND!I always do the \"speaker in the corner\" trick to amp up the bass, but honestly, if you turn the bass setting up on the app, you don't have to do that.The sound is rich, full, and lifelike - I listen to a lot of Jazz and it sounds amazing on this speaker. Classical sounds lovely as well, and I have to reduce the bass a bit when listening to Dub Techno, because it gets a little rattly.Overall I am extremely pleased with my purchase, and I will probably replace the larger unit in the bathroom with another Pop.I would love to see this offered in a nice shade of coral!",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mastarayray",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQJNXJDKPPQO7RYMYA4CBF6JB2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QTUCCJQDI296?ASIN=B09ZXLRRHY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Echo Pop Bluetooth Speaker - A Compact Powerhouse of Sound!",
                "reviewText": "I recently added the Echo Pop Bluetooth Speaker to my collection of audio devices, and I must say it has quickly become a favorite for its impressive performance and portability.First and foremost, the sound quality of this compact speaker is outstanding. Despite its small size, the Echo Pop delivers rich and clear audio with surprisingly deep bass. The well-balanced sound profile ensures a pleasant listening experience across various genres, making it a versatile choice for any occasion.The Bluetooth connectivity is seamless and hassle-free. Pairing my devices with the Echo Pop is a breeze, and the connection remains stable even at a distance. The wireless capability adds a level of convenience, allowing me to control my music from a distance without being tethered to the speaker.I'm particularly impressed with the battery life of the Echo Pop. It boasts an impressive playtime on a single charge, making it a reliable companion for outdoor activities, picnics, or just a day at the beach. The quick-charging feature is a bonus, ensuring that I spend more time enjoying music and less time waiting for the speaker to recharge.The compact and sleek design of the Echo Pop makes it easy to carry anywhere. The build quality is robust, and the speaker feels durable enough to withstand the rigors of daily use. The touch-sensitive controls add a modern touch, allowing for easy adjustments to volume and playback with a simple tap.Another standout feature is the water-resistant design. This has proven to be a game-changer for poolside lounging and outdoor gatherings. The Echo Pop's ability to withstand splashes and light rain ensures that the party can go on, even if the weather doesn't cooperate.The Echo Pop also comes with a built-in microphone, turning it into a convenient speakerphone for hands-free calls. The call quality is surprisingly clear, and the hands-free functionality adds an extra layer of utility to this already versatile device.In conclusion, the Echo Pop Bluetooth Speaker has exceeded my expectations in terms of sound quality, portability, and durability. Whether I'm at home, on the go, or enjoying outdoor activities, this compact powerhouse of sound has proven to be a reliable and stylish companion. If you're in the market for a feature-packed Bluetooth speaker that punches above its weight, the Echo Pop is an excellent choice.",
                "reviewVotes": "56 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul ReutherPaul Reuther",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEINJ752OGMUPHYSZUSJZRGDBTPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HHRBXOV1NVJ9?ASIN=B09ZXLRRHY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazon Echo Pop is the best!",
                "reviewText": "I love the small size. It fits everywhere. Right now it is on my nightstand. A friend of mine just got the Amazon Dot. I was impressed by its sound. I decided to buy one but they are expensive. Then I saw the Pop while browsing Amazon. It was a steal at 17.99. I bought one immediately. I did not expect much when I saw it. It was easy to set up, I used my Amazon account. The sound quality is quite good. I listen to music mostly. I realize that the Dot probably has somewhat better audio, but I am quite pleased with the pop.I keep it on a classical music station while I sleep, it is relaxing. I adjusted the equalizer and it made an improvement on the sound. If I want bigger sound and volume I can use the Bluetooth and connect it to my system’s Edifier speakers. I have tried this and it works well. So much for whatever limitations the audio on the Pop has. I do not understand the reviewers who write negative comments about the Pop. I am quite pleased with it. This is my first foray into Alexa. So far I really like it and cannot believe all you can do with it. I cannot wait to explore further. You cannot go wrong with the Amazon Pop. It does lack temperature control, and proximity sensor, both of which I do not need. I highly recommend this speaker, especially at its price. Buy one, you will be pleased with it. The setup is very easy, and it can be controlled with your smartphone. I am very pleased with it.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7137grbEJwL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}