{
    "remaining_requests": 46419,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BassPal-Bluetooth-Speakers-Waterproof-Portable/dp/B0C1BZHQ28",
    "body": {
        "name": "BassPal Bluetooth Speakers, IPX7 Waterproof Shower Speaker, Portable Speaker with LED Display, FM Radio, Suction Cup, Light Show, Built-in Mic, Best Gifts for Pool Beach Home Party Travel Outdoors",
        "price": "$29.99",
        "originalPrice": "",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BassPal-Bluetooth-Speakers-Waterproof-Portable/dp/B0C1BZHQ28",
        "soldBy": {
            "sellerID": "A14YNY49YKF04H",
            "name": "dianmo",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A14YNY49YKF04H&asin=B0C1BZHQ28&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C52S4M28"
        ],
        "asinVariationValues": [
            {
                "asin": "B07Y5PQYR3",
                "variationName": "Color",
                "variationValue": "BLUE",
                "price": "$29.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51ZGOG2qNXL._SS36_.jpg"
            },
            {
                "asin": "B0C1BZHQ28",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$29.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51f2RjLNxHL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51f2RjLNxHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51oGLe0DP5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51y48aor3NL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 LaDG7a8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51B-JdIN-IL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51RoG1y-XPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61aMZwgN4NL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BassPal Store",
            "link": "https://www.amazon.com/stores/BassPal/page/B9D25242-538B-43EF-85B5-A48F72B3D4B3?ref_=ast_bln"
        },
        "brand": "BassPal",
        "merchantInfo": "dianmo",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 5924,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 13. Order within 13 hrs 18 mins",
            "FREE pickup Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 13. Order within 22 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Multifunctional LED display: The portable Bluetooth speaker LED digital screen display allows you check the time and battery in Bluetooth mode. In FM radio mode, you can choose to listen to the station you like and adjust the volume as needed, bring you a more convenient and comfortable life.",
            "Beat-driven light show: Watching a halo of LED phase, pulse and shine with the rhythm of your music for a completely immersive vivid audiovisual experience. The Bluetooth party speaker boasts seven romantic colors and you can lock one color or let it scroll away to elevate the atmosphere of any event, especially beautiful at night.",
            "IPX7 fully waterproof: IPX7 waterproof technology offers impermeable protection, even can be submersed in 3 feet of water up to 30 minutes, the removable suction cup design makes Bluetooth shower speaker can floating on the water or stick to your bathroom wall, mirror, pool deck, kitchen counter or whatever slick surface.",
            "TWS 3D Stereo Sound: True wireless stereo technology support two wireless speakers play music synchronously through a Bluetooth connection, form left and right channel stereoscopic meat for meat music, 360° surround high definition sound without any noticeable distortion even at maximum volume crash the dancing, meeting your indoor outdoor carnival requirement.",
            "Ultra portable speaker/radio: This portable outdoor speaker with latest Bluetooth 5.0 provides faster stable pairing and fits in the palm of your hand, hang to your bag or bike via lanyard, insert antenna may enhances radio signal, built-in microphone will not miss important calls!"
        ],
        "description": "Key Features of BassPal IPX7 Waterproof Portable Bluetooth Speaker LED display allows you check time and battery in Bluetooth mode Hi-Fi loud stereo sound, 8W high-performance drivers IPX7 Waterproof, shockproof, dustproof, scratchproof Built-in microphone for hands-free speakerphone call FM radio and LED mood light Removable strong suction cup 730mAh battery for up to 8 hours of playtime",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Portable Audio & Video",
                "link": "https://www.amazon.com/Portable-Audio-Video/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172623"
            },
            {
                "name": "Portable Speakers & Docks",
                "link": "https://www.amazon.com/Speaker-Systems-MP3-Player-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=689637011"
            },
            {
                "name": "Portable Bluetooth Speakers",
                "link": "https://www.amazon.com/bluetooth-speakers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7073956011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.82 x 3.82 x 2.95 inches"
            },
            {
                "name": "Item Weight",
                "value": "8.1 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0C1BZHQ28"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 5,924 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,064 in Electronics (See Top 100 in Electronics) #346 in Portable Bluetooth Speakers"
            },
            {
                "name": "Date First Available",
                "value": "April 3, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "Shenzhen Zhiluling Technology Co.,Ltd."
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Speakers Maximum Output Power",
                "value": "8 Watts"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "BassPal"
            },
            {
                "name": "Model Name",
                "value": "F013 PRO"
            },
            {
                "name": "Speaker Type",
                "value": "Built-In, Indoor, Outdoor, Home, Travel, Party"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, USB"
            },
            {
                "name": "Special Feature",
                "value": "LED Screen Display, FM Radio, LED Light Show, Bluetooth 5.0, TWS Stereo Sound, Removable Suction Cup, Portable Lanyards, Special Antenna, Floating, Microphone, IPX7 Waterproof/Shockproof/Dustproof/Scratchproof See more"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The LED digital screen display shows time, how much battery life is left and what mode it is. How do you get FM tuner to stop on a station? You can long press the \"play\" button to get it to go through channels, quick click to stop on the radio channel that you want it to stop on, if you press through the \"volume\" buttons it displays a different number and changes stations. How to set the time ? In Bluetooth mode, long pressing the \"play\" button, the display will flash hours first. By using the \"volume\" button to adjust hour, then one-press \"play\" button again to lock hour. Same way to adjust minutes. When the speaker is turned off, no clock display.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/75d78218-5e4e-4eea-b9f0-9bc48a589bb3.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Frequency Response: 120Hz-22 KHzBluetooth 5.0Operating Distance: Up to 66 ftBattery Capacity: 730mAhPower Rating: 8WCharging Voltage: DC 5VMicrophone: Built-inCharging Time: Approx.2 HoursPlayback Time: Up to 8 HoursHousing Material: ABS+Silicone Key Features of BassPal IPX7 Waterproof Portable Bluetooth Speaker LED display allows you check time and battery in Bluetooth mode Hi-Fi loud stereo sound, 8W high-performance drivers IPX7 Waterproof, shockproof, dustproof, scratchproof Built-in microphone for hands-free speakerphone call FM radio and LED mood light Removable strong suction cup 730mAh battery for up to 8 hours of playtime",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fb562d78-e641-4578-bb87-7d77f9531090.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2283e6f1-0c4a-4cc1-847a-93227c9c563b.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "High Quality Music On-the-Go -Ultra-portable speaker easy to be put into the backpack, hang on the handle of the bicycle or mounted on the frame, enjoy crystal clear music while hiking, camping, picnicking, fishing, on the beach, by the swimming pool, in the shower, at home, dormitories or in your office, Anywhere! -Without worrying that water, sand or dust could do any damage to your speaker. It is suited for every type of adventure and lifestyle. IPX7 Waterproof for Pool Party -IPX7-rated protection safeguards against rain, dust, snow, and spills. F013 Pro even withstands being submerged in up to 3ft (1 m) of water up to 30 minutes. It means you can enjoy a strong pool party that's not afraid of splashes or bad weather! -Ensure safe use in the bathroom shower, in the rain, by the pool or on a boat Modern, Stylish and Sturdy -With aqua blue body, innovative design and intriguing 7-color combination mixed with the LED lights for the mood makes this product unique. A halo of LEDs reacts and phases in time with the beat will crash the party or dancing, choose your favorite light color or let it scroll through all 7 colors to create a romantic atmosphere. -ABS+silicone material protect the wireless speakers from years of wear and tear will give you peace of mind. Wireless Stereo Pairing -TWS technology enables you to pair two speakers via a single device form left and right channel output respectively, then audio can be played in sync on two speakers for true double enhanced stereo sound. Each Bluetooth speaker for iPhone can also be used separately. -After 10 minutes without any operation since you powered on, the product will shut down automatically.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9b86c58-b281-4d6b-af88-ccd12f638023.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b9c325cd-82db-4e10-9995-881bc1b8a7bc.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/38b5e085-54eb-44d7-8439-48c48d41ee56.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f582434-8cf6-4dbb-9830-3dd9534afeda.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/75d78218-5e4e-4eea-b9f0-9bc48a589bb3.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fb562d78-e641-4578-bb87-7d77f9531090.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2283e6f1-0c4a-4cc1-847a-93227c9c563b.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cf1825b3-aa8d-4a08-8006-b4bc13dd5cdc.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9b86c58-b281-4d6b-af88-ccd12f638023.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b9c325cd-82db-4e10-9995-881bc1b8a7bc.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/38b5e085-54eb-44d7-8439-48c48d41ee56.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f582434-8cf6-4dbb-9830-3dd9534afeda.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7fb76a76-8c93-419d-a1cd-87e2e6798f71.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ryan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVUAOH7FLQODSWM567EJVRGSILQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y0FC29107QV6?ASIN=B0C1BZHQ28",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 8, 2022",
                "reviewTitle": "5.0 out of 5 stars Best shower speaker I've found so far",
                "reviewText": "I've always been a shower singer and about 10 years ago I got my first shower speaker to go along with that habit. I've had a lot of these speakers in the past, since many of the ones I've gotten don't last a full year. This BassPal speaker is hands-down the best one I've ever used.The sound quality is fantastic. I'd put it on par with my JBL bluetooth speaker that isn't waterproof. The bass isn't going to rattle your house apart, but even at the louder volumes needed to compete with the sound of the shower, the overall quality of the music is great. It's nice and deep, without getting that rattle that a lot of cheaper heavy-bass speakers will get.The sound is top-notch, but there are other features that also make this speaker a great choice. I love the screen on the speaker. It shows battery level, a clock, and the current mode the speaker is set to (for transparency, I only ever use the bluetooth, I didn't even take the radio antenna out of the box). Just knowing that my speaker isn't going to die on me in the middle of a shower is huge for me - I hate it when my tunes get cut out because I didn't think to charge the little guy.I do also appreciate that the speaker comes with a big ol' suction cup on the back AND a rope with a loop on the top. Most other speakers I've gotten only have one or the other, but it's perfect having them both because I can use the suction cup to place the speaker exactly where I want it, but I can use the rope to secure it to the shower head for when the suction cup inevitably loses its suction (this happens probably once a week). I've had other speakers that only have the suction cup and they all fall eventually. I've also had speakers that only have the rope and I can never position those right as they end up just hanging free from the point where the showerhead attaches to the wall and spinning whichever way it feels like in that particular moment.I did have one major problem with the speaker that I purchased. After about 3 months of use, the speaker died on me. It would display a red light when I tried to turn it on, but never do anything beyond that. Fortunately, BassPal was very helpful when I reached out. They asked that I send them a video of the speaker not working, but then sent a replacement right away as soon as I got the video to them. I was very happy with how easy of an interaction that was.This is the best shower speaker I have found. I'd certainly recommend it to anyone who likes having some tunes while they get clean!Pros:-Great sound-Screen shows battery level as well as clock and mode (easy to read)-Buttons are nice and chunky so you can feel when they click-Holds a charge for weeks-Excellent customer support when replacement was neededCons:-My first one died on me-No distinct buttons for volume/tracks",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C.W.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG34CHWCRXEDJ2MVIS5HVTVUSRGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VBUO1QJ96VH2?ASIN=B0C1BZHQ28",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Works perfect",
                "reviewText": "We have had this since Nov and it's now mid Jan. It is used many many times a week by everyone in my family. It is in the shower everytime and does get sprayed on and it works perfectly. It can get very loud even and just adds some extra enjoyment and relaxation to shower/bath time. Charge holds for a decent amount of time before needing to be charged again.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charlie Tuna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK6TLQHSFGGKOLETF7YYIYFSKBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R381PM8SB7USV5?ASIN=B0C1BZHQ28",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 15, 2020",
                "reviewTitle": "4.0 out of 5 stars Not Bad.",
                "reviewText": "Okay, first off, If you're looking for FM, look elsewhere. I fiddled with this thing for about an hour, I am university educated but despite this I think I have common sense and have a background in electronics and technology. I could not get this thing to stop on a channel or save it to a preset. It could be okay though; if your Bluetooth device has an FM capability, then you can use it and just use the speaker to pump the sound. Using it like this, it works perfectly- and you can use the clock too. As an aside, my music player has FM but it requires wired headphones for the antenna. When used like this, the sound still goes through the speaker which is nice but I also used the supplied speaker's antenna in my music player, and it picked up all my presets on my music device! Sweet!The sound is great. I set the bluetooth's speaker volume on maximum, 30, and then used my music device to adjust the volume. This way I have volume control away from the speaker. Now if you wanted to toggle the volume through the speaker, you can do that as well. You can also toggle the music device's songs forward and backward by long pressing the volume buttons.You can toggle through various light schemes too but I just turned them off to save battery life. When the unit is charging, the light is red and I assume it will either turn green or simply go off when it is charged.What could make this thing better? One, a flat bottom! When you unscrew the suction cup, the base of the speaker is conical. If it was flat or had feet you could set this on a table or something. Some rubber feet over the four assembly screw holes might make this issue non existent. The good news about the suction cup screw and the accompanying hole, it is a standard 1/4*20! Thank you for that. If you don't know, that's a standard thread for things like camera bases , tripods, and GoPro junk.Also, the buttons have a lot of designs on most of them but you can only press the centre of the buttons for the functions. You toggle the functions by long pressing. This is not a big deal but you can barely make out the function designs on the buttons. I may try to fix this with a wipe of some white or yellow acrylic paint and then wipe the button's high spots off. if I do this, I will take some pictures to show my results.Finally, I think this thing will be okay. It pairs easily, it has great sound, it feels really well built and rugged, and it was cheap. If it conks out like I think it will, I may attempt a battery replacement/ upgrade because at this price point, the battery will probably be the weak link.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUAN6EZVYXE64XGTDTBA24BSYMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NW25QGGTBLG1?ASIN=B0C1BZHQ28",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Great speaker!",
                "reviewText": "Got one of these from my husband as a gift and I love it! I use it everytime I shower and I even got my daughter one for her bathroom for christmas as she has been asking. Only issue is that the buttons that looks like it would say \"next\" or \"back\" only work for volume, I haven't been able to get them to actually make anything go next or back which it might be a user error I am unsure I didn't investigate into it too much. I like that it automatically shuts off if it's not playing anything for a bit, saves battery!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Priyanka",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 8, 2020",
                "reviewTitle": "Just Amazing!!",
                "reviewText": "I gifted this Bluetooth speaker to my husband on his Birthday & he absolutely love it!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "\"networking9\"",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 14, 2020",
                "reviewTitle": "Good purchase",
                "reviewText": "Good sound quality and seems to create a very reliable Bluetooth connection . Really like it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pip",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 28, 2020",
                "reviewTitle": "FM radio won’t tune otherwise great",
                "reviewText": "Great speaker but FM radio won’t tune. Paired easy haven’t tried in water yet as bought for a present",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Theepa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 19, 2020",
                "reviewTitle": "Works well!",
                "reviewText": "Brilliant sound, loud, excellent quality, durable. Pretty. Can't ask for more!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brad",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 29, 2023",
                "reviewTitle": "Didn’t last",
                "reviewText": "Bought this as a Xmas present and already is falling apart. The suction cup connection has sheared off, the charging connection no longer seals and now the unit won’t charge.Very disappointing. Lasted less than 5 months.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}