{
    "remaining_requests": 46484,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sonos-Playbar-Mountable-Sound-Movies/dp/B00AEMGGU2",
    "body": {
        "name": "Sonos Playbar - The Mountable Sound Bar for TV, Movies, Music, and More - Black",
        "price": "$514.95",
        "originalPrice": "",
        "rawPrice": 514.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sonos-Playbar-Mountable-Sound-Movies/dp/B00AEMGGU2",
        "soldBy": {
            "sellerID": "A3GMNP3CXMIPDP",
            "name": "CellularStream",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A3GMNP3CXMIPDP"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07D6L7N1G"
        ],
        "asinVariationValues": [
            {
                "asin": "B01KU6XP2S",
                "variationName": "Style",
                "variationValue": "3.1 Set",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07XNYX6K8",
                "variationName": "Style",
                "variationValue": "5.1 Surround Set (Black)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07XNYX6K5",
                "variationName": "Style",
                "variationValue": "5.1 Surround Set (White)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07P3G997M",
                "variationName": "Style",
                "variationValue": "PLAYBAR + Mount + $50 Gift Card",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B087LJXPW9",
                "variationName": "Style",
                "variationValue": "Playbar + Mount + Free $20 Gift Card",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00AEMGGU2",
                "variationName": "Style",
                "variationValue": "Playbar Only",
                "price": "$514.95",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/21VIrz-eNPL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51iK9fLadQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lu4XfR tL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pWf89oDhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Dj7SGQA8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gbmnq9DPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61BFAWAxdcL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/376eb11d-88b5-4c67-8eea-76e9443c4bf2/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/14a2aad4-09d0-4d08-b6f0-1832f0ba0b03/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/431cb93d-e8ef-4e38-b0ed-338ca0b68048/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2977ad7-c5e9-46c6-a8fe-879030cc0831/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fbc62bc1-a8ba-4289-b88e-775358ab980f/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/edba20e0-7b11-4fd9-8e17-a3bdfa6c6a42/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb7106d1-9561-4646-aa21-c3c800c7b3cb/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 7,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B15rlnVtnwS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/815Mlv9jFfL.pdf"
        },
        "byLineInfo": {
            "name": "Brand: Sonos",
            "link": "https://www.amazon.com/Sonos/b/ref=bl_dp_s_web_2530477011?ie=UTF8&node=2530477011&field-lbr_brands_browse-bin=Sonos"
        },
        "brand": "Sonos",
        "merchantInfo": "CellularStream",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1981,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 20 - 23.",
            "Or fastest delivery February 14 - 16. Order within 13 hrs 11 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The mountable soundbar for TV, movies, music, and more",
            "Enjoy crisp dialogue and impressive bass from wall to wall with Playbar. Control it with the Sonos app, your remote, and more",
            "Whether you mount it on the wall or place it below your TV on a stand or console, Playbar automatically tunes itself for the best possible sound",
            "Playbar was specially tuned by Oscar-winning sound engineers to emphasize the sound of the human voice so you can always follow the story",
            "Easily connect Sonos speakers in different rooms over WiFi to create a home sound system that brings every room and everyone together"
        ],
        "description": "Sonos Playbar is the mountable soundbar for TV, movies, music, and more. Enjoy crisp dialogue and impressive bass from wall to wall with Playbar. Control it with the Sonos app, your remote, and more. Enjoy crisp dialogue and impressive bass from wall to wall with Playbar. Control it with the Sonos app, your remote, and more. Whether you mount it on the wall or place it below your TV on a stand or console, Playbar automatically tunes itself for the best possible sound. Playbar was specially tuned by Oscar-winning sound engineers to emphasize the sound of the human voice so you can always follow the story. Easily connect Sonos speakers in different rooms over WiFi to create a home sound system that brings every room and everyone together.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Home Audio",
                "link": "https://www.amazon.com/Home-Audio-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=667846011"
            },
            {
                "name": "Speakers",
                "link": "https://www.amazon.com/Speakers-Audio-Video/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172563"
            },
            {
                "name": "Sound Bars",
                "link": "https://www.amazon.com/Home-Audio-Sound-Bars/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3237803011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "35.5 x 5.6 x 3.4 inches"
            },
            {
                "name": "Item Weight",
                "value": "5.4 Kilograms"
            },
            {
                "name": "Manufacturer",
                "value": "Sonos"
            },
            {
                "name": "ASIN",
                "value": "B00AEMGGU2"
            },
            {
                "name": "Item model number",
                "value": "PBAR1US1BLK"
            },
            {
                "name": "Batteries",
                "value": "2 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,981 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#147,776 in Electronics (See Top 100 in Electronics) #562 in Home Audio Sound Bars"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "February 12, 2013"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Sonos"
            },
            {
                "name": "Model Name",
                "value": "Sonos PLAYBAR"
            },
            {
                "name": "Speaker Type",
                "value": "Soundbar"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Special Feature",
                "value": "Wireless, Multi Room Audio, Bass Boost"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Malcolm Granger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGX5K6AXQ7CUT7L4LGPMATWT4R4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23W6OA40T8A5Q?ASIN=B00AEMGGU2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 10, 2015",
                "reviewTitle": "5.0 out of 5 stars Sonos is a new music experience!",
                "reviewText": "Sonos is legendary for a good reason - because they really produce these components for the discerning consumer as well as for the neophyte looking for new sonic frontiers...It all started when I bought the LG ND8630 (the white washtub Airplay speaker). I loved the Airplay ability, the looks, and the deep sound. Now discontinued, it is a killer speaker for a killer price. Then, I happened to drop into a Bose store (big mistake), and walked out with the Gold Standard of wifi-speakers, the Bose Soundtouch 30. Wow, this has the \"Bose Sound\", deep with crisp highs and an OK interface (I hated the limiting 6-favorite Bose app) that worked with Airplay, Spotify Connect, and aux inputs. It is the best in a single speaker one can find, in my mind, for $500. The Bose was King of my music experience at home...but something was missing...Comparing the Bose 30 with the Bose QC15 headphones, I noticed what most (if not all) wifi- or wireless speakers were missing - the ambience of stereo separation! Music is produced with a lot consideration about how the track will sound in a stereo environment; the typical wireless speaker mixes or blends the two channels together - by virtue of the fact that any left-right channels are only inches- to two feet apart. Sounds great but is hardly a listening \"experience\".So, I noticed the Sonos Play:1 world. I had not given Sonos any consideration because i was not into the \"music in every room\" advertising approach. With caution, I bought a single Play:1 and liked the deep sound from a relatively small coffee-can sized speaker. Wow, then I discovered that by adding a second Play:1, I could easily make these into a left and right stereo pair, over wifi and with zero expertise, they just worked!For only $400, I had a pair of totally wireless speakers that filled the living room with the most amazing sound. I had been missing the true ambience of songs by playing Apple Music and Spotify, Amazon, Google Play, and Pandora over a single speaker. Note that compared to the Bose Soundtouch 30, each individual Sonos Play:1 could not match its presence, but together, the Sonos Play:1 pair just killed the Bose, sad to say! Rich bass (go figure!) and crisp highs, they sound great. Every playlist on every service was a new experience.Thanks for reading to this point. So, I thought...I went from 1-D sound (on the wireless speakers) to a much richer 2-D stereo sound with the Sonos Play:1 pair, why not expand into 3-D sound with the added Sonos Playbar? Yes, it is $699 but I had spent double that much of goofy surround systems, subwoofers, and gadgets. So, Amazon delivered the Playbar (1-Day shipping!) and I plugged it in. The iPhone Sonos app is an example of simplicity and yet flexibility (learn this lesson, Bose!) and within a minute I had a true surround system! It uses your old TV or Cable remote for volume, has an IR-repeater strip across the back, in case the Playbar blocks the TV remote, has only a power cord, an optical connect to the TV, and an ethernet cable for the connectivity to the Play:1 pair. It uses its own wifi band so it offloads any wifi traffic over this completely wireless surroundsound system. Amazing! BTW, did you know that many of the commercials have incredible 5.1 DD sound! Imagine that shock. Yes, most modern TV's do throughput 5.1 Dolby digital over the HDMI-optical pathway. Yes, Comcast and Dish do broadcast most shows and movies in 5.1. And yes, the Playbar-Play:1 combo is incredibly lifelike. You have number of variables, like the surround and ambient effects, the rear speaker adjustments, and a sound calibration with the TV volume (I left my TV speakers disconnected). The Playbar comes on with the TV and shuts off with the TV. I don't even have to think about it...easy!But wait, there's more! Using the iPhone Sonos app (...now I found the perfect solution for an old iphone or ipad laying about...!) I played my Spotify playlists over the Sonos Playbar-Play combo. WHOA. Amazing sounds, not only left- to right but also across the room. The playbar sits in front the TV while the Play:1's sit behind the sofa. The sound is very airy, and each instrument appears in different parts of the room - eery! It's more like an expanded sound field across the room, even for the standard mp3 two-channel streaming files.So, what have I got? A killer surround system that just works ( I decided against getting the SUB woofer from Sonos for now) in addition to a very fascinating room stereo experience. The Sonos combo knows if content is 5.1 and if so, the rear channels play the surround information, otherwise, it fills the room with the Left-Right stereo content.What about my gripes? I thought I would hate the app as much as I had no love for the Bose app. Actually, the Sonos app has a lot to offer; each Sonos playlist can contain content from each or any of the music services you have, all rolled into one playlist. So, until Sonos supports Apple Music, I am stuck to iTunes content that I have downloaded onto my iPhone or iPad. Cmon, Apple and Sonos - fix this! I wish the Playbar would recognize more than 5.1 (I don't think DTS is supported). Before you buy the Playbar, MAKE SURE: your TV has HDMI inputs for each of your devices such as cable, PS3, PS4, etc. Make sure your TV can support 5.1 over the HDMI and then out to the Sonos on the optical SPDIF output. Make sure, you can plug the Playbar into an ethernet router in the room, so that the Sonos combo can operate on its own net. You cannot play the Playbar and both rear Play:1's only on the local wifi network, you have to use a Bridge, Connect, or the Playbar through the router. I think...So, get these components and experience the best in 2-D and 3-D sound. I'll add more as I gain insights.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ped28",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOPSERQ5GWZ4YLMNV42RDCNPY5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YPDO0H930FLQ?ASIN=B00AEMGGU2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2017",
                "reviewTitle": "5.0 out of 5 stars Great System with Echo/Alexa Integration!",
                "reviewText": "Pros: easy to set up. Works well with Alexa. Sound is excellent. Integrates well with TV. Looks high end.Cons: Expensive. IR receiver doesn't work well in one orientation. Doesn't integrate with the sound display on the TV.We've been fans of Sonos since we bought our first Play:5, 10 years ago. Sonos is still the best electronic device we have ever purchased. Lately we have appreciated the ease and convenience of using voice commands of Alexa to listen to music. In fact we have sometimes listened to the speaker on the echo dot despite it's obviously inferior sound. Since the update allowing integration with Alexa, we use the speaker for just about everything, except to ask Alexa questions.With this in mind, I purchased this Playbar to use with the TV. I wasn't sure if I'd have to configure it each time I turned the TV on, or how easy it would be to set up with Alexa. Once we set it up to work with the TV, it just comes on automatically. There is only a slight delay of a second or so before the sound comes on with the TV. I don't have the turn the speaker on separately. It also works very well with Alexa. You can listen to music withe the TV either on or off. If you are listening to music and then turn the TV on, the speaker will switch to TV sound. We've tried the night time mode that turns down the loud parts of a movie down, so you don't disrupt the neighborhood. It's easy to set this using the Sonos app. The Palybar has only one physical connection in addition to its wireless one and that is an optical connection. I was a little concerned that my TV didn't have an optical connection, but I think this is fairly standard and that most sound bars of various brands connect via optical connection. My TV has an optical connection.I had no problem setting up the Playbar to the Alexa/echo system, although I can't explain the process. We did find that the IR receiver with the speaker sitting more upright, such as you might have it, if you were connecting it to the TV with a bracket only worked if you were standing within 5 feet or so. The IR receiver oriented in the way you would rest the speaker on a table of fireplace mantle worked well from far away, so that's the way we oriented the speaker and fortunately it turned out to be the way we prefer.The price on this product is high. I think it's worth more than the typical sound bar system for its sound quality and the things it can do. How much more is an individual decision. For someone considering a sound bar and a separate sound system and an echo speaker, the choice is more clear. And echo dot and the Sonos Playbar could give you the capabilities of a whole bunch of different systems and do it more elegantly.Looks are a matter of personal preference, but I think the Playbar looks and feels high end.I can't see a situation where you'd be disappointed with the Sonos Playbar if you are looking for a high-quality sound bar. The new integration of Sonos products with Alexa/echo really takes an already great product and brings the most updated convenience.This Sonos device integrates with other Sonos products, including the Sonos Subwoofer. You could connect a 5.1 system wirelessly. We haven't done this and probably won't, but if you were considering running wires through your walls, the high expense of a lot of Sonos speakers might offset some of the installation time/expense. Keep in mind that each speaker will still have to be plugged into a power outlet.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jorge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 13, 2018",
                "reviewTitle": "MI FAVORITO NUEVO JUGUETE!!!",
                "reviewText": "Después de mucho análisis de investigación entre diversas marcas, principalmente Bose para reemplazar mi viejo Onkyo-Harman Kardon 5.1 Home Theater, me decidí por comprar a través de Amazon mi PlayBar, 2 Sonos One y el Sub. Me llegaron en menos de 24 hrs a mi domicilio y me tardé más en desempacarlas que en lo que lo estaba disfrutando. Super sencillo de usar y con una calidad de audio IMPRESIONANTE!Mi esposa está feliz también porque la estética y el evitar cables es un gran PLUS! Es super sencillo el set-up y el usarlo a través de diversas fuentes, todo es automático! Aparte algo que no sabía es que puedes usar tu actual control remoto y ajustarlo para manejar el volumen de Sonos... en mi caso uso el de mi TV Sony. Estoy muy satisfecho!",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raghav",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 26, 2018",
                "reviewTitle": "simply amazing",
                "reviewText": "simply amazing...easy set up and the best sound quality ever.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ST",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 12, 2015",
                "reviewTitle": "Good value for the sound quality and convenience of the Sonos system",
                "reviewText": "After owning this and listening to this for a couple of weeks, here are my thoughts:Pros:- Great sound (like everyone else indicates).. Sounds even better when grouped with sub/other speakers. The syncing is virtually perfect - it sounds like one unit.- Powerful enough to fill a small apartment. Can get pretty loud as well.- Easy setup and really convenient to use - controllable with your phone/tablet/computer, so you can really control what's playing anywhere in your home any time- Looks clean - not only aesthetically but also you won't get messy wires as there's a max of 3 wires running to the soundbar (optical, power, and ethernet)- From packaging to the physical feel of the Playbar - it feels like a well-made quality productCons:- Pricey, but worth the money if it's within your budget.- Bass is not very strong, but acceptable for regular useOverall, the good sound quality is only half of what you're really paying for. It's true that you can get other soundbars that sound just as good if not better for $750, but the other half of the price is really the convenience of what they call \"the Sonos system\". I think a lot of people really underestimate the convenience factor. You can use virtually everything as a controller (phone/tablet/computer) as long as they're on the same LAN and have the app. As a simple (but surprisingly common) example, this means I can use my phone to select a playlist and then walk around the house; grab my tablet to adjust the volume a bit; and stop the music via my computer later on. You also don't need to keep any of these controllers on while the music is streaming, since it's all streamed by the Playbar itself.Other notes:- You'll need a good wireless network- Works great with popular music streaming services (I use Spotify premium and it's really well integrated)- You won't be able to use this as a wireless AUX speaker (no Bluetooth either)",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 25, 2019",
                "reviewTitle": "Excellent sound, great music streaming device",
                "reviewText": "The Playbar is on the expensive side but it does deliver excellent sound and is an excellent device for streaming music. I bought the Playbar to replace an existing speaker system because although the speakers were okay for TV sound, I was very dissatisfied with them for music. I did look at other soundbars but decided to spend the money on the Playbar because of its capabilities as a music streaming device. So far I am very happy with it for both TV and music but especially for music. Setting it up as a streaming device was really easy but setting it up with my TV was more of a hassle. My TV is an old Sharp Aquos which does have an optical out port as Sonos requires but unfortunately the older Aquos models don't split the audio signal for HDMI inputs. As a result I had to order a device that could split the audio signal to an optical out port. Once I had that, everything worked. So I would recommend that you make sure your TV has an optical out port that is compatible with the Playbar to avoid disappointment. But even if it isn't, there is a fix.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VíctorMMM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 5, 2017",
                "reviewTitle": "Excelente barra de sonido.",
                "reviewText": "Para aquellos que buscan un sonido de alta definición, un volumen para llenar espacios grandes, dispuestos a invertir en una solución elegante de barra de sonido.La calidad del audio es sobresaliente, especialmente si usas la opción de calibración \"TruePlay\" de SONOS en tu celular - sube increíblemente cómo el audio se adecúa al espacio / muebles del área donde la tienes.Excelente para disfrutar de música y épico para películas/series.Con opción de sonido 'nocturno' (atenúa sonidos fuertes para no despertar a otros miembros del hogar).Esta barra es pilar para crecer a un sonido 5.1 si agregas 2 reproductores SONOS y el Subwoofer SONOS (aún no lo he hecho personalmente).Excelente emulador de sonido surround.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}