{
    "remaining_requests": 46389,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Majority-Bluetooth-Connection-Speakers-Projectors/dp/B08BJB2K7L",
    "body": {
        "name": "Majority Sound Bar for Smart TV, 50 Watts, 2.0 Bluetooth TV Sound Bar, 15 Inch Home Audio Sound Bars, Small Soundbar for TV and PC | AUX, RCA, Optical, USB | Gaming, Music, Movies - Bowfell Black",
        "price": "$34.95",
        "originalPrice": "$39.95",
        "rawPrice": 34.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Majority-Bluetooth-Connection-Speakers-Projectors/dp/B08BJB2K7L",
        "soldBy": {
            "sellerID": "A3MGJXQ37XI9ID",
            "name": "iZIlla",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3MGJXQ37XI9ID&asin=B08BJB2K7L&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 15% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/318RFdxTASL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/411AedN698L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51L1rkjsMjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518tgmhb3dL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xMHfqRuuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-iX8d 9GL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Fz84KvNdL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0bbc2515-44c5-498b-9569-7be43f2173ec/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/05de1a90-30da-4aa2-888e-5e29a1864595/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a89e371-af8a-45c2-a737-f2702c9bd14f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2ebb9579-c0f7-495d-a44f-8567346fd690/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4fedc4d9-d73e-4bd8-987f-316370fafb11/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e784d763-ef72-4d43-90bf-4596fd188299/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81+ff2R1QlL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81+ff2R1QlL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Majority Store",
            "link": "https://www.amazon.com/stores/Majority/page/41A9E0A2-6A4A-4E72-AAB5-01A9E72CF62A?ref_=ast_bln"
        },
        "brand": "Majority",
        "merchantInfo": "iZIlla",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 27878,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35. Order within 5 secs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "50 WATTS, DUAL STEREO, 15 INCH: The Majority Bowfell is a powerful 50 watt TV sound bar packed with the latest audio technology and compatible with a wide range of household items such as your TV, PC, laptop, projector or monitor. Feel true cinematic surround sound in your own home from our small but mighty soundbar.",
            "BLUETOOTH, EQ CONTROL, 5 AUDIO MODES: Our powerful 50 watt soundbar and speaker comes with various audio connections and an EQ feature to customize your audio to how you want it. Music, radio, gaming, movies, live sport.",
            "AUX, OPTICAL, RCA, REMOTE: Our sound bar for tv has been designed with ease of use in mind - simply plug in, and play using the wide range of connections. Go truly wireless with our supplied remote to adjust volume, EQ settings, source, and more.",
            "COMPACT BUT MIGHTY: The Bowfell is a compact, slim audio sound bar device that fits perfectly on desks and sits comfortably under your TV. Use the buttons on the side of the soundbar or the supplied remote to go truly wireless and adjust the volume, equaliser settings, source and much more. An ideal sound bar for TV or PC, fill your room and immerse yourself with cinematic sound in your very own home.",
            "3-YEAR WARRENTY: Majority are a home audio brand with an experienced and friendly customer service department. We are proud to offer a 3-year extended warranty on all our products (registration required) and a hassle-free return policy. This package contains 1x Bowfell, 1x Remote, 1x RCA cable, 1x Power cable, 1x AUX cable and a user manual."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Home Audio",
                "link": "https://www.amazon.com/Home-Audio-Electronics/b?ie=UTF8&node=667846011"
            },
            {
                "name": "Speakers",
                "link": "https://www.amazon.com/Speakers-Audio-Video/b?ie=UTF8&node=172563"
            },
            {
                "name": "Sound Bars",
                "link": "https://www.amazon.com/Home-Audio-Sound-Bars/b?ie=UTF8&node=3237803011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "15.28 x 2.13 x 2.83 inches"
            },
            {
                "name": "Item Weight",
                "value": "816.5 Grams"
            },
            {
                "name": "ASIN",
                "value": "B08BJB2K7L"
            },
            {
                "name": "Item model number",
                "value": "BOW-BAR-BLK"
            },
            {
                "name": "Batteries",
                "value": "2 AAA batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 27,878 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,463 in Electronics (See Top 100 in Electronics) #10 in Home Audio Sound Bars"
            },
            {
                "name": "Date First Available",
                "value": "June 18, 2020"
            },
            {
                "name": "Manufacturer",
                "value": "Majority"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Speakers Maximum Output Power",
                "value": "50 Watts"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Majority"
            },
            {
                "name": "Model Name",
                "value": "Bowfell"
            },
            {
                "name": "Speaker Type",
                "value": "Soundbar"
            },
            {
                "name": "Connectivity Technology",
                "value": "Optical"
            },
            {
                "name": "Special Feature",
                "value": "Bass Boost"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Comparison of Our Products Bowfell Add to Cart Bowfell Plus Add to Cart Sierra Plus Add to Cart Everest Add to Cart Customer Reviews 3.9 out of 5 stars 27,878 4.2 out of 5 stars 72 4.2 out of 5 stars 103 4.0 out of 5 stars 118 Price $34.95$34.95 $69.95$69.95 $264.94$264.94 $229.95$229.95 Wattage 50 Watts 100 Watts 400 Watts 300 Watts Dolby Atmos x x Dolby Audio Dolby Audio Surround Sound x 2.1 Surround Sound With Up firing Speakers Detachable Satellite Speakers Audio Inputs USB, Optical, Aux, Bluetooth USB, Optical, Aux, Bluetooth Optical, AUX, USB, HDMI, HDMI Optical, AUX, USB, HDMI Arc Remote Included ✔ ✔ ✔ ✔ Wall Mountable ✘ ✘ ✔ ✔ Dimensions Inch 15.2x2.1x2.8In 15.2x2.1x2.8In 37.8x4.25x3.2In 35x3.9x2.6In",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b1593581-b824-4ac9-9fa0-a8c5b7d2d901.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/50adb208-4407-4efa-95d1-cf9c01201b2e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/28c113b9-f35c-46f3-b6b6-921a17a00105.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/816f27fc-e213-4c68-a017-b1649d105a26.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/06b0b466-fb81-457a-b37e-84f09e7495ad.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b237d6f-2dd8-4755-b005-0a9cfd19651b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/52ffd36d-5017-450f-a82d-dc7930e7c583.__CR0,0,200,225_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/38133dfb-80a8-43a5-b8d3-dd1fa99789f5.__CR0,0,200,225_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/72b34dc9-0a5b-4ab2-b5f4-d4258c67425b.__CR0,0,200,225_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cf9b9a07-1354-4428-9c86-434ddc02f9a3.__CR142,0,2276,2560_PT0_SX200_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Will",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLNWOCDEECLF7FPRQMYDDSVZVHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A9WK1VWPLEUX?ASIN=B08BJB2K7L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Just When I Though I Couldn't Love This More...",
                "reviewText": "I got one of these for my kitchen probably two years ago because I love to have music and podcasts going while I cook and bake. I needed something that didn't rely on a rechargeable battery and that would also fit on top of my microwave. This not only fits perfectly, but two years later, I still have no issues with it. It's a great little soundbar for the money, plays all music clearly, and it even throws a lot of sound if you turn it up higher (I have no idea how far exactly it goes because it's very powerful even on lower settings). I've mostly used it for the Bluetooth connectivity over the years, and it only cuts out if I take my phone to another room (which is to be expected). Otherwise, it maintains the connection very well and will go for hours if you leave it go. I actually ended up buying one for my office last year for cheap waiting room music, and on its lowest sound setting, it's perfect for background music. I just hooked it to my office computer, turned on YouTube Music, and let it play till my workday is finished.More recently, I remembered the other reason I bought this particular model -- the USB capability. I have an enormous vinyl collection (most of which is computerized) and was getting tired of having to wash my hands every time I changed the song on my phone while cooking and baking. So I got a small thumb drive on Amazon, loaded it up with some of my vinyl recordings, and now I can play it all day without having to start and stop and change songs. Christmas Eve, I cooked a holiday dinner for 13 people and was in the kitchen most of the day. The music just played and played without issue for almost twelve hours. The remote works great; this whole unit is worth the price.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "W. D. Gagliani",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEJQJFYU5MRPLRLH6KVHXO2FPTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CN4IHCMP9V12?ASIN=B08BJB2K7L",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2022",
                "reviewTitle": "4.0 out of 5 stars Fair amount of sound in a small package...",
                "reviewText": "Generally I am satisfied with this soundbar, my first ever. I am not by any stretch of the imagination an audiophile, so my observations may be faulty. The soundbar came well-packaged. However, a small issue was that the instruction sheet that was supposed to be included was not. No major problem, set-up is mostly intuitive, and I was able to download a manual PDF from the manufacturer's website to double-check my efforts. Still, the instructions SHOULD have been in the box. The sound itself is fairly good, though I haven't been able to adjust it to my complete satisfaction -- how much of the TV's own speaker sound should be mixed with the soundbar? I'm not sure -- it seems to be a personal opinion, but I would have appreciated some advice. As others have mentioned, this unit does not output much in the bass register -- okay for me, as I don't want to shake walls, but it may be a problem for other users. A small annoyance is that when the unit is turned on from the remote, the volume level is rather high no matter at what level it was left (this wouldn't be a problem in a house, but living in a condo with neighbors can make this kind of sudden sound explosion embarrassing and potentially problematic). Another small annoyance is that the adaptor cord is barely long enough in my situation -- I expected it would not reach my surge strip at all, but it did... just barely... and the fact that the jack is at the right end of the bar, rather than the rear center, could well make that cord too short for some users depending on their ball of spaghetti cord-situation. Minor issues, but for some they could be much more major. All in all, for me it seems to be an improvement over my TV's own sound, which was often too bass-heavy and full of distortion -- with the soundbar I've not had the TV volume rattle and hum as it used to do. The bar is small, attractive, and unobtrusive, and priced to sell even for experimental reasons -- can't go wrong with under forty bucks. I'm not one to need surround-sound Dolby etc etc high-end components (and volume needs to be kept reasonable for the common wall), so I don't mind that it's not an earth-shaker. I think I'll get a better sound mix the more I play with it. If not perfect, at this price it doesn't need to be.-W.D. Gagliani, author of The Judas Hit",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Black Butterfly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFN3JIJCFCRU25QJVQRT6FNIPKGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NT2QP54ICDKD?ASIN=B08BJB2K7L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Bowfell Soundbar",
                "reviewText": "Initially I was not expecting much for the price. I am satisfied with this small sound bar. It does what I need for my 24 inch Samsung smart TV. I was able to connect it via the optic cable. I was also able to play music from my cellphone through the Bluetooth option.It doesn't have a lot of bass or give off the sound of theater surround sound as I would have enjoyed. But like I said I wasn't purchasing this to get that feature. For small spaces it's perfect. I'm not sure how this would work with my 50 inch TV, I'm curious to give it a try. I'm looking to get a new one for that TV as well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AdriánAdrián",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 7, 2023",
                "reviewTitle": "El producto cumple, pero no esperes mucho",
                "reviewText": "El diseño es compacto, al rededor de los 40cm por lo que es perfecto para televisores pequeños o equipos de cómputo que no cuenten con audio integrado.El sonido es bastante nítido y los bajos son profundos pero la calidad de sonido no es impecable. Esto se aprecia más en niveles de volumen más altos. Eso sí, la potencia es muchísima para el tamaño del altavoz. Recomiendo usarla hasta un máximo del 30% de su potencia, considero que es un nivel suficiente para una habitación no muy grande y cerrada, además que así se evitan distorsiones del sonido y se aprecia un sonido de mejor calidad.No esperes mucho, al contrario, pero por su precio entrega una calidad muy buena y un sonido excelente pero que no llega a remarcable.La probé reproduciendo música en Tidal por medio del cable auxiliar, luego en videos de YouTube, una película en Netflix y finalmente un programa de TV. El sonido es claramente mejor que el de una televisión pequeña ya que éstas suelen tener altavoces de mala calidad y sin presencia de bajos.Su acabado es elegante y me gusta su rejilla metálica al frente. Tengo que agradecer que incluyan cables RCA y AUX, además el control es de buena calidad, yo habría preferido más modos de EQ pero nuevamente por el precio se agradece que haya 3, utiliza 2 pilas AAA y tiene buena respuesta.La recomiendo para personas que quieran un sonido suficiente sin gastar de más, pero si eres audiofilo y necesitas claridad y potencia, ésta bocina no es para tí.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81MVW8KnqDL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710UKchyKQL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71KmW1GUMpL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81tQ-2fsmZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81g1Tau0doL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vinícius Jambeiro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 22, 2022",
                "reviewTitle": "Barra de som linda e eficiente!!!",
                "reviewText": "Barra de som compacta mas com um som de altíssima qualidade, além de possuir controle remoto que sim é um diferencial das demais... Instalei em uma tv de 14\" e foi a combinação perfeita. SUPER RECOMENDO ☺️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arturo R",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 1, 2023",
                "reviewTitle": "Producto de calidad",
                "reviewText": "Buen producto, muy sencillo de manejo y buen sonido",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ER",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 25, 2023",
                "reviewTitle": "Qualidade sonora",
                "reviewText": "Produto de qualidade e com ótimo acabamento, mas os sons graves decepcionam. Para quem está acostumado com subwoofer separado não recomendo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcos Konno",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 23, 2023",
                "reviewTitle": "Pelo tamanho, tem um som muito bom. Mas a amplitude do som é limitado.",
                "reviewText": "Comprei para melhorar o som da minha TV, mas a saiu se bem para assistir filmes e ouvir musica, já que tem certa potência para transmitir sons graves e tem definição nos sons agudos. Não tem muita opção de equalização. Em termos de volume, não consegue transmitir um som muito alto. Então fica restrito a salas pequenas. Tive que pagar taxa de importação apesar da Amazon informar que era só valor informado e nada mais. Mas mesmo assim pelo tamanho pequeno e som que gera, ainda valeu a pena.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}