{
    "remaining_requests": 46628,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Marshall-Emberton-Portable-Bluetooth-Speaker/dp/B09XXW54QG",
    "body": {
        "name": "Marshall Emberton II Portable Bluetooth Speaker, Black & Brass",
        "price": "$126.00",
        "originalPrice": "$169.99",
        "rawPrice": 126.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Marshall-Emberton-Portable-Bluetooth-Speaker/dp/B09XXW54QG",
        "soldBy": {
            "sellerID": "ANO9SHL0H3C29",
            "name": "General King",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ANO9SHL0H3C29&asin=B09XXW54QG&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C5S7Z5ZL"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41LCShMl2CL._SS36_.jpg"
            },
            {
                "asin": "B09XXW54QG",
                "variationName": "Color",
                "variationValue": "Black & Brass",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21F2mLfgrpL._SS36_.jpg"
            },
            {
                "asin": "B0B25H1NYH",
                "variationName": "Color",
                "variationValue": "Cream",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31TDd4tXO6L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "Only 4 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/21F2mLfgrpL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51okSTSBZiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515bCsQfBjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5175E5qGs L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51A3wvMQWnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21oNKa3jkdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81ZlMOHULTL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4cecb32d-8325-469d-a75e-f461db17baf9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/93ee5230-3674-49de-9663-dddce2a35c4a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f7e4bf8a-f16d-418a-8442-190b3c6faf0b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b12d4015-a394-4a2c-b568-53ec0aa147af/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2865f679-9144-4415-b1b4-f3e242aad46a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/020becf0-2d44-48c1-a722-9f8289e87ec7/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/51HXNtRdj3L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/51HXNtRdj3L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Marshall Store",
            "link": "https://www.amazon.com/stores/Marshall/page/9026DF40-FE9E-4B80-B1C8-E1DFD5435F54?ref_=ast_bln"
        },
        "brand": "Marshall",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 8214,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 2 hrs 15 mins",
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Friday, February 16. Order within 23 hrs 45 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SUPERIOR SIGNATURE SOUND: Sound that is rich, clear and loud, like the artist intended. Experience absolute 360° sound with True Stereophonic, a unique form of multi-directional sound from Marshall – where every spot is a sweet spot.Waterproof : Yes",
            "30+ HOURS OF PORTABLE PLAYTIME: Emberton II offers 30+ hours of portable playtime on a single charge",
            "ROADWORTHY IP67-RATED DESIGN: Tough and resilient, boasting an extremely durable IP67 dust- and water-resistance rating",
            "PAIR, PLAY AND BRING THE LOUD: Emberton II won’t slow you down with a lengthy set-up – pair, play and let the good times roll",
            "MULTI-SPEAKER SESSION WITH STACK MODE: Powered up with Stack Mode – connect to other Emberton II speakers and amplify your sound",
            "Covered by the Zound Industries USA Inc. one-year Limited Warranty. Additional terms apply. See below for details"
        ],
        "description": "Emberton II is a compact portable speaker with the loud and vibrant sound only Marshall can deliver. Two 2’’ full range drivers and two passive radiators bring you the heavy Marshall sound you know and love. Experience absolute 360° sound with True Stereophonic, a unique form of multi-directional sound from Marshall – where every spot is a sweet spot. By separating out the spatial content of stereo recordings, Emberton II produces a sound much larger than its size and outperforms most speakers in its class. Amplify your sound with a multi-speaker Stack Mode session by connecting your speaker to other Emberton II speakers. With 30+ hours of playtime, you can enjoy the superior sound of Marshall for hours on end.This lightweight speaker is tough and resilient, weighing in at only 0.7 kg(1.5 lbs) while boasting an extremely durable and easy-to-use design, making it a must for any occasion. Emberton II has an IP67 dust- and water-resistance rating so it won’t let rain or dirt get in the way of your music. The textured silicone sleeve arcs back to the classic vinyl that encased the original amplifiers and signature details, such as the solid metal grille and iconic Marshall script, echo the legacy of rock ’n’ roll that you know and love.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Portable Audio & Video",
                "link": "https://www.amazon.com/Portable-Audio-Video/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172623"
            },
            {
                "name": "Portable Speakers & Docks",
                "link": "https://www.amazon.com/Speaker-Systems-MP3-Player-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=689637011"
            },
            {
                "name": "Portable Bluetooth Speakers",
                "link": "https://www.amazon.com/bluetooth-speakers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7073956011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2.75 x 6.25 x 2.75 inches"
            },
            {
                "name": "Item Weight",
                "value": "118 Grams"
            },
            {
                "name": "Manufacturer",
                "value": "Zound Industries"
            },
            {
                "name": "Language",
                "value": "German"
            },
            {
                "name": "ASIN",
                "value": "B09XXW54QG"
            },
            {
                "name": "Item model number",
                "value": "1006234"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 8,214 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,268 in Electronics (See Top 100 in Electronics) #61 in Portable Bluetooth Speakers"
            },
            {
                "name": "Date First Available",
                "value": "July 6, 2022"
            },
            {
                "name": "Charging Time",
                "value": "3 Hours"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Marshall"
            },
            {
                "name": "Model Name",
                "value": "Emberton II"
            },
            {
                "name": "Speaker Type",
                "value": "Portable Bluetooth"
            },
            {
                "name": "Connectivity Technology",
                "value": "wireless"
            },
            {
                "name": "Special Feature",
                "value": "Stack Mode, Waterproof"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Emberton II delivers sound that is rich, clear and loud, like the artist intended. Experience absolute 360° sound with True Stereophonic, a unique form of multi-directional sound from Marshall – where every spot is a sweet spot.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fa947268-aed7-4fb9-a827-4ffce531ab5e.__CR0,147,2928,906_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fed8f512-72da-4ec3-92a8-d1250edade15.__CR0,158,1200,742_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fa947268-aed7-4fb9-a827-4ffce531ab5e.__CR0,147,2928,906_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dd14eedc-a52a-478b-8262-5c8346555c85.__CR0,79,1200,742_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/503f8451-d278-4b13-ade4-077e4fbc918e.__CR439,0,1940,1200_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Shaikh Shahnawaz AlamShaikh Shahnawaz Alam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEB5JEKNO3NNDOMDWCOKF2H3WDJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WRMQNY9KE109?ASIN=B09XXW54QG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Simple yet Wonderful",
                "reviewText": "The Marshall Emberton is a testament to Marshall's commitment to quality and innovation. It seamlessly blends timeless design with cutting-edge technology, delivering a speaker that not only looks stunning but also sounds exceptional. The iconic Marshall logo adorns the front, paying homage to the brand’s heritage.Portability and Convenience: The Emberton’s compact size, weighing just 0.7 kilograms, makes it incredibly portable. Slip it into your bag or pocket, and you have a powerful sound system wherever you go.Sound Performance: Don’t be fooled by its size; the Emberton packs a punch. With two 10W drivers, it delivers a surprisingly rich and dynamic sound. The bass is deep and satisfying, the mids are clear, and the highs are crisp, offering a well-balanced audio experience. Even at high volumes, the sound remains distortion-free, showcasing Marshall’s commitment to audio excellence.In conclusion, the Marshall Emberton is a testament to Marshall’s engineering prowess. It defies its size, delivering a sound quality that rivals much larger speakers. Its robust build, impressive battery life, and excellent sound make it a top choice in the realm of portable Bluetooth speakers. Whether you’re a music enthusiast, a frequent traveller, or someone who values premium audio in a compact form, the Marshall Emberton is a stellar choice.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71FN5QqK4hL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71aUIUh2BRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ilk1BXUCL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Omar Enrique Ferrer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFUDKDNGZTOEP2BCFB4CLUELCYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL16ZWDRDNUEI?ASIN=B09XXW54QG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2022",
                "reviewTitle": "5.0 out of 5 stars Great product with usage caveats",
                "reviewText": "A few months ago I had an epiphany. When I was a kid my father loved to have the best in sound equipment in the house, and I would play with graphic equalizers and lay in the floor looking for the best position between the giant speakers to experiment how to better enjoy the music.Today, I hear music in monophonic audio in an old JBL Charge 3 speaker (don't tell my dad, he would be ashame of me).So I started to get better equipment. Now, I live in a small apartment with thin walls in a 3rd floor, so, big amplifiers and so are out of the question, but at least I could get better bluetooth speakers, so I tried the Marshall Emberton II.To say that I impressed with the sound would be an understatement. With out-of-the-box settings, the sound is more than detailed. 80s and 90s music sound outstanding although, Peter Cetera's Glory of Love and Toto's Africa vocals sound as I never heard them before, they are sharp and strong, sometimes detracting just a little from the overall sound (keywords here, really, just a little).This brings me to my first recommendation: do not mess with your applications equalizers if you don't know what you are doing. This speakers were clearly designed to use the manufacturer equalizer settings (more on this later). I have youtube music and amazon prime music (yeah, I know, no spotify), and my sound with the latter was to heavy on bass, to the point of drowning the music and feeling almost distorting. Tron: Legacy's soundtrack sounded specially dreadful, as Daftpunk uses heavy bass in their electronic music for that specific music. I then set the equalization in Amazon Prime Music to flat. It was a different performance altogether. I could ever hear some slight effects they used, that I had not noticed before.Now, one down for the application. Bluetooth pairing used Google Fast Pair, which was seamless and impressive (it shows appears to be a custom Marshall little window, so, it looks cool), but the application takes forever to actually \"discover\" the device, even when it is already paired.When it finally discover it (which was not too long, but took a couple of turning on and off the speaker), the application notified me of a firmware upgrade, which I proceeded to install. The installation failed miserably, so, I temporarily stopped that effort, which I retook successfully a day later. The update was surprisingly big in size, taking around 5 minutes to download, and the application simply marked the update successful while the speaker was still rebooting, which took a few seconds more than what I feel comfortable with, but it went through, and after that, the application again took surprisingly long to detect the speaker.To end that topic, the equalization settings are definitely underwhelming, with only three modes: Marshall, Voice and Push, of which I have only tried Marshall as everybody else says that Voice is just for podcast and such and Push increases bass at the expense of all the other sound bands quality.Lesson learned: unless too picky, when using this speaker, leave your apps equalizers on flat, their profile is that good.Now, to the hardware itself, people will notice this little wonder. Using the nostalgia factor with the Marshall amplifier design was a touch of genius, and the brass button on top is the cherry on top. Some reviews complain about a single button approach to multifunction (power, volume, forward-back, bluetooth pairing has another almost invisible button, which fits because you are not changing your pairing frequently). If we can handle touch control on over-head and in-ear speakers, this button is a piece of cake.My only complain in this department is that, at least for me, an old guy, the signs indicating the functions around the button, being carved in the black speaker, which has texture, are for all intent and purposes invisible, but once you get accustomed, an use the logo as a positional reference that's not a problem anymore.And finally, the little caveat. Single speaker, stereo sound. Let that sink in.Done? Ok, they achieve this trick by separating the sound left and right with drivers back and front respectively (or was it the other way around? well, you get my point). Stereo suffers a little (not too much) because both sources are incredibly close, but it brings this caveat. This speaker should not be set as others, against walls, like in shelf, and so, because you end up drowning one side.The best position for this speaker is in the center of the audio stage, and if you want to appreciate the sound, you should point one side (not the front or back) to you. that way both sources are equally distanced from you so you get a better balance.If you are ok with the caveats this product is worth the price, I definitely recommend it.",
                "reviewVotes": "98 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Henry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQG5VSTRRDUUMCDBLJFGGLEW2PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SJWAA9W247P8?ASIN=B09XXW54QG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Sounds quality, depth",
                "reviewText": "The sounds vs the size is fantastic. Great materials quality and looks great too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SaurabhSaurabh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFC55YR6POHNEQWUNAC6EM4ENAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R335WCAVUZ6HA7?ASIN=B09XXW54QG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Small speaker, big sound !!",
                "reviewText": "It is a loud speaker, excellent sound quality. Feels as if artist is playing right in front of you. It’s 360 music flows evenly around. Great to look at, great to hold, great to carry around. Amazing battery life. Bit of higher bass would have been helpful. May be the best portable speaker in town. Highly recommend!!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61aqixUyb7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Su Doki",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG3MMBXL5ODHUR3EXHWYGOHLNXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PKWJ1ZABTB2S?ASIN=B09XXW54QG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Love, love, love, and love...",
                "reviewText": "So good, I bought two instead of one Marshall Middleton. As wanted, I pair them together to get surround sound, smaller size, and save about $50. Although I own two pairs of Marshall headphones which I'm taking with me to Heaven, at that time - it took awhile for me to commit to buying the speakers. That's because I already own a pair of off-brand Bluetooth speakers that sound so much better and lasts many hours longer than more expensive Beats, Bose, Sony, etc. They have all the other bells-and-whistles specifications, including USB-C, rapid charging, 20+ hours playtime and only cost $30 each. The seller stopped selling them on Amazon.Emberton II was a huge jump in price. The difference from Emberton I - is it will pair with other Marshall speakers. But only the latest models like the Middleton or more Emberton IIs. Also, the Emberton II has a grain texture finish. The hardest part about buying Marshall products is knowing if you actually got authentic products. Knock-offs provide knock-off quality and it hurts the reputation of genuine products with bad reviews. I won't describe the differences in great details. The box is printed on all sides that spills over to other sides. It looks and feels real money, very expensively printed. Inside packaging and booklets too. The speaker is very well crafted down to the smallest details and feels solid. The grills are finished very well, individually, without any rough edges or mistakes and so is the Marshall signature emblem. Look closely.The Emberton II sound quality is phenomenal for all music genres. It's a work of art pumping out sound, spatially separating all the tracks of instruments and voices, to hear them together in one song. This is studio quality at a reasonable price. It exceeds my $30 pair, which already beat-out all the other more expensive speakers, in the only way it could. I heard sounds playing in music I've heard so many times, I can replay it verbatim in my head. Some folks might scoff at this price point comparison. But if I'm completely satisfied at $30 or $170 - no one can entice me to spend $1500 or $15,000 I can afford to pay too. I might purchase more Emberton II's to install wireless speakers throughout the house. For now, I'm pretty satisfied.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zein Camacho",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 22, 2024",
                "reviewTitle": "Excelente opción",
                "reviewText": "Muy buen sonido, claro y con buena potencia. Su tamaño es súper práctico, y el diseño vistoso y de calidad como todas las bocinas Marshall.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 26, 2023",
                "reviewTitle": "Fantastic sound!",
                "reviewText": "This is a great looking speaker with even better sound!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos Duarte",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 24, 2023",
                "reviewTitle": "Muy contento con la adquisición de ésta bocina.",
                "reviewText": "Que me gustó de ésta bocina: Bueno, pues lo primero y mas importante, la calidad del sonido que emite la bocina, es increible que de algo tan pequeño salga un sonido de tan alta calidad. Los materiales de los que está construida se ven sobrios pero elegantes y su diseño es agradable a la vista. Se siente de cosntrucción sólida y compacta. Su botón de funciones es sencillo e intuitivo. El indicador del nivel de bateria es adecuado. La encontré en barata, así que la relación calidad-precio fue excelente.Que no me gustó de la bocina: Ojalá pudiera emitir mayor volumen de sonido, pero creo, por el tamaño, que es lo que puede alcanzar a emtir.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 20, 2023",
                "reviewTitle": "Gotta love it",
                "reviewText": "It’s a typical Marshall, great sound, love it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Milton Chicoli",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 19, 2023",
                "reviewTitle": "Fácil de usar e boa qualidade sonora",
                "reviewText": "O som dela é muito bom, bem equilibrado e agradável. Tem potência sonora e boas respostas tanto em graves como nos agudos. A bateria dura bastante e é fácil de usar. Exceto pelo soquete de recarga que não aceita todos cabos USB-C. O encaixe é pequeno e só o cabo original consegue ficar no local e dar contato. A proteção externa deveria ter mais espaço para o plugue.De resto, ela faz jus à marca com bom acabamento e qualidade dos materiais.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$126.00",
                "sellerName": "North To South (WE REPORT RETURN FRAUD)",
                "sellerRating": "5"
            },
            {
                "price": "$126.05",
                "sellerName": "SaleTime Distributers",
                "sellerRating": "5"
            },
            {
                "price": "$126.15",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}