{
    "remaining_requests": 46649,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Car-Three-Way-Speaker-System/dp/B0007L8BW6",
    "body": {
        "name": "Pyle Car Three Way Speaker System - Pro 6.5 Inch 280 Watt 4 Ohm Mid Tweeter Component Audio Sound Speakers For Car Stereo w/ 40 Oz Magnet, 2.25” Mount Depth Fits Standard OEM - Pyle PLG6.3 (Pair),Yellow/Black",
        "price": "$35.59",
        "originalPrice": "$35.59",
        "rawPrice": 35.59,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Car-Three-Way-Speaker-System/dp/B0007L8BW6",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00GNSM52E"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "VehicleSpeakerSize",
                "variationValue": "3.5 in",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "VehicleSpeakerSize",
                "variationValue": "4 in",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "VehicleSpeakerSize",
                "variationValue": "4 x 10 in",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "VehicleSpeakerSize",
                "variationValue": "4 x 6 in",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "VehicleSpeakerSize",
                "variationValue": "5.25 in",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "VehicleSpeakerSize",
                "variationValue": "6 x 9 in",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0007L8BW6",
                "variationName": "VehicleSpeakerSize",
                "variationValue": "6.5 in",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "SpeakerSystemClass",
                "variationValue": "2-way",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0007L8BW6",
                "variationName": "SpeakerSystemClass",
                "variationValue": "3-way",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "SpeakerSystemClass",
                "variationValue": "8-way",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "SpeakersMaximumOutputPower",
                "variationValue": "120 Watts",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "SpeakersMaximumOutputPower",
                "variationValue": "140 Watts",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "SpeakersMaximumOutputPower",
                "variationValue": "300 Watts",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "SpeakersMaximumOutputPower",
                "variationValue": "180 Watts",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "SpeakersMaximumOutputPower",
                "variationValue": "240 Watts",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0007L8BW6",
                "variationName": "SpeakersMaximumOutputPower",
                "variationValue": "280 Watts",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "SpeakersMaximumOutputPower",
                "variationValue": "500 Watts",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51KcRTIc4cL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Gcf8KbjcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518svWpEX6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lfUUBQglL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51C3SMnUUIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515lU6k5ByL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hAOiOea L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/51kctI4LIfL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/51kctI4LIfL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Pyle Store",
            "link": "https://www.amazon.com/stores/PyleUSA/page/D79E9149-99F8-49A4-8E8C-D24560694FC2?ref_=ast_bln"
        },
        "brand": "PyleUSA",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 4987,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 49 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "THREE-WAY: The Pyle GEAR three-way speaker is the latest series which has been designed and engineered for consistency and high performance. The 6.5 inch features an eye-catching yellow poly injected cone for plenty of stiffness without added weight",
            "LOW IMPEDANCE: The 4 ohm component audio speaker compensates the undersized wire found in many of today’s cars. It also makes the most of every 280 watts peak power w/ 140 watt RMS, your car stereo can deliver with rubber magnet boot cover",
            "40 OZ MAGNET: The 3-way car speaker system has 40 oz. magnet structure that completes the package. Helps to provide smooth, loud and detailed sound. Additional features include 60-20KHz frequency and 2.25” mount depth w/ yellow coated steel basket",
            "POWERFUL FEATURES: The non-fatiguing butyl rubber surround keeps your speakers secure and extends its life. Supported by a super film tweeter for sweet highs, 0.5” neodymium dome for mids, and a high temperature voice coil to round out the low end"
        ],
        "description": "Pyle Model : PLG6.36.5 inch Component Car Speakers6.5'' 280 Watt Three-Way SpeakersStandard 6.5'' Size Fits OEM Locations Yellow Color Poly Injected Cone Non-Fatiguing Butyl Rubber Surround 0.5'' Neodymium Dome Midrange Super Film Tweeter High Temperature Aluminum Voice Coil Strong Capacitor for Excellent Performance Yellow Coated Steel Basket 40 oz. Magnet Structure Rubber Magnet Cover Power Handling: 140 Watts RMS /280 Watts Peak Frequency Response: 60-20KHz Impedance: 4 Ohms Includes Custom Grills, Wires and Installation HardwareMounting Depth: 2.25\"Get in gear with the Pyle Gear series! These speakers are designed to provide the best quality sound for the budget-minded enthusiast. These 6.5', three-way speakers have 280 watts of pure power, supported by a super film tweeter for sweet highs, 0.5' neodymium dome for mids, and a high temperature voice coil to round out the low end. The non-fatiguing butyl rubber surround and yellow-color poly-injected cone provide a sturdy foundation for keeping your sound crystal clear and distortion-free. The 40 oz. magnet structure allows these speakers to achieve a frequency response of 60 Hz to 20 kHz. To boost performance, these speakers have been equipped with a strong capacitor, meaning your speakers will never struggle for power. These speakers look cool, too, thanks to the yellow coated steel basket. Includes custom grills, wires, and installation hardware. You'll hear everything you were meant to hear with Pyle Gear.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Car & Vehicle Electronics",
                "link": "https://www.amazon.com/Vehicle-Electronics/b?ie=UTF8&node=3248684011"
            },
            {
                "name": "Car Electronics",
                "link": "https://www.amazon.com/Car-Electronics/b?ie=UTF8&node=1077068"
            },
            {
                "name": "Car Audio",
                "link": "https://www.amazon.com/Car-Audio-Video-Electronics/b?ie=UTF8&node=226184"
            },
            {
                "name": "Speakers",
                "link": "https://www.amazon.com/Car-Speakers-Subwoofers-Audio-Video/b?ie=UTF8&node=760560"
            },
            {
                "name": "Coaxial Speakers",
                "link": "https://www.amazon.com/Coaxial-Car-Speakers/b?ie=UTF8&node=10980771"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "‎0.7 Kilograms"
            },
            {
                "name": "Product Dimensions",
                "value": "‎3.23 x 6.85 x 6.85 inches"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎PLG6.3"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Wireless Remote",
                "value": "‎No"
            },
            {
                "name": "Depth (inches)",
                "value": "‎2.25 inches"
            },
            {
                "name": "Weight",
                "value": "‎1.78 Kilograms"
            },
            {
                "name": "Speakers Maximum Output Power",
                "value": "‎280 Watts"
            },
            {
                "name": "Number Of Items",
                "value": "‎2"
            },
            {
                "name": "ASIN",
                "value": "B0007L8BW6"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 4,987 ratings"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,205 in Electronics (See Top 100 in Electronics) #89 in Car Coaxial Speakers"
            },
            {
                "name": "Date First Available",
                "value": "April 28, 2005"
            },
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3.23 x 6.85 x 6.85 inches; 1.54 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ PLG6.3"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ April 28, 2005"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Pyle"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0007L8BW6"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ China"
            },
            {
                "name": "Brand",
                "value": "Pyle"
            },
            {
                "name": "Model Name",
                "value": "PLG6.3"
            },
            {
                "name": "Speaker Type",
                "value": "Surround Sound"
            },
            {
                "name": "Connectivity Technology",
                "value": "Coaxial"
            },
            {
                "name": "Special Feature",
                "value": "Speakers"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About us In the late 20th century, Pyle established itself as a premium source for replacement speakers and car audio. By the year 2000, Pyle had undergone a massive transformation, expanding into the nascent market spaces of competitive car audio, home audio, marine audio, and professional audio & musical instruments - our Pyle Pro line. As you sit in your car, you are isolated from outside noise and surrounded by speakers. You become enveloped in sound. We have a wide range of speakers, amplifiers, and head units that will enrich your car audio experience. You’d be surprised at how much better your music can sound with an upgrade from the factory speakers and amplifier.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/666a16ea-ac68-4a16-899b-0974dc06168a.__CR15,0,385,385_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Pyle Car: We have a wide range of speakers, amplifiers, and head units that will enrich your car audio experience. And we don’t just focus on audio at Pyle Car. Cars are a big part of our lives, and we offer a variety of products and accessories that can enhance your experience and turn your car into a modern media system on wheels, including navigation systems, DVD players, and iPod interfaces. At Pyle, we also care about your safety. That’s why we’ve also got a full line of rear and front-facing cameras that can be wired to a monitor in your car – so you can park in those tight spots or see around corners with ease. Pyle Home: Start with your home theater, a stalwart of any modern house. We’ve got projectors, TVs, mounts, and stands, just to get started – all fully equipped with state-of-the-art HD technology, compatible with beautiful video game consoles like Xbox 360, PlayStation 3, and Wii, as well as your favorite Blu-Ray players, for crisp, hi-res images that explode in your eye on a mind-blowing scale. Of course, Pyle Home also carries all the cables and adaptors you need for a fully operational setup that’s sure to be the envy of your neighbors. There’s plenty more to keep you entertained. Bass-expanding mini speakers that run on rechargeable batteries and play your digital music, wherever you go. Perfect for the dorm room or sitting by the pool. Headphones. Vintage turntables – get the look of yesterday’s classic phonographs with today’s high-quality manufacturing standards. Power amplifiers, horn speakers, and waterproof speakers for your garden. Tripods and speaker stands. Pyle Pro: features a huge range of musical instruments, DJ equipment, and accessories for your every need. All of our products have been designed with the professional in mind. You don't just see or hear the quality - you feel it. And whether you're a hard-working musician, studio engineer, or even a budding amateur, Pyle Pro has something to offer. Among Pyle Pro’s most popular items are our PA Systems. Pyle is constantly modernizing these powerful devices to meet the demands of the modern user. Our flagship PAs include wireless microphones, rechargeable batteries, and iPod/iPhone docks. They’re great for use in large areas and events – at churches for weddings, at schools, gyms, birthday parties – anything indoor or outdoor where your voice needs to be heard loud and clear. And they’re easily transportable, thanks to caster wheels and telescoping handles. Use it for any audio – voice, guitar, CD, MP3 player – they handle everything. Pyle’s emerging guitar line is also grabbing the attention of the music industry. Models are available in double-cutaway and Les Paul styles, with solid rosewood bodies in a variety of colors. Beginner kits including Pyle has also introduced a huge variety of effects pedals. Rounding out Pyle Pro’s line are our USB-to-analog converters, including a 2-channel mixer with USB input and output.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/666a16ea-ac68-4a16-899b-0974dc06168a.__CR15,0,385,385_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Nick W.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAMQFD3VFBOCNBHQVH6S6WQGMKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35D36I1ALFWHT?ASIN=B0007L8BW6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 19, 2013",
                "reviewTitle": "5.0 out of 5 stars Exactly what i was expecting!",
                "reviewText": "These arrived a day early: fast shipping. :)Great speakers, very eye catching color and very precise sound for their size. I can't think of a single thing about these that is a turn down. The bass is good even before a full break in has been conducted. Currently they are running from a 25 X 4 MAX amp, that I use for the front/rears in my home theater/ HiFi system. Before these I used Dayton audio B652 bookshelf speakers. Although there is nothing wrong with them, I felt I needed to upgrade. Pyle PLG6.2 were a great choice. my Daytons and a 10\" Polk audio subwoofer are going into a tower enclosure. These handle really well and are made of a sturdy Polypropelene ( can't spell that :) ) cone. Most are paper, and thats a problem. The tweeters are about 240% more efficient than almost all that I have seen in my lifetime. These are a great cheap PAIR of speakers. Don't hesitate to buy them, and for optimal performance learn a little bit about how to use speakers properly, don't assume you know, all speakers are different, it pays off. Grills are nice addition, really easy to mount and cables were small but had clips on them.I recommend this to anyone looking for a visually pleasing and great sounding pair of speakers. Any intelligent person can easily tell you that name brand isn't always the best. With about 3 1/2 years of experience in the speakers/electronics field, I can say that these ARE high-quality and if treated right should last along time.PS: Thank you UPS and Sonix Electronics for that fast shipping!Update: After alot and I mean alot of testing, these worked best in a ported enclosure. Which surprised me because they managed to reach 35 Hz without struggle. These can really take a lot of beatings, these have at least been moved between 20+ enclosures. The only issue is the tweeter on one of the speakers crackles a bit on rare occasion. Not a biggie. But a great buy for anyone.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Atriok",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4Q7TOGLS42SZFRUHHDRPNHKAKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19P35UYSBVYWI?ASIN=B0007L8BW6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Enjoy my story, I recommend",
                "reviewText": "Got these for my old 87' b2200. They fit perfectly and have a nice feel and look to them, sleek and modern, exactly what I was looking for. I connected the battery and turned the key over after I wired them up, my insides filled with butterflies in excitement to hear these little babies make my neighbors call the cops on me. The welcome word appeared on my head unit. quickly, my hands reached for the volume knob turning it clockwise as fast as it would let me. The soft taps against my phone screen hearing each click as I find the perfect song. Scrolling and scrolling... AH, there it is, I click on it, smiling from ear to ear staring at my steering wheel waiting for my terrible connection to load the song. The screen changes... and.. its an ad. I hear a walmart ad as the first thing on these lovely new speakers and it sounded incredle. I've never wanted to take a trip to Walmart, listening to my new speakers, so badly in my entire life. I recommend these speakers if this is the kind of experience your looking for! 😊",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fredrick IhlenfeldFredrick Ihlenfeld",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFPYMBGRWV6VZL25YGEH5LEOLTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GNXZAVSO5I7U?ASIN=B0007L8BW6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "4.0 out of 5 stars Pyle is stepping up",
                "reviewText": "I hit these with some fairly high wattage and wow! They sounded fairly comparable to a Kenwood 6x9 concert series but not as warm sounding the test I used was the same 6x9 boxes running off of the same Kenwood hqr amplifier. After a time of using the tweeters started to sound a bit scratchy also I believe I give them a decent workout. Using a oscilloscope testing for distortion I'm able to dial in. The eight way idea is novel. They're okay really they're not a pro audio speaker they got some pretty nice sounding mid Bass don't expect deep lows unless you're playing at low volume. The magnet on the back side is gargantuan! I imagine this is what helps its performance. The look is something out of an '80s movie with the freaky scientist Neighbor Next Door Maybe. They're not horrible no they actually exceeded my expectations if it weren't for the scratchy Twitter and the less than warm sound they could have gotten five stars. Good value for the money remains to kind of be seen.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/712BIBqVJ8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71QeOifJYIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81l1Kmh+SrL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stack Mojave DesertStack Mojave Desert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBGSP43LDLJROQZH7D2IUESH46Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25SOL5HECK5U3?ASIN=B0007L8BW6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Great price on good speakers",
                "reviewText": "I bought 4 and put them in the ceiling on my travel trailer with a pioneer double din stereo CD am/fm and a sealed 15 inch subwoofer, these 6x9 Pyle sound very good I surprised how good they sound for a budget priced speaker I recommend them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61lvQ2YkEzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marsse",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHH4XO466M6LSCZLORVNWGCIAVMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XQ6GACQNED8V?ASIN=B0007L8BW6",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "1.0 out of 5 stars Do not say it fits my vehicle when it’s way too big",
                "reviewText": "I looked up speakers that fit my 07 dodge truck.I didn’t take my door panel off prior to ordering, so that’s on me but why do things twice. I believed the fit guide. These speakers were 2inches deeper than factory and would break the window. I didn’t install or hear the sound. They look good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jaime C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 16, 2023",
                "reviewTitle": "Buen sonido",
                "reviewText": "Pensé k x el echo de ser de 3 vías el sonido sería con mejor fidelidad pero es loMismo k una de 2 vías pero bien productos lo recomiendo y llego rápido",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denis S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 11, 2023",
                "reviewTitle": "bonne callité",
                "reviewText": "satsfait",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RAUL M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 18, 2022",
                "reviewTitle": "Claridad y potencia inmejorable",
                "reviewText": "Reemplacé las bocinas originales de un Renault KWID las cuales tenían un pésimo sonido, por estas magníficas bocinas PYLE PLG4.2 que tienen una claridad y una potencia 70 watts RMS con excelente sonido. No distorsionan en lo más mínimo, soportan todo el volumen del estéreo sin perder claridad. Eso sí, debido a su sensitividad 88dB, el volumen máximo del estéreo se redujo ligeramente, pero ganó en calidad, refinamiento y cero distorsión. Tienen buena integración entre el tweeter y bocina con lo cual alcanza un amplio rango de frecuencias desde los 90htz hasta los 20000htz. Estoy muy satisfecho con mi compra.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MrFireMrFire",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 16, 2021",
                "reviewTitle": "Great little dash speakers",
                "reviewText": "Bought these speakers for my 2001 suzuki carry. There was no stock speakers originally, only the holes for them. The mounting tabs are designed to easily snap off the ones that you don't need, I was able to drop these right in. Awesome that the come with plenty of wiring, mounting brackets and mounting cutout if needed as well. I'm sure there are other speakers out there that have a better sound quality but these sound great to me and certainly can't beat the price.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7141strDOKL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 15, 2021",
                "reviewTitle": "Measure old speakers and opening first.",
                "reviewText": "The speakers are great for the price and sound good. They did not fit my 2011 Toyota Highlander. Amazon app said they would fit. My advice is to measure where your old speakers were, and maybe more importantly the height, as these speakers stick up a bit too high. Also had to cut around opening just to make them fit width wise. In the end speaker cover sticks up a few mm.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}