{
    "remaining_requests": 46374,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sewell-Direct-SW-29863-12-Deadbolt-12-Pair/dp/B006U3O566",
    "body": {
        "name": "Sewell SW-29863-12 Deadbolt Banana Plugs 12-Pairs by, Gold Plated Speaker Plugs, Quick Connect",
        "price": "$32.15",
        "originalPrice": "",
        "rawPrice": 32.15,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sewell-Direct-SW-29863-12-Deadbolt-12-Pair/dp/B006U3O566",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CV3CPNPH"
        ],
        "asinVariationValues": [
            {
                "asin": "B006U3O566",
                "variationName": "Style",
                "variationValue": "Deadbolt Banana Plugs",
                "price": "$32.15",
                "variationImageURL": ""
            },
            {
                "asin": "B08SQ5JTGQ",
                "variationName": "Style",
                "variationValue": "Deadbolt Right Angle",
                "price": "$32.95",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41LoUo4jzQL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51pYR eQeUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31TVWtZmNOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31imo7K2fSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31W0LfJpkjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41R1QueAxxL.jpg",
            "https://m.media-amazon.com/images/I/51ywqPBz uL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04c15f7f-5cf7-42cc-ad2c-7e2630b42e36/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/9b343db1-c7ad-56dc-9fa9-8f6f166e6e93/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/25fa98f7-b5af-4ff6-ba3d-a2b92771ea8d/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/011a04bf-a166-4a7c-aded-e434de0f4a0a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d2a5492-1522-4a75-83dd-fa4eadcf0a06/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 5,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Sewell Store",
            "link": "https://www.amazon.com/stores/Sewell/page/E8866BBE-70C6-4EE2-A0A8-D58DD7118574?ref_=ast_bln"
        },
        "brand": "Sewell",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 8534,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 13. Order within 56 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fast Lock plugs with self-crimping teeth for an easy and reliable connection",
            "Base Diameter = 13.2mm - Tip Diameter = 4.6mm, but can be compressed to the standard 4mm for a firm fit in your speaker or receiver",
            "24K gold plating over steel tip for crystal clear signal and superior durability",
            "Red and black labels for polarity identification",
            "Maximum wire size 8 AWG (10 AWG suggested)"
        ],
        "description": "Get the most out of your home audio system by ensuring the best connection from your speaker cable to your receiver with the Sewell deadbolt banana plugs. Using self crimping teeth These plugs provide a simple, secure, and low profile connection without requiring soldering or screws. These 1.6” inch plugs are extremely low profile making it so you can put your speakers or receiver closer to the wall. Unlike other banana plugs that use low quality metals like zinc alloy The Sewell deadbolt banana plugs use pure copper and high Quality brass with 24K Gold plating. Installation one of the best things about the deadbolt banana plugs is that installation is quick, secure, and requires no tools. Just follow these steps. Feed the cable through the bottom piece. Push the cable back over the teeth on the bottom piece. Screw the top piece to the bottom one. You're finished. All in all you should only need 10-20 seconds for this entire operation. What are banana plugs? Today, many electronics use the banana plug interface, also known as binding post (referring to This connection in its female form). this female binding post connection that accepts this banana plug is found commonly on virtually all audio/video receivers, speaker wall plates, and more. Banana plugs offer an alternative to inserting a bare speaker wire into the equipment. Wires tend to get pulled out or frizzy after time passes. Banana plugs require only one install, giving you a permanent and robust connector at the end of your speaker wire.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Home Audio",
                "link": "https://www.amazon.com/Home-Audio-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=667846011"
            },
            {
                "name": "Home Audio Accessories",
                "link": "https://www.amazon.com/Home-Audio-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3236443011"
            },
            {
                "name": "Connectors & Adapters",
                "link": "https://www.amazon.com/Audio-Video-Connectors-Adapters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=172544"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 5 x 1 x 6 inches; 13.05 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ SW-29863-12"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ January 5, 2012"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Sewell Development Corp. dba Sewell Direct"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B006U3O566"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ China"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14 in Audio & Video Connectors & Adapters"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 8,534 ratings"
            },
            {
                "name": "Brand",
                "value": "Sewell"
            },
            {
                "name": "Color",
                "value": "multi-color"
            },
            {
                "name": "Material",
                "value": "Copper"
            },
            {
                "name": "Connector Type",
                "value": "Banana Plug"
            },
            {
                "name": "No. of wires",
                "value": "2"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Self-Crimping Teeth Most banana plugs use screws or solder to hold the cable in place. They are secure, but take time to install. Deadbolt banana plugs use self-crimping teeth that provide a secure connection without requiring any screws or solder so you can spend less time setting up your speakers, and more time enjoying them. Deadbolt Banana Plugs The Best Connection. In 30 Seconds. Get the most out of your home audio system by ensuring the best connection from your speaker cable to your receiver with Deadbolt Banana Plugs by Sewell. These high quality plugs use self-crimping teet to provide an extremely secure and low profile connection without solder or screws. That means that you will not only speed up your install time, but their low profile allows you to put your speakers or receiver closer to the wall. Fast-Lock technology Self-crimping teeth Heavy-duty casing 24K gold plated connectors",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/27e9a88e-5818-4fe3-bf76-a8c0d9e2d3fa._SR285,285_.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/fcb1b7f2-f5cb-49ac-8c3e-dd3cda7b1e71._SR230,100_.png"
                ]
            },
            {
                "media_text": "Fast Install Thanks to our Quick-Lock technology, you can install each Deadbolt banana plug in around 30 seconds. Low Profile Deadbolts are one of the smallest banana plugs, giving you a cleaner install and allowing you to keep your equipment closer to the wall. High Quality Components Deadbolts feature connectors that are coated in 24k gold to ensure a great connection that lasts the life of the cable.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/8f82c881-0dde-4eae-b484-04fb43bbc7f8._SL300__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f39cc0c9-3974-4a3a-8629-e79e0357ee8e._SL300__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7f1da15a-af40-4000-8118-1cc40f8f7037._SL300__.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/ed371c70-ede2-476d-bff1-9951562c7694._SR970,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/27e9a88e-5818-4fe3-bf76-a8c0d9e2d3fa._SR285,285_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fcb1b7f2-f5cb-49ac-8c3e-dd3cda7b1e71._SR230,100_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8f82c881-0dde-4eae-b484-04fb43bbc7f8._SL300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f39cc0c9-3974-4a3a-8629-e79e0357ee8e._SL300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7f1da15a-af40-4000-8118-1cc40f8f7037._SL300__.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Secret Angel ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSUZYOVB3BHGXLADUXJ7VRSSOXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N0OEELTXHVP3?ASIN=B006U3O566",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Five Stars for Secure Connections and Clever Design!",
                "reviewText": "The Sewell Deadbolt Right-Angle Banana Plug has earned a stellar five-star rating for its exceptional design and ability to create secure and reliable connections.These banana plugs are a game-changer for anyone seeking a hassle-free solution for speaker connections. The right-angle design not only adds convenience in tight spaces but also ensures a snug fit, minimizing the risk of accidental disconnection.The Deadbolt Right-Angle Banana Plugs are a testament to thoughtful engineering, providing both ease of use and a high level of performance. Whether used by audio enthusiasts or professionals, these plugs deliver on their promise of creating solid and dependable connections.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joseph",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3OZTLQZ53GCOSUVZGK5UUJIJ7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV8ZHM7YCDWPL?ASIN=B006U3O566",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2014",
                "reviewTitle": "5.0 out of 5 stars Great Banana Plugs",
                "reviewText": "I spent a lot of time researching various types and brands of banana plugs and finally decided to purchase Deadbolt. Initially I wanted plugs with two set screws since I already own and use some with great results. However, I decided to purchase these because they are shorter which means they don't protrude as far out from my receiver and they have a nice grip for removing and inserting. I wasn't sure if the termination design would be as strong as set screws but it is every bit as secure and probably more. I use these on my receiver for 5 speaker connections and on my wall plate for two ceiling speakers. I have used them twice because I had ordered new speaker wire which didn't arrive until a couple of days later, and, being impatient I wanted to connect them immediately to see how well they performed. Now, before I proceed I want to mention that I only use pure copper, and not the copper clad aluminum that many companies use. I personally like the oxygen reduced copper that Monoprice sells. Copper is copper and don't let anyone try to fool you. As long as the gauge is sufficient for the distance you are running it you will not yield better results using more expensive wire. I use 14 gauge which is thicker than necessary, 16 would suffice but I like to be safe in case I make longer runs or decide to buy 4 ohm speakers which I may some day. These connectors are made of brass and copper, the connector being pure copper and the casing brass. I prefer a copper connector for conductivity purposes with gold plating reducing the chance of corrosion. I don't believe brass connectors would make any audible difference but I prefer copper.Performance: The first time I connected these I spread the wires out all around the connector, which having only 41 strands made for a very thin layer of wires and they weren't as even as I would have liked, but since I knew I would be doing it again when my wire arrived I just went with it. I realize I just said that copper is copper and there is not audible difference in sound when using different brands of wire or high dollar ones vs low dollar as long as the wire is copper and properly shielded. However, with regard to the connectors you do need to make good terminations. As soon as I turned on the surround sound I noticed the volume wasn't as loud as it was before with bare wire connections. Then my wife even complained about the sound level so I knew it wasn't just me. I believe the problem was how I spread all of the wires around the teeth so thinned out that some or many of the wires were not being crimped well in the teeth.2nd Time Connecting: This time I divided the strands in two, then folded one half of the wires over one side of the teeth and the other half of wires across from them. I did spread them out a little but kept them fairly thick on the teeth so they would crimp better. I turned on my surround sound and the sound level was perfect, just like before when I used bare wire to connect to the terminals.I rated these plugs 5 stars since I do get the same audio as with bare wire terminations. The plugs appear to be very high quality and have a nice weight to them. They look very nice on the back of my receiver and the wall plate and have made connecting speaker to the receiver fast and easy. I strongly recommend these plugs and I will buy them again when I add more speakers. At present I am using them on two receivers for 5.1 surround sound. I still use bare wire on my speakers since they are easier to access but may change them too in the future.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CoastalCoastal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFT77Y4B52NIJNWPBGHTSTFY44Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNFXX75T6HW3Y?ASIN=B006U3O566",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 21, 2022",
                "reviewTitle": "5.0 out of 5 stars Perfect, high quality, speaker wire Banana plugs",
                "reviewText": "My absolute favorite banana plugs for my high end audiophile home theater systems speaker needs. Using Sewell connectors with my very high end audio equipment and equally high end speakers. You can buy rolls of high quality speaker wire so you can quickly and easily make high quality, custom length, fast to connect, speaker wires. Helps keep your wiring looking need and organized, is easy to connect and disconnect, and works works with basically any gauge of speaker wire. Most speaker from the 1990’s to today and most audio equipment can use banana plugs. With gold plating make for fantastic contacts. And so much cheaper than buying premade speaker cables.An additional plus is that these Sewell banana plugs use the same base as the Sewell 90 degree banana plugs, and ‘Flex Pin’ connectors. It makes it really easy to change to connector head to another style or to change your speakers to a model that needs a different connector.I have used this brand and style of connectors to hook up 7 and 9 channel home theater and music listening room in multiple homes. At this point I would never consider using another brand.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71CYuIQYsTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. J. ibarra Valerio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 3, 2023",
                "reviewTitle": "Gran eleccion a bajo costo",
                "reviewText": "Remplace unas Monster y me sorptendio estas estan mejor hechas y vienen 12 por el precio de 1 par de Monster el Sonido Igual",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gustavo ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 14, 2023",
                "reviewTitle": "Cumplen su funcion",
                "reviewText": "Los mejores banana plug que he usado, el tamaño es perfecto para lugares reducidos. 100% recomendados.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ankit s.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 22, 2021",
                "reviewTitle": "Best banana plugs in india",
                "reviewText": "I've tried so many Banana plugs previously but these are best of them",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnthonyAnthony",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 21, 2021",
                "reviewTitle": "Excellent quality banana plugs dont hesitate buy them",
                "reviewText": "Great quality. Easy to install. Inserted spliced wire and fanned out coppering. Lower the base slightly to tuck wiring in neatly then lifted up and squeezed wirings snugly around cylinder before attaching the flex pin top. Match colour coding to the flex pin connectors keeps life simple. dont short in your amp or speakers After, that just sit back and listen to some good music. Would purchase the Silverback Right Angle Banana Plugs.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81bhzXawAVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81IOvQdCF0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81h+UJKFOGL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "C Taylor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 12, 2023",
                "reviewTitle": "Speaker plugs",
                "reviewText": "Good and easy to use",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$32.95",
                "sellerName": "Sewell Direct Corp",
                "sellerRating": "4.5"
            }
        ]
    }
}