{
    "remaining_requests": 46369,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bluetooth-Adapter-Streaming-Wireless-Speakers/dp/B016NUTG5K",
    "body": {
        "name": "esinkin Bluetooth Audio Adapter for Music Streaming Sound System, Wireless Audio Adapter Works with Smartphones and Tablets, Wireless Adapter for Speakers",
        "price": "$23.99",
        "originalPrice": "$45.90",
        "rawPrice": 23.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bluetooth-Adapter-Streaming-Wireless-Speakers/dp/B016NUTG5K",
        "soldBy": {
            "sellerID": "A2DF5PP7S295J7",
            "name": "Esinkin Inc.",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2DF5PP7S295J7&asin=B016NUTG5K&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "20",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41H8RO  GFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41LJhfigv1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31vQhGSK2RL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31l1RHHFI0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/414qnG6rt-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41z4tHrkgVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/813MGPanDzL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f49bfbc9-c668-4475-9d95-06e1d4d8bb29/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0575eb7-b4da-47b8-beec-e567cf9dba1f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a7af173-8217-4a9b-b60d-65793447255a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/05fc0b80-eba6-4bc6-a06c-07ad8ef6e922/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1209d749-640f-4cfd-bb52-da8309b32658/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b55b9d44-ded0-4e61-b6eb-d142216fe583/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the esinkin Store",
            "link": "https://www.amazon.com/stores/Focusonproductqualityuserexperienceandaddfuntoyourlife/page/60F625A3-DE28-43AE-A986-B2819B7D8486?ref_=ast_bln"
        },
        "brand": "Focusonproductqualityuserexperienceandaddfuntoyourlife",
        "merchantInfo": "Esinkin Inc.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 44407,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 23 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Listen music wireless: Connect with computer speakers, home stereo systems or other speaker systems via the 3.5 mm or RCA cable, then pair with the Bluetooth audio devices such as smartphones or tablet for streaming music.",
            "Easy setup and automatic reconnect: Pair your device to the adapter once with a single button press. It can reconnect automatically with the previously paired device.",
            "Wireless range: Indoors(without obstacles) connect rang up 30-40 ft (10-12 m).",
            "Works with most device: Bluetooth enabled device including smartphones, tablets, computers, laptops upon and any powered PC speakers, home stereo systems and A/V receivers.",
            "NOTE: This adapter doesn't have built-in battery, power by AC to DC power adapter or USB cable. This product is a bluetooth receiver ONLY, not a bluetooth transmitter. Only to give Bluetooth capabilities to an existing stereo / powered speaker / PA."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b?ie=UTF8&node=172504"
            },
            {
                "name": "Network Adapters",
                "link": "https://www.amazon.com/Computer-Network-Adapters/b?ie=UTF8&node=490499011"
            },
            {
                "name": "Bluetooth Network Adapters",
                "link": "https://www.amazon.com/Bluetooth-Computer-Network-Adapters/b?ie=UTF8&node=3015437011"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Type",
                "value": "‎Bluetooth"
            },
            {
                "name": "Brand",
                "value": "‎esinkin"
            },
            {
                "name": "Item model number",
                "value": "‎W29-us"
            },
            {
                "name": "Item Weight",
                "value": "‎3.52 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎1.97 x 1.97 x 0.94 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "1.97 x 1.97 x 0.94 inches"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Manufacturer",
                "value": "‎esinkin"
            },
            {
                "name": "ASIN",
                "value": "‎B016NUTG5K"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎October 15, 2015"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 44,407 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2 in Bluetooth Network Adapters"
            },
            {
                "name": "Compatible Devices",
                "value": "Tablet, Smartphone"
            },
            {
                "name": "Specific Uses For Product",
                "value": "1"
            },
            {
                "name": "Connector Type",
                "value": "RCA, Auxiliary"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Easy to Setup Pair your Bluetooth enabled devices to the Bluetooth receiver with a single button short press. Press the bluetooth button to enter the pairing mode. Connect Range This adapter bluetooth reception range up to 10-12 meters (30-40 feet). After a successful connection, it will stay connected. Small This product has a small size and lightweight. Does not take up space. What's in the package Bluetooth ReceiverAC to DC Power Adapter3.5mm to RCA Audio CableUSB Power CableUser Manual",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95af00c6-891a-495f-b6b5-b8600dbc496f.__CR0,53,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6065ff1a-a655-45ff-94c6-264805f8c9c7.__CR0,38,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/783720e1-01c2-448c-9fae-1075fab7a4cf.__CR0,38,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4d104c5b-5ace-4782-b72c-f0c95eef41a6.__CR0,44,300,225_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "2023 upgraded (This unit just a bluetooth receiver not a bluetooth transmitter) The top Bluetooth button adds pause and shutdown functions. Click button means START/PAUSE. Hold the button 3 sec means ON/OFF. This unit doesn't transmit Bluetooth signal. Only receives Bluetooth signal from phone media or PC/server music sources How is the volume controlled? This bluetooth receiver doesn't have a volume control. You can control volume from your phone and your amplifier receiver, also set the volume on amplifier receiver then control final volume from phone to turn up and down. Can I transmit music from a CD player to a bluetooth speaker? This is a bluetooth receiving device which hard wires into a non-Bluetooth audio system as an additional input source that receives audio from Bluetooth devices such as your phone or computer .You need a Bluetooth transmitter What's in the box? 1 x Bluetooth receiver 1 x AC to DC Power adapter 1 x 3.5mm to RCA Audio cable 1 x USB Power cable 1 x User manual",
                "media_link": []
            },
            {
                "media_text": "Esinkin Bluetooth Receiver Add to Cart Bluetooth Receiver Add to Cart AC to DC Power Adapter Add to Cart 3.5mm to RCA Audio Cable Add to Cart USB Power Cable Add to Cart Customer Reviews 4.5 out of 5 stars 44,407 4.5 out of 5 stars 939 4.4 out of 5 stars 28 4.5 out of 5 stars 16 4.2 out of 5 stars 18 Price $23.99$23.99 $23.95$23.95 $8.99$8.99 $8.99$8.99 $7.99$7.99 Bluetooth ✔ ✔ ✘ ✘ ✘ NFC ✘ ✔ ✘ ✘ ✘ ON/OFF Button ✔ ✘ ✘ ✘ ✘ Include AC to DC Power Adapter ✔ ✔ ✔ ✘ ✘ Include 3.5mm to RCA Cable ✔ ✔ ✘ ✔ ✘ Include USB Power Cable ✔ ✘ ✘ ✘ ✔",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95af00c6-891a-495f-b6b5-b8600dbc496f.__CR0,53,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6065ff1a-a655-45ff-94c6-264805f8c9c7.__CR0,38,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/783720e1-01c2-448c-9fae-1075fab7a4cf.__CR0,38,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4d104c5b-5ace-4782-b72c-f0c95eef41a6.__CR0,44,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-brand-media/c04aa870cf0a08400af3317f0f3bf095.w1680.h1680.__CR93,0,1493,1680_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a0822fa2-4e08-466a-914d-56605fced309.__CR17,0,267,300_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7006d9b7-b68a-4a76-a751-ab66ae60469f.__CR17,0,267,300_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bae0253c-9c8c-4d53-aa79-c191ccc9f76a.__CR719,0,2402,2702_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/76608362-8382-43de-8cb0-b23639acff36.__CR83,0,1333,1500_PT0_SX200_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Nate",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7IXO6PADOXBQUHWWGE6JX2D2VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26AN6U72NDIWV?ASIN=B016NUTG5K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Arrordable high quality bluetooth receiver",
                "reviewText": "I bought affordable Dual speakers for our deck and screen porch. Our older-but-still-quality Yamaha 7.1 amplifier offers separate A/B speakers that we've connected for those speakers, but I've never had a way to manage sound outside. PROBLEM SOLVED! My wife can now play audio books or music from her phone from the screen porch about 30' away. Whether main living area, screen porch or main deck, the tiny Esinkin bluetooth receiver does a great job. As for the sound in the main living area, it sounds great. It's a terrific price for a very impressive, simple device. As it's so small and looks great, I put it on top of our entertainment center behind the TV where it's barely noticeable. Tiny but powerful, I'm very pleased. We'll see how it holds up, but all reviews point to it doing well over time.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VetPilot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVBVUA4TR2YPELJ2BYKQ4DJCOFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CZKSZI3LPT17?ASIN=B016NUTG5K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2022",
                "reviewTitle": "5.0 out of 5 stars Extremely Useful",
                "reviewText": "Well worth buying if you are looking to make non-wireless audio equipment wireless, using Bluetooth technology. As long as the equipment you want to make wireless has either a 3.5mm audio port, or RCA type Left & Right audio ports you are all set. In my case I wanted to improve connectivity to an excellent (but out-of-date) Bose CD/Radio player. I used the included RCA connections for the radio, and this wireless adapter's corresponding female connections. Then I finished it by using the included power adapter required to power this Bluetooth adapter. When placing my Samsung S5 phone into Bluetooth mode, and after pairing the two devices, it connected immediately to this adapter, transferring all sound to the Bose radio. Both the phone and Bose radio had control over the volume range, although the stereo will have the greatest control, as expected. The resulting audio sound output is excellent - better than I would ever get from the Samsung phone. Obviously, the broadcast quality from a radio station is simply passing through to the audio equipment (and the resulting sound quality is now solely dependent on the quality of the audio equipment you are using). Note: If the sound origin is from your phone, double check the Bluetooth settings for this device, AFTER you have connected to the adapter (select the settings icon adjacent to the name of this adapter to make sure, at a minimum, that Audio is active, and Calls [if available] is deactivated). While you are at it, you have the opportunity to rename the device - especially if you plan to install more of them. With this unit, don't bother to look for an On/Off feature on the unit itself. There isn't one. It's just a small circuit board and it won't put you in the poor-house if it runs 24/7. However - should you be obsessed with only having it on when you use it, just unplug it from the unit itself, instead of unplugging it from an outlet. But a word of caution - No Circuit board likes power surges, brown-outs, or lightening strikes. If you temporarily have electrical supply issues due to an approaching storm, I would immediately unplug it from the wall outlet ASAP, thereby protecting the adapter and the power supply unit. Several folks have, in their review, mentioned that when turning on Bluetooth with their device, it would immediately connect to the adapter (after it's been paired for the first time, of course) rather than let you pick what Bluetooth device you wanted to connect with, as most other Bluetooth devices do. This is true. However, I don't find that to be troublesome at all. First it shows great Reliability and Repeatability (two good Quality Assurance characteristics), and secondly, you can always select another Bluetooth choice displayed, and it will connect to it, and disconnect this adapter. Speaking of Reliability, I have run this Bluetooth adapter for hours at a time, and it has never dropped out, sought re-connection, or displayed any other anomaly.Now, a couple of extra notes about this adapter: Pairing the unit to your originating source is simple. Press and hold the square button in the middle of the unit until the unit has a blinking blue light. Go to your phone/computer/other device that has Bluetooth on, and select this adapter. After it is paired, it will always connect in future use. The power adapter cord measures about 71 inches long. Very generous to reach a wall outlet without using extension cords. However , a multiple outlet extender with surge protection would not be a bad idea. The RCA cord from the adapter to your attached system measures about 61 inches - plenty to do the job. The included pictorial instructions show a variety of connection choices and is very good. The box that everything comes in is very strong & sturdy (a keeper), but I found the slide-on outer \"description-advertising\" cover to be very tight to the box and wouldn't come off without tearing it, which I didn't want to do. So, I used a thin knife and slid it along the glue line of the overlapping paper (where the bar-code is printed), and it came right off. Afterwords, I used one run of adhesive tape to rejoin them with just a little more separation so that the slide-on cover would be easier for on/off use.The unit does provide a 3.5mm cable connector, but I did not try it. I used the RCA cable instead, which works as I expected it to. Before I discovered and bought this adapter, I had connected a 3.5mm connector directly from my phone to the same type connection on the Bose radio, and although it played, the volume was next to nothing, even with everything turned up, both on the phone and the Bose radio. Not acceptable. On top of that, it would force the phone to be hardwire tethered to the Bose radio. Again, not acceptable. The only solution was to buy and use this great adapter as described earlier. This also gives me freedom to go into any other room and still be connected, and listen to audio (locally from the phone, or via a streaming internet connection ) broadcast through the Bose radio!I love it when a plan comes together! I plan to buy two more of these, one to connect to my TV, and one for a spare backup. Enjoy one of these! You won't be disappointed!",
                "reviewVotes": "134 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Keith J.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAZMFHNI2KDJZEJORBOIPI55CKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V9FOMXH8K64I?ASIN=B016NUTG5K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent product. Great Value",
                "reviewText": "I don't write many reviews but this product deserves 5 stars and a review. First, it comes well-packaged. Very secure. In fact, It was the toughest challenge with the product. Getting it out of the box. But all the necessary cables are included and it was extremely easy to set up. Essentially, there was nothing to set up. I plugged in my RCA cables from my Bose speakers and plugged the adapter into the wall outlet. I opened Bluetooth on my Android Samsung 10 phone and scanned for the Esinkin Bluetooth receiver. Within a minute they were paired and connected. No frustration which I have had with other Bluetooth devices. It works perfectly. Extremely pleased and I would give it more stars if possible.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVW6YE5OPKPDZRF6DMIUY5GKYQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NH20M8742UR3?ASIN=B016NUTG5K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "4.0 out of 5 stars Good Sound Quality, Volume output is much lower than the other components",
                "reviewText": "Works wellEasy to connect to my tabletGood Sound QualityVolume output is much lower than the other components, I have to have the volume on the tablet maxed and still have to turn the receiver way up to get a volume similar to the CD player, radio, TV, or turn table.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Santiago Rodriguez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3AVDKHD57P6XPCBFGGAN6XA5GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S51OUD6TRAS1?ASIN=B016NUTG5K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars The Bluetooth reach of this little thing is amazing",
                "reviewText": "The product is perfect for its purpose, the coverage and stability of the Bluetooth is amazing, it reaches the whole house, everything connects to it, I haven't had any signal drops and it sounds great. On point with its functionality 10/10.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kathleen Pici",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAK4RJIW3PM5PYPWA26QSU5WZ2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH4F907LQ5DGJ?ASIN=B016NUTG5K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Just bought, but so far impressed",
                "reviewText": "Only have had it for 24 hours, but connection and distance capability is impressive. The price was very reasonable. I am only getting mono with the RCA from stereo to the aux cord end into the adapter, but I am going to try using an RCA. For my purposes it works fine for the speakers in the ceiling and the mono isn’t a factor , but volume is a little low.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SMoore",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 2, 2023",
                "reviewTitle": "Works as Described and Easy to Set Up",
                "reviewText": "I am using this to send Bluetooth streams to a Denon receiver. Works well. I found the pictograph instructions easy to follow notwithstanding I had read reviews that others thought they were deficient. Possibly, they have been updated since then. Easy to link my phone to this receiver. This unit turns on automatically when powered up. If you wish to turn it on or off manually, then you depress the power button (the only button) for 3 seconds. To get it to go into pairing mode when it is powered on you press the button quickly and release it. This is backwards to what I would normally expect but doesn't cause any problems in actual use. The sound seems fine. I have only had it for two weeks so cannot comment on its longevity.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOSE B.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 25, 2023",
                "reviewTitle": "ENTREGA RÁPIDA BUEN PRECIO",
                "reviewText": "FUNCIONA PERFECTAMENTE",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ARAB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 28, 2023",
                "reviewTitle": "All should have!",
                "reviewText": "Amazing product and very easy to install and use. Touch and go!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on March 24, 2022",
                "reviewTitle": "ok, peccato il tasto di accensione",
                "reviewText": "funziona benissimo, piccolo ed elegante, unico difetto è l'essere sempre acceso; per chiuderlo devi staccarlo dalla corrente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Skale64",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 20, 2021",
                "reviewTitle": "Excellent",
                "reviewText": "Branché sur un ampli Yamaha d'ancienne génération mais fonctionnant parfaitement, le voila remis au gout du jour. ce petit appareil est facile a connecter et a appairer. la qualité audio est bonne pour du streaming et sur mon ampli il y a deux sortie 240v dont une libre il est branché dessus comme cela il s'allume et c'éteint en même temps que l'ampli.Nickel surtout pour le prix",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}