{
    "remaining_requests": 46469,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/JBL-CHARGE-Portable-Bluetooth-Waterproof/dp/B09DHMGSF6",
    "body": {
        "name": "JBL CHARGE 5 - Portable Bluetooth Speaker with IP67 Waterproof and USB Charge out - Teal (Renewed)",
        "price": "$99.95",
        "originalPrice": "$155.78",
        "rawPrice": 99.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/JBL-CHARGE-Portable-Bluetooth-Waterproof/dp/B09DHMGSF6",
        "soldBy": {
            "sellerID": "AED492BX4II6G",
            "name": "Acoustic Sound Design Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AED492BX4II6G&asin=B09DHMGSF6&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B094LCPQ6T"
        ],
        "asinVariationValues": [
            {
                "asin": "B094LS37Z4",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$109.97",
                "variationImageURL": "https://m.media-amazon.com/images/I/41A3m9muWPL._SS36_.jpg"
            },
            {
                "asin": "B095FTDJB6",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$122.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41RUwIDy+5L._SS36_.jpg"
            },
            {
                "asin": "B0962GH52L",
                "variationName": "Color",
                "variationValue": "Camouflage",
                "price": "$129.77",
                "variationImageURL": "https://m.media-amazon.com/images/I/41uUT5KK7RL._SS36_.jpg"
            },
            {
                "asin": "B09H7VNHSY",
                "variationName": "Color",
                "variationValue": "Gray",
                "price": "$129.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41QZFh39b3L._SS36_.jpg"
            },
            {
                "asin": "B096L488N3",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "$109.95",
                "variationImageURL": "https://m.media-amazon.com/images/I/41RxlAgTpYL._SS36_.jpg"
            },
            {
                "asin": "B09DHMGSF6",
                "variationName": "Color",
                "variationValue": "Teal",
                "price": "$99.95",
                "variationImageURL": "https://m.media-amazon.com/images/I/414S2TkalHL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/414S2TkalHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41RMwR8uxXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41uWPUZ TDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41picWpZrAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tcVrn0GFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/313QjFqH0DL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Q6ysRT4SL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "Acoustic Sound Design Inc",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 3406,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 22 - 26. Order within 15 hrs 8 mins."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "JBL Pro Sound with an optimized long excursion driver, separate tweeter and dual JBL bass radiators",
            "Long lasting battery delivers up to 20 hours of playtime",
            "Take the Charge with you anywhere due to its IP67 waterproof and dustproof rating",
            "PartyBoost feature allows you to pair two JBL PartyBoost-compatible speakers together in stereo or link multiple JBL PartyBoost-compatible speakers for really incredible sound",
            "Built-in powerbank lets you charge your devices without taking a break"
        ],
        "description": "This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Portable Audio & Video",
                "link": "https://www.amazon.com/Portable-Audio-Video/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172623"
            },
            {
                "name": "Portable Speakers & Docks",
                "link": "https://www.amazon.com/Speaker-Systems-MP3-Player-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=689637011"
            },
            {
                "name": "Portable Bluetooth Speakers",
                "link": "https://www.amazon.com/bluetooth-speakers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7073956011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "10 x 9 x 6 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.1 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B09DHMGSF6"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 3,406 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,791 in Electronics (See Top 100 in Electronics) #1 in Renewed Portable Bluetooth Speakers #52 in Portable Bluetooth Speakers #651 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "August 24, 2021"
            },
            {
                "name": "Manufacturer",
                "value": "JBL"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Speakers Maximum Output Power",
                "value": "40 Watts"
            },
            {
                "name": "Charging Time",
                "value": "20 Hours"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "JBL"
            },
            {
                "name": "Model Name",
                "value": "JBL Charge 5 - Teal"
            },
            {
                "name": "Speaker Type",
                "value": "Multi Room"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Special Feature",
                "value": "Portable, Stereo pairing"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tazio Passariello",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV2XT5FI2LPGINQX6SYSIWQC25A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L3ED2D0443DJ?ASIN=B09DHMGSF6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2023",
                "reviewTitle": "5.0 out of 5 stars DONT EVEN THINK ABOUT IT BUY IT RIGHT NOW!!!!!!!!!!!",
                "reviewText": "ok this is going to be a long a** review because there is to much to say. let me start off with the speaker itself. its boxed super nicely so you know you're in good care. second it may seem like a lot of money but believe me this is an amazing deal. a year or 2 back i got a huge speaker from amazon (the big box ones) but it was only 50 bucks. i thought it was loud. but believe it or not this is as loud if not louder. and the quality of the sound is out of this world. the base is amazing. its sand/water/dust proof. NOW the one tiny thing is its not heavy or anything its a perfect weight butttttttt if you plan to carry it a lot just in your hands it is thick and heavy enough and does not have an amazing grip made for your hands to hold for long times. so its not portable as in walk wherever you want with it in your hands but there are things you can buy for that luckily. NOW if ur setting it down its not going anywhere the grips on the bottom are amazing. its stitched super nicely also its fast and lasts long. so yes its portable. there is even an app for it its also super durable. ok now its crazy that i am even saying this about it but the charging cord is amazing. believe it or not i never knew this until a bit ago but different USB cords actually dispose of different amounts of electricity and speed and rate of flow of it. so it can be super dangerous to mix up cords. Nowadays luckily most products have safety systems for that. Anyway the dope thing about this is the actual little plastic pices inside where it would plug into a brick is ORANGE. so you can tell its a jbl one. for example, 99% of companies make it black blue and sometimes white. but jbl made it orange so now you know thats your JBL cord. it even comes with a cool little information booklet to tell you about it. so now let me rate for everything out of 10:portable: 9/10audio quality: 10/10base: 10/10battery life: 10/10durability: N/A (not fully tested it yet but so far its been a 10/10)packaged: 10/10price: 10/10weight: (not really a way to judge this but its a tiny over 2 pounds so about what i thought so since it did not super exceed weight expectations 9/10)overall: 9.5/10what i would rate other competitors on average: 7.5/10do note this can actually be a dangerous speaker around younger people and pets and even adults because it does actually get really loud and over time this is very damaging to your ears. i really could write a million more things but i am in high school so i have to get back to homework now while listening to music. (really this can be used for anything and even though this is refurbished i promise you you would never know really i have owned a new one.)EDIT:Soooo we did end up having a few problems. So one thing is the sand. It’s amazing in water but in the sand it will get only a few but still a few pieces of it stuck in the grills/netting. The one other thing is how choppy the Bluetooth can get if u go farther then 20 feet. Now idk if that’s because I have a iPhone XR (now we are on the 15 so 5 or 4 gens old if apple had skipped a year in between) I would still give a 5 stars since after a week I did manage to get the sand out with the point of a super sharp knife. But I have no idea about the Bluetooth thing. It’s pretty annoying as I saw somewhere it should do wayyyyy farther than that but again it could be my phone. I will give an update number 2 after trying with different phones and seeing if that fixes it. Still 100% recommend it’s still portable and super loud. Oh but if you have young ones or even other adults tell them to not touch the subs on each side of the speaker (the things that bounce in and out with base to help creat it and amplify it.) it’s very bad to touch those and it will damage it either over time or instantly. Some 3rd parties have made nets to cover that area if you have ones that don’t listen I would invest in one. An amazing products still. JBL has mastered audio. The entire family loves it.EDIT 2: ok this is to good. so when i first ordered it it accidentally went to my moms card. i offered to pay her back and but she said no and said as soon as it arrived we are returning. fast forward to my 1st edit she loves it blah blah blah everyone loves it people come up to me say it so good they love it they want it. but wait it gets so much better. NOWWWW my mom wants one for x mas. she told me this morning she has fallen in love with it so much and now wants one. this thing is the most addictive product ever. its hard to explain sound quality. you just have to experience amazing sound quality to love and want good sound quality. trust me if my mom now loves this she really love it. i am in my mid-teens and my mom not in my entire life has ever said she wants something for x mas that i own and that she wanted to return. this is serious stuff right here i promise you will want it. your entire family will.Now i will say that after having it for about 1 month (close enough) and carrying it so much if you not a somewhat strong/ young person it will get tiring on you are really quick to hold it for long periods of time. but you can go pick yourself up a $15 case for it with a handle/strap. I am now changing the new overall rating.JBL Charge 5 New overall rating: 9.8/10Compared to other similar models and prices: 10/10",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "station9",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ4Y76SNNTYPOL6OEZTVQIDXZWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12M5LNDQUN9RO?ASIN=B09DHMGSF6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars JBL Charge 5 Bluetooth speaker",
                "reviewText": "I went back and forth and looked at a lot of reviews before choosing this product. I have had JBL products before and know they make good quality products. I wanted a portable speaker that had a little more sound than what I had. Upon getting this speaker it was boxed really nicely and came packaged very well. The literature that was included was nicely printed and the quick start instructions made it easy to get started. The speaker is easy to pair with any bluetooth device and use once you get it paired. I love the fact that you pretty much turn the speaker on and it automatically pairs to your device. This little speaker is well made and it waterproof so that you don't have to worry about your investment getting ruined if you get it wet. This speaker produces a lot of sound and surprisingly a lot of bass for it's size, I ended up buying two of these for my backyard and they pair up easily for stereo sound. Just one of these would fill up my backyard with sound but with both there is definitely plenty of sound to go around and they sound great. I highly recommend this product and will be buying more JBL products in the future. There are also plenty of color choices if you are looking for a product to fit your style.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sonia Ashburn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5VZ7B2EOBX3NTW7FDRTA3QBPRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS06P3DNPANGN?ASIN=B09DHMGSF6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2023",
                "reviewTitle": "5.0 out of 5 stars This speaker is the best one for the money",
                "reviewText": "I did thorough research comparing the JBL \"flip\", \"charge\" and \"extreme\" product lines. I also compared them to the Bose SoundLink Flex. I wanted something portable, but with good sound quality and didn't want to spend a lot of money. I'm a big Bose fan, but it became clear to me that the JBL Charge 5 was the best for the money. The sound quality of the Bose is more comparable to the flip 5 or 6,. The Charge 5, being physically larger that the Bose, just outperforms the it having better sound quality and a wider range. The JBL extreme is a good product, but it's less portable than what I wanted and costs significantly more. I bought the Charge 5 under \"Amazon Renewed\" at a significant discount. I actually got it cheaper than the Bose which, as I said above, is more like the smaller JBL flip product line. When I received it, it appeared completely new. There was no way to know that the product was \"renewed\". So I highly recommend \"Amazon renewed\" if you're looking to save a few bucks.As for the speaker itself, the Charge 5 is less portable than the JBL flip. It's clearly not designed to be carried around when hiking or jogging and such. It has no handle or strap, though one can be purchased separately for about $15. It has set of rubber \"feet\" on its bottom that keep it from rolling when placed flat. It's ideal for sitting on a table or bench when having a picnic or BBQ party (this is what I use it for). It has very good bass and mid-range sound and it's plenty loud. Even at high volumes, I don't hear a lot of distortion. I would rate the speaker sound performance as very good. They claim it will play for 20 hours. I've never used it for that long, but I've used it for several hours at high volume and it never died. It also recharges to full battery in just a few hours. It's very quick to link up via Wi-Fi and I've walked a good distance from it and it doesn't lose connection.There are cheaper Wi-Fi speakers on the market, but from what I've read, the sound quality isn't usually as good as this product. I would recommend spending a few extra bucks for this one. If you want something you can walk around with, look at the JBL flip 5 or 6. If you want a huge block-party type speaker, this one might be a little small. However, if you're in the middle and want a nice backyard speaker, this is definitely the one. When used indoors, it is really loud.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wiggy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEI3JCERHDAYHTPHXVNQYHBJQD5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSAS3WPDV9C1J?ASIN=B09DHMGSF6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Best PORTABLE speaker purchase hands down.",
                "reviewText": "Great base and surround sound feature, greatest feature though is 100% the charging port it has within itself, the speakers loudness is great, and for its size it is reasonable and travel ready.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jason hurlburt",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 24, 2023",
                "reviewTitle": "Great sound quality",
                "reviewText": "For a smaller unit this JBL system really has great sound quality.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manuel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 3, 2023",
                "reviewTitle": "Muy buena bocina",
                "reviewText": "Gran sonido para lo que ofrece, buenos bajos, buena definición de sonido, buena duración de la batería. No hay que exigir más de lo que ofrecen sus 30w más 10Sí la recomiendo",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "emigaemiga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 14, 2023",
                "reviewTitle": "Excellent produit",
                "reviewText": "Très belle qualité de son, facile à déplacer car pas trop gros. Je l'adore. De plus, je l'ai reçu plus rapidement que c'était mentionné.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71YX707ddSL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roberto BurgosRoberto Burgos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 9, 2023",
                "reviewTitle": "Excelente compra",
                "reviewText": "Es una excelente opción, considerando si tamaño tiene una excelente calidad de graves, medios y agudos, lo recomiendo ampliamente",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71c5IAsOw7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julieta Valencia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 30, 2024",
                "reviewTitle": "Excelente",
                "reviewText": "Excelente bocina, tiene buena duración de bateria y buen sonido, es un poco grande pero funciona excelente para fiestas o eventos pequeños.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$99.95",
                "sellerName": "Verdi!",
                "sellerRating": "4.5"
            },
            {
                "price": "$114.99",
                "sellerName": "ExclusivesDirect",
                "sellerRating": "4.5"
            },
            {
                "price": "$119.77",
                "sellerName": "dealsright",
                "sellerRating": "5"
            }
        ]
    }
}