{
    "remaining_requests": 46362,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sonos-Play-Ultimate-Wireless-Streaming/dp/B014LFINIA",
    "body": {
        "name": "Sonos Play: 5 - Ultimate Wireless Smart Speaker - Black",
        "price": "$738.00",
        "originalPrice": "",
        "rawPrice": 738.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sonos-Play-Ultimate-Wireless-Streaming/dp/B014LFINIA",
        "soldBy": {
            "sellerID": "A85QO95PKJWKQ",
            "name": "Group Usa",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A85QO95PKJWKQ&asin=B014LFINIA&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0167CCNTU"
        ],
        "asinVariationValues": [
            {
                "asin": "B014LFINIA",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$738.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/419ZcfXzb6L._SS36_.jpg"
            },
            {
                "asin": "B014LFIN58",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$739.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/412WMGn-C3L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "28",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31DoS0ijXrL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51t0knZXw5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hrrJ- 1VL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VcQ36aS3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Orzmu64yL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51F9LUaBSbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61BFAWAxdcL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/376eb11d-88b5-4c67-8eea-76e9443c4bf2/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/14a2aad4-09d0-4d08-b6f0-1832f0ba0b03/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fadcefae-8914-4cbb-81c6-8b780b9f8a5b/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/78b7af8f-c560-4353-822a-4586f3611962/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b9ba4d19-8109-4de0-a60d-78f163324553/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/932577bd-b437-41fd-bc9d-358d37cbdfbe/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/32adf9f1-50d4-4bf5-9e6c-bc44e15e1f99/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 7,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/815Mlv9jFfL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B15rlnVtnwS.pdf"
        },
        "byLineInfo": {
            "name": "Brand: Sonos",
            "link": "https://www.amazon.com/Sonos/b/ref=bl_dp_s_web_2530477011?ie=UTF8&node=2530477011&field-lbr_brands_browse-bin=Sonos"
        },
        "brand": "Sonos",
        "merchantInfo": "Ships from and sold by CellularStream.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1270,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21.",
            "FREE delivery February 14 - 16.",
            "Or fastest delivery Tuesday, February 13. Order within 12 hrs 53 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Our biggest and best-sounding speaker featuring six amplifiers with six dedicated speaker drivers. Fill even the largest rooms with pure, brilliant sound. Stereo pair for an even better sound experience.",
            "Play different songs in different rooms at the same time. Or, pump one song in perfect sync, throughout your home."
        ],
        "description": "Sonos play: 5 Ultimate wireless Smart speaker for streaming music (black). Power supply - Auto-switching 100-240 V, 50-60 Hz. Connects to your home WiFi network with any 802.11b/g, 2.4 GHz broadcast-capable router for uninterrupted wireless streaming.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Portable Audio & Video",
                "link": "https://www.amazon.com/Portable-Audio-Video/b?ie=UTF8&node=172623"
            },
            {
                "name": "Portable Speakers & Docks",
                "link": "https://www.amazon.com/Speaker-Systems-MP3-Player-Accessories/b?ie=UTF8&node=689637011"
            },
            {
                "name": "Portable Bluetooth Speakers",
                "link": "https://www.amazon.com/bluetooth-speakers/b?ie=UTF8&node=7073956011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "14.3 x 8 x 6 inches"
            },
            {
                "name": "Item Weight",
                "value": "14 Pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Sonos"
            },
            {
                "name": "ASIN",
                "value": "B014LFINIA"
            },
            {
                "name": "Item model number",
                "value": "PL5G2US1BLK"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,270 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,296 in Portable Bluetooth Speakers #16,647 in MP3 & MP4 Player Accessories"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "September 28, 2015"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Sonos"
            },
            {
                "name": "Model Name",
                "value": "Play:5"
            },
            {
                "name": "Speaker Type",
                "value": "Smart Speaker"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Special Feature",
                "value": "Wireless"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "6 Drivers 2 Alexa built-in Bluetooth Portable Apple AirPlay 2 Audio line-in Wall mountable 6 Drivers 2 Alexa built-in Bluetooth Portable Apple AirPlay 2 Audio line-in Wall mountable 6 Drivers 2 Alexa built-in Bluetooth Portable Apple AirPlay 2 Audio line-in Wall mountable",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/35ea1276-e65a-43ed-8380-c3abf1bce5df.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1e150334-8d10-451d-8172-91902b8b2a89.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/823dd290-9042-4906-8405-02492e5b982d.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6f6794d4-18b2-4643-87d8-ee21367cd864.__CR0,89,2928,1200_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dac33ab0-cc88-4cc8-b6df-a5e0ba039924.__CR0,0,488,700_PT0_SX488_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/92caacb8-d4de-40dd-8440-d4f121ea5adb.__CR0,0,488,700_PT0_SX488_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/08a401a4-d2ec-4498-87bb-6f973fb4d23e.__CR0,0,488,700_PT0_SX488_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Thomas J. Venditto",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5TNEJFKC457LBQMOZUTME4XG5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PKSAYL10C9VA?ASIN=B014LFINIA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2016",
                "reviewTitle": "5.0 out of 5 stars Sonos Rocks!",
                "reviewText": "I guess I SHOULD have given Sonos Play:5s only four stars because of the ridiculous price they charge for this thing!That aside, I'm extremely pleased with these speaker's sound quality, control software and overall functionality.The Sonos products do what no other product does(AFAIK). They allow you to play music thru-out your living space wirelessly.Further, you can select speakers(other Sonos products) to play different tracks simultaneously.You can choose songs from your music library to form a cue.Re:cue; you can change the song order, add/delete, SAVE etc. Like an ITunes playlist, only better.You can adjust EQ via Bass/Treble control.You can adjust volume or mute, pause/continue, cue fwd/rev, etc.I'm able to play music stored on my PC, controlled by my phone/tablet. (you don't need music on each device)TuneIn radio (comes with the software) has 100,000 stations to choose from. They play flawlessly.You can do all this from your PC, tablet or smart phone. How do you top this?SEVERAL people can perform all these functions SIMULTANEOUSLY. (which gets interesting when your child is home from college LOL)If you ask me, it's a miracle! \"Ah but, setup must be difficult!\", you say.Nope, setup was a snap. Once unpackaged and plugged in, I downloaded the software and configured the speakers in less than 30 minutes. REALLY! The software is simple and intuitive.Cons: Price I wish they had a better equalizer program. The current one has a basic treble/bass slide bar. I wish they had outdoor speakers. I wish they had wireless headphones.Note: Sonos product all require AC electric supply i.e. plug them in. They're wireless, not battery operated; which I think is a good thing.My experience:My highest priority was to be able to play music off my PC located in the 26'x26' kitchen/LR/DR open floor plan, over a set of decent quality speakers. The thought of integrating the whole house seemed wonderful, albeit unattainable. We listen to a variety of music, but mostly rock, jazz and jazz fusion. Occasionally, we like to blast it. How loud? \"loud enough to NOT hear myself sing\" LOL. I wanted to \"hit it out of the park\", so I wound up buying 2 Play:5s and Sonos Sub.First, I set up the Play:5s to see if/how they would work. They immediately reminded me of Apple products with they're ridiculous gratuitous packaging. I mean the boxes alone must cost $25! LOLAs I said, the setup was a snap. I downloaded the app from the Sonos site*. It loaded quickly and I was on my way. Setup** was a couple of screens similar to pairing blue tooth stuff. What did take a while, was importing my 10K track music library(There's a serious issue here too! see below.)As for sound quality, I'd rate the speakers as \"very good\", to \"excellent\". If one considers the size of the format, ease of setup and they are wireless, I'd say \"excellent\"! I paired the speakers as stereo and listened to flawless music stream for about an hour. The bass response was so good, I almost didn't open the sub. I'm glad I did! While a huge expense for a seemingly frivolous component, the Sonos Sub is amazing! It definitely adds another dimension to the system.Several days later, I bought the Sonos starter set (2 Play:1s). I put one in the 12'x18' bedroom and one in the 24'x30' garage. Admittedly, these speakers do not deliver the sound quality of the 5's, but when you consider the size of the format, they absolutely rock!I'm saving my $ for more Sonos products!------------NOTES----------------------------------------------*I downloaded the app from Sonos. There's another app on the google app site which is rated rather low. I don't know if they are the same.**You need ethernet (hard wire) connection for the first Sonos product you install. Later, you can move remove the wire or move the speaker wherever you like.***my ITunes PLAY LISTS did NOT import. The library is all there and the playlists titles are there, but the data within the playlists is erroneous and does not play. I'm on Sono's site attempting to fix this. WARNING, there appears to be NO real FIX at this time.UPDATE: I found an esoteric file \"fix\". It will work short term. If you're good with your PC file system, you can do it too.FLASH! I was contacted by Sonos support regarding this post. I'll update.UPDATE-I'm about 30 days into these products. I listen to them almost daily. ( just ordered 2 more P5s)The Music stream(over my network) has been flawless.I experienced 2 or 3 device \"lockups\" on my S5 phone, which were quickly averted with an app restart.My ITunes playlist problem persists. Sonos has been very attentive, emailing me several times about it. They say the issue is in ITunes(I don't doubt them), but I can't find the playlist files in order to examine and repair them.I WISH the P5s had more treble (brighter). I play them with the treble setting maxed out 100% of the time.I WISH the software had a real equalizer, rather than the vanilla bass/treble adjustments.UPDATE-I purchased 2 additional P5s. Now I have 2P5s + Sub in one room(24'x24') and 2P5s standalone in another(20'x20' with lower ceiling). I'll say the standalones are still pretty impressive. In fact, the sub tends to be a bit over-the-top and requires adjustment on some songs. Generally for classical music I'll turn it up a notch, then have to back it off for rock music. It's interesting to hear the extra bass when listening to talk radio. The standalones are by NO MEANS lacking. Don't hesitate to get two P5s if you can't afford the sub.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "7mtns4k",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMX6R2TREGY5ZLIAVRXNC6OWCEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22H6TP1VH53VG?ASIN=B014LFINIA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2015",
                "reviewTitle": "5.0 out of 5 stars Very impressed with this",
                "reviewText": "What is it?Sonos is a wireless speaker system that streams music from your computer (downloaded, ripped from CD, iTunes etc) or internet streaming services such as Spotify, Tidal and streaming radio stations directly into your room. It's all controlled via an Android or iPhone/IPad app. There is also a PC/MAC program but it's easier to use the phone. There is no screen and very limited controls on the speaker itself.With the app (or program) you can choose local or steaming music, create playlists, etc. Unlike a Bluetooth speaker, the app is just controlling what the speaker is playing. It's not the source of the music. The speaker is connected to you router via Wi-Fi (Or wired) so it get the music it's playing directly over the network.The idea of Sonos is you have a speaker in every room. But you just need one to start. Eventually you can have many speakers and they can be playing different music or all linked together playing the same thing.Why I bought itI had a CD changer, surround sound receiver and some speakers which worked for many years. I found I wanted to modernize to something easier after my friend let me try his Sonos system.Once I saw what this could do, I knew I could:- Listen to my almost 350 CD collection- Be able to create playlists from my existing collection- Access my purchased music collection (Amazon music and some iTunes tracks) (Was hoping this was possible)- Stream radio and use services like Spotify/Pandora- Start playing and change music easilyMy CD collectionOne thing Sonos does not tell you how to do is get your CD collection into the Sonos system. You can rip your CDs using some program and store them on you computer. But if you have a laptop like me sometimes it's not always available. I ended up using a microJukebox which ripped the CDs automatically. It acts as a computer server and allows me to play my music at any time. I also was able to load my existing tracks from iTunes and Amazon on it. Sonos has a nice interface like iTunes but again if your laptop is not powered on, it won't work. Now all my CDs and music are in stored on the microJukebox.How does it sound?I was going to purchase the old version of the PLAY:5 but waited after I read that the new version was almost out. I'm glad I waited. The sound is pretty amazing. My original system has good size speakers and a small sub woofer; and the PLAY:5 fills the room with rich sound just as well is not better then the larger system.Audio qualityI have been doing some listening tests between my ripped CDs and the same tracks on Spotify. The tracks ripped from CD are defiantly much better, but Spotify has a lot more music available.The only thing I had to compare before was playing my Android phone through a blue-tooth speaker and playing CDs on my CD player was good. Now the PLAY:5 sounds even better than my CD player did with the same tracks (ripped from my CDs).I heard that Tidal streams most of their content in CD quality. I may get a trial account and try that out with this system.What's next?I need to start learning the advanced functionality that Sonos has to offer. I also want to start exploring some of the other free streaming services. I was very surprised at how many stream services are included.I may purchase another smaller Sonos unit for the bedroom. I see you can set alarms and it would be cool to wake up to music. I'm very happy so far!ConclusionThe PLAY:5 is a great system.- Easy to use- Great app- Supports lots of different streaming services- Access to local music- Sounds amazing- Solidly built",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Md Abu Shuphiyan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 8, 2017",
                "reviewTitle": "No one can beat this",
                "reviewText": "First, awesome service by Amazon, received the very next day of order.Amazing performance, awesome sound and superb bass. The best wireless speaker in market now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roger Carrillo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 27, 2017",
                "reviewTitle": "Excelente",
                "reviewText": "Actualización aproximadamente un año y medio de uso: La mejor compra que he hecho en mi vida, vale cada centavo y eso que la compre cuando costaba $12,500.Actualización: A un mes de cumplir el año de uso se descompuso la tarjeta de red inalámbrica, el equipo seguía funcionando pero debía conectarlo vía Ethernet así que contacté a garantía, me pidieron que ejecutara la opción de diagnóstico que incluye la app de Sonos y listo, me pidieron que enviara mi equipo por mensajería y a las 2 semanas me llegó un equipo nuevo. Mantengo la calificación de 5 estrellas porque el servicio post venta me pareció muy bueno y la falla del equipo pudo deberse a un problema ajeno a la fabricación.Comentario original: Excelente calidad de audio, no distorsiona en ningún momento, tengo planeado adquirir mas productos de la familia SONOS en un futuro próximo. Lo único malo es que dos meses después de comprarla SONOS decidió bajar sus precios en México, pude haberme ahorrado $2500 :(",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darkev",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 5, 2016",
                "reviewTitle": "Beautiful sound reproduction with an easy to use app controller",
                "reviewText": "This speaker is very well built and sounds terrific. I played several songs that I'm familiar with and they all sounded better than ever before. The speaker is heavy and well built. I like the fact that I can control more with this speaker than I can with my Sonos:1 speakers. Swiping to the right plays the next song in the queue. Swiping left plays the previous song. Volume and stop/start functions. I bought this for my bathroom which is 11' X 12' in dimension with a 20' ceiling. It is just one speaker but the room sounds like it has 4 speakers. I am not sure how they did that. I am thrilled with the speaker and hope I'll enjoy many years of excellent sound from it. I would recommend this to a friend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christian Levasseur",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 14, 2019",
                "reviewTitle": "Bad reliability and unable to add speaker from Windows",
                "reviewText": "I had a Sonos speaker on a Windows network for less than three years. Then, the speaker died. It seems the sound is good but the reliability is bad. I decided to give Sonos another try anyway. When I added the new speaker on the network, I had to update the Sonos software on my Windows station. Unfortunately, Sonos \"improved\" their Windows software by removing support for adding speakers from within Windows (they only support iOS and Android)! Since this device is on a controlled network where no WiFi devices are allowed, this is proving very complicated for a simple speaker. I'm very disappointed with my experience with Sonos speakers.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eduardo Sal.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 24, 2019",
                "reviewTitle": "Justo lo que buscaba",
                "reviewText": "La nitidez del sonido es exquisita, que era el principal valor que me importa al mezclarla con dos Sonos One que no sentía que balancearan bajos.Aviso que no compré este producto para probar su potencia, puedo asegurar que una habitación de unos 100m2 queda bien cubierta y modulada con un volumen moderado, pero un restaurante podría convenirle comprar dos Sonos One y ubicarlos en contra esquinas.Mi única queja es que usar apps que no sean la propia de sonos (como Alexa, comando de Alexa o Spotify) hace que al recibir mensajes se pierde por momentos la transmisión, aun con un Sonos Boost. Pero si usas directo la app de Sonos no pasa nada así.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$759.00",
                "sellerName": "Mlaags",
                "sellerRating": "4.5"
            }
        ]
    }
}