{
    "remaining_requests": 46646,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/JBL-Touring-Coaxial-Speakers-Alphasonik/dp/B003KN2TEY",
    "body": {
        "name": "JBL GTO629 6.5\" GTO 2-Way 360 Watts MAX Power Grand Touring Series Coaxial Car Audio Speakers Bundled with Alphasonik",
        "price": "$89.95",
        "originalPrice": "",
        "rawPrice": 89.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/JBL-Touring-Coaxial-Speakers-Alphasonik/dp/B003KN2TEY",
        "soldBy": {
            "sellerID": "A1M2AR6046TFJG",
            "name": "Amazing Dealzzz",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1M2AR6046TFJG&asin=B003KN2TEY&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C22RVP35"
        ],
        "asinVariationValues": [
            {
                "asin": "B003KN2TEY",
                "variationName": "Size",
                "variationValue": "6-1/2\" Coaxial",
                "price": "$89.95",
                "variationImageURL": ""
            },
            {
                "asin": "B00881CT3E",
                "variationName": "Size",
                "variationValue": "6-1/2\" Component",
                "price": "$65.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "20",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/4130gynyu5L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/419QOrSN tL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51u6XZY5d0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rm5 okrdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41VSTcvUvyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/612 l1UQPOL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/18db20d4-2692-57ae-95bd-fab8f0c8ff68/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/15b0540a-3785-5e03-8675-3530cee078a3/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/9461ef40-0aeb-55cf-98ba-46d42ae63583/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the JBL Store",
            "link": "https://www.amazon.com/stores/JBL/page/17575AD5-FBC3-4ACB-8002-79EF7CF1DE1E?ref_=ast_bln"
        },
        "brand": "JBL",
        "merchantInfo": "Amazing Dealzzz",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 681,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "6.5\" Stage Series 2-Way Component System",
            "Power Handling: Peak: 300 watts per set / RMS: 100 watts per set",
            "Injection-molded polypropylene cone / PEI Balanced Dome Tweeter",
            "Top-mount Depth: 2-5/16\" / 4 ohms impedance",
            "Frequency Response: 50 - 20000 Hz / Sensitivity: 90dB"
        ],
        "description": "The JBL GTO628 6. 5\"-6. 75\" speakers have a 60 watt RMS and 180 watt max. The mylar/titanium dome tweeters have a 2 ohm impedance and a 92 dB sensitivity rating for added audio quality. These JBL GTO628 speakers have a top-mount depth of 2\" with a cutout diameter of 5-1/8\". Top-mount depth: 2\" Cutout diameter: 5-1/8\" Frequency Response: 50-21 kHz 1-Year VMInnovations",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Car & Vehicle Electronics",
                "link": "https://www.amazon.com/Vehicle-Electronics/b?ie=UTF8&node=3248684011"
            },
            {
                "name": "Car Electronics",
                "link": "https://www.amazon.com/Car-Electronics/b?ie=UTF8&node=1077068"
            },
            {
                "name": "Car Audio",
                "link": "https://www.amazon.com/Car-Audio-Video-Electronics/b?ie=UTF8&node=226184"
            },
            {
                "name": "Speakers",
                "link": "https://www.amazon.com/Car-Speakers-Subwoofers-Audio-Video/b?ie=UTF8&node=760560"
            },
            {
                "name": "Coaxial Speakers",
                "link": "https://www.amazon.com/Coaxial-Car-Speakers/b?ie=UTF8&node=10980771"
            }
        ],
        "productInformation": [
            {
                "name": "Manufacturer",
                "value": "‎Harman Kardon"
            },
            {
                "name": "Brand",
                "value": "JBL"
            },
            {
                "name": "Model",
                "value": "‎GTO629"
            },
            {
                "name": "Item Weight",
                "value": "‎4.41 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎10 x 9 x 8 inches"
            },
            {
                "name": "Item model number",
                "value": "‎GTO628"
            },
            {
                "name": "Batteries",
                "value": "‎1 12V batteries required."
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Manufacturer Part Number",
                "value": "‎GTO628"
            },
            {
                "name": "Special Features",
                "value": "‎Radio"
            },
            {
                "name": "Wattage",
                "value": "‎180 watts"
            },
            {
                "name": "Speakers Maximum Output Power",
                "value": "‎180 Watts"
            },
            {
                "name": "Number Of Items",
                "value": "‎1"
            },
            {
                "name": "ASIN",
                "value": "B003KN2TEY"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 681 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,136 in Electronics (See Top 100 in Electronics) #53 in Car Coaxial Speakers"
            },
            {
                "name": "Date First Available",
                "value": "April 26, 2009"
            },
            {
                "name": "Model Name",
                "value": "GTO629"
            },
            {
                "name": "Speaker Type",
                "value": "Coaxial"
            },
            {
                "name": "Connectivity Technology",
                "value": "Coaxial"
            },
            {
                "name": "Special Feature",
                "value": "Radio"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "JBL Car Audio JBL Sound Solutions Specifications component speaker system includes two woofers and two tweeters 6-1/2\" polypropylene woofer cone PEI balanced dome tweeter with in-line crossover handles up to 50 watts RMS (150 watts peak power) frequency range: 50-20,000 Hz sensitivity: 90 dB grilles included What's in the box? 2 Woofers2 Tweeters (each in flush mount housing with 4\" wire attached)2 Flush mount retaining rings2 Woofer grillesTwo 5' Tweeter wires with crossover wired in-lineTen 1\" Screws10 Speed clips2 Strips of grille puttyInstallation manual JBL Stage 600C 2-Way Component Car Audio Speakers JBL's Stage Series is the affordable way to bring joy back to your listening experience. These Stage 600C component speakers sport a big 6-1/2\" polypropylene woofer that gives your music the responsive, robust low-end punch you've been missing. The separate balanced dome tweeter delivers smooth, spacious highs, and brings your music back to life with startling detail. Features worth listening to! Injection-molded polypropylene coneThe polypropylene woofer cone in Stage speakers is engineered for superior rigidity and sensitivity. The result is increased low-frequency output and richer, more robust musical characterPEI balanced dome tweeterPolyetherimide tweeters offer increased power handling, efficiency and reduced distortion for smooth, spacious sound, and a seamless transition between the middle and high frequencies.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/55550d54-2e6c-49cf-98eb-8d3e94166ef1.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/e6c4954a-d67f-4208-bf2e-457cfa8046b4.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/55550d54-2e6c-49cf-98eb-8d3e94166ef1.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d05addc6-2b92-4f17-93cf-9515ecaf3d36.__CR0,0,1940,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "supernova",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOVWRSCLLVG6U3RWNDOSTEAHRZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QAEX5IO74WV?ASIN=B003KN2TEY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 27, 2013",
                "reviewTitle": "5.0 out of 5 stars Great speakers, but pay attention to wire polarity!",
                "reviewText": "Got those speakers for my 2012 Ford Focus SEL 5 door, because I really liked components JBL GTO608C 6.5-Inch 2-Way Component System that I installed in the front doors. I use a stock head unit - non-Sony with Sync, driving 6 speakers. Overall, installation in the rear doors was very easy, as I used the OEM speaker baffles. High sensitivity of the speakers is evident - I can hear increased sound level at the same volume settings. So far the speakers seems like a nice addition to their \"cousins\" in the front doors - they (GTO628) add low and mid frequencies nicely to the overall sound. Highs from GTP628 are not as evident because there is no line of sight to the rear door mounting location when I am in the driver seat.But I noticed one very important discrepancy in the speaker installation instruction - its picture for the wire polarity swaps \"+\" and \"-\" wires. It is very important, as swapping them may lead to drastic decrease in the low frequency response from all speakers as perceived by the car occupants (see below why this is). May be this explains why some people report something like \"no bass response from the speakers\" after they replaced their car OEM speakers, all because they followed the installation instruction wire polarity.The installation instruction (you can get it from the JBL website when you search for GTO628 product page there) shows a particular \"+\" and \"-\" wire connection to the speaker. It seems that it draws the speaker from the magnet side. I believe that the correct wire connection would be when the same picture draws the speaker from the front (membrane) side.Here is my evidence:1. When I examine the speaker tabs, the small white board (where all wires solder to) has a \"+\" sign engraved on it, and it does not coincide with the instruction-suggested location;2. I used a 1.5V battery to test the speaker polarity - the speaker membrane should move up if the battery \"+\" terminal touches the \"+\" lead of the speaker. Result - the speaker \"+\" engraving pointed to the correct positive terminal.3. GTO608 woofers have a particular \"+\" and \"-\" tab arrangement (you can get GTO608 instruction from JBL website) that agrees with the GTO628 engraving, but contradicts to the GTO628 installation instruction picture.Some basics behind speaker polarity: if even one woofer speaker in a car is connected backwards, its membrane moves in the opposite direction than those of the rest of the speakers. At low frequencies, this leads to \"canceling out\" the sound wave as, for example, it tries to \"pull\" the sound wave at the same time as the other speakers try to \"push\" it.I am very puzzled as to why manufacturer made such an error, and hope that JBL reps browse our reviews so they can correct the instruction. Otherwise more and more people will complain about \"lack of bass response\" in their review - all because of the incorrect speaker connection.Edit on 05/28/13 - forgot to mention - remember to remove sticky transparent film from the magnet back - otherwise when the speaker is exposed to hot summer temperature, the film will curl up and fall inside the door, potentially blocking one of the door drain holes.Edit on 05/29/13 - I agree with a reviewer who noticed decreased low-frequency response after replacing the stock speakers. I just got a rental Camry and was amazed by the car stock audio system bass intensity, even at moderate EQ bass settings. My body has shaken. Especially when this bass comes from a small speaker with paper cone and a tiny magnet (I could see 2 of them from inside the trunk). It seems to me that stock speaker designers tune the speaker impedance to the factory head unit (more on the speaker impedance is below). This would lead to very powerful bass, but makes mid-frequency response quite distorted. In general, speakers with smaller magnets (like stock speakers) may have a better low-frequency response (reason for this is quite complex).Each speaker has a very complex effective impedance curve, usually it peaks at low frequency (around 80-100 Hertz it can be as high as 20-100 Ohm for a large-magnet speaker with a 4 Ohm nominal impedance). This relates to the speaker membrane and driver design. Modern solid-state amplifiers present a 0 Ohm load to the speaker, meaning that speaker no longer can freely move around this peak, or resonant, frequency. This is so called \"damping effect of a solid-state amplifier\". Speakers with smaller magnets generally less prone to the damping effect at the peak frequency, so they can be moved by amplifier much easier in the usable bass range(50-80Hz). This is an oversimplified explanation of course.So GTO628 speakers may easily feel greater damping effect at low frequency than the stock speakers do. Result - decreased bass response (it is still there, it is just attenuated). Solution - to use an external amplifier that can deliver proper (higher) gain at low frequency (some amplifiers allow boosting curve right at the speaker resonant frequency). Or to use a dedicated subwoofer. I personally like neither of the options, so I just enjoy very clear mid-highs (with some hints of bass) from the GTO speakers driven by the factory head unit.",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matthew C.Williams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY55TC4WHRGETMK5A23TVTGWT3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX4E1YW0BGO7O?ASIN=B003KN2TEY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 8, 2016",
                "reviewTitle": "5.0 out of 5 stars Awesome Sound Quality",
                "reviewText": "This is going to be lengthy but I believe speakers are only 1 piece of the puzzle in your audio system. The most expensive speakers behind a junk deck or AMP will make the best speakers \"bad\" sound louder. I won't say I'm cheep, but prior to any purchase I will spend a month or more comparing products & models. I purchased a car a few months back with the worst OEM radio I ever heard but it was a steel of a deal. At full blast you could have a normal conversation with passengers. I needed the complete system replaced.I have a Harmon Kardon Bluetooth speaker that blasts with incredible clarity so I started there. They manufacture JBL & Infinity speakers so after a bunch of comparisons RMS Output and Peak Power vs. Cost. I settled on 2 pair of JBL 6 1/2 at 200 watts peak for about $50 pair.Next onto the head unit, after searching every pro audio review I could find there was 5 models that were always in the top 10 reviews. I compared the RCA Channel outputs, Hands Free, Steering Wheel controls, HD/Sirius and price and went with a Kenwood deck with 6 Channel out for $150. On to the AMP with 6 Channel out on my deck I needed a 5 or 6 channel AMP to push the speakers plus my BASS. Now this AMP is 4 Channel or bridged at 2/3 Channel which wasn't ideal for me but again I compare all the options vs cost so we will get to the BASS later. I wanted to retain the ability to fade front to rear on the sound so I'm running this as a 4 Channel 2ohm with the low pass filter so I get crisp mid's & high's.I'm not the guy at the stoplight with the obnoxiously loud stereo as a norm but now I can drowned them out if I choose to. The volume on the head unit now sits at about 20% for my normal loud, if I turn it to 3/4 total volume it's like being in the Pit at a concert. I'm fairly certain at full volume for an extended period my ears would start bleeding.So this leaves the BASS, again comparing 1/2 Channel amps and BASS Speakers vs self contained unit and the available space in my mid size SUV that carries 5 kids. I did have space to mount it in the very back side panel but wanted it closer. I found a 600 Watt Lanzar 8\" self contained unit for about $100 and put it under the passenger seat.So long story short what I'm saying is this AMP is worth every penny and if you shop around for all the pieces to put together this AMP can be an incredible piece of your system as a whole. Maybe I am cheap for $500 I built a system that out blasted another guy that said he paid $1200 for his install.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Big Brian ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6LGW4ENSRNIPKU3NZ3QNIIRZZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31DH07PPR0FGX?ASIN=B003KN2TEY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "4.0 out of 5 stars Great sound for the price",
                "reviewText": "Great value and decent sound. Installation instructions were confusing at best but not hard to figure out for an audiophile.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ian B.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 28, 2015",
                "reviewTitle": "Great speaker, S-L-O-W delivery!",
                "reviewText": "The JBL GTO series make great a great upgrade to your factory system - they can handle a pile of power, but make the most out of low-power stock systems too. Excellent tweeters are exceptionally clear without the sharp, ear shatteringness (for lack of a real word) of many cheaper sets. These also come with the adaptor plates for the 6.5S openings (like in the 2015 Ford Fiesta thst these went in to).One word of caution - \"Urban Inspirations\" shipping speed/delivery times are BRUTAL!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Glen Roberson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 27, 2015",
                "reviewTitle": "Four Stars",
                "reviewText": "Very nice for the price the sound is great",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}