{
    "remaining_requests": 46645,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Amazon-Compact-speaker-enhanced-display/dp/B09B8VN8YQ",
    "body": {
        "name": "Amazon Echo Dot (5th Gen) with clock | Compact smart speaker with Alexa and enhanced LED display for at-a-glance clock, timers, weather, and more | Glacier White",
        "price": "$39.99",
        "originalPrice": "$59.99",
        "rawPrice": 39.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Amazon-Compact-speaker-enhanced-display/dp/B09B8VN8YQ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BDPZDBQR"
        ],
        "asinVariationValues": [
            {
                "asin": "B09B8W5FW7",
                "variationName": "Color",
                "variationValue": "Cloud Blue",
                "price": "$39.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31C7T9uuiVL._SS36_.jpg"
            },
            {
                "asin": "B09B8VN8YQ",
                "variationName": "Color",
                "variationValue": "Glacier White",
                "price": "$39.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/21+xUcglauL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/511BZJP 53L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31ybUVdc-xL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LYblubumL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YBI4MCMBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tPQV2zgOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rgVbspV7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HCnHBYrAL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 60545,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Reducing CO2 products reduce their carbon footprint year after year. Certified by the Carbon Trust."
        },
        "features": [
            "OUR BEST SOUNDING ECHO DOT YET – Enjoy an improved audio experience compared to any previous Echo Dot with Alexa for clearer vocals, deeper bass, and vibrant sound in any room.",
            "ENHANCED LED DISPLAY – Stay on track with an improved LED display that shows the time, weather, alarms, and song titles at a glance.",
            "ALEXA IS YOUR PERSONAL ASSISTANT – Ask Alexa for news, weather, timers, smart home controls, and more to make your day easier and more productive.",
            "ALL YOUR MUSIC AND CONTENT – Stream all your favorites from Amazon Music, Apple Music, Spotify, and others or via Bluetooth for throughout your home.",
            "VOICE-CONTROLLED SMART HOME – Control compatible lights, locks, fans, and more with just your voice or create routines triggered by motion sensors.",
            "DESIGNED TO PROTECT YOUR PRIVACY – Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls, including a mic off button.",
            "DO MORE WITH DEVICE PAIRING – Fill your home with music using compatible Echo devices in different rooms, create a home theater system with Fire TV, and extend wifi coverage with a compatible eero network so you can say goodbye to drop-offs and buffering.",
            "CLIMATE PLEDGE FRIENDLY – We considered sustainability in the design of this device with 100% recyclable packaging, 100% post-consumer recycled polyester yarn, and 55% post-consumer recycled plastics."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Size",
                "value": "3.9” x 3.9” x 3.5” (100mm x 100mm x 89 mm)"
            },
            {
                "name": "Weight",
                "value": "10.7 oz (304g) Actual size and weight may vary by manufacturing process"
            },
            {
                "name": "Audio",
                "value": "1.73” (44 mm) front-firing speaker, Lossless High Definition"
            },
            {
                "name": "Display",
                "value": "LED Display"
            },
            {
                "name": "Wifi connectivity",
                "value": "Dual-band Wi-Fi supports 802.11a/b/g/n/ac (2.4 and 5 GHz) networks. Does not support connecting to ad-hoc (or peer-to-peer) wifi networks."
            },
            {
                "name": "Amazon Sidewalk",
                "value": "A shared network that helps compatible devices work better at home and beyond the front door. If wifi is lost, Sidewalk enables certain devices to stay connected. Also, Sidewalk helps devices like water sprinklers and pet locators work over longer distances. Sidewalk uses a small portion of your internet bandwidth to provide these benefits to you and your neighbors via Sidewalk Bridges (participating Echo and Ring devices), and is turned on for your device unless you have previously turned off the setting. You can turn off Sidewalk at any time. Learn more about Sidewalk."
            },
            {
                "name": "Smart Home Device Compatibility",
                "value": "WiFi, Bluetooth Low Energy Mesh, and Matter"
            },
            {
                "name": "Bluetooth connectivity",
                "value": "Advanced Audio Distribution Profile (A2DP) support for audio streaming from your mobile device to Echo Dot or from Echo Dot to your Bluetooth speaker. Audio/Video Remote Control Profile (AVRCP) for voice control of connected mobile devices. Hands-free voice control is not supported for Mac OS X devices. Bluetooth speakers requiring PIN codes are not supported."
            },
            {
                "name": "eero Built-in",
                "value": "Your wifi network must use a compatible eero router and your Echo device must stay in range of a compatible eero device. You will need to link your eero and Amazon accounts and manage eero Built-in from the eero mobile application to use this feature. eero Built-in compatible Echo devices support up to 1,000 sq. ft. of additional coverage, speeds up to 100 Mbps, and 10 or fewer connected devices. Actual performance can vary and certain eero, Echo, or Alexa features may be incompatible with eero Built-in. Learn more about eero Built-in performance, availability and compatibility. Use of eero and eero-related products and services, including eero Built-in, requires creation of an eero account and agreement to eero’s Terms of Service. Review eero’s Privacy Notice."
            },
            {
                "name": "System requirements",
                "value": "Echo Dot comes ready to connect to your wifi. The Alexa app is compatible with Fire OS, Android, and iOS devices and also accessible via your web browser. Supported operating systems. Certain skills and services may require subscription or other fees."
            },
            {
                "name": "Setup technology",
                "value": "Amazon Wi-Fi simple setup enables customers to connect smart devices to their wifi network in a few easy steps. Wi-Fi simple setup is another way Alexa is always getting smarter. Learn more about Wi-Fi simple setup."
            },
            {
                "name": "Warranty and service",
                "value": "90-day limited warranty and service. Optional 1-year, 2-year, and 3-year extended warranty available for U.S. customers sold separately. Use of Echo Dot is subject to these terms."
            },
            {
                "name": "Accessibility features",
                "value": "To enable features that personalize Alexa to your abilities, go to Settings → Accessibility in the Alexa App. • Adaptive Listening provides customers more time to finish speaking before Alexa responds. • Preferred Speaking Rate allows customers to control how fast or slow Alexa speaks. To enable, say “Alexa, speak slower” or “Alexa, speak faster.” • Request Sound will play an audible tone in addition to the visual indicator when you speak to Alexa. To enable, say “Alexa, turn on Start of Request Sound.” • Kindle Read Aloud will have Alexa read your Kindle books aloud. • Notify When Nearby will play notification sounds when you’re detected near your Echo device. • Alexa Accessibility features also include several other settings for customers with accessibility needs related to vision, hearing, mobility, and speech."
            },
            {
                "name": "Included in the box",
                "value": "Echo Dot, glacier white power adapter (15W), and Quick Start Guide."
            },
            {
                "name": "Generation",
                "value": "Echo Dot (5th Gen) with clock - 2022 release"
            },
            {
                "name": "Privacy features",
                "value": "Wake word technology, streaming indicators, microphone off button, the ability to view and delete your voice recordings, and more. Visit the Alexa Privacy Hub to explore how Alexa and Echo devices are designed to protect your privacy."
            },
            {
                "name": "Alexa Skills & Features",
                "value": "Alexa makes your life easier, more meaningful, and more fun by letting you voice control your world. Alexa can help you get more out of the things you already love and discover new possibilities you've never imagined. Discover and learn what Alexa can do."
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own an Amazon Echo, visit Manage Your Content and Devices for information specific to your device."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jason Parada",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELFTDXVHT5MDM7SH67CBO6SYRSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3T7Y5ZR56XRJV?ASIN=B09B8VN8YQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful Speaker & Alexa!",
                "reviewText": "This Alexa device is wonderful. I love having the time visible so that I can see the time on my nightstand. The mic works great and the voice recognition is wonderful. Even with a loud movie on the Alexa can determine what I am saying and disregard the dialogue from the movie. The speakers on this are amazing for the price. I feel like I can hear parts of songs/music that I never noticed before and the bass is also great. No complaints from me and I would definitely recommend to a friend. Easy to set up and great connection to Wi-Fi and my smart home.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cory Maffeo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYHM2OBDTEUQTGGDCQGZCZX6Z4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMFB992TVZDZS?ASIN=B09B8VN8YQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2023",
                "reviewTitle": "5.0 out of 5 stars A perfect blend of form and function",
                "reviewText": "The Cloud Blue Echo Dot (5th Gen, 2022 release) has completely changed my daily routine by integrating cutting-edge technology into an elegant form factor. This smart speaker has been an invaluable addition to my home, providing me with the services of Alexa as well as serving as a stylish and practical clock.I was immediately drawn to the Cloud Blue hue of my new Echo Dot with clock because of how softly it injects a burst of energy into any room. The device's compact size makes it suitable for use in any room of the house, from the bedroom to the kitchen. Amazon's commitment to offering products that complement a wide range of aesthetic preferences is reflected in the subtlety of this one.This smart speaker stands out from the crowd because to its built-in LED clock display. This seemingly minor modification has transformed my Echo Dot from a simple alarm clock into a multifunctional wristwatch. The LED display is easy to read from across the room, and its brightness can be adjusted so that it doesn't keep me up at night. Having the ability to switch between a 12-hour and 24-hour clock face as well as adjusting the clock's brightness is a nice touch.The Echo Dot's brilliance lies in its voice-activated functions, which are made possible by Alexa. Setting alarms, checking the weather, listening to music, and controlling smart home equipment may all be done with just a few phrases. The sound from the 5th generation Echo Dot is superior to those of its predecessors, filling the room with music that is both crisp and balanced. Whether I'm listening to my go-to podcast or a constantly evolving playlist, the Echo Dot always delivers excellent sound quality.Voice control is surprisingly reliable because to the system's several microphones, which allow Alexa to hear my commands even in noisy environments. I was blown away by how well the voice recognition worked. It almost never fails to comply with my demands and provides instant feedback. The Echo Dot has become an indispensable device, allowing me to effortlessly access information, schedule updates, and entertainment.Since privacy and security are so important in today's interconnected world, I am overjoyed by the privacy safeguards Amazon has implemented in the Echo Dot. The ability to switch off the microphones is a convenient feature that allows me to enjoy some peace and quiet whenever I need it. Amazon's openness about data usage and the ability to review and delete voice recordings via the Alexa app are further indications of the company's commitment to user control and data protection.Setting up the Echo Dot was a breeze with the help of the intuitive Alexa app, which took me through the process. The process of linking the device to my Wi-Fi network and making my desired adjustments was quick and painless. The Echo Dot is a good long-term investment because Amazon regularly updates its software to include the most recent features and enhancements.The Echo Dot (5th Gen, 2022) with clock is a great example of smart technology that has been simplified to perform a single, specific task in a time when smart technology may sometimes seem overwhelming. The combination of a high-tech watch and Alexa's brainpower has made my regular tasks much more manageable and enjoyable. The Echo Dot adapts easily to my needs, whether I'm setting an alarm to gently wake me up in the morning or just listening to my favorite music. This smart speaker has seamlessly integrated into my life at home and become an essential tool. The Echo Dot with clock has undeniably merited its five-star rating for its top-notch functionality, sleek design, and helpful contribution to today's simplified lifestyle.",
                "reviewVotes": "141 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "yuri c.yuri c.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7CRS3A4PURZMCCF32VFNHDP2QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MIDMNQRLIIY6?ASIN=B09B8VN8YQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Lightning fast setup and overall action, compared to previous versions!",
                "reviewText": "Amazing device! Easily connects to any bluetooth/wi-fi sources, performs fast, actually there are so much options and functions that you might spend couple months just to get to know her)) integrated sound lacks clarity though, if you are planning to rock some favorite tracks you might be dissapointed a little, but connecting a wireless speaker is a matter of second and sound is amazing. Clock with adaptive bightness is absolutely must have feature! Well, very happy with purchase, recommend with no doubt)",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61H8wOQAgyL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. J. Fiori",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTU5VVIUZJ4JK4HQRRTJKBZR6NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W3FM3JDD7AKM?ASIN=B09B8VN8YQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Super product",
                "reviewText": "For a small divice it has great sound. I love the fact that it has a clock. I was tired of trying to find my phone to know the time in the middle of the night . I like music on to fall asleep, all have to do is say, \"Alexa play Pandora\" and it plays my favorite station. I then ask Alexa set a sleep time for three hours. Alexa has so many other capabilities, I just think it's great. I was a little hesitant to have a product that was always listening in. I'm 69 years old I have to get with the times. Let's face it, there is nothing that is private anymore, unless you want to live under a rock.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Morgan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVLIAEZUT352MSUCI5JDEBREIMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I0GXBBL4YYR?ASIN=B09B8VN8YQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2023",
                "reviewTitle": "4.0 out of 5 stars It's an Echo...",
                "reviewText": "Wake up and smell the virtual coffee, because the Amazon Echo Dot (5th Gen) with a clock has officially become my morning's trusty sidekick. Move over, roosters—I've got Alexa telling me the time with the enthusiasm of a caffeinated morning person.Pros:1. **Clock with Sass:** Forget your average wall clock; this Echo Dot's clock has attitude. It's like having a personal time announcer who's always on point. \"Hey, sleepyhead, it's time to rise and shine!\" Alexa says, as if it knows I hit snooze three times already.2. **Soundtrack to My Existence:** Not only does this little gadget tell me the time, but it also serenades me with my favorite tunes. It's like having a DJ who's attuned to my mood. Need some pump-up music for the day? Just ask, and Alexa's got you covered.3. **Dimmable Smartness:** The clock's display is dimmable, which is fantastic for those nights when even the smallest glimmer of light is an intruder in your quest for the perfect sleep. It's like having a night light that adjusts to your nocturnal whims.Cons:1. **Sudden Sass Attacks:** Sometimes, Alexa's responses are just a tad too sassy. I asked her to play some chill vibes, and she replied, \"Sure thing, chill master. Anything else, or can I continue being the DJ you never knew you needed?\" Easy there, Alexa, I just wanted some background music, not a roast.2. **The Clock Can't Make Coffee:** As much as I wish my Echo Dot could double as a barista, it's strictly a time-telling, music-playing genius. I asked, \"Alexa, make me coffee,\" and all I got was a polite suggestion to visit the kitchen. Maybe in the 6th Gen, Amazon?3. **Clock-Watching Addiction:** With the clock right there on my nightstand, it's impossible not to check the time every five minutes. It's like having a miniature time portal that I can't resist gazing into. Productivity plummeted, but at least I know exactly how much time I wasted.In conclusion—oops, I almost broke the no-conclusion rule—this Echo Dot with a clock is more than a bedside timekeeper; it's a witty companion that adds a touch of charm (and occasional cheekiness) to your daily routine. Just don't expect it to make your coffee or hold back on the sass—it's a clock, not a miracle worker.",
                "reviewVotes": "63 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}