{
    "remaining_requests": 46523,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/All-New-release-Smart-speaker-Charcoal/dp/B09B8V1LZ3",
    "body": {
        "name": "Echo Dot (5th Gen, 2022 release) | With bigger vibrant sound, helpful routines and Alexa | Charcoal",
        "price": "$34.99",
        "originalPrice": "$49.99",
        "rawPrice": 34.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/All-New-release-Smart-speaker-Charcoal/dp/B09B8V1LZ3",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BF73CTQF"
        ],
        "asinVariationValues": [
            {
                "asin": "B09B8V1LZ3",
                "variationName": "Color",
                "variationValue": "Charcoal",
                "price": "$34.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/01EP6fIZNkL._SS36_.jpg"
            },
            {
                "asin": "B09B93ZDG4",
                "variationName": "Color",
                "variationValue": "Deep Sea Blue",
                "price": "$34.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/01hXv+tQySL._SS36_.jpg"
            },
            {
                "asin": "B09B94RL1R",
                "variationName": "Color",
                "variationValue": "Glacier White",
                "price": "$34.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/01H0lxSx-HL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/417Dg2CS7cL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31MqnQ5wZ8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41twOW1hMpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419tViZriBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410MGVWajyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qIg8mVN6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vAY6E0JLL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 86868,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 14. Order within 23 hrs 19 mins",
            "FREE delivery February 17 - 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Reducing CO2 products reduce their carbon footprint year after year. Certified by the Carbon Trust."
        },
        "features": [
            "OUR BEST SOUNDING ECHO DOT YET – Enjoy an improved audio experience compared to any previous Echo Dot with Alexa for clearer vocals, deeper bass and vibrant sound in any room.",
            "YOUR FAVORITE MUSIC AND CONTENT – Play music, audiobooks, and podcasts from Amazon Music, Apple Music, Spotify and others or via Bluetooth throughout your home.",
            "ALEXA IS HAPPY TO HELP – Ask Alexa for weather updates and to set hands-free timers, get answers to your questions and even hear jokes. Need a few extra minutes in the morning? Just tap your Echo Dot to snooze your alarm.",
            "KEEP YOUR HOME COMFORTABLE – Control compatible smart home devices with your voice and routines triggered by built-in motion or indoor temperature sensors. Create routines to automatically turn on lights when you walk into a room, or start a fan if the inside temperature goes above your comfort zone.",
            "DESIGNED TO PROTECT YOUR PRIVACY – Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls, including a mic off button.",
            "DO MORE WITH DEVICE PAIRING – Fill your home with music using compatible Echo devices in different rooms, create a home theatre system with Fire TV, or extend wifi coverage with a compatible eero network so you can say goodbye to drop-offs and buffering."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Size",
                "value": "3.9” x 3.9” x 3.5” (100mm x 100mm x 89 mm)"
            },
            {
                "name": "Weight",
                "value": "10.7 oz (304g) Actual size and weight may vary by manufacturing process"
            },
            {
                "name": "Audio",
                "value": "1.73” (44 mm) front-firing speaker, Lossless High Definition"
            },
            {
                "name": "Wifi connectivity",
                "value": "Dual-band Wi-Fi supports 802.11a/b/g/n/ac (2.4 and 5 GHz) networks. Does not support connecting to ad-hoc (or peer-to-peer) wifi networks."
            },
            {
                "name": "Amazon Sidewalk",
                "value": "A shared network that helps compatible devices work better at home and beyond the front door. If wifi is lost, Sidewalk enables certain devices to stay connected. Also, Sidewalk helps devices like water sprinklers and pet locators work over longer distances. Sidewalk uses a small portion of your internet bandwidth to provide these benefits to you and your neighbors via Sidewalk Bridges (participating Echo and Ring devices), and is turned on for your device unless you have previously turned off the setting. You can turn off Sidewalk at any time. Learn more about Sidewalk."
            },
            {
                "name": "Smart Home Device Compatibility",
                "value": "WiFi, Bluetooth Low Energy Mesh, and Matter"
            },
            {
                "name": "Bluetooth connectivity",
                "value": "Advanced Audio Distribution Profile (A2DP) support for audio streaming from your mobile device to Echo Dot or from Echo Dot to your Bluetooth speaker. Audio/Video Remote Control Profile (AVRCP) for voice control of connected mobile devices. Hands-free voice control is not supported for Mac OS X devices. Bluetooth speakers requiring PIN codes are not supported."
            },
            {
                "name": "eero Built-in",
                "value": "Your wifi network must use a compatible eero router and your Echo device must stay in range of a compatible eero device. You will need to link your eero and Amazon accounts and manage eero Built-in from the eero mobile application to use this feature. eero Built-in compatible Echo devices support up to 1,000 sq. ft. of additional coverage, speeds up to 100 Mbps, and 10 or fewer connected devices. Actual performance can vary and certain eero, Echo, or Alexa features may be incompatible with eero Built-in. Learn more about eero Built-in performance, availability and compatibility. Use of eero and eero-related products and services, including eero Built-in, requires creation of an eero account and agreement to eero’s Terms of Service. Review eero’s Privacy Notice."
            },
            {
                "name": "System requirements",
                "value": "Echo Dot comes ready to connect to your wifi. The Alexa app is compatible with Fire OS, Android, and iOS devices and also accessible via your web browser. Supported operating systems. Certain skills and services may require subscription or other fees."
            },
            {
                "name": "Setup technology",
                "value": "Amazon Wi-Fi simple setup enables customers to connect smart devices to their wifi network in a few easy steps. Wi-Fi simple setup is another way Alexa is always getting smarter. Learn more about Wi-Fi simple setup."
            },
            {
                "name": "Warranty and service",
                "value": "90-day limited warranty and service. Optional 1-year, 2-year, and 3-year extended warranty available for U.S. customers sold separately. Use of Echo Dot is subject to these terms."
            },
            {
                "name": "Accessibility features",
                "value": "To enable features that personalize Alexa to your abilities, go to Settings → Accessibility in the Alexa App. • Adaptive Listening provides customers more time to finish speaking before Alexa responds. • Preferred Speaking Rate allows customers to control how fast or slow Alexa speaks. To enable, say “Alexa, speak slower” or “Alexa, speak faster.” • Request Sound will play an audible tone in addition to the visual indicator when you speak to Alexa. To enable, say “Alexa, turn on Start of Request Sound.” • Kindle Read Aloud will have Alexa read your Kindle books aloud. • Notify When Nearby will play notification sounds when you’re detected near your Echo device. • Alexa Accessibility features also include several other settings for customers with accessibility needs related to vision, hearing, mobility, and speech."
            },
            {
                "name": "Included in the box",
                "value": "Echo Dot, glacier white power adapter (15W), and Quick Start Guide."
            },
            {
                "name": "Generation",
                "value": "Echo Dot (5th Gen) - 2022 release"
            },
            {
                "name": "Privacy features",
                "value": "Wake word technology, streaming indicators, microphone off button, the ability to view and delete your voice recordings, and more. Visit the Alexa Privacy Hub to explore how Alexa and Echo devices are designed to protect your privacy."
            },
            {
                "name": "Language",
                "value": "Alexa speaks English and Spanish"
            },
            {
                "name": "Alexa Skills & Features",
                "value": "Alexa makes your life easier, more meaningful, and more fun by letting you voice control your world. Alexa can help you get more out of the things you already love and discover new possibilities you've never imagined. Discover and learn what Alexa can do."
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own an Amazon Echo, visit Manage Your Content and Devices for information specific to your device."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Anatoliy Vlasenko",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7OCJHDLGPTO75TVRTQHMTP74DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU30GI92HIYJT?ASIN=B09B8V1LZ3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars A wonderful bedside table companion",
                "reviewText": "I've recently upgraded to the Echo Dot 5th Gen, and it has been an impressive experience. This latest iteration of Amazon's popular smart speaker has brought notable improvements in sound quality, functionality, and design, making it a valuable addition to any smart home setup.The most striking upgrade in the Echo Dot 5th Gen is its enhanced audio performance. The sound quality is significantly improved from its predecessors, offering richer and clearer audio. The bass is more pronounced, and the overall sound is more balanced, making it suitable for music, podcasts, or audiobooks. It's quite remarkable how much sound this small device can produce.Design-wise, the Echo Dot maintains its compact and minimalist aesthetic, but with a more refined finish. It blends seamlessly into various home decors and takes up minimal space, perfect for placing on a nightstand, desk, or kitchen counter. The LED light ring at the base adds a futuristic touch and provides visual feedback for voice commands.The 5th Gen model continues to excel in voice recognition. Alexa responds promptly and accurately to commands, even in a room with background noise. The addition of new features and skills keeps the device versatile and functional for a range of tasks, from controlling smart home devices to setting reminders.Connectivity is another area where the Echo Dot shines. It easily integrates with various smart home ecosystems and streaming services, offering a seamless experience. The setup process is straightforward, making it accessible even for those who are not tech-savvy.Amazon has also made strides in privacy with this model. The inclusion of a microphone off button and clear disclosures on data usage are reassuring for users concerned about privacy.However, one aspect to consider is that the full functionality of the Echo Dot relies heavily on being integrated into the Amazon ecosystem. For those who are not invested in this ecosystem, some features may be less accessible or useful.In terms of value, the Echo Dot (5th Gen) is reasonably priced, especially considering the upgrades in sound quality and functionality. It offers a cost-effective way to introduce or expand smart technology in your home.In summary, the Echo Dot is a significant improvement over its predecessors, making it a compelling choice for both new and existing users. Its enhanced sound quality, sleek design, and smart features, combined with the reliability of Alexa, make it a standout product in the smart speaker market. Whether you're looking to enjoy music, manage your smart home, or simply seek the convenience of a voice assistant, the Echo Dot 5th Gen is an excellent choice.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ed T.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPYMBBRPTQF6VGPBCNNZZEU5JFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PA8N816Q1MO6?ASIN=B09B8V1LZ3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2023",
                "reviewTitle": "5.0 out of 5 stars It's exactly what you'd expect",
                "reviewText": "Purchased this as a Christmas gift and we're told it was easy to hook-up to their wifi. The sound quality is good, but not great; but then again, it's not a Bose system so that's not a knock on it. The bulb works well in the kids' room and they have fun with the changing colors. This wasn't expensive, so it was a good buy.",
                "reviewVotes": "86 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leon Portee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSFME5424N5AFRCEU2NXJ3COXMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OV4DWYB8F6TW?ASIN=B09B8V1LZ3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars A Compact Marvel",
                "reviewText": "The Amazon Echo Dot (5th Gen) is a delightful addition to any smart home setup. Let me share why this little smart speaker has won my heart:Sleek Design: The Echo Dot’s compact, spherical shape fits seamlessly into any room. Available in light blue or white, it’s both stylish and unobtrusive.Balanced Sound: Despite its small size, the Echo Dot delivers surprisingly well-balanced sound. Whether you’re streaming music, listening to podcasts, or asking Alexa for the weather, the audio quality won’t disappoint.Tap Gestures: The new motion sensors allow you to interact with the speaker by simply tapping it. It’s like having a secret handshake with your smart assistant!Eero Mesh Networking: Need better Wi-Fi coverage? The Echo Dot doubles as an Eero mesh network node, ensuring a strong and reliable connection throughout your home.Affordable Price, the Echo Dot offers incredible value. It’s the perfect entry point for anyone dipping their toes into the world of smart speakers.Alexa at Your Service: Ask Alexa to play your favorite tunes, set reminders, control smart devices, or even tell you a joke. She’s always ready to assist.While the Echo Dot (5th Gen) lacks a 3.5mm jack and has a limited frequency range, these minor quibbles fade in comparison to its overall performance. Plus, if you’re willing to spend a tad more, consider the Echo Dot With Clock—it adds an LED display for useful information.In summary, the Amazon Echo Dot (5th Gen) is a smart speaker that punches above its weight. Whether you’re a tech enthusiast or a casual user, this little marvel will enhance your daily life. Highly recommended!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kathryn Magendie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5OTJDIHBG4SYLRYWKS7MR7NWUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VKDDUE7RSEX1?ASIN=B09B8V1LZ3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Clearer sounding than the 4th Gen",
                "reviewText": "I have a 4th Gen that I bought cheap on a Prime Day Deal and I've enjoyed it, but wanted to try out the 5th Gen. There's not a huge difference except:-Sound/music is louder and clearer-Takes temperature inside the room-There's only one port in the back so be aware of that-The navy blue color is all one color and I like that (and the color)-When someone calls me, the music stops (I don't think it did this with the 4th Gen but maybe I'm not remembering correctly)-You can tap to pause and to replay but I rarely use this -sometimes I have to tap several times-There may be other features that differ from the 4th but I've not discovered them yet if there areAs with the 4th and 5th:Easy set up. Routines are nice. Responsive. I like the way I can control my smart plug.I was also easily able to set it up so that I can have my 4th Gen on one side of the house and the 5th in another and play music on both so as I move about my house, I always hear the music, and I can use them independently as well. You can have them as right and left speakers but I didn't care about that.I'm happy with my order. But would I have been just as happy keeping my 4th Gen? Maybe. Still, nice to have a bit of an upgrade.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}