{
    "remaining_requests": 46596,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Pyle-Woofer-Sound-Speaker-System/dp/B000FMPENQ",
    "body": {
        "name": "Pyle 6.5 Inch Mid Bass Woofer Sound Speaker System - Pro Loud Range Audio 300 Watt Peak Power w/ 4 Ohm Impedance and 60-20KHz Frequency Response for Car Component Stereo PLG64,Yellow",
        "price": "$26.79",
        "originalPrice": "",
        "rawPrice": 26.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Pyle-Woofer-Sound-Speaker-System/dp/B000FMPENQ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C5HRW76B"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ML glG KL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51-SfEYmrYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VDpRDrimL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rL6tYKvnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51I-aeGERpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51W1NfWj7PL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61hYD1i4evL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7a334307-aa30-4749-8d47-d3a9cf654b6f/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/61LCACQx9sS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/61LCACQx9sS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Pyle Store",
            "link": "https://www.amazon.com/stores/PyleUSA/page/D79E9149-99F8-49A4-8E8C-D24560694FC2?ref_=ast_bln"
        },
        "brand": "PyleUSA",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 3917,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35. Order within 38 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "AUTO SPEAKER SYSTEMS: Pyle GEARX series woofer is the latest series which have been designed and engineered for consistent and high performance. The 6.5 inch feature an eye-catching yellow CD P.P. cone for plenty of stiffness without added weight.Speakers maximum output power:300 watts.Impedance: 4 ohm.Power source type:Corded Electric.Speaker size:6.5 inches",
            "LOW IMPEDANCE: The 4 ohm component audio speaker compensates the undersized wire found in many of today’s cars. It also make the most of every 300 watts peak power your car stereo can deliver with rubber magnet boot cover",
            "MID BASS WOOFER: Pyle pro mid bass woofer sound speaker system has 30 oz. magnet structure and 60 Hz – 20 kHz frequency response that complete the package. It helps to provide smooth, loud and detailed sound",
            "POWERFUL FEATURES: The specially treated rubber surround keeps your speakers secure and extending the life of the product. A 1” high-temperature aluminum voice coil provides the richest sound, ensuring low distortion and providing an open sound stage",
            "WORRY-FREE SHOPPING: With the Pyle PLG64, we are confident of the quality of our product, therefore, we offer a 30 day money back guarantee no questions asked",
            "Yellow CD P.P. Cone - Magnet Weight: 30 Oz",
            "Specially Treated Rubber - Impedance: 4 OHM",
            "Edge Suspension - Rubber Magnet Boot Cover",
            "1.0'' High Temperature - 300 Watts Peak Power",
            "Aluminum Voice Coil - Mounting Depth: 2.84\""
        ],
        "description": "Get in gear with the Pyle Gear-X series These speakers are designed to provide the best quality sound for the budget-minded enthusiast. This 6.5' woofer has 300 watts of pure power supported by a 1' high-temperature voice coil to boost the low end. Hear the rumbling lows of your favorite music thanks to the 30 oz. magnet structure. The non-fatiguing butyl rubber surround and yellow-color poly-injection cone provide a sturdy foundation for keeping your sound crystal clear and distortion-free. To boost performance, these speakers have been equipped with a strong capacitor, meaning your speakers will never struggle for power. These speakers look cool, too, thanks to the yellow-coated plastic basket. You'll hear everything you were meant to hear with Pyle Gear.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Car & Vehicle Electronics",
                "link": "https://www.amazon.com/Vehicle-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3248684011"
            },
            {
                "name": "Car Electronics",
                "link": "https://www.amazon.com/Car-Electronics/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1077068"
            },
            {
                "name": "Car Audio",
                "link": "https://www.amazon.com/Car-Audio-Video-Electronics/b/ref=dp_bc_aui_C_4?ie=UTF8&node=226184"
            },
            {
                "name": "Subwoofers",
                "link": "https://www.amazon.com/Subwoofers-Car-Speakers-Audio-Video/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3009141"
            },
            {
                "name": "Component Subwoofers",
                "link": "https://www.amazon.com/Car-Subwoofers/b/ref=dp_bc_aui_C_6?ie=UTF8&node=1294866011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "8.07 x 14.37 x 14.37 inches"
            },
            {
                "name": "Item Weight",
                "value": "30 Ounces"
            },
            {
                "name": "Manufacturer",
                "value": "Pyle"
            },
            {
                "name": "ASIN",
                "value": "B000FMPENQ"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "PLG64"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 3,917 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#15,718 in Electronics (See Top 100 in Electronics) #11 in Car Component Subwoofers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "November 20, 2005"
            },
            {
                "name": "Speakers Maximum Output Power",
                "value": "300 Watts"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "PYLE"
            },
            {
                "name": "Model Name",
                "value": "PLG64"
            },
            {
                "name": "Speaker Type",
                "value": "Woofer"
            },
            {
                "name": "Special Feature",
                "value": "Radio"
            },
            {
                "name": "Subwoofer Diameter",
                "value": "6.5 Inches"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "FEATURES AUTO SPEAKER SYSTEM Pyle GEARX series woofer is the latest series which have been designed and engineered for consistent and high performance The 65 inch feature an eye-catching yellow CD PP cone for plenty of stiffness without added weight LOW IMPEDANCE The 4 ohm component audio speaker compensates the undersized wire found in many of today’s cars It also make the most of every 300 watts peak power your car stereo can deliver with rubber magnet boot cover MID BASS WOOFER Pyle pro mid bass woofer sound speaker system has 30 oz magnet structure and 60 Hz – 20 kHz frequency response that complete the package It helps to provide smooth, loud and detailed sound POWERFUL FEATURES The specially treated rubber surround keeps your speakers secure and extending the life of the product A 1” high-temperature aluminum voice coil provides the richest sound, ensuring low distortion and providing an open sound stage",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b03c0419-0f84-4f42-8f07-c72adb8412db.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7be41167-6858-4e23-9021-92e0fed2c53c.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90e0312d-aba9-4304-88d6-a74cc2219456.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03dc4402-4aa5-486e-a3c4-2e897b2e3fd9.__CR0,0,2000,2000_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Yellow CD P.P. Cone Specially Treated Rubber Mounting Depth: 2.84\" Cut-out Size: Φ140 mm Weight: 3.19 lbs. Pyle 6.5 Inch Mid Bass Woofer Sound Speaker System Pro Loud Range Audio 300 Watt Peak Power The specially treated rubber surround keeps your speakers secure and extending the life of the product A 1” high-temperature aluminum voice coil provides the richest sound, ensuring low distortion and providing an open sound stage. Pyle pro mid bass woofer sound speaker system has 30 oz magnet structure and 60 Hz – 20 kHz frequency response that complete the package It helps to provide smooth, loud and detailed sound AUTO SPEAKER SYSTEMS LOW IMPEDANCE MID BASS WOOFER POWERFUL FEATURES",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d13ed23c-9eae-4442-bcb9-9789152adc15.__CR0,0,3000,4000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dc4b2466-65fe-401f-ba2d-4766719453d3.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "PLG64 PLG6C Product Dimensions 8.07 x 14.37 x 14.37 inches 6.85 x 3.23 x 3.23 inches Item Weight 1.88 pounds 5.19 pounds",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ee579023-d017-4121-bbea-b13eab3f8bec.__CR0,0,3000,1856_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b03c0419-0f84-4f42-8f07-c72adb8412db.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7be41167-6858-4e23-9021-92e0fed2c53c.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90e0312d-aba9-4304-88d6-a74cc2219456.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03dc4402-4aa5-486e-a3c4-2e897b2e3fd9.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fd5132b7-cb98-4968-9a6f-c51d62bae884.__CR0,0,3000,1856_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d13ed23c-9eae-4442-bcb9-9789152adc15.__CR0,0,3000,4000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dc4b2466-65fe-401f-ba2d-4766719453d3.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bd92e504-272b-4723-8da8-99620be50271.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4e409b80-e4f3-4050-873f-82f86d0fa1c1.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Richard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6ZJN37KZOVCBVKOJL5AXBWTMPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14WLO6Q2BHZCR?ASIN=B000FMPENQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2013",
                "reviewTitle": "5.0 out of 5 stars Meaty Sound; replaces sub-woofer for me.",
                "reviewText": "****************** UPDATE May 2015 *********************2 years and still running fine. I enjoy the set up so much, I wanted to write an update to commend these speakers.Reading the 1star review for this really makes me feel so sad for humanity. People who are rating 1 or 2 stars for this are pretty much just revealing to everyone how ignorant they are. That being said, ignore those reviews, and notice how it weighs on 5 star reviews.Using these mid woofers in the rear with full range in the front makes for a very enjoyable listening experience.Using only stock (full range) speakers; the sound stage feels like a narrow strip of flat sound coming from my dash area (chest area and above). Using these in the rear, it makes it like my entire car cabin is the sound stage, and increases depth of sound stage (from the floor of the car).They have an interesting sound character and make music very enjoyable to listen to and physically feel. Since there's more energy in the low/ mid range, the overall sound is more textured, and the vibrations you can feel are in the range of sound that have more musical significance than what you feel with low blasting sub woofer.(Comparing to a protege5 oem stereo : the audio sounds textually very flat, and the stock subwoofer is just so boomy. Very V shaped. Makes me think of a glossy magazine cover, vs. shoe box diorama. The sound has a high wattage glossyness to it, but it's not stimulating to my ears. The top is just harsh, and the sub woofer isn't providing any musically significant sound.)Well, probably any brand mid-bass woofer will be enjoyable (I don't know since these are my first mid woofers), but these were the cheapest so I went with these.The audio enjoyment you will get from adding these to full range speakers will be much greater than the cost of these speakers, and having that surplus increases the enjoyment even more. :)*********************************************************************************************I am using these for my rears in my 95 Accord LX with Dual XDM6400 stereo. My fronts are Pioneer TS-G1643R.(Accord specific comments: My stock rear speakers are 5.25\", I think; and it fits into a weird 6x9 looking adapter, that bolts in with 3 bolts; kind of weird. Anyway, to get these in; I had to drill some holes into said adapter, and pick up some small nuts and bolts to attach the speakers to the adapter. The Accord stock wiring clip can come apart somewhat; so that you can take the wiring out of the clip, and slide it onto the speaker leads.)I enjoy sound with a subwoofer; but I don't like the idea of lugging around 20-40lbs of junk in my trunk, plus the wear on my car battery and rear suspension, and loss in handling. For me, these mid range speakers sort of replace a subwoofer; in that they give me punch in the lower range, and that they give me piece of mind that I have something a bit more powerful, and more specific range than regular speakers in my rears. They however, do not have the lower extended range that subwoofers have, and are not an all out replacement for a subwoofer.I am pleasantly surprised how meaty these speakers make my music. Personally, in my car, I listen to electronic, rock, jazz, pop, jpop. Certain genres seem to make more sense now; especially Rock for some reason, or songs w/ rock instrumentals. Electronic music sounds great too.Since they are \"mid-bass\" woofers, I was sort of expecting as if you push up the mids in your eq - it might sound muffled, fuzzy and not very appealing. But that is not so! (well, maybe by themselves they sort of sound like that, but I'm using them with my Pioneer fronts covering the top). These speakers don't sound like they push up your eq mids, but more like they add more physical impact/resonance to your mid/lower range, giving your sound a bit more depth and texture. I would describe it like running your hands over a cobble stoned street; if that makes sense; kind of lumpy, and hard, and smooth, and dense, and textured.I do have some distortion when the volume is turned up; but I believe it has to do more with my head unit than the speakers. I am just using them with my Dual head unit, on stock wires, and they are good enough for me. I imagine they will be more robust sounding if you are using and amp and with crossovers.For $11-13 each; I think these speakers are pretty great value for sound, if you have another pair that is already covering your highs. They make music more enjoyable by adding some depth, punch, and texture to the sound.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Morgan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVLIAEZUT352MSUCI5JDEBREIMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RI6F2B3FAV08C?ASIN=B000FMPENQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "5.0 out of 5 stars A Powerful Sonic Upgrade",
                "reviewText": "I recently added the Pyle 6.5 Inch Mid Bass Woofer Sound Speaker System to my car's audio setup, and it has been a powerful sonic upgrade that transformed my driving experience. These speakers, part of the Pro Loud Range, are a testament to quality and performance. 🚗🔊🎶The sound quality delivered by these speakers is remarkable. It's like having a live concert in my car. The clarity, depth, and precision of the audio are impressive. Whether it's the thumping bass or the crystal-clear vocals, these speakers excel in delivering an exceptional listening experience. It's more of a sonic immersion than a typical car audio upgrade. 🎵👂🎤The 300 Watt peak power is music to my ears. It's like unleashing the full potential of my car's audio system. These speakers have the ability to fill my vehicle with rich, distortion-free sound that enhances every song. They're perfect for audiophiles who crave a dynamic and powerful audio experience. It's more of a soundwave celebration than a mere upgrade. 📣🔊The 4-ohm impedance and 60-20KHz frequency response ensure compatibility and versatility. It's like having a universal remote for your audio needs. These speakers are designed to work seamlessly with various car audio systems, and they handle a wide range of frequencies. It's more of an audio harmony than a one-note wonder. 🔄📻In conclusion, the Pyle 6.5 Inch Mid Bass Woofer Sound Speaker System is a game-changer for car audio enthusiasts. The exceptional sound quality, high peak power, and versatile compatibility make these speakers a must-have for anyone looking to elevate their in-car audio experience. If you're seeking a powerful sonic upgrade that turns your car into a concert hall on wheels, these speakers are the way to go. Highly recommended! 🚀🚗🎶👍",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "netman9111",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEK5MQJEVLLZIFGWUQTXXHE2M4IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRTHE8S81L6ZT?ASIN=B000FMPENQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "4.0 out of 5 stars There Good for the price.",
                "reviewText": "Installed these in the rear doors of 2002 Cadillac Escalade.Replaced the stock speakers, Bose were totally worn out.These are an upgrade to the Factory speakers.They do have More bass. On the factory amp, They Did ok,Not awesome, but not bad. I installed a sound stream amp, That helped them a lot.With the amp they sound pretty good, had to noise kill the doors, to stop some vibration.Iv owned better. But considering the price, There probably as good as youl find.Im going with 4/5 Price vs Performance. There a good deal at the lower price point.No there are not as good as Jl-audio, or other higher priced subs.They are Good for a budget install or factory speaker replacement.They should work until I have the money for some more expensive replacements.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 5, 2023",
                "reviewTitle": "EXELENTE PRODUCTO",
                "reviewText": "Buena calidad buen Sonido 100% recomendado",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ion",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 24, 2024",
                "reviewTitle": "Buon rapporto qualità prezzo",
                "reviewText": "Per quel che costa la qualità dell'audio non è male. L'unica pecca è che,essendo plastica,alle frequenze molto alte si sente che è plastica. Per quel poco che costa comunque ha una buona qualità audio",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angel Jiménez fernandez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on October 9, 2023",
                "reviewTitle": "Calidad sonora",
                "reviewText": "Calidad de medios gravesMuy buen sonido nada que envidiar a grandes marcas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 13, 2023",
                "reviewTitle": "Nickel",
                "reviewText": "Vraiment satisfait. Très bonne qualité et en plus pas cher.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NatNat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 27, 2023",
                "reviewTitle": "Excellent value for money great sound",
                "reviewText": "£20 per speaker bought 2 to upgrade my Land Rover discovery rear door pod. Old Harman Kardon speakers were shot so put these in wow what a difference they made. Very well made and sound for money is perfect. Worth double what I paid easy when put up against a top make.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71h8v58n9OL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$26.79",
                "sellerName": "GEP Sales",
                "sellerRating": "5"
            }
        ]
    }
}