{
    "remaining_requests": 46524,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sonos-Play-Mid-Sized-Streaming-certified/dp/B005441AJC",
    "body": {
        "name": "Sonos Play:3 - Mid-Sized Wireless Smart Home Speaker for Streaming Music, Amazon Certified and Works with Alexa. (Black)",
        "price": "$259.82",
        "originalPrice": "",
        "rawPrice": 259.82,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sonos-Play-Mid-Sized-Streaming-certified/dp/B005441AJC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B00XTGX3ME"
        ],
        "asinVariationValues": [
            {
                "asin": "B005441AJC",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$259.82",
                "variationImageURL": "https://m.media-amazon.com/images/I/21H0ZPT6NRL._SS36_.jpg"
            },
            {
                "asin": "B00554S24W",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$230.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/21WZFAFJM9L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51FC HchevL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51672WFZSxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51iwGd1YJXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gkdCzWZaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OTZy 7bBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41oxxIHpzhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61BFAWAxdcL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/376eb11d-88b5-4c67-8eea-76e9443c4bf2/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/52854218-83e8-5c0b-b030-be6f86490a36/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d79ac0ab-546f-4daa-b4de-42c0e0ce8abb/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4a699ef3-1bd2-4702-9d01-768150da3799/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3cfb4e0e-1b7a-4137-8494-c27518cd80ff/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fc342f51-07f0-4754-84f7-1027fefe047b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/17fd2104-0d91-4be4-bd36-81595f54b69c/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 7,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91exx2YVVJL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/31T9SDsi6yS.pdf"
        },
        "byLineInfo": {
            "name": "Brand: Sonos",
            "link": "https://www.amazon.com/Sonos/b/ref=bl_dp_s_web_2530477011?ie=UTF8&node=2530477011&field-lbr_brands_browse-bin=Sonos"
        },
        "brand": "Sonos",
        "merchantInfo": "Sold by Renovar Tech and Fulfilled by Amazon. Ships from and sold by CellularStream.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1581,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "FREE delivery February 14 - 16.",
            "Or fastest delivery Tuesday, February 13. Order within 13 hrs 19 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Delivers richer and deeper sound than play:1, making it perfect for spots where you have more room",
            "Connect your play:3 to any Amazon echo or Alexa enabled device, then just ask for the music you love",
            "Play different songs in different rooms at the same time; Or, pump one song in perfect sync, throughout your home",
            "Set up in five minutes using your home wifi; Easily expand your home audio system over time by adding wireless speakers to additional rooms whenever you’re ready",
            "Wirelessly stream all your favorite music services like Amazon music, Pandora, Apple music, and Spotify"
        ],
        "description": "Wirelessly stream your entire music library, favorite music services, and thousands of radio stations to any room. Place the SONOS PLAY:3 Wireless Hi-Fi System vertically or horizontally, mount it on a wall or hide on a shelf. Set up simply, and expand until every room in your home is packed with music. Control the SONOS PLAY:3 Wireless with free apps for your phone, tablet, and computer.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Portable Audio & Video",
                "link": "https://www.amazon.com/Portable-Audio-Video/b?ie=UTF8&node=172623"
            },
            {
                "name": "Portable Speakers & Docks",
                "link": "https://www.amazon.com/Speaker-Systems-MP3-Player-Accessories/b?ie=UTF8&node=689637011"
            },
            {
                "name": "Portable Bluetooth Speakers",
                "link": "https://www.amazon.com/bluetooth-speakers/b?ie=UTF8&node=7073956011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "12.3 x 9.5 x 8.6 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.6 Kilograms"
            },
            {
                "name": "Manufacturer",
                "value": "Sonos"
            },
            {
                "name": "ASIN",
                "value": "B005441AJC"
            },
            {
                "name": "Item model number",
                "value": "PLAY3US1BLK"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,581 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,147 in Home Audio Speakers #3,989 in Portable Bluetooth Speakers #19,649 in MP3 & MP4 Player Accessories"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "July 20, 2011"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Sonos"
            },
            {
                "name": "Model Name",
                "value": "Play:3"
            },
            {
                "name": "Speaker Type",
                "value": "Wireless"
            },
            {
                "name": "Connectivity Technology",
                "value": "Sonos"
            },
            {
                "name": "Special Feature",
                "value": "Wireless"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Stereo sound. Even if you’re not an all-out audiophile, you still deserve great sound. Play:3 delivers, in stereo. Three Class-D amplifiers and three custom-built drivers create a full, wide sound stage so the instruments and vocals really shine. There’s also a bass radiator to pump out the lows. Multiple orientations. Stand it tall or set it on its side. Either way, Play:3 automatically optimizes the sound. When it's horizontal, it's in stereo. When it's vertical, it's in mono. The rubber feet on two sides make it safe for any surface.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/99d8bb8f-cd89-44f0-8039-05dee2b68c17._CR0,0,650,350_SX650__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/14c58a47-4f8a-4034-8667-23d1d4bfb784._CR0,0,650,350_SX650__.jpg"
                ]
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Sonos Comparison Chart Play:3 One Play:5 Voice Control When connected to Alexa device Voice Control Yes - Alexa built in Voice control When connected to Alexa device Drivers 3 Drivers 2 Drivers 6 Line-in No Line-in No Line-in Yes Multiple orientations Yes Multiple orientations No Multiple orientations Yes Wall mountable Yes Wall mountable Yes Wall mountable Yes",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/02543b1e-f765-4d25-8c35-55a582d969f5._CR0,163,1300,975_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b9fa6377-28f7-40eb-a899-0ca7b1c3255a._CR0,0,300,225_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/911e3684-d4ff-44f9-91c1-a962b7f6faec._CR0,163,1300,975_SX300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/7c7ea87e-e5bc-4f7b-ad6c-84cbcb08dca9._CR0,0,1464,600_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/45419e27-a5f1-46c6-b175-d07fbb8e917b._CR0,0,1464,600_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/99d8bb8f-cd89-44f0-8039-05dee2b68c17._CR0,0,650,350_SX650__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/14c58a47-4f8a-4034-8667-23d1d4bfb784._CR0,0,650,350_SX650__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7012f8e4-884e-4635-837a-d4831cee65c8._CR0,0,1464,600_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a3f6a285-9eba-48a8-8c3f-c31982ba4abd._CR0,0,1464,600_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d80903a9-43fd-4a4a-96ae-821383f38490._CR0,0,1464,600_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d500f5d3-8288-4dd0-a768-63f9fe69e2b7._CR0,0,3050,1250_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/02543b1e-f765-4d25-8c35-55a582d969f5._CR0,163,1300,975_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b9fa6377-28f7-40eb-a899-0ca7b1c3255a._CR0,0,300,225_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/911e3684-d4ff-44f9-91c1-a962b7f6faec._CR0,163,1300,975_SX300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZA3RYZOOPECQCP6ONTIQPJHGJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QF75COY4FU9N?ASIN=B005441AJC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2012",
                "reviewTitle": "5.0 out of 5 stars Remarkable Home Wireless Music System",
                "reviewText": "I've been using the Sonos Play 3 for a couple of weeks now with a Sonos wireless bridge and I have to say it is quite a remarkable system. I never give 5 stars, but I have never been so impressed with a technology system before. Very simple to use, well designed, and the controller app for PC and IOS is excellent. The Play 3 sound quality is quite good for a small set of powered speakers. The major benefit of the Play 3 is the easy portability of the system. I can move it to the porch or garage and within a minute the system is linked (you can easily tell its status - when the white led stops blinking, it is connected) and can use my ipad or iphone to control what I want to listen to. The ease of set up with the bridge is quite good. The system uses a simple auto-connect process to add devices to the Sonos network where, after being prompted by the application software, you press a button on the Sonos device and it automaitcally searches for a Sonos network to join. This is similar to the easy connect process many new wireless routers use to add devices. No passwords, but secure.The Sonos wireless bridge does not use a standard wifi network, it creates its own proprietary wireless Sonos network which cannot be seen by standard wifi devices. I believe the Sonos uses some of the channels in the 2.4GHz range. I have not seen any interference issues with my existing wifi network.You should do the initial set up from a PC or Mac, not a mobile device. I tried to do the initial set up from my ipad but when I added the app to my PC, the devices weren't recongnized and I had to reinitialize the system. To be fair, the Sonos app warned me that it is recommended to initialize the system from the pc app, so I don't consider this a problem - it was no big deal.The design of the components is very good, not cheap or cheesy looking, and the ease of use is excellent. One's reaction is that this is the wireless music system I'd expect to see come from Apple in terms of robustness, design, and ease of use. Although my first reaction was that the system seemed to be a bit expensive, the Play 3 is not much more than a set of of higher end powered PC speakers, and when you include the Sonos functionality, my assessment changed to thinking it was actually a good value.The system integrates easily with iTunes library and seems to support almost any media library. I've only really started to explore this aspect. Setting up music queues and playlists is trivially simple. The biggest drawback is that it is addictive - since getting the Play 3, I've added a Play Connect to my existing stereo amp and speakers. I can play to and from the Sonos system with my stereo now. This is really cool - I can play different streaming radio or music library tunes on the different Sonos devices in different rooms, or the same, or whatever the heck I want to do - all easily controlled from the Sonos app. I'm just seeing how soon before I justify another Sonos component. It's clear there is a very complex technological base for the Sonos system, both hardware and software, but that complexity is well hidden behind a simple to use interface for the user.Sonos may not be the \"cheapest\" system for home music, but it is the best. I did a lot of research before purchasing and no one else nailed this application nearly as well as Sonos. It just does this, but it does it exceptionally well. Over the years, we've made a significant investment in our music library and I view the Sonos as a great way to unlock the value in this investment by making it easy for me to enjoy my library wherever I am in the house. Kudos to the Sonos team for a job well done.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6VJYLVYJCQIXUEIBSVKZGRUGVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN5ID0CIWT8DB?ASIN=B005441AJC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 5, 2011",
                "reviewTitle": "5.0 out of 5 stars 12 Minutes to amazing sound quality",
                "reviewText": "I have a Sonos system already with two ZP120's and two ZP90's as well as an iPod dock and to unpack and have Pandora playing on my Sonos Play 3 was 12 minutes. The large majority of the time was a software update and carefully cutting away the tape at the top of the package. Like all Sonos components, the set-up is easy and fast. Friends of mine have been blown away by how good my speakers sound running Pandora, internet radio and my iTunes library and I am not sure I understand WHY either-just that it is. Sonos sounds great.Positives: This item is not very big but produces big sound with full bass. I am a slight audiophile and cannot imagine being able to get much better sound out of a box that size. Great mids and excellent detail on the highs. I have it in a bedroom that is medium sized and of course it fills up the whole room with more than enough sound. I cannot imagine someone not being happy with this quality of sound given the size of this box.Easy to set-up and melds beautifully with your other Sonos components.Ability to meld with a 2nd Play 3 to form a more robust sound.Great sized footprint-not too big not too small.Only one wire-and that's the power plug. That gets you basically unlimited music from your library or online streaming as well as a robust and beautiful sound.Negatives: The item is average looking and not extremely attractive-but then again it's just a boxNo connections on the back except an ethernet port. No line in and certainly no option to power additional speakers off of this unit. Literally, there are NO other connections on this item and most \"Dock\" like speakers have a line in. What this means is that if you want to use it as your speaker for your DVD player, DVR or a music player not connected wirelessly with Sonos, you are not going to be able to.Not cheap. The comparison I can think of off hand is the Bose Sounddock-which obviously does not have the wireless capability that this item has-and the Sounddock is more expensive than the Play 3-so considering all that can be done with this Play 3-it's probably priced about right but there are no giveaways here.Summary: I am thrilled with this item and will now probably look to get a Play 5 for a larger room downstairs and get rid of my ZP120 down there. The Play 5 does have a deeper more full sound but it's $100 more and has a much larger footprint. Also, I will probably get two Play 5's and then I can use them as stereo or move them around the house easily and still connect to my Sonos network. If you have a space where you don't need/want a lot of wires and don't have a lot of space for speakers with a ZP120 or ZP90 with an amp-this item is for you. In small to medium rooms, this will give you the sound you want. An extremely impressive product that I cannot speak highly enough about!",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fer García",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 21, 2019",
                "reviewTitle": "Excelente calidad de sonido con un diseño sumamente atractivo",
                "reviewText": "Tenía algún tiempo considerando comprar una de estas bocinas conectadas mediante WiFi. Al final decidí comprar una SONOS. Para empezar, su configuración fue bastante sencilla: simplemente con descargar la aplicación, encontrar el dispositivo y emparejar las distintas cuentas de música en la nube para que tenga opciones para reproducción. Para su control instalé aplicaciones para Android, iOS en iPad y aplicaciones para Mac y PC.Estoy muy contento con la bocina, tanto su calidad de construcción, sonido y diseño son muy buenos. De manera particular, la calidad de sonido de la bocina es sensacional, realmente superó mis expectativas: el sonido es muy claro y suficientemente fuerte para llenar el nivel inferior de nuestra casa. En mi opinión las frecuencias bajas son adecuadas: no soy una persona que disfruta particularmente de música con bajos muy potentes, así que, en mi caso personal, el sonido que emite esta bocina, para el tipo de música que escucho, es más que adecuado, sin embargo es algo que a alguien podría no serle suficiente porque busquen alguna opción con un bajo más marcado.Como puntos negativos solamente pondría que la bocina tuviera la capacidad de conectarse de manera \"offline\" a mis dispositivos: si no estuviera inscrito a servicios de música en la nube la bocina sería, básicamente, inservible; eso significa también que si no tuviera servicio de Internet (o fuera de una mala calidad) también no podría hacer mucho con ella; no es un problema en mi caso (y creo que para la mayoría de la gente tampoco debería serlo), pero sí es algo a tomar en cuenta que podría evitar que SONOS se convirtiera en el sistema de sonido principal de su hogar.Recientemente adquirí una bocina Alexa (Echo Dot de 3a generación) y le instalé la skill de SONOS; de esta manera puedo iniciar la reproducción de música en mi bocina SONOS mediante instrucciones habladas hacia Alexa. Aunque la experiencia no es completamente impecable, creo que es lo suficientemente buena para poder realizar tareas de reproducción comunes sin tanto problema. Una característica que me agrada es que, cuando la reproducción de la SONOS es iniciada por Alexa, cuando ésta última recibe una instrucción por voz, el volumen de la SONOS es reducido para que no exista interferencia al hablar a la bocina de Amazon.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GreyMittens",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 30, 2015",
                "reviewTitle": "Another Sonos Hit!",
                "reviewText": "My Sonos play 3 just arrived today and set up took me all of 2 minutes... mostly was unpacking :) I have a sonos connect on my home stereo so a sonos network already active. I plugged in the play 3, loaded my sonos app and 'add new sub/device' from settings menu then pressed the top and middle button on play 3. Bingo, new device setup. It asked me a zone name (Bedroom, Kitchen, Patio etc.) and that was it.Now my connect can play from the living room on a streaming station and my patio zone a different station {though usually I think I would only have one going anyway). The Sonos play 3 has to be plugged in (no batteries) so if it is outside, you will need access to an outlet. Also, these are not meant to be permanently installed outside and at a couple hundred a speaker, I would be worried about it walking away.The sound is really impressive for a single little box (single tweeter, 2 mid woofers). For setup / testing I did just have it plugged into a kitchen outlet. My kitchen and living room is a large open area with vaulted ceiling and it could comfortably function for this area. Very crisp and clear with a little base poking it's head out.I'm rather new to Sonos and their devices (maybe a year now?) but really like the products they kick out. Easy to install, easy to use and sound good. Not sure how this compares to play 1 or 5 beyond what is on paper / specs but happy with my purchase. Hopefully this summer my neighbours outside are too! :)gm",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kavita Boga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 6, 2015",
                "reviewTitle": "This speaker completes my suround system & the sound is very good. Unfortunately Sonos has no customer care in India ...",
                "reviewText": "I have bought a complete Sonos system In the US last year , It takes a short while to familiarise to the sonos way then its a breeze setting up.This speaker completes my suround system & the sound is very good .Unfortunately Sonos has no customer care in India so all repairs are handled by the country you have purchased them fortunately there is a 2 year warranty which will only cover the units located in the USA.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 5, 2018",
                "reviewTitle": "It does one thing beautifully, but ONLY ONE THING",
                "reviewText": "The sound quality of the Sonos speaker is truly as good as you've heard, and truly as good as you have read in the 5-star reviews. The top-quality cones deliver crisp highs, rich mids, and super-beautifully defined bass. Best sound for the price point you're going to find anywhere. That's all I'll say about that.CONS: Sonos advertises itself as a music streaming system, and you need to understand that STREAMING MUSIC IS THE ONLY THING IT DOES. It will not play any video-related software. It will not amplify your phone calls. It will not play the audio from movies on your laptop. It will not play the system sounds from your device. It will not play the audio output from games or phone apps. YouTube, Netflix, iMovie, iTunes films, Headspace, Guitar Hero, NFL Game Pass, Periscope, WhatsApp, Messenger, Facebook, Skype, Instagram vids, news apps, sports casts, Chrome, Safari, Firefox and Opera are all screwed with a Sonos speaker. If you only want a speaker for your streaming music (Spotify, Pandora, internet radio, or from your device's music storage) then get Sonos for unparalleled sound quality. If you want a computer speaker or a complete home audio system, buy another product.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Casicien",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 16, 2017",
                "reviewTitle": "El futuro del audio en casa",
                "reviewText": "Excelente opción de audio en casa. resulta sorprendente la configuración de los equipos por medio de una App. El sonido es casi excelente y la calidad de los altavoces es suprema, son pesados y con materiales de excelente calidad.Lo recomiendo ampliamente para ir equipando la casa con excelente sonido, el cual puede ser independiente o separado.Muy buena compra y excelente servicio de Amazon México.Los contras, crean adicción y querrás tener una bocina en cada rincón de tu hogar (y no son nada baratos).",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}