{
    "remaining_requests": 46568,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/All-new-Echo-Show-5/dp/B09B2SBHQK",
    "body": {
        "name": "All-new Echo Show 5 (3rd Gen, 2023 release) | Smart display with 2x the bass and clearer sound | Charcoal",
        "price": "$89.99",
        "originalPrice": "$89.99",
        "rawPrice": 89.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/All-new-Echo-Show-5/dp/B09B2SBHQK",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BZTW3TCH"
        ],
        "asinVariationValues": [
            {
                "asin": "B09B2SBHQK",
                "variationName": "Color",
                "variationValue": "Charcoal",
                "price": "$89.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31y0XqyhvFL._SS36_.jpg"
            },
            {
                "asin": "B09B2SRGXH",
                "variationName": "Color",
                "variationValue": "Cloud Blue",
                "price": "$89.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31U-88Tot-L._SS36_.jpg"
            },
            {
                "asin": "B09B2QTGFY",
                "variationName": "Color",
                "variationValue": "Glacier White",
                "price": "$89.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/211JaTJu-4L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "20",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Aq1xp12KL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41tcx4sZ2qL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51GTEiZNlcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Abv5YeZqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Rrqfsg4eL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51M75CeWhrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nNarFykxL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 22299,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Tuesday, February 13. Order within 11 hrs 33 mins",
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Thursday, February 15. Order within 12 hrs 18 mins",
            "FREE pickup Saturday, February 17",
            "Or fastest pickup Tuesday, February 13. Order within 23 hrs 33 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Reducing CO2 products reduce their carbon footprint year after year. Certified by the Carbon Trust."
        },
        "features": [
            "ALEXA CAN SHOW YOU MORE – Set alarms and timers, sleep soundly with a relaxing playlist, start your morning with a smart home routine, see your calendar or weather clearly - all with your voice.",
            "SMALL SIZE, BIGGER SOUND – Stream your favorite music, shows, podcasts, and more from providers like Amazon Music, Spotify, and Prime Video—now with deeper bass and clearer vocals. Includes a 5.5\" display so you can view shows, song titles, and more at a glance.",
            "KEEP YOUR HOME COMFORTABLE – Control compatible smart devices like lights and thermostats, even while you're away.",
            "SEE MORE WITH THE BUILT-IN CAMERA – Check in on your family, pets, and more using the built-in camera. Drop in on your home when you're out or view the front door from your Echo Show 5 with compatible video doorbells.",
            "SEE YOUR PHOTOS ON DISPLAY – When not in use, set the background to a rotating slideshow of your favorite photos. Invite family and friends to share photos to your Echo Show. Prime members also get unlimited cloud photo storage.",
            "STAY CONNECTED WITH VIDEO CALLING – Use the 2 MP camera to call friends and family who have the Alexa app or an Echo device with a screen. Make announcements to other compatible devices in your home.",
            "DESIGNED TO PROTECT YOUR PRIVACY — Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls including a mic/camera off button and built-in camera shutter, as well as support for viewing end-to-end encrypted Ring video.",
            "DESIGNED FOR SUSTAINABILITY – This device’s fabric is made from 100% post-consumer recycled polyester yarn and aluminum is made from 100% recycled aluminum. The device packaging is 100% recyclable."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Size",
                "value": "5.8”W x 3.6”D x 3.2”H (147mm x 91mm x 82mm)"
            },
            {
                "name": "Weight",
                "value": "16.1 oz (456 grams) Actual size and weight may vary by manufacturing process"
            },
            {
                "name": "Display",
                "value": "5.5” touch screen"
            },
            {
                "name": "Camera",
                "value": "2 MP camera with built-in shutter (Photo quality/size may vary)"
            },
            {
                "name": "WiFi connectivity",
                "value": "Dual-band wifi supports 802.11a/b/g/n/ac wifi networks. Does not support connecting to ad-hoc (or peer-to-peer) wifi networks."
            },
            {
                "name": "Amazon Sidewalk",
                "value": "A shared network that helps compatible devices work better at home and beyond the front door. If wifi is lost, Sidewalk enables certain devices to stay connected. Also, Sidewalk helps devices like water sprinklers and pet locators work over longer distances. Sidewalk uses a small portion of your internet bandwidth to provide these benefits to you and your neighbors via Sidewalk Bridges (participating Echo and Ring devices), and is turned on for your device unless you have previously turned off the setting. You can turn off Sidewalk at any time. Learn more about Sidewalk."
            },
            {
                "name": "Bluetooth connectivity",
                "value": "Advanced Audio Distribution Profile (A2DP) support for audio streaming from your mobile device to Echo Show 5 or from Echo Show 5 to your Bluetooth speaker. Audio/Video Remote Control Profile (AVRCP) for voice control of connected mobile devices. Hands-free voice control is not supported for Mac OS X devices. Bluetooth speakers requiring PIN codes are not supported."
            },
            {
                "name": "Audio",
                "value": "Full range 1.75” built-in speaker."
            },
            {
                "name": "System requirements",
                "value": "Echo Show 5 comes ready to connect to your WiFi. The Alexa app is compatible with Fire OS, Android, and iOS devices and also accessible via your web browser. Supported operating systems. Certain skills and services may require subscription or other fees."
            },
            {
                "name": "Setup technology",
                "value": "Amazon wifii simple setup enables customers to connect smart devices to their wifi network in a few easy steps. WiFi simple setup is another way Alexa is always getting smarter. Learn more about frustration-free setup."
            },
            {
                "name": "Processor",
                "value": "MediaTek MT 8169 B"
            },
            {
                "name": "Accessibility features",
                "value": "To enable features that personalize Alexa to your abilities, go to Settings → Accessibility. • Tap to Alexa enables access to Alexa via touch, instead of speech, through on-screen tiles or a keyboard, including the ability to save your favorite actions. • Adaptive Listening provides customers more time to finish speaking before Alexa responds. • Preferred Speaking Rate enables customers to control how fast or slow Alexa speaks. • Alexa Captioning, Call Captioning, and Closed Captioning provide text captions in any mode for supported content. • Show and Tell helps customers who are blind or visually impaired identify products when you say “Alexa, what am I holding.” • VoiceView screen reader enables access for customers who are blind or visually impaired. • Screen Magnifier enables customers to zoom in/out, and pan around the screen. • Notify When Nearby will play notification sounds when you’re detected near your Echo device. • Kindle Read Aloud will have Alexa read your Kindle books aloud. • Real Time Text enables customers to type live text in a video call. • Alexa Accessibility features also include settings for Color Inversion, Color Correction, Request Sound and more."
            },
            {
                "name": "Warranty and Service",
                "value": "1-year limited warranty and service included. Optional 1-year, 2-year, and 3-year extended warranty available for U.S. customers sold separately. Use of Echo Show 5 is subject to these terms."
            },
            {
                "name": "Included in the Box",
                "value": "Echo Show 5 (3rd Gen), Glacier White power adapter (22W)/cable (4.9ft) and Quick Start Guide."
            },
            {
                "name": "Generation",
                "value": "Echo Show 5 (3rd Gen) - 2023 release"
            },
            {
                "name": "Privacy Features",
                "value": "Wake word technology, streaming indicators, microphone/camera off button, built-in camera shutter, the ability to view and delete your voice recordings, and more. Visit the Alexa Privacy Hub to explore how Alexa and Echo devices are designed to protect your privacy."
            },
            {
                "name": "Language",
                "value": "Alexa speaks English and Spanish"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own an Amazon Echo, visit Manage Your Content and Devices for information specific to your device."
            },
            {
                "name": "Smart Home Device Compatibility",
                "value": "WiFi, Bluetooth Low Energy Mesh, and Matter"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "NJ Forest",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPTWNA36XYUGLFMGKYA6PRNFCOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5H8MHKB1GUXO?ASIN=B09B2SBHQK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Echo Show 5: The Family-Friendly Smart Home Dynamo That's Here to Entertain and Assist!",
                "reviewText": "So, I recently added the Echo Show 5 to my smart home squad, and let me tell you, it's not just a device; it's the family's new best friend, and the kids think it's cooler than ice cream. At the Black Friday price? We simply could not beat the value.First off, Alexa's voice recognition is a mind-reader. In the chaos of my bustling household, it effortlessly catches my commands, proving it's the multitasking maestro we all need. Weather check? Set a timer for cookie baking. Queue up a dance party playlist? Alexa's got it covered like a pro-party planner.Now, the Echo Show 5's display maybe 5.5 inches, but it's a powerhouse. Crystal-clear visuals turn video watching, web browsing, and even virtual storytime into a delightful experience. It's like having a personal assistant with a dash of magic for the kids.And the sound quality? It's a mini-concert in our living room! Those dual 1.7-inch speakers deliver audio so crisp, it's like having a front-row seat to the coolest show in town. Alexa plays their favorite tune, and suddenly, the room transforms into a private VIP lounge for the whole family.But the real showstopper? Video calls! The high-res camera turns video chats into virtual hangouts that are almost as good as having grandma in the room. Skype, and Zoom – they're all here to make family connections stronger than ever. It's like the Echo Show 5 is the high-tech bridge connecting generations.And for family multitasking? Alexa's got it covered. Smart device control, daily news updates, weather forecasts, recipe suggestions – it's like having your concierge who also knows how to tell a good joke. Seriously, ask Alexa for a joke; the kids love it.Setting up the Echo Show 5 was smoother than a bedtime story. Even for those of us who consider ourselves tech-challenged, it's a breeze. The interface? Kid-friendly and intuitive, making it a win for the whole family.In conclusion, the Echo Show 5 isn't just a smart display; it's an all-in-one family entertainer and organizer. It's the smart investment that turns your home into a party zone for the kids, a communication hub for the family, and a tech-savvy sidekick for the parents. If you want a device that keeps everyone happy and connected, grab the Echo Show 5 – it's the smart home upgrade that's truly family-approved! 🎉✨",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shouryaan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWIQ7ZLX5D6CMDSGC67U5GQ7EKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BXH271LJLNNX?ASIN=B09B2SBHQK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars great product",
                "reviewText": "I recently purchased the Echo Show and I have been absolutely thrilled with this product! It has quickly become an integral part of my daily routine and has enhanced my household in so many ways.One of the standout features of the Echo Show is its impressive display. The 10.1-inch HD screen provides crystal clear visuals, which makes watching videos, browsing websites, or viewing photos a truly immersive experience. The touch screen is highly responsive and intuitive, making navigation a breeze.The sound quality of the Echo Show is exceptional. The dual 2-inch neodymium stereo speakers deliver rich and powerful audio that fills the room with crisp, lifelike sound. Whether I'm listening to my favorite music, watching a movie, or having a video call, the sound is consistently excellent.The voice control capabilities of the Echo Show are truly impressive. The built-in Alexa assistant allows me to control various smart devices throughout my home with simple voice commands. I can adjust the lights, set timers, check the weather, play music, and so much more, all without lifting a finger. The voice recognition is accurate and responsive, making it incredibly convenient and time-saving.Another unique and useful feature of the Echo Show is its ability to video call friends and family. The high-resolution camera allows for clear, face-to-face conversations, which is especially valuable for loved ones who live far away. The inclusion of Skype and Zoom also enables seamless communication, regardless of the platform preference.The Echo Show also acts as a virtual assistant, providing helpful information such as daily news updates, weather forecasts, recipe suggestions, and even step-by-step instructions for various tasks. It's like having a personal assistant at your fingertips, simplifying daily activities and keeping you informed.Overall, I am extremely satisfied with the Echo Show. Its combination of a stunning display, impressive sound quality, and the convenient Alexa integration makes it an excellent addition to any household. Whether you're looking for a versatile smart home hub, a high-quality display for multimedia consumption, or a device that enhances communication with loved ones, the Echo Show offers it all. I highly recommend this product to anyone in search of a premium smart display experience.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nita mitchell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKMZYETFNC72GBE5K3XYX3TMXQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFTPE28FPHTM7?ASIN=B09B2SBHQK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Love the new blue color",
                "reviewText": "Just annoyed at even though we have all our Alexas with different wake words. She does not always listen, and it also interrupts the Alexa in the LV when i ask Echo in the Kitchen something. That can be annoying. The only trouble we have with Alexa is when we put 2 in a group. It does not always work well. But we still love all but the one we got that is not a show its a dot, and it has static. Wish we could replace that one.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6SL6MFARWQGXVFZX3AFZPKDXKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VIUTY25F43V9?ASIN=B09B2SBHQK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "4.0 out of 5 stars I’m glad I purchased!",
                "reviewText": "I have 3 other Alexa Echo’s and have had several revisions since Alexa first came out along with many different connected devices. This is the first Echo Show for me. I really like it! There are some really good features that the others devices I have do not have, so that’s nice. There are a few features I wish it did have that my Echo Plus has. The one major feature that is missing is the ability to check and show the current temperature in the room. Overall, I’m happy I got it. The camera feature is nice but very poor guality. The sound is pretty good for what it is. Connecting devices was pretty straightforward and worked just fine. I do wish the cord was a little longer. The screen is small so I wanted to keep it on a shelf that’s eye level but the wall plugs are too low for the length of cord.The Blink indoor camera is as expected. I already had a few indoor and outdoor cameras so no surprises.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 19, 2024",
                "reviewTitle": "practico de buen tamaño",
                "reviewText": "facil de usar, buen tamaño, llego perfecto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rick",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 25, 2024",
                "reviewTitle": "Very Good",
                "reviewText": "Very Happy with this product. Will recommend. Thank You",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pillsbury Dough Boy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 2, 2024",
                "reviewTitle": "A must!",
                "reviewText": "The stand is a no brainer as it allows the screen to be easily seen especially in the dark.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}