{
    "remaining_requests": 24634,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Vitafusion-Gorgeous-Nails-Multivitamin-Vitamins/dp/B0179RJ3RW",
    "body": {
        "name": "Vitafusion Gorgeous Hair, Skin & Nails Multivitamin plus Biotin and Antioxidant vitamins C&E, Raspberry Flavor, 135ct (45 day supply), from America’s Number One Gummy Vitamin Brand",
        "price": "$12.43$12.43 ($0.09$0.09 / Count) $11.12$11.12 ($0.08$0.08 / Count)",
        "originalPrice": "$17.49",
        "rawPrice": 12.43,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Vitafusion-Gorgeous-Nails-Multivitamin-Vitamins/dp/B0179RJ3RW",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CGZQL11Q"
        ],
        "asinVariationValues": [
            {
                "asin": "B0179RJ3RW",
                "variationName": "FlavorName",
                "variationValue": "1 Bottles (135 Count)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "FlavorName",
                "variationValue": "Raspberry",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0179RJ3RW",
                "variationName": "Size",
                "variationValue": "135 Count (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "100 Count (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "36",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41mShqwCgqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41GClGxFmYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51n7gj5utFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51PNd2ypn7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51sKniOdZcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BQvK7J7vL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61zhVXui1xL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/97cb290d-c719-5751-905a-749529057524/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9dc80992-4a1d-4b1b-ac82-00a39850b304/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Vitafusion Store",
            "link": "https://www.amazon.com/stores/Vitafusion/page/5F7F55A0-5B11-44C3-A502-8544672EDB95?ref_=ast_bln"
        },
        "brand": "Vitafusion",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 6922,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 5 hrs 27 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 5 hrs 27 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Unlock your inner beauty: Each 3 gummy serving provides vitamins C&E plus biotin to help you achieve beauty from the inside out*.",
            "Product Note: Exposure to heat or sunlight may lead to melting/damage of product. Hence customers are expected to be available during the product delivery",
            "Delicious and Nutritious: Vitamins fused with delicious natural raspberry flavors for a taste you'll love!",
            "The NO’s: No Artificial Flavors or Sweeteners, No Synthetic (FD&C) Dyes, No High Fructose Corn Syrup, No Gluten or Dairy",
            "Award Winning Taste: Recipient of the 2021 ChefsBest Excellence Award. The ChefsBest Excellence Award is awarded to brands that surpass quality standards established by independent professional chefs.",
            "America’s #1 gummy vitamin brand: We deliver the best vitamin experience so you look forward to your daily dose!"
        ],
        "description": "vitafusion Gorgeous Hair, Skin & Nails Multivitamin Gummy Vitamins are a specially formulated fusion of 11 essential nutrients. These hair-skin-nails gummies help you achieve beauty from the inside out. One serving of these delicious gummy vitamins for skin and hair provides 2X the biotin, 2X the antioxidant vitamin E, and 6x the vitamin C [3[, to support luxurious hair, gorgeous skin and healthy nails [1]. Infused with a delicious and natural raspberry flavor. Feel beautiful! Vitamin Better! With the vitafusion hair, skin, nails formula, we believe taste and nutrition can be fused together to deliver the best vitamin experience, ensuring it’s an easy and delicious part of your day. Check out our complete line of hair-nail vitamins. For over 12 years, we’ve been helping people to live happy and healthy lives with our gummy vitamins and supplements. vitafusion is the only gummy vitamin brand with products that have been awarded the ChefsBest Excellence award for taste [2]. Anything is possible when great nutrition is your foundation. Take a fruitful step toward a healthier, happier world with America’s #1 gummy vitamin brand. Vitamin Better! [1] These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease. [2] The ChefsBest Excellence Award is awarded to brands that surpass quality standards established by independent professional chefs. [3] Versus the leading hair, skin and nails gummy supplement. Per serving.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Vitamins, Minerals & Supplements",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23675621011"
            },
            {
                "name": "Vitamins",
                "link": "https://www.amazon.com/Vitamin-Supplements/b/ref=dp_bc_aui_C_3?ie=UTF8&node=6936790011"
            },
            {
                "name": "Multivitamins",
                "link": "https://www.amazon.com/Multivitamin-Supplements/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3774861"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3.19 x 3.19 x 6.31 inches; 1.2 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 27917020068"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ October 31, 2015"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Church & Dwight - Nutrition & Wellness"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0179RJ3RW"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,404 in Health & Household (See Top 100 in Health & Household) #128 in Multivitamins #851 in Sales & Deals"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 6,922 ratings"
            },
            {
                "name": "Brand",
                "value": "Vitafusion"
            },
            {
                "name": "Item Form",
                "value": "Gummy"
            },
            {
                "name": "Primary Supplement Type",
                "value": "Multivitamins"
            },
            {
                "name": "Diet Type",
                "value": "Gluten Free"
            },
            {
                "name": "Flavor",
                "value": "1 Bottles (135 Count)"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "ONLY THE GOOD STUFF These vitafusion gummies give you the nutrients you need without all the extras because what’s in our gummies is just as important as what's not! TASTY GUMMIES, TASTY VALUE Our gummies are deliciously healthy without having to break the bank! The ChefsBest Excellence Award is awarded to brands that surpass quality standards established by independent professional chefs. VITAMIN BETTER vitafusion the gummy vitamin experts! We deliver the best vitamin experience so you look forward to your daily dose! MADE IN THE USA We gather the best ingredients from around the country and world to make our gummies right here in the USA as part of our commitment to high quality products!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d733ab12-1630-4cd2-b5f6-f4cc0cf540e1.__CR0,0,358,358_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c77364f-e86d-4554-8ee1-7ffa45ec19c6.__CR0,3,361,361_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb1f46ce-7334-430c-9e57-46af57ac9731.__CR0,0,1080,1080_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1ef946bc-8acb-4f96-8a50-3c971d5baf41.__CR0,1,357,357_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Gorgeous Hair Skin & Nails Biotin Collagen Apple Cider Vinegar Benefit Hair, skin, & nails support with biotin and antioxidants* Hair, skin, & nails support from biotin* Supplies vital collagen peptides to the body* Apple Cider Vinegar plus B-12 for energy metabolism support*",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/84fdece7-aa5c-4b68-b6b6-483faa6d6a92.__CR1,0,1452,898_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d733ab12-1630-4cd2-b5f6-f4cc0cf540e1.__CR0,0,358,358_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c77364f-e86d-4554-8ee1-7ffa45ec19c6.__CR0,3,361,361_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb1f46ce-7334-430c-9e57-46af57ac9731.__CR0,0,1080,1080_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1ef946bc-8acb-4f96-8a50-3c971d5baf41.__CR0,1,357,357_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/50fe8e11-df23-4ebd-9b57-1d2ef2459228.__CR0,17,4042,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6661d4f9-e3a5-4502-8892-c11e3b835735.__CR750,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d20c4429-80a7-4eb8-a0d6-e526b625151e.__CR750,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8cbca6ba-8153-4e8b-9bf0-850a4eca1028.__CR721,0,1499,2997_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/687d8950-3db4-42e8-913d-40ac1f9ba37e.__CR0,0,625,1251_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Call of KthaliaCall of Kthalia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3YNEWD3ZVFSWCVC3HZXJ4OFWDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLRSRBR9NADSD?ASIN=B0179RJ3RW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2016",
                "reviewTitle": "5.0 out of 5 stars Effective, affordable and easy to take Beauty Supplement!",
                "reviewText": "I was hesitant to try this product, but I know how much biotin can do for my hair and nails so I wanted to give it this product a try.Back story on me and biotin:A couple years ago I took a biotin supplement that made my nails grow fast and strong, and my hair start to get more thick and lush, but right as the hair effects started kicking in I began to notice that the product was causing my skin to dramatically increase oil production and break out - badly. I am a little older for acne, so my oily/slightly-sensitive/acne-prone skin usually only graces me with clogged pores, tiny (but annoying) occasional hormonal breakouts and the very, very, very rare \"something didn't agree with my cyst\". For example, I did a cleanse awhile back and I got three teeny tiny cysts at the beginning, which did eventually clear up, but which were awful. The biotin supplement I took (This one: Natrol Biotin 10,000 mcg Maximum Strength Tablets, 100 Count (Pack of 2) ) actually made my skin thick with oil I could scrape off three times a day with my nails, a dozen or more pimples and some cysts. It continued to get worse, rather than better like my skin did with the cleanse, until I realized it was the biotin which was causing the issue. I stopped taking it - drank a ton of water because biotin is water-soluble - and my skin began clearing literally within a day or two.The thing that made me sad was that the biotin was indeed making my nails grow long and super strong. It was almost as notable a difference as the oily breakouts on my face, except that was for the positive. It also had just begun to take effect on my fine hair when I had to stop for the sake of my skin, but it had been allowing my hair to grow strong and shed less. But having a horribly oily and broken out face was not worth the boost to my nails and hair, so I stopped taking the product, quickly losing the effects on my hair and shortly there after the effects on my nails. :-(For a couple years I was too scared to try biotin again. That is how bad it made my skin in the short time I took it. But when I saw this product, read the label to see the dosage was lower and that there were other vitamins mixed in the blend that supported the effects of the biotin, I thought I would give it one more try.So far I am very pleased with this product, and I have been watching my skin vigilantly for any sign of the issues I experienced before and haven't seen anything worrisome yet. Here is what I have to say about this product for the two weeks I have been taking it:1. The gummies taste pretty great. It's not candy, but better than a pill or a powder for sure. Be sure to chew them up well for best effects, per the manufacturer direction.2. This bottle is going to last you about a month and a half (135 pills, 3x a day = 45 days of doses). At ~$26 a bottle, I think it's a little pricier than some supplements, but this isn't just biotin as it has other vitamins as well, which support health skin, hair and nails. I think the value to cost ratio is going to depend on how the product works for you and what your budget is like.3. The effect on my nails was swift. I've included a photo of my nails showing how far my gel manicure has grown in 20 days. My right hand actually shows a stronger growth effect, but I had trouble taking a clean shot of my right hand, being right-handed.4. My hair has begun to shed less. With fine hair, we often have lots of tiny hairs, lots of oily sebum producing follicles - which I have both - and so I get oily scalp and I shed a lot of hair. It's annoying, but I've already noted that there are fewer hairs on my shirt throughout the day after the past week or so of use of this product.5. Again, I've been watching vigilantly for signs of increased oil production or pimples, and I've seen nothing of the sort. I suspect the 10,000 mg dose was simply too high for me, and this lower dose is effective but not so high as to cause my skin the issues the other product did.Bottom line: I think this is a little pricey but seems a good way to get beauty vitamins and minerals in your system to support your hair, skin and nails. I am already seeing the effects at 2 weeks, and I will watch for more positive signs of this products effects on me. I will also obviously look for signs of bad things happening to my skin. For now I recommend you try this, and pay attention to your body's reaction as I do, as it seems effective but supplements can cause different reactions in different people.I will be sure to update my review within the next month or so to let you all know if it is working the same, better or worse! I also want to remind you that if you have a problem with biotin making you oily or break out: Drink a LOT of water, and stop taking the product of course, because it is water soluble you can easily flush it from your system. And as this experiment has proven so far - you might just need a lower dose, but always pay attention to your body's signals and needs!Best of luck! Hope this has been helpful and please ask questions if you have them! :-)Note: I've posted a photo of my nails to show how much they have grown in the past 20 days - 14 of which were while taking this biotin supplement product. Please excuse my cuticles and ridges! We all have our beauty struggles and I am a little overdue to the nail salon! :PUPDATE 06/01/2016: It seems like this product more typically goes for around $15 a bottle, and I had misread the current price for the price I had paid which was about $12 with a coupon. At this price (~$15) I find the product much more reasonable to purchase and will be much more likely to choose this as a regular supplement product if it keeps going well for me. Though Amazon prices can flux radically, and sometimes it pays to grab a few when you see a good price and wait it out when the prices rocket, I thought this price difference was worth a mention.UPDATE 06/22/2016: I've used this product for a few more weeks. Restocked and I am on the second bottle. Now my nails are growing so fast that if they weren't all thick and healthy I would be annoyed! Because I get gel manicures (so they last and stay nice) but now they grow out almost twice as fast as before. I had my nails redone (because of something else that had gone wrong with them) but the week of growth looked more like my old two week of growth. Verdict is still out on the hair, but I am shedding LESS. I notice this as I wear dark shirts a lot and I used to have a lot of candy colored hair stuck to them and now I don't have hardly any, ever, outside of washing and brushing. To me this indicates that in time my hair will be thicker - with more hairs staying on my head, per shedding cycle. When I feel like I can say \"I only looped my pony holder 3 instead of 4 times!\" I promise to update for that, or any other news I might have. Oh, and no skin issues with acne or oil either. I am thrilled! Definitely recommend you try this tasty and effective beauty supplement to see if it works for you!UPDATE 09/01/2016: I have been very pleased with this product. My nails never break anymore, and they grow fast. Sometimes annoyingly fast for my gel manicures! Also, the real reason I had wanted to try this was for my hair. I found this product quite effective in making the most of what I've got - which is fine hair that is processed. My part is now much less apparent and my hair feels fluffier with almost zero effort. To maximize your results - which I *did* notice prior to me starting to use this shampoo/conditioner/spray - I recommend this line which helps you shed less: Ogx Shampoo Niacin 3 & Caffeine 13oz (2 Pack) . So, with this combo, the Biotin is a nutrient that makes your hair and nails grow strong and the niacin + caffeine helps you shed less, which basically equates to helping you have your fullest possible natural hair. No, it probably won't make super fine/thin hair look like a hair model's hair, but it does make your hair look its best! :DFinally, I recommend that if you consider giving this combo a shot, that you pay attention to how your body reacts to it (since I myself have had bad reactions to biotin in the past), that you are consistent with use of the products and that you use them for at least a month, preferably a few months, before you pass a complete judgment because supplements take time to get into your system to make a change to the body, and topical products that affect shed cycle will also take some time to show their benefit. Hope this review helped, that the products help and best of luck!UPDATE 09/05/2016: I forgot I had meant to update this to a 5 star product. I do like it that much. :-) And somehow my subject line got changed to a random portion of the middle of my review and makes no sense. It was refusing to update, so time will tell if this updates or that last update to the review subject line sticks!UPDATE 10/04/2016: Something I like to do when I am pretty sure I am not going crazy, and a product seems to be having a certain desirable effect, is I try out NOT taking it anymore -- to see what happens. So right after my last update - about 30 days ago - I stopped taking this and I stopped using my OGX Shampoo and Conditioner that I had mentioned above. HERE ARE THE RESULTS: Sort of the same was as a supplement takes awhile to work it's way into your system and slowly take effect for the better, stopping taking this product (and using the shampoo and conditioner) took awhile to show up as negative impact, too. My nails had been growing FAST as a result of this product, but suddenly they actually began to break for the first time in probably about 6 months. Not just one rogue accidental break but I actually broke several of them and had to cut my nails back to my fingertips, which also hasn't happened in 6 months. As for my hair, it very swiftly began a shed cycle, whereas before I was able to brush my hair and mostly not have to pick any hairs off my top for months... suddenly I was a shedding machine. Hairs upon hairs - in the brush, blown around the bathroom when I styled and alllllllll over my tops at work alllllllllll niiiiiiiiight loooooong. Very annoying. I am going to go back on the supplement and using the hair products now and see how it goes! I will be sure to update in either about a month - or when I first begin to see positive results. :-)",
                "reviewVotes": "116 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81bMMsBVJVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81zKpHrWwVL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Smiles ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWOOJGZCQ4SNP4Z5WFOLFY65UFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PZSH6578IOV5?ASIN=B0179RJ3RW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Vitamins",
                "reviewText": "These are great. Good flavor. I feel like my hair and nails are healthier when I take these.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mindy Peach",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM2TLFH4VFYCD7SSKMY24DCQ6PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAYE08LVLQI6D?ASIN=B0179RJ3RW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2023",
                "reviewTitle": "5.0 out of 5 stars THIS IS ALSO A MULTIVITAMIN",
                "reviewText": "I LOVE this product. My hair and nails definitely grow alot faster now that I’ve been taking this for a couple of months. Typically my nails are brittle and never get the chance to grow long. Since taking this they do. One thing I didn’t realize when I first started taking this was that it’s also a multivitamin, so I was taking this in addition to the multivitamin I take and that was definitely too much. But it works, I’m hooked now. I can’t wait to see the results of my hair after a few more months. Oh and it tastes good too! Almost like a treat.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Justice rocks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3HL2BJLNHR5UXP5IV4RHCTF3LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37I6VJ0SW8C39?ASIN=B0179RJ3RW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Delicious",
                "reviewText": "I order these All the time and love them. They have a great taste think gummy bears. My kids take them too. Works as promised..I've never seen nails grow that quick especially on my son🤣",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MrJohns",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZWUZ3C6FWVVRKH5KOL74Y46XWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G05E9KE0GOTP?ASIN=B0179RJ3RW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Overall satisfied",
                "reviewText": "I like how strong my finger nails have become and how my hair has become more resilient and shinier. What I dislike is the flavor which taste like raw tea leaves and the fact that about 10% of the gummies were melted, which I understand comes with shipping still unpleasant.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "likespets",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBJPKNJKZ4JRIYECWMRYRODDBNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26EG3SRO7T7RU?ASIN=B0179RJ3RW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Great vitamin for hair and nails",
                "reviewText": "These gummies not only taste good, they actually work. I’m often skeptical about vitamins and if they work versus getting nutrients from food. I was having an issue with my nails constantly breaking, especially after working in my garden when they dry out. After I started using these regularly my nails started growing stronger and faster. I also noticed that my hair started growing faster. I definitely recommend!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marissa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAQS73AWC7UT7FPB3H3OZJHGJGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OI8WFHQB1DTH?ASIN=B0179RJ3RW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Great taste !",
                "reviewText": "I don’t like vitamin taste ! You can barely taste it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KL Scott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGJRDJCBUMOJBO7EEU5WHLQE5HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3K3NJGJ6YG6YU?ASIN=B0179RJ3RW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars When other 1 is sold out",
                "reviewText": "This one works as good helps with hair.. yay girl",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ayush Agrawal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 27, 2019",
                "reviewTitle": "Don't know if the product is helpful.",
                "reviewText": "Didn't realise any changes in my skin and hair.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Disappointed Customer Disappointed Customer ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on July 7, 2023",
                "reviewTitle": "Gummy all melted like hard jam",
                "reviewText": "Very disappointed to receive a spoilt product and cannot consume and cannot return 😩, please be fair to replace.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71bVbHZdFEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71-wNrpZKrL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$13.08",
                "sellerName": "Shophut boutique LLC",
                "sellerRating": "4"
            }
        ]
    }
}