{
    "remaining_requests": 24476,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Daily-Multivitamin-Women-Over-Supplement/dp/B07R1ZFXPY",
    "body": {
        "name": "Daily Multivitamin for Women 50 & Over – Memory Support Supplement – Promotes Stress Reduction & Healthy Immune Response – Women's Multivitamin Supplement Designed for Stomach Comfort - 60 Capsules",
        "price": "$13.47$13.47 ($0.22$0.22 / Count) $12.72$12.72 ($0.21$0.21 / Count)",
        "originalPrice": "$17.99",
        "rawPrice": 13.47,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Daily-Multivitamin-Women-Over-Supplement/dp/B07R1ZFXPY",
        "soldBy": {
            "sellerID": "A32DGYOAL6LMZV",
            "name": "BioSchwartz",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A32DGYOAL6LMZV&asin=B07R1ZFXPY&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51d8IttW SL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/515thgFlSPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51kabIG-UIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JH4KtHXjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dJfIUQ44L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61UgTms4CcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61PGv7kYSDL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/99eb0b2e-c889-4b24-9c42-5b464efa1569/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BioSchwartz Store",
            "link": "https://www.amazon.com/stores/BioSchwartz/page/B8FFDA1B-2040-49BF-A71D-611CAAEC40C1?ref_=ast_bln"
        },
        "brand": "BioSchwartz",
        "merchantInfo": "BioSchwartz",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2401,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 4 hrs 58 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Optimal immune defense: BioSchwartz advanced formula women's multivitamin 50+ is formulated with vitamins C, D, zinc and antioxidants to help fight off free radicals that can damage immune cells, keeping your immune system healthy and strong",
            "Helps promote bone & breast health: BioSchwartz Women’s 50+ multivitamin contains high-potency vitamin D along with calcium, vitamin K, and magnesium to help promote bone and breast health, and also contains omega-3 fatty acids, B-vitamins, and other shortfall nutrients to support whole body health",
            "Cognitive support: BioSchwartz women’s 50+ multivitamin utilizes brain boosting ingredients including L-theanine and Lion’s Mane Mushroom to support mental clarity, focus and memory",
            "Purity tested & allergen free: Each and every batch of BioSchwartz's Women’s 50+ Multivitamin capsules are third party tested to guarantee the highest purity, potency, and premium quality",
            "Formulated by professionals: Each one of our professional grade supplements is created by a team of highly experienced health-care professionals following strict GMP guidelines to ensure the greatest benefits are achieved"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Vitamins, Minerals & Supplements",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23675621011"
            },
            {
                "name": "Vitamins",
                "link": "https://www.amazon.com/Vitamin-Supplements/b/ref=dp_bc_aui_C_3?ie=UTF8&node=6936790011"
            },
            {
                "name": "Multivitamins",
                "link": "https://www.amazon.com/Multivitamin-Supplements/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3774861"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 3.9 x 1.97 x 1.97 inches; 0.04 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ BIO-WOMEN-MULTI50-GS-1"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ April 22, 2019"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ BioSchwartz"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07R1ZFXPY"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,789 in Health & Household (See Top 100 in Health & Household) #272 in Multivitamins"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,401 ratings"
            },
            {
                "name": "Brand",
                "value": "BioSchwartz"
            },
            {
                "name": "Item Form",
                "value": "Capsule"
            },
            {
                "name": "Primary Supplement Type",
                "value": "Multivitamins"
            },
            {
                "name": "Flavor",
                "value": "Unflavored"
            },
            {
                "name": "Product Benefits",
                "value": "Antioxidants,Healthy Immune"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "ADVANCED FORMULA BONE & BREAST SUPPORT MULTIVITAMIN SUPPLEMENT WITH VITAMINS A, C, E, B-COMPLEX, AND LION’S MANE BIOSCHWARTZ ADVANCED FORMULA FOR BONE & BREAST SUPPORT DAILY MULTIVITAMIN SUPPLEMENT – FORMULATED TO GIVE YOU THE BEST POSSIBLE RESULTS† Most women don't get enough key nutrients needed for overall health from food alone. BioSchwartz Advanced Formula Women’s 50+ Multivitamin has been professionally developed as a comprehensive supplement to support women’s total health by providing the nutrients you miss out on in your daily diet. Designed for women looking for all-inclusive support, our formula promotes breast health, bone health, and improved mental focus.† BioSchwartz Advanced Formula Women’s 50+ Multivitamin capsules can help support whole body health by working to:† ✔ Promotes Breast Health † ✔ Supports Bone Health † ✔ Promotes Mental Clarity & Focus † ✔ Immune System Support † ✔ Supports Brain Health † ✔ Promotes Antioxidant Activity † ✔ Supports Healthy Hair, Skin & Strong Nails † ✔ Supports a Balanced Mood & Sense of Well-being † ✔ Supports Eye Health † ✔ Promotes Cardiovascular Wellness † ADVANCED MULTIVITAMIN FORMULA – BONE & BREAST HEALTH SUPPORT – MAINTAIN IMMUNE & DIGESTIVE HEALTH – COGNITION SUPPORT – OVERALL HEALTH SUPPORT.†",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9f627ec4-7d6a-48e6-9c6e-74824b49efa6.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "BIOSCHWARTZ ADVANCED FORMULA WOMEN’S MULTIVITAMIN FOR WHOLE BODY HEALTH: FORMULATED TO GIVE YOU THE BEST RESULTS† What makes our Advanced Formula Women’s 50+ Multivitamin unique? BioSchwartz Advanced Formula Women’s 50+ Multivitamins are specially designed to meet the unique needs of women age 50 and older. To keep your body in balance, each serving is packed with a blend of essential vitamins, minerals and natural ingredients to provide comprehensive nutritional support, promote a healthy immune response and help contribute to mental clarity.† ESSENTIAL VITAMINS. Our formula contains a nourishing blend of B-vitamins, Vitamins A, C, D and E. Together, these ingredients promote natural energy production, support brain, heart, eye and bone health and helps ease occasional nervous system tension, helping you stay focused.† MINERAL BLEND. An essential for whole body health, Magnesium aids in the development of strong bones and teeth. It also helps with the absorption of other minerals you’ll find in our multivitamin including Calcium, Zinc and Potassium to improve digestion, maintain healthy skin and support healthy muscles.† MUSHROOM BLEND. Mushrooms have been used for thousands of years in Asian countries for their medicinal properties. Our specialized cognition blend combines Reishi and Lion’s Mane Mushrooms to combat fatigue and promote mental clarity and focus.† POWERFUL ANTIOXIDANT FORMULA. Research shows antioxidants are one of the top lines of defense when it comes to wellness maintenance and protecting us from free radicals that can damage our cells. Our antioxidant rich blend of Grape Seed Extract, Zinc, Vitamin C, Acai and Goji Berries was created to help promote cellular protection and fortify the immune system.†",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/d449d9c2-5053-4a45-ac78-3714a964490b.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "THE SAFETY AND QUALITY OF OUR PRODUCT IS OUR #1 PRIORITY TO ENSURE YOUR PEACE OF MIND At BioSchwartz, we take product quality and safety to new levels and follow a strict manufacturing process. PROUDLY MADE IN USA. All our supplements are manufactured in the USA. We establish stringent quality control standards in our manufacturing facility and manufacture all our supplements to exceed expectations set by cGMP (Current Good Manufacturing Practices). Being a Professional Grade Supplement Company means that we use only natural and high-grade raw ingredients, which are routinely tested for purity and quality. NO FILLERS, NO BINDERS, NON-GMO INGREDIENTS. Using only the latest technologies, we were able to develop a Women’s 50+ Multivitamin formula that is 100% pure and natural with Non-GMO ingredients. Our Advanced Formula Women’s 50+ Multivitamin does NOT contain fillers, binders, preservatives or chemicals that most brands use today. Always check the label to make sure that you are buying a 100% pure multivitamin. GLUTEN FREE. When you buy BioSchwartz Advanced Formula Women’s 50+ Multivitamin, you can be sure you are getting the best multivitamin for women. On top of our premium formulation, our multivitamin is gluten and allergen free. PRODUCT SAFETY. While most companies only use 1 or 2 seals, our Advanced Formula Women’s 50+ Multivitamin has 3 seals: an integrity and tamper proof seal to close the box, a pre-perforated neck-band and a heat-induction inner seal. SUPPLIER AUDIT. All our ingredients are bought from suppliers that go through a very thorough audit process to ensure they can meet our strict safety and quality guidelines. MANUFACTURING PROCESS. During the manufacturing process we analyze samples every 15 minutes and visually inspect every single bottle at the end of the production line. THIRD PARTY TESTED. At BioSchwartz, quality, safety and efficacy are of utmost importance. After our supplements are manufactured, labeled and sealed, we take things a step further by enlisting 3rd party, independent labs to test once again for purity and potency. These labs further analyze our completed products to ensure and verify that the ingredients in our products are pure, safe and in the appropriate amounts as listed on our labels. FORMULATED BY PROFESSIONALS. Every ingredient inside of BioSchwartz Advanced Formula Women’s 50+ Multivitamin was carefully selected and combined by a team of professionals to achieve maximum potency and efficiency. Our supplement is the result of unparalleled science, research and strict quality control standards that makes us stand apart from the competition. OUR COMMITMENT TO EXCEPTIONAL QUALITY. At BioSchwartz, we create superior products through the perfect balance of the latest technologies, and the purest nutrients nature has to offer. Our mission is to improve the lives of those that trust our high-quality supplements to enhance their health. Integrity and quality steer everything we do, and our commitment to our customers is to produce the highest quality nutritional supplements.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A32DGYOAL6LMZV/B01E3JHUUG/KTH4pXRQsSk._UX300_TTW__.jpg"
                ]
            },
            {
                "media_text": "BIOSCHWARTZ ADVANCED MULTIVITAMIN FORMULA SPECIALLY DESIGNED TO SUPPORT WOMEN’S WHOLE BODY HEALTH:† WHOLE BODY HEALTH: As you move toward a healthier you, you may be missing out on key nutrients the body needs to function at its best. Inclusive of bone, breast and brain health, BioSchwartz Advanced Formula Women’s 50+ Multivitamin can help provide daily broad-spectrum support for the body and mind.† HIGH BIOAVAILABILITY AND ABSORPTION: All multivitamins are not created equal. Our formula contains highly bioavailable forms of each nutrient to make sure they’re absorbed by the body to deliver the best results.† GENTLE ON THE STOMACH: As we get older, our bodies start to change, including our ability to properly digest what we eat. BioSchwartz Advanced Formula Women’s 50+ Multivitamin features plant-based digestive enzymes including natural ginger and peppermint extracts to help ease digestion and decrease stomach upset.†",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/2780b3be-631a-453a-a1f7-a17554801ba6.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/fe1eca91-cd41-456f-8b18-90f088e3c6c5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/0848155c-5dd2-4a8d-a619-f3ea360694cb.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9f627ec4-7d6a-48e6-9c6e-74824b49efa6.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/d449d9c2-5053-4a45-ac78-3714a964490b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A32DGYOAL6LMZV/B01E3JHUUG/KTH4pXRQsSk._UX300_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/2780b3be-631a-453a-a1f7-a17554801ba6.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/fe1eca91-cd41-456f-8b18-90f088e3c6c5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/0848155c-5dd2-4a8d-a619-f3ea360694cb.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "CJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKBSJGFX4C3VPSB773QUAOD6CPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LIVSW0R3IPT4?ASIN=B07R1ZFXPY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars It seems to supply what my body needs",
                "reviewText": "I like that it has the array of vitamins and minerals and herbs",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Klp",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGERQJWT7FW6HXOJN722C6EZTTCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OJWEW72VN1ZZ?ASIN=B07R1ZFXPY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Increased Energy",
                "reviewText": "This seems to be a good clean vitamin. I have been taking for a month. Doesn’t cause mild nausea like some other vitamins. Energy level & alertness improved. Digestive blend helps with some stomach issues. Will continue to take for now.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Figgy1",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSKGTYPF3EOPDKXIX5PCF2ZJ53Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YG84BG6LVP3N?ASIN=B07R1ZFXPY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 18, 2023",
                "reviewTitle": "4.0 out of 5 stars Good",
                "reviewText": "Most Americans are short on chromium (a mineral that keeps down sugar cravings), and this formula contains very little of it. Other than that, it has a good selection of vitamins and minerals.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Niknac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNGUHWBJGSBGRXLIDOMGRD5U3JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V7FGBE1VWIO4?ASIN=B07R1ZFXPY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2020",
                "reviewTitle": "5.0 out of 5 stars BE WARY",
                "reviewText": "UPDATE: after taking these for a month I got another bottle and got this weird rash on my back. I am not sure if it's quality control or what but it was strange. I stopped taking the vitamins and it went away. Wanted to make sure it was the vitamins so I started taking them again and sure enough the rash came back. I threw the bottle out. I will not be re-ordering this product. I was so hopeful but you get what you pay for in this instance. Not worth the health risk.These vitamins are great. Like that they are in capsule for easier digestion. Was using other brand and started causing headaches. This eliminated the headaches and is giving me the minerals and nutrients I need. I'm post gastric bypass so I must take these multiple times a day and it doesn't cause any adverse effects while being WAY more economical than the branded bariatric vitamins.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marie Alice",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMEAXTWENI54LFVWUQZFYXPQY2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NG749YFLYNCD?ASIN=B07R1ZFXPY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Very good",
                "reviewText": "I think these are good vitamins. I started getting enough sleep. I want to order more",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francine Auteri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNR7RDIS2SHPH3F7EFB7ZJSYOAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DYQMKUPX0Y8E?ASIN=B07R1ZFXPY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Vitamins",
                "reviewText": "Works well",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKBV2R5AMMWQYU54KFTFN6ZU7LQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6F66OJGO76EZ?ASIN=B07R1ZFXPY",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 28, 2022",
                "reviewTitle": "3.0 out of 5 stars Large capsules",
                "reviewText": "A little hard to swallow the large capsule",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elsa Martinez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEYTPQV6WNILULWONG2RLV2PU4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZF7QGIP5NCWM?ASIN=B07R1ZFXPY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Energy",
                "reviewText": "They are huge",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vijay Parekh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 25, 2021",
                "reviewTitle": "Honest Amazon best online company",
                "reviewText": "Good product prompt delivery.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}