{
    "remaining_requests": 24759,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Natures-Bounty-Multivitamin-Supplement-Antioxidants/dp/B0072F8D7S",
    "body": {
        "name": "Nature's Bounty Advanced Hair, Skin & Nails, Argan-Infused Vitamin Supplement with Biotin and Hyaluronic Acid, 150 Rapid Release Softgels",
        "price": "$11.08$11.08 ($0.07$0.07 / Count) $9.91$9.91 ($0.07$0.07 / Count)",
        "originalPrice": "$20.70",
        "rawPrice": 11.08,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Natures-Bounty-Multivitamin-Supplement-Antioxidants/dp/B0072F8D7S",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "Save an extra 25% on your first Subscribe and Save order.",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41k4uWOXQDL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51v5EyZAlJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51SYzcC3JzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ho14NsagL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41VCEEPZtkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ImTf3jhwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Bc7YjYTrL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/944a16b3-1641-4a2b-afd8-2fe50d584701/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e79e026c-67c8-4da7-ab39-941fd8f80cd9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2e2e5baa-4801-41dd-8b7b-2ac2a06051a9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1f0abca1-033a-49e5-8928-70b31213bfee/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04cd6924-fb15-4350-98f8-5dd3f8ab0144/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aac14f67-a51e-4aac-8702-775ac57937ca/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Nature's Bounty Store",
            "link": "https://www.amazon.com/stores/NaturesBounty/page/2192B06C-A1A0-4830-90FF-E20F767573CA?ref_=ast_bln"
        },
        "brand": "NaturesBounty",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 53029,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 3 hrs 3 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 3 hrs 3 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SUPPORTS BEAUTIFUL HAIR; GLOWING SKIN; AND HEALTHY NAILS (1): Hair Skin & Nails Rapid Release Softgels contain biotin; vitamins; minerals; antioxidants and other nutrients consistently found in healthy hair; skin and nails",
            "WITH BEAUTY-SUPPORTING BIOTIN: Nature's Bounty Hair, Skin & Nails vitamins contain beauty-supporting biotin; a vital nutrient that helps to maintain healthy hair while supporting overall beauty (1)",
            "ANTIOIXIDENTS PLUS HYALURONIC ACID: Skin and Hair Nutrients Antioxidants A; C and E Plus Hyaluronic Acid; Laboratory tested and contains no artificial color or flavor; and are free from sugar; milk; lactose, soy; gluten; wheat; yeast; and fish; Sodium free",
            "HELPS MAINTAINS HEALTHY SKIN: Vitamin E contributes to skin health (1) and Vitamin C is involved in collagen production and formation; which forms the basis for vibrant skin(1)",
            "FROM THE TRUSTED WELLNESS EXPERTS: Nature’s Bounty Extra Strength Hair Skin and Nails Vitamins are a product of 50 years of dedication to quality and scientific research to make vitamins and nutritional supplements of unrivaled excellence"
        ],
        "description": "From the #1 brand for hair, skin, and nails,(2) Nature's Bounty Extra Strength Hair, Skin & Nails Rapid Release Softgels are packed with biotin and contain antioxidant vitamins C & E plus hyaluronic acid and vital nutrients to support beautiful hair, glowing skin, and healthy nails from the inside, out.(1) Each serving of our softgels contains antioxidant vitamins A, C & E plus hyaluronic acid and biotin to help support and maintain healthy hair, skin, and nails.(1) Vitamin E contributes to skin health, and vitamin C is involved in collagen production and formation, which forms the basis for vibrant skin, whereas biotin helps to maintain healthy hair.(1) Every Nature’s Bounty beauty supplement is backed by a combination of nature and science and made with the purest ingredients, guaranteed. Our unique formula is laboratory-tested plus is free of milk, lactose, soy, gluten, wheat, yeast, or fish. If you’re hoping to look and feel your best, Nature's Bounty Hair, Skin & Nails vitamins for women are a great way to support your natural beauty from within.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Vitamins, Minerals & Supplements",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23675621011"
            },
            {
                "name": "Vitamins",
                "link": "https://www.amazon.com/Vitamin-Supplements/b/ref=dp_bc_aui_C_3?ie=UTF8&node=6936790011"
            },
            {
                "name": "Vitamin B",
                "link": "https://www.amazon.com/Vitamin-B-Supplements/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3774671"
            },
            {
                "name": "B7 (Biotin)",
                "link": "https://www.amazon.com/Vitamin-B7-Biotin-Supplements/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3774751"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2.66 x 2.66 x 4.74 inches; 5.6 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 35710"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ January 27, 2012"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Nature's Bounty"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0072F8D7S"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#477 in Health & Household (See Top 100 in Health & Household) #4 in Vitamin B7 (Biotin) Supplements #78 in Sales & Deals"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 53,029 ratings"
            },
            {
                "name": "Brand",
                "value": "Nature's Bounty Optimal Solutions"
            },
            {
                "name": "Item Form",
                "value": "Softgel"
            },
            {
                "name": "Primary Supplement Type",
                "value": "Vitamin C, Vitamin E, Vitamin A, Vitamin D, Vitamin B, Vitamin B2, Vitamin B6, Vitamin 12, Vitamin B1, Zinc See more"
            },
            {
                "name": "Diet Type",
                "value": "Gluten Free"
            },
            {
                "name": "Flavor",
                "value": "Unflavored"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "FROM THE #1 BRAND FOR HAIR, SKIN & NAILS (2) Ready to shine from the inside out? (1) Support your natural beauty with Nature’s Bounty Hair, Skin & Nail supplements. (1) From advanced softgels to delicious gummies and jelly beans, our wide range of products are designed to fit your lifestyle needs, whatever they may be. Each innovative formula is packed with Biotin and antioxidant vitamins C & E for beauty support. (1) Nature’s Bounty Hair, Skin & Nails Advanced Softgels are infused with argan oil and contain 5,000 mcg of biotin per serving, plus hyaluronic acid, a popular beauty ingredient. (1) Our Hair, Skin & Nails Gummies and Advanced Gummies are both bursting with delicious strawberry flavor and contain 2,500 mcg and 6,000 mcg of Biotin per serving, while our mixed berry Jelly Beans contain 6,000 mcg of Biotin plus Keratin. (1) Whether you decide to mix and match or stick with your favorite supplement, all of Nature’s Bounty Hair, Skin & Nails vitamins support your natural beauty from within. (1)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a971eada-72bc-43b8-8b08-2ba1d0cf7496.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Upgrade Your Beauty Routine Make Nature’s Bounty Hair, Skin & Nails Supplements part of your daily routine to support beautiful hair, glowing skin, and healthy nails. (1) Shine From the Inside Out Packed with key beauty vitamins, Nature’s Bounty Hair, Skin & Nails supplements support vibrant skin to help you shine from the inside, out. (1) Quality You Can Count On As the #1 Brand for Hair, Skin & Nails, Nature’s Bounty is dedicated to quality, consistency, and scientific research.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/3aecff4f-f807-4916-83d6-a0436232c16e.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/09f2ffe6-5e03-4f83-a6f3-87c788d080b8.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/5c404911-80cd-4365-ae34-d9d0eb6d2172.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/22244c9a-e2eb-4894-bb7e-b8fa42b19900.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/27252f7b-14ef-4cce-b7f1-79525be1d507.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a971eada-72bc-43b8-8b08-2ba1d0cf7496.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3aecff4f-f807-4916-83d6-a0436232c16e.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/09f2ffe6-5e03-4f83-a6f3-87c788d080b8.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5c404911-80cd-4365-ae34-d9d0eb6d2172.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c2aff889-27e6-494b-a4d2-20a026793477.__CR0,0,1940,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Slim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKBSMBKX2DEHKZ6KXH3ZTLW7TYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N38SII2Z1YQB?ASIN=B0072F8D7S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 18, 2022",
                "reviewTitle": "5.0 out of 5 stars Please do your research! Too much misleading info!",
                "reviewText": "I read a review that said these don’t digest because they took a long time to dissolve in water 🤦‍♀️, which scarily has 700-some odd “helpful” votes. This is not even close to what happens in the digestive tract, and is a misleading statement. The pH of water is neutral (7). The pH of the stomach is 1 (HIGHLY acidic due to the hydrochloric acid our bodies make to digest foods and break down complex nutrients so our bodies can absorb & use them). Sinking a vitamin in water and saying they won’t digest is completely misleading and inaccurate. These capsules are designed to dissolve at a specific rate IN THE DIGESTIVE TRACT, not a glass of water. These vitamins DO work to improve hair, skin, and nail health. I’ve been taking these for several years and they have improved the condition of my hair, skin, and nails. I have thyroid disease and an autoimmune condition that has caused my hair to thin out badly and become brittle, and made my nail and skin condition poor as well. I’m 38 and I’m a skincare & hair care formulator with a small business, and I hold myself to the highest standards regarding transparency and educating my clients about false beauty claims and ingredients, and ethically sourcing my raw materials. I also have a background in medicine, I am educated extensively in these fields. You can fact check me, in fact, I encourage you to do so. Don’t let a completely irrelevant glass of water “test” deter you. This supplement has everything the body needs to improve the health of hair, skin, and nails from within, which is where it all starts. This product doesn’t regrow hair, but it does improve the texture and health, in my experience. My nails look much better as well. This is a safe vitamin (per my doctor, ALWAYS consult your doctor before starting a supplement, and read the ingredients list for potential allergens) containing vitamins/nutrients the body needs anyway, and is “natural” (I use this term loosely because “natural” has no meaning in the skincare and haircare world; just like “green” has no meaning, it’s a gimmick, if you want proof of this, check with the FDA; no laws or regulations exist that define “natural” or “green” in beauty/cosmetics and it is just another gimmicky, misleading way for beauty companies to take your $$, no regulations or laws exist to prevent any company from making these claims and no definitions or parameters currently exist that even define what they mean in beauty), for those who want a product with no “chemicals” (meaning chemical actives, I.e. minoxidil, as every single thing on earth is a chemical & has a chemical formula; water is a chemical, H2O is it’s chemical formula). Please take the time time to check the facts on products because the cosmetic/beauty industry is almost entirely unregulated as far as claims companies can make, save for any kind of claim to treat or prevent conditions, I.e. sunscreens, as these types of products are considered drugs by the FDA. These do digest, but can be a bit irritating on an empty stomach if you happen to have a sensitive tummy. I do have a long history of GI problems as part of my health conditions, so I take these with food to prevent a bellyache. For the price, you can’t really beat these as a simple and effective way to help improve the condition of hair, skin, & nails, as long as your doc gives you the green light. I hope this helps for anyone who isn’t aware of the plethora of misinformation in beauty, it’s literally my job to know the science and the laws/regs about products and ingredients, and to be 100% FDA compliant. Do your homework folks, because there is a TON of bad, misleading “info” out there about all things beauty. All in all, I give this product 5 stars. This is a great way to improve your beauty regimen from the inside out, and good health will always be the number one way to keep your hair, skin, and nails looking and feeling good.",
                "reviewVotes": "1,845 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juliann SeeleyJuliann Seeley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKYO7CIQ4RN5QR5OMHCSY5MCC4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XCI3UMA1TYQR?ASIN=B0072F8D7S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Great product",
                "reviewText": "Started using this product about a year ago and I have only good things to say! Makes my hair look so shiny and healthy, and it had grown so much! My nails have also gotten much sturdier which has always been a problem for me. Great price.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7179T6U5PkL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "susan rodriquez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5KXEX3IHX44IUINXIKHJFDAYHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38YPMLWR0UFMI?ASIN=B0072F8D7S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars This stuff is powerfully awesome!",
                "reviewText": "So I grew up with the best nails in my school.Naturally hard and healthy, so I kept them polished and pretty. Then I got old and hit menopause and my fingernails got weak and started curving under. So I had to keep them cut short and quit polishing them. My DR said it just happens. Plus my hair is now thinning ,too. So I decided to try these supplements and within 6 weeks my nails got strong again and they now grow out straight and pretty. And I also started growing back hair where my hair was falling out.I'm so thankful for this because it has given me back my confidence.I wish I had tried it sooner. You should try it too 💅",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGOCKIYOU6EOXP45JM23RGNNFZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UJQ2Z079ZECR?ASIN=B0072F8D7S",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "4.0 out of 5 stars Affordable and effective",
                "reviewText": "Hair loss and brittle fingernails had me searching for solutions. I tried this product because it was easy to find and affordable. Guess what? Hair and nails are much healthier! Not an instant solution, but taking the capsules daily is easy and effective.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica Mazzarese",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRROIWUZY4XKGPC5ZHR4HJT2TPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39TKNZYF7QF6F?ASIN=B0072F8D7S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Strengthens and lengthens!",
                "reviewText": "Been using this for one year and have seen significant improvement in the health of my hair and nails. Baby hairs are growing where they never used to and my nails are much stronger than before. Less breakage! Taste good, too!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angela T.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZTWBGVLZFGQRFHMQ2GSESO4BXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28VZWO1Z6KO1S?ASIN=B0072F8D7S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars REALLY WORKS!!",
                "reviewText": "I have taken this product for a weeks & this is the only thing that allows my nails to grow. I haven't noticed much in my hair, but my nails are strong and grow pretty fast. It has them stronger and not cracking. I also use Sally Hard as nails to protect them as they are growing. When I ran out, I could yell the difference which told me it was this product that helped. I highly recommend if you want them to grow. I took 3 capsules per day and never missed it.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Secret Angel ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSUZYOVB3BHGXLADUXJ7VRSSOXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVBXYYOTG9R7F?ASIN=B0072F8D7S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Nourish and Enhance",
                "reviewText": "Nature's Bounty Hair, Skin & Nails Rapid Release Softgels have become an integral part of my beauty routine, and I am delighted to give them a well-deserved 5-star rating. These softgels provide essential nutrients to support healthy hair, skin, and nails, resulting in nourished and enhanced beauty from within.One of the standout features of Nature's Bounty Hair, Skin & Nails Softgels is the comprehensive blend of nutrients. These softgels are packed with a combination of vitamins, minerals, and antioxidants that are specifically formulated to promote the health and vitality of hair, skin, and nails. The carefully selected ingredients work synergistically to provide the necessary nourishment for vibrant and radiant beauty.The rapid-release softgel technology ensures quick and efficient absorption of the nutrients, allowing them to start working their magic from within. This fast-acting formula means that I can enjoy the benefits of these softgels sooner, seeing visible improvements in the health and appearance of my hair, skin, and nails.I have noticed significant improvements since incorporating Nature's Bounty Hair, Skin & Nails Softgels into my daily routine. My hair feels stronger and more resilient, my skin appears more radiant and supple, and my nails are noticeably stronger and less prone to breakage. These visible improvements have boosted my confidence and made me feel more beautiful from the inside out.The quality and safety of Nature's Bounty as a brand are exemplary. They are known for their commitment to using high-quality ingredients and employing strict manufacturing processes. This dedication to excellence gives me peace of mind, knowing that I am consuming a trustworthy and reliable product.Additionally, the convenience of the softgel form makes it easy to incorporate into my daily routine. I simply take the softgels with a glass of water, without any hassle or unpleasant taste. This ease of use ensures that I stay consistent with my supplementation, maximizing the benefits over time.",
                "reviewVotes": "63 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DeloksDeloks",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on October 5, 2023",
                "reviewTitle": "Pas sérieux.",
                "reviewText": "J’ai reçu mes commandes périmées et je les ai renvoyé 😡😡😡",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7110gZcwIqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on January 15, 2024",
                "reviewTitle": "Such a good buy!",
                "reviewText": "Really love this product! It makes me sleep so deep too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "aydaayda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 29, 2021",
                "reviewTitle": "Its not reliable",
                "reviewText": "mine has got stuck together and it shows the poor quality of this product and might be expired, whereas the expiration date mentioned to be 08/2023. its unreliable! Don't buy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61z6GsAHGoL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "America_Mrs.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on November 11, 2023",
                "reviewTitle": "Potent",
                "reviewText": "An excellent multiple vitamin for those concerned with beauty or hair . I used it in the U.S. where my hair and skin were lovely.When I came to Japan, several years ago now, I stopped taking it. Within a year I noticed terrible changes to my hair and skin. Recently I remembered this product and was so happy to find it available here on Amazon. Fingers crossed it helps improve things. FYI, it makes me ravenous, so I'm not able to take the full dosage daily. Currently considering taking it after dinner or at bedtime on a full stomach to avoid the hunger this supplement stimulates. Others may experience the same side effect.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tati",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on April 5, 2023",
                "reviewTitle": "Effective",
                "reviewText": "I've been taking it for less than a week but I've already noticed that I'm having less hair loss when I'm washing it",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}