{
    "remaining_requests": 24491,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Super-Mini-Multi-Superior-Childrens-Multivitamin/dp/B008RGIYTS",
    "body": {
        "name": "Wellness Resources Super Mini-Multi - Children's Multivitamin Swallowable Capsules with Methyl Folate, Methyl B12 and Coenzyme B Vitamins for Growth, Focus, Brain Health (120 Capsules)",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Super-Mini-Multi-Superior-Childrens-Multivitamin/dp/B008RGIYTS",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "This item cannot be shipped to your selected delivery location. Please choose a different delivery location.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41TEI4L7GkL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/514 yWUXVSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-LwqJydLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51h5BvhhoxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Xfna38mvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WUScsxeSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61KAhxQhOmL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2099f802-c19a-44c3-8c9b-b2af5e7a83e2/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fb5dbbec-8e61-472b-be22-62355f21de10/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Wellness Resources Store",
            "link": "https://www.amazon.com/stores/WellnessResources/page/1FD532F0-EF3D-40D8-9B03-2BEC99D5EAF1?ref_=ast_bln"
        },
        "brand": "WellnessResources",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 663,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Compact by Design (Certified by Amazon) products remove excess air and water, which reduces the carbon footprint of shipping and packaging."
        },
        "features": [
            "HIGHEST QUALITY children's multivitamin for daily nutrient needs.*",
            "MAX ABSORPTION: Coenzyme forms of B vitamins support natural energy and brain health.* HIGHEST PURITY: No sweeteners, gluten-free, dairy-free, non-GMO, no artificial colors or flavors; no additives.",
            "Over time, spotting can occur on this product when exposed to moisture in the air. This is due to the hygroscopic (moisture absorbing) nature of many of the ingredients and is not indicative of contamination or mold. To reduce this issue, please keep capsules in the original bottle with the included desiccant, and store in a cool, dry place.",
            "METHYL FOLATE: Methylated folate is bioavailable, readily usable folate for brain health.*",
            "GENTLE IRON: Iron bisglycinate is easy on the tummy, highly absorbable iron for growth.*"
        ],
        "description": "Wellness Resources - Since 1985 Highest Quality Supplements Wellness Resources formulates 90+ superior quality supplements that deliver the most absorbable nutrients in optimal amounts to make a true difference in your wellness. Family-Owned Since 1985 We care about your health! As a family-owned company founded in 1985, we are committed to formulating the very best nutritional supplements for results!",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Vitamins, Minerals & Supplements",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23675621011"
            },
            {
                "name": "Vitamins",
                "link": "https://www.amazon.com/Vitamin-Supplements/b/ref=dp_bc_aui_C_3?ie=UTF8&node=6936790011"
            },
            {
                "name": "Multivitamins",
                "link": "https://www.amazon.com/Multivitamin-Supplements/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3774861"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 0.59 x 0.2 x 0.16 inches; 2.4 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ August 1, 2012"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Wellness Resources"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B008RGIYTS"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,597 in Health & Household (See Top 100 in Health & Household) #223 in Multivitamins #1,109 in Climate Pledge Friendly: Health and Household"
            },
            {
                "name": "#1,109 in Climate Pledge Friendly",
                "value": "Health and Household"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 663 ratings"
            },
            {
                "name": "Brand",
                "value": "Wellness Resources"
            },
            {
                "name": "Item Form",
                "value": "Capsule"
            },
            {
                "name": "Primary Supplement Type",
                "value": "B-Complex"
            },
            {
                "name": "Diet Type",
                "value": "Vegan"
            },
            {
                "name": "Flavor",
                "value": "Unflavored"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Wellness Resources Super Mini Multi is an advanced children's multivitamin with the highest quality vitamins and minerals. It does NOT contain any additives, sweeteners, coloring, or flavorings. No junk; only the best nutrients for your kids! Coenzyme forms of B-vitamins for maximum absorption and energy production. B vitamins are essential for brain cells, focus, and nerves.*Gentle, highly absorbable iron bisglycinate. Iron is needed for growth and brain function.* Our special iron is easy on the tummy, doesn't cause nausea or upset stomach, and is optimized for absorption.Methyl folate for optimum absorption. It is estimated that 25 to 50% of the population does not properly convert folate into the methylated form, which is needed for absorption and use. There is no need to worry about this issue with pre-methylated folate.Absorbable minerals. Super Mini Multi is a well-rounded multivitamin with high quality minerals such as zinc, selenium, boron, manganese, calcium, and magnesium.Fruit antioxidant extracts for immunity and eyesight. Super Mini Multi includes grape seed extract, bilberry, beta carotene, quercetin, and lycopene. Super Mini-Multi comes in small, easy-to-swallow capsules. For children old enough to swallow, it is a great first vitamin to learn to swallow. Just place the vitamin on a spoon with apple sauce or yogurt and it will go right down. The capsule may also be opened and the powder inside mixed into food or a smoothie. Why not a gummy or chewable? At Wellness Resources, we're quality and purity fanatics and avoid using any sweeteners, even in our kids multivitamin. If you make the effort to give your child a multivitamin, be sure you're giving them vitamins and minerals they can actually absorb and use! Wellness Resources has been formulating nutritional supplements since 1985. See how our science-based formulations will make a difference in your family's wellness!",
                "media_link": []
            },
            {
                "media_text": "Super Powered Nutrients for Your Super Hero! Super Mini Multi is in a league of its own! It contains the most highly absorbable B vitamins, pre-methylated folate, and other important vitamins and minerals. Most other kids multivitamins are filled with low quality vitamins, sweeteners, and coloring. Super Mini Multi contains the most absorbable nutrients in a multivitamin optimized for brain health and growth.* Give your child the most absorbable, highest purity nutrients with Super Mini Multi!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A370K4TA6VNKWW/f868f5c9-b1c5-4453-a439-988d51222232._CR0,0,1423,1423_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Wellness Resources - Since 1985 Highest Quality Supplements Wellness Resources formulates 90+ superior quality supplements that deliver the most absorbable nutrients in optimal amounts to make a true difference in your wellness. Family-Owned Since 1985 We care about your health! As a family-owned company founded in 1985, we are committed to formulating the very best nutritional supplements for results! Quality You Can Trust Science-based Manufactured in the USA Most absorbable nutrient forms Formulated by nutritional experts No junk fillers or additives Gluten-free",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A370K4TA6VNKWW/615e245c-6dd3-4ef1-a874-edfef77ef3a9._CR0,0,600,600_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Transparency in Labeling Wellness Resources supplements are formulated with the highest purity, most absorbable raw material nutrients. We use the same forms of nutrients used in research – nutrients that are proven to be well absorbed and used by the body. We list the exact nutrient forms and amounts on the label! Standardized nutrients with active compounds listed on labelNo \"proprietary formulas\" with hidden nutrient amountsNo hidden ingredientsLab verified to ensure label accuracy and purity Wellness Resources selects science-based nutrients standardized for the most beneficial nutritional compounds. Get the most from your nutritional supplements!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/052cb77a-cdee-4070-b418-e530aca3af0d.__CR0,0,2048,2048_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "*These statements have not been evaluated by the Food and Drug Administration. These products are not intended to diagnose, treat, cure, or prevent any disease.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/f72bde1b-a0aa-4e27-b587-5b2c172adc85.__CR0,0,1200,360_PT0_SX600_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A370K4TA6VNKWW/f868f5c9-b1c5-4453-a439-988d51222232._CR0,0,1423,1423_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A370K4TA6VNKWW/615e245c-6dd3-4ef1-a874-edfef77ef3a9._CR0,0,600,600_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/052cb77a-cdee-4070-b418-e530aca3af0d.__CR0,0,2048,2048_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dani Russo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYMAFLB6ADT6BARIMW2ASZYULUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSIW7XKBZRHIT?ASIN=B008RGIYTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Great!",
                "reviewText": "The people writing the reviews about the black specs are giving the product a bad wrap because of their own mistake. The black spots are from oxidation which happens with vitamins that are not left in an air tight container with the freshness pack. If you leave them in their container in a cool dry place they will be fine.These are great capsules and perfect size for young kids.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHOI4Y2VUSCVESLVL7OLYWSKQHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32SQXPXHW2YG9?ASIN=B008RGIYTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 4, 2019",
                "reviewTitle": "5.0 out of 5 stars Has potential to be perfected",
                "reviewText": "I'd like to start out by saying I can appreciate the time and effort that goes into creating good products like this. The amounts of vitamins in these are close to excellent. These are a little low on Vitamin E, vitamin K, Choline, and Magnesium. I still appreciate these tiny, easy to swallow children's multi-vitamins. They certainly pack a lot for being so tiny. They are so small that it is a little difficult to open them up to sprinkle into my babies juices. It goes best in grape juice or something like a smoothy if they are old enough to notice, but never milk, dont even take them with milk. But my 7 year old and 10 year old had no worries or even hesitated to swallow 3 at once. Yes, I was shocked. But there are a few other small down sides. So these lack Vitamin E, K, Choline,and magnesium. The label doesn't reassure me enough that none of the vitamins are synthetic. So I have to do research to find out for sure. I do notice the additive called magnesium stearate, which is an oil additive that prevents clumping BUTmay or may not be harmful. I'm not sure how effective magnesium stearate is, but it is still a little controversial and should be left out. Other companies are stepping up to the plate in the organic field and it wont be long before the controversial additives and synthetic ingredients are absent with a larger variety of quality product for consumers to commit to.Since this multi-vitamin is lacking all of those vitamins and needs an oil based additive, I believe Wheat Germ Oil would be the perfect supplement for the magnesium stearate. It has everything this multi-vitamin is missing. Which is Vitamin E, K, choline and both Omega-3's and Omega-6's. And Fats are definitely important. How convenient.Wheat Germ Oil:Phytosterols 1206mgCholine 43.6mgVitamin E (Alpha Tocopherol) 326mgVitamin K 53.9 mcgTotal trans-polyenoic fatty acids Total Omega-3 fatty acids 15044mgTotal Omega-6 fatty acids. 119457mgTotal Fat 218g 335%Saturated Fat 41.0 gMonounsaturated Fat 32.9gPolyunsaturated Fat 135gAnd BTW this vitamin does state on the back that vitamin E's DV% is fulfilled, but from what I've learned it's falling very short. 10IU is not enough. But like I said, The amounts of vitamins in this childrens multi vitamin are impressive, easy to swallow, and mixes well with juice in baba's for the babies who can't swallow them. I will purchase again. Until I find something even better.",
                "reviewVotes": "54 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMC2W46MC7RQEXD5BY7M5O43BBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11QALJVMU2O6Y?ASIN=B008RGIYTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars BEST VITAMIN FOR MTHFR KIDS",
                "reviewText": "All across the board of ingredients and vitmains these vitamins are fantastic! especially if your looking to get your kids off gummy vitamins. theyre safe for mthfr which is a UNICORN to find for some reason. they last you two months if youre using it for one kid. my 8 yr old takes these happily and it was his first introduction to capsule form vitamins. my 4 yo old wont take them however shes still young though. they are a little bit bigger than a tic tap per capsule. if you compare these with the smarty pants gummy vitamins they contain so much more vitamins and daily value intake than the smarty pants and have some good added supplements to the capsule not just vitamins. the price is really good for a 60 day supply!!! you got a forever customer here.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KeishaKeisha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTZ4A4P46SEC7RMSDRNGYICONHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I7ATWYSYVCZC?ASIN=B008RGIYTS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2022",
                "reviewTitle": "4.0 out of 5 stars They seem to be okay vitamins",
                "reviewText": "I love the size of these since my 9yr old prefers capsules over liquid supplements. I can't say whether these are better or worse than others since there really aren't many options out there for childrens capsules to compare to. My only complaint is that sometimes there are these large black spots in the capsules. Idk what they are, so I feel that the company could use better quality control.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/614dbT-BEuL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "jessicaleigh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGH2OSU4XR7QFEN6CPKD7CURLDMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KAKYQLJS7AGQ?ASIN=B008RGIYTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 25, 2022",
                "reviewTitle": "5.0 out of 5 stars My kids love these",
                "reviewText": "My 9, 7, and even 3 year old have no trouble swallowing this product. I was skeptical At first, but thought I could always empty the capsules into apple sauce if the kids had a hard time. Nope! They picked it up within a couple of days, even the three year old! I’m so glad we decided to try these because everyone loves them and they are soo easy. All of the good stuff, none of the junk. I think it’s worth seeing if your kid is capable of swallowing something. They are about as big around as a tick tack, but twice the length. I did take it apart for the toddler the first time and it was easy to stir into apple sauce- but it did turn it pink! Probably the magnesium. She ate it no problem, then I taught her to swallow the pill whole in a spoon full of apple sauce, and nod she just takes them with water. The ingredients are high quality and I feel like they have way more than your average kids gummy vitamin. Highly recommend.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Candace Chang",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVHFZYYCBTFJY7SECASYDIYUQPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NXQ8ULJJYKRD?ASIN=B008RGIYTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Great option to teach kids how to swallow pills",
                "reviewText": "Probably the most important thing about these multivitamins is that my kids take them without complaint. They are small - perfect for swallowing. They don't taste like anything. They don't cause stomach issues when taken on an empty stomach. We've used these consistently for the last couple of years and are very happy with them. As a parent, I especially love that there are pills available vs having to resort to chewables or gummies.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ry eikleberry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJI2BGMH3PUWN2PW2ZKAVOYWWJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39MDW5FN6W2S5?ASIN=B008RGIYTS",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "1.0 out of 5 stars Seal broken",
                "reviewText": "When it arrived, the cap was on so tight it was nearly impossible to open. Then, upon opening, seal was broken.There’s a few other reviews with this same problem…guessing it’s a quality control problem that needs addressed with their caps going on just a little off making the seals puncture and lids tight.They had lots of potential, but unfortunately won’t be buying again, or using for my daughter.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NadineChristopher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJF3GHVU6KBMR33N74FDQKJFSQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFF191MD72RGL?ASIN=B008RGIYTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Small capsules",
                "reviewText": "Perfect for my two younger kids having a hard time getting used to swallowing pills instead of eating the sugar gummy ones. Perfect & small for them to take and get used too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}