{
    "remaining_requests": 24752,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Super-Complex-Vitamins-Supplement-Vegetarian/dp/B07414752B",
    "body": {
        "name": "Divine Bounty Super B Complex Vitamins - All B Vitamins Including B12, B1, B2, B3, B5, B6, B7, B9, Folic Acid - Vitamin B Supplement - Support Healthy Energy Metabolism - 90 Vegetarian Capsules",
        "price": "$14.84$14.84 ($0.16$0.16 / Count) $14.02$14.02 ($0.16$0.16 / Count)",
        "originalPrice": "$22.95",
        "rawPrice": 14.84,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Super-Complex-Vitamins-Supplement-Vegetarian/dp/B07414752B",
        "soldBy": {
            "sellerID": "A8G127BZKAULA",
            "name": "Divine Bounty",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A8G127BZKAULA&asin=B07414752B&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07414N15P"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "Save 15%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41TnSYcauIL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51eBif2nK6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51cjEszhrAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Vh7dxrcnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517z-JYOlML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wUo-EOvGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519pzLtFIuL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Divine Bounty Store",
            "link": "https://www.amazon.com/stores/Divine+Bounty/page/AF992FB2-33CE-455F-AEE0-47E0AC778505?ref_=ast_bln"
        },
        "brand": "Divine Bounty",
        "merchantInfo": "Divine Bounty",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 31248,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 5 hrs 47 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "More Potent Source Of B-Complex Vitamins - Our extra strength formula contains all the essential B Vitamins in just one capsule. If you'd rather take your B Vitamins (like B 12 & 6) together in one convenient capsule, look no further! Divine Bounty offers one of the most potent Vitamin B-Complex formulas available.",
            "Best Value For Money - Not only do we offer a high potency formula, each bottle contains 90 B Complex capsules, making it one of the best value vitamin B supplements available. The B-complex group are water-soluble vitamins, not easily stored in the body and thus need to be replenished frequently. Most comparable brands offer less capsules or a lower potency formula. With more capsules per bottle and superior potency per capsule, Divine Bounty is great value for money.",
            "Highest Quality Ingredients - Our formula is made up of only pure ingredients with no harmful additives. Simply the full B-Complex plus the combo of Inositol and Choline, two naturally occurring close cousins to the B Vitamin family. Our capsules are non GMO, soy free, gluten free and have no preservatives, stearates, silicone dioxide or artificial ingredients. A pure, clean formula.",
            "Daily B Complex Vitamins - Our bodies use B vitamins every day, and while diet is always the best way to get these essential vitamins, it’s not always possible to get enough of all 8 b vitamins from food alone. Use the Divine Bounty B Complex formula to supplement any deficiencies. Also sometimes called Super B, Stress B Complex, or B-100, it can also be taken as powder, tablets, pills, or soft gel caps.",
            "A Supplement You Can Take With Confidence - Divine Bounty is proudly made in the USA in an inspected facility. We stand behind our Vitamin B complex supplements and are proud to have the best formula on the market. If it doesn't work for you, let us know. We care about your results. EAN: 9506000122304 09506000122304"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Vitamins, Minerals & Supplements",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23675621011"
            },
            {
                "name": "Vitamins",
                "link": "https://www.amazon.com/Vitamin-Supplements/b/ref=dp_bc_aui_C_3?ie=UTF8&node=6936790011"
            },
            {
                "name": "Vitamin B",
                "link": "https://www.amazon.com/Vitamin-B-Supplements/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3774671"
            },
            {
                "name": "B-Complex",
                "link": "https://www.amazon.com/Vitamin-B-Complex-Supplements/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3774761"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2.2 x 4.2 x 2.2 inches; 3.53 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ DB-BVITA-S90"
            },
            {
                "name": "Department ‏",
                "value": "‎ unisex-adult"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ July 18, 2017"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Divine Bounty"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07414752B"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,481 in Health & Household (See Top 100 in Health & Household) #8 in Vitamin B-Complex Supplements"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 31,248 ratings"
            },
            {
                "name": "Brand",
                "value": "Divine Bounty"
            },
            {
                "name": "Item Form",
                "value": "Capsule"
            },
            {
                "name": "Primary Supplement Type",
                "value": "B-Complex"
            },
            {
                "name": "Diet Type",
                "value": "Vegetarian"
            },
            {
                "name": "Flavor",
                "value": "Unflavored"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The eight B vitamins - B1, B2, B3, B5, B6, B7, B9, B12 - are essential to maintaining the normal functioning of our bodies. They play an important role in overall health and wellbeing. While a healthy diet can provide us with all the B-Vitamins we need, certain factors can lead to a deficiency in one or more of the B vitamins. Divine Bounty Vitamin B Complex offers one of the most potent formulations on the market. If you are looking for a superior B-Vitamin supplement, look no further.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/89752556-baa2-49f6-9924-b09de5685ab1.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Why is Divine Bounty the Right Choice for You? At Divine Bounty, we truly want you to see the results you're looking for. That is why we take the time to craft the perfect formula with a careful balance of ingredients. - Superior Potency - Many B-Vitamin formulas don't even provide the recommended Daily Value of the vitamins they've included. Divine Bounty gives you a superior dose of all the Vitamin-B your body needs on a daily basis in just one convenient capsule. - Superior Formula - Our powerful Vitamin B capsules combine the 8 essential B-Vitamins with their naturally occurring cousins, Inositol and Choline. As B-Vitamins are not easily stored in the body, we give your body a chance to absorb what it needs by providing a higher potency of each ingredient. - Superior Value - Don't get caught having to re-order every month with brands that offer a much lower potency or fewer capsules per bottle. Containing 90 easy-to-swallow capsules, your bottle of Divine Bounty Vitamin B Complex is real value for money. - Superior Quality - We only use natural ingredients enclosed in vegetarian capsules. This means our supplement does not contain any harmful chemicals, stearates, artificial ingredients, fillers or preservatives. It is also GMO free, dairy free, gluten free and also free of animal products.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/59d9a86b-0105-4465-89a6-c6ee4041ff39.__UX300_V1___.jpg"
                ]
            },
            {
                "media_text": "A Supplement You Can Take With Confidence At Divine Bounty, our mission is to help those who are looking for ways to naturally support and promote a healthy body. We strive to redefine what's possible by combining nature with science to provide high quality formulas for optimum balance. Powered by nature's most cutting-edge active ingredients, our supplements are carefully crafted with health in mind. Divine Bounty doesn't compromise on quality and proudly affirms the integrity and quality of our products. Made in an inspected facility, all of our products are proudly manufactured to our unique specifications using only the finest quality ingredients that have been carefully selected and crafted together with the support of qualified scientists. We stand behind our entire supplement range and are proud to have the best formulas on the market. All of our products are pure, clean formulas that include only what you need, without the unnecessary additives. We truly care about your satisfaction and wellbeing. That is why we use only the finest ingredients that have been scientifically tested for purity and potency.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A8G127BZKAULA/B00VSVKJ8I/xGlGRzlUSpOk._UX300_TTW__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A8G127BZKAULA/B00VSVKJ8I/rviRIVUHRrZ._UX300_TTW__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A8G127BZKAULA/B00VSVKJ8I/5GM9DjTQ6a8._UX300_TTW__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/89752556-baa2-49f6-9924-b09de5685ab1.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/59d9a86b-0105-4465-89a6-c6ee4041ff39.__UX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A8G127BZKAULA/B00VSVKJ8I/xGlGRzlUSpOk._UX300_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A8G127BZKAULA/B00VSVKJ8I/rviRIVUHRrZ._UX300_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A8G127BZKAULA/B00VSVKJ8I/5GM9DjTQ6a8._UX300_TTW__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "S. Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH56H5PGM4ELDBDFGEG2RV7LQKYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AVYIQLJU8J4I?ASIN=B07414752B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Works, Easy size to swallow",
                "reviewText": "Good product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "richiecez610",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEERDBK46ERHPK5KUQSVSN4O2ZWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BP9J60H61U3G?ASIN=B07414752B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Good value.",
                "reviewText": "I take B Vitamin for energy. It helps to get me going and get things done around the house. I noticed a huge difference in my energy levels when I started taking B-complex vitamins. I definitely can tell the difference when I don’t take them & when I do. These are good. I highly recommend.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Judad47",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKJ5EVN7PX246KYH7WSYXCEUG5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TPQVQ4VVIZMX?ASIN=B07414752B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Vitamin",
                "reviewText": "I believe this product has helped my over all health. I am feeling better since taking this Vitamin B supplement.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cece",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCKZ4C5DWNE7NDJF7SL3LLG27GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37WG6ELWHV5SS?ASIN=B07414752B",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "4.0 out of 5 stars B complex",
                "reviewText": "Would definitely recommend, I took them for a month and had more energy throughout that period. No after taste or bad smell. I would probably start taking it for another month just to reap the benefits.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Le",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRG5FGCFFCSGOZAMWYLJQIONHYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z0W11CUO01ND?ASIN=B07414752B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 17, 2023",
                "reviewTitle": "5.0 out of 5 stars A Boost of Vitality",
                "reviewText": "Title: A Boost of Vitality: A Positive Review of My Vitamin B PurchaseI recently made a purchase of Vitamin B supplements that has had a tremendously positive impact on my overall well-being. Allow me to share my experience and provide a glowing review of this remarkable product.First and foremost, I am delighted with the effectiveness of these Vitamin B supplements. Since incorporating them into my daily routine, I have noticed a significant increase in my energy levels and overall vitality. I no longer experience the midday slumps or feelings of fatigue that used to hinder my productivity. The Vitamin B complex has truly been a game-changer in helping me maintain a consistent level of energy throughout the day.Moreover, these supplements have also greatly benefited my mental clarity and focus. I find myself more alert and able to concentrate on tasks with enhanced clarity. The Vitamin B complex's positive impact on my cognitive function has been remarkable, enabling me to perform at my best both personally and professionally.Additionally, I appreciate the quality of the product. The vitamins are formulated with high-quality ingredients, ensuring their potency and effectiveness. I also appreciate that they are free from any unnecessary additives or fillers, making them a clean and reliable choice for my nutritional needs.Another aspect that I find commendable is the convenience of the packaging. The vitamins come in easy-to-swallow capsules that are well-sealed to preserve their freshness. The bottle's design allows for effortless dispensing, making it convenient to incorporate the supplements into my daily routine.Finally, I must highlight the positive impact these Vitamin B supplements have had on my overall health. Vitamin B plays a crucial role in supporting various bodily functions, including metabolism, nerve health, and red blood cell production. By ensuring I meet my daily recommended intake of Vitamin B, I feel confident that I am taking proactive steps towards maintaining my long-term health and well-being.In conclusion, my purchase of these Vitamin B supplements has been nothing short of remarkable. They have significantly boosted my energy levels, improved my mental clarity, and supported my overall health. I highly recommend these supplements to anyone looking to enhance their vitality and well-being. Incorporating these vitamins into my daily routine has been a positive investment in my health, and I couldn't be happier with the results.",
                "reviewVotes": "75 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCV6TMHI3KRTR4YIMUTCZ6JJV7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAIC3G3UWAVWJ?ASIN=B07414752B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Good stuff",
                "reviewText": "Recommended for me by my doctor",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "michelle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMVWSSEBOYI6IUMOR4UL2DUN3ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22CP3JKERO337?ASIN=B07414752B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent",
                "reviewText": "Lots of energy and not nervous energy",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLODB5GBOQTCUI34JG4S4UEA2EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R334KHV16Y2O00?ASIN=B07414752B",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2023",
                "reviewTitle": "3.0 out of 5 stars Loved these before, seems different than previous bottles?",
                "reviewText": "I have purchased these vitamins 2 times in the past and was completely satisfied with them. They were high quality and truly boosted my energy and mood. The third bottle I purchased in June ‘23 was not the same product. The b complex has a VERY distinct odor and taste that is quite unpleasant, but I’ve gotten quite used to it. The new bottle lacked that odor and absolutely smelled and tasted 100% like turmeric. I am quite disappointed not only because I feel I am out the money for the bottle but also because I very much enjoyed the last 2 bottles of the quality b complex I had purchased before. Have reached out to the company via their website, will update if they offer any help.EDIT:After contacting divine bounty, they sent me a replacement bottle and have offered a full refund for my original bottle. The customer service is outstanding. I am not sure what to make of things with the new bottle. The capsules are having a different effect on me than they have had in the past, not a pleasant one. I don’t know if the formulation has changed or it is just me. After smelling the capsules more, I don’t think they were turmeric, but they do not smell the same as my previous 2 bottles did. Could not be happier tho with the way I was treated by them as far as customer service.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}