{
    "remaining_requests": 24706,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Supplement-Vitamins-Supplements-Nutritional-Capsules/dp/B09Z6JHHHL",
    "body": {
        "name": "Nature Fruits and Veggies/Vitamins Supplements Dietary Nutritional Balance 90 Fruit and 90 Veggie Capsules",
        "price": "$26.00",
        "originalPrice": "$39.99",
        "rawPrice": 26.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Supplement-Vitamins-Supplements-Nutritional-Capsules/dp/B09Z6JHHHL",
        "soldBy": {
            "sellerID": "A2NOZVBXPHPMUO",
            "name": "fourteen and three",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2NOZVBXPHPMUO&asin=B09Z6JHHHL&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CK25NF7D"
        ],
        "asinVariationValues": [
            {
                "asin": "B09Z6JHHHL",
                "variationName": "Size",
                "variationValue": "1 Count (Pack of 2)",
                "price": "$26.00",
                "variationImageURL": ""
            },
            {
                "asin": "B0C9WFQ43B",
                "variationName": "Size",
                "variationValue": "1 Count (Pack of 4)",
                "price": "$64.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "Only 10 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61XhlwMoAsL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51TDgNS VxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51o2Kz9IXOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51MYaZS69RL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51kEGfM6GHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51YdjtdNHUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61KO4AsuA1L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1563022b-4e27-4722-a3b9-d021e3d30606/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1135d2b0-27f0-40ad-b4d5-505466336fea/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8eab7f35-6c51-4fc3-96df-6e1d36f5fa01/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27d882b0-78de-4d10-b6ab-b2f0d4bd4883/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Horjoy",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=Horjoy"
        },
        "brand": "Horjoy",
        "merchantInfo": "fourteen and three",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2059,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22.",
            "Or fastest delivery February 16 - 20."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "All-natural: Horjoy Veggies and Fruits Capsules are made from more than 30+ all-natural fruits and vegetables, grown in organic farms and processed with new drying technology. These capsules are a great substitute to natural form fruits and vegetables, allowing you to supplement nutrients that you may not be getting from your regular diet With our all-natural formula, you can be confident that you are getting the best possible supplement for your health",
            "Keep optimal health: Veggies and fruits capsules can be used as a daily supplement to enhance your overall health and wellness. Rich in vitamins, minerals, and antioxidants, they can help support a healthy immune system. But not only that - these capsules can also help promote better sleep. The nutrients found in fruits and vegetables, such as magnesium, potassium and tryptophan, have been shown to help promote relaxation, leading to improved sleep quality and greater energy and vitality",
            "Made in USA: We take pride in creating high-quality health supplements that people can trust. That's why our Veggies and Fruits Capsules are made in a GMP certified facility, with strict quality standards. The designer of the capsules is one of the top nutritionists in the United States",
            "Suitable for kids to seniors: Horjoy Veggies and Fruits Capsules are perfect for all ages, from kids to seniors. These capsules are made with all-natural ingredients that are free from added sugars, fillers, preservatives and synthetics, making them safe and healthy for everyone. They are also easy to swallow, and won't leave a bad taste in your mouth. They are a great alternative for those who don't like or have issues consuming fresh fruits and vegetables",
            "After-sales service: We offer a 30-day satisfaction guarantee. If you are not completely satisfied with your purchase, please contact us and we will do our best to address any issues and make things right for you"
        ],
        "description": "Nature Fruits and Veggies/Vitamins",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b?ie=UTF8&node=3760901"
            },
            {
                "name": "Vitamins, Minerals & Supplements",
                "link": "https://www.amazon.com/b?ie=UTF8&node=23675621011"
            },
            {
                "name": "Blended Vitamin & Mineral Supplements",
                "link": "https://www.amazon.com/Multiple-Vitamin-Mineral-Combination-Supplements/b?ie=UTF8&node=3773931"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 4.37 x 4.25 x 2.09 inches; 7.37 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ April 29, 2022"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Horjoy"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B09Z6JHHHL"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,675 in Health & Household (See Top 100 in Health & Household) #145 in Blended Vitamin & Mineral Supplements"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,059 ratings"
            },
            {
                "name": "Brand",
                "value": "Horjoy"
            },
            {
                "name": "Flavor",
                "value": "Apple,Banana,Tomato"
            },
            {
                "name": "Unit Count",
                "value": "2.00 Count"
            },
            {
                "name": "Item Form",
                "value": "Softgel"
            },
            {
                "name": "Item Weight",
                "value": "0.46 Pounds"
            },
            {
                "name": "Diet Type",
                "value": "Vegan"
            },
            {
                "name": "Product Benefits",
                "value": "Immune Support"
            },
            {
                "name": "Age Range (Description)",
                "value": "Child"
            },
            {
                "name": "Package Information",
                "value": "Bottle"
            },
            {
                "name": "Number of Items",
                "value": "2"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7d8d11e7-53ed-4bda-ac41-749f0b52738a.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e0d1810c-d155-4807-b30d-abb3cd30cd9f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/802ea2b6-c5cd-4209-9223-27d3e1b29d4c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f585c14-38a2-4c49-8728-08efb35d79f5.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/62a2ff30-16e2-44d2-b341-6c0775fbcfef.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "I recently started incorporating Horjoy Veggies and Fruits Supplements into my daily routine, and I couldn't be happier with the results. These supplements have truly become a game-changer for me, and I'm excited to share my positive experience with others.  First and foremost, the quality of Horjoy's supplements is exceptional. It's evident that they source the finest ingredients, as I can taste the freshness and purity in every capsule. Knowing that I'm getting a concentrated dose of essential vitamins, minerals, and antioxidants from real fruits and vegetables is reassuring, especially when my busy schedule doesn't always allow for a well-balanced diet.  One of the standout features of these supplements is their convenience. Life can get hectic, and it's not always easy to prepare and consume a variety of fruits and vegetables every day. Horjoy Veggies and Fruits Supplements simplify this process by providing a quick and efficient way to ensure I'm meeting my nutritional needs. Plus, there's no need to worry about spoilage or waste, as these capsules have a long shelf life.  Since I started taking these supplements, I've noticed a significant improvement in my overall well-being. I have more energy throughout the day, and I feel more alert and focused. My immune system also seems to be stronger, as I've experienced fewer colds and illnesses since incorporating Horjoy's supplements into my daily regimen.  The best part is that these supplements are gentle on the stomach and don't cause any digestive discomfort, which can sometimes be an issue with other vitamin and mineral products. I appreciate that they are suitable for people with dietary restrictions, as they are gluten-free, vegan, and free from artificial additives.  In addition to the physical benefits, I've also noticed an improvement in my skin's complexion and overall glow. The antioxidants in these supplements are doing wonders for my skin's health, and I couldn't be happier with the radiant results.  Overall, I wholeheartedly recommend Horjoy Veggies and Fruits Supplements to anyone looking to enhance their nutrition and overall well-being. These supplements have made a noticeable difference in my life, and I'm confident they can do the same for others. With Horjoy, you can invest in your health with peace of mind, knowing you're getting a top-notch product that delivers real results.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSO463OJX46QUPWTFMJMOE4H3NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TGXQIZQ1I2RS?ASIN=B09Z6JHHHL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars 😁",
                "reviewText": "I recently started incorporating Horjoy Veggies and Fruits Supplements into my daily routine, and I couldn't be happier with the results. These supplements have truly become a game-changer for me, and I'm excited to share my positive experience with others.First and foremost, the quality of Horjoy's supplements is exceptional. It's evident that they source the finest ingredients, as I can taste the freshness and purity in every capsule. Knowing that I'm getting a concentrated dose of essential vitamins, minerals, and antioxidants from real fruits and vegetables is reassuring, especially when my busy schedule doesn't always allow for a well-balanced diet.One of the standout features of these supplements is their convenience. Life can get hectic, and it's not always easy to prepare and consume a variety of fruits and vegetables every day. Horjoy Veggies and Fruits Supplements simplify this process by providing a quick and efficient way to ensure I'm meeting my nutritional needs. Plus, there's no need to worry about spoilage or waste, as these capsules have a long shelf life.Since I started taking these supplements, I've noticed a significant improvement in my overall well-being. I have more energy throughout the day, and I feel more alert and focused. My immune system also seems to be stronger, as I've experienced fewer colds and illnesses since incorporating Horjoy's supplements into my daily regimen.The best part is that these supplements are gentle on the stomach and don't cause any digestive discomfort, which can sometimes be an issue with other vitamin and mineral products. I appreciate that they are suitable for people with dietary restrictions, as they are gluten-free, vegan, and free from artificial additives.In addition to the physical benefits, I've also noticed an improvement in my skin's complexion and overall glow. The antioxidants in these supplements are doing wonders for my skin's health, and I couldn't be happier with the radiant results.Overall, I wholeheartedly recommend Horjoy Veggies and Fruits Supplements to anyone looking to enhance their nutrition and overall well-being. These supplements have made a noticeable difference in my life, and I'm confident they can do the same for others. With Horjoy, you can invest in your health with peace of mind, knowing you're getting a top-notch product that delivers real results.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jayesh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJ5ZMJ7UQBNFHNJP4WTJSDUNMUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D86XLQL8KS9W?ASIN=B09Z6JHHHL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars A Convenient and Effective Way to Boost Daily Nutrition",
                "reviewText": "I recently started using Horjoy Nature Fruits and Veggies/Vitamins Supplements, and I'm genuinely impressed with the results. As someone who struggles to incorporate enough fruits and vegetables into my diet, these supplements have been a game changer.Product Quality and Packaging: The capsules arrived in perfect condition, neatly packaged. The quality of the capsules is evident, with no unpleasant taste or aftertaste, which is often a concern with such supplements.Effectiveness: Since beginning these supplements, I've noticed a significant improvement in my overall energy levels and general well-being. The balance of 90 fruit and 90 veggie capsules ensures a comprehensive nutritional intake that complements my daily diet.Ease of Use: What I love most about these capsules is the convenience they offer. With my busy lifestyle, getting the recommended daily intake of fruits and vegetables can be challenging. These supplements make it easy to maintain a balanced diet.Value for Money: Considering the quality and the quantity (180 capsules in total), I find these supplements to be excellent value for money. It's an investment in my health that I find justifiable and reasonable.Overall Experience: My experience with Horjoy Nature Fruits and Veggies/Vitamins Supplements has been overwhelmingly positive. I feel more energetic, and it's a relief knowing that I'm supporting my body with essential nutrients every day.Recommendation: I would highly recommend these supplements to anyone looking to enhance their nutritional intake. Whether you're someone who struggles to eat enough fruits and veggies, or you're simply looking for an additional nutritional boost, these capsules are a great choice.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ben E",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHL5E34KWPVSCKNNSBYOYM3PPXFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HF8IEO5I3T62?ASIN=B09Z6JHHHL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "4.0 out of 5 stars Easy to swallow and less expensive than others",
                "reviewText": "I've taken these supplements for about a year and a half now. Like almost everyone leaving a review here, I don't get nearly enough fruits and veggies in my daily diet, and i know how important it is for my health to do so. These diet supplements appeal to me because they're an easy way to get my fruits and veggies, and they're pure fruits and veggies, nothing else (except for the capsule casing). Also, the price for the Horjoy supplements is much less than its most well-known competitor. I can't say for sure it increases my energy level or makes aches and pains go away faster, or whatever customers claim it does. I'm a 67 year old male who's in great health and is active in sporting activities. These days I rarely if ever get headaches, constipation or diarrhea, and I don't have significant aches and pains that usually come with advanced age. Like I said, I can't attribute these with 100% certainty to the Horjoy pills, but I'm reasonably sure they're a benefit to me regardless.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John R",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 24, 2023",
                "reviewTitle": "Very good for health but are stucking in the larynx.",
                "reviewText": "I am very happy with the Fruits and Veggies Supplement. They are definitely do their job.The only thing that I would really improve is the plastic coating of those pills. Unlike any other pills I taken those ones are sticking in the larynx after swallowing them. I figured out to take them with lots of water / drink otherwise they just stuck between the throat and the stomach in the larynx... Not a good feeling for quite a while and when trying to eat something like bread to \"push\" them down... it sometimes heart quite a lot.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$33.99",
                "sellerName": "GAKUS",
                "sellerRating": "4.5"
            },
            {
                "price": "$42.99",
                "sellerName": "MYLGB",
                "sellerRating": "4.5"
            }
        ]
    }
}