{
    "remaining_requests": 24522,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/GMO-Free-Vitamins-Ingredients-Bioavailability/dp/B085KX3ZX9",
    "body": {
        "name": "GMO Free Vitamins - Ultra Fine Vitamin C Powder, Made in UK, UK Ingredients - Highest Grade of Quali-C L-Ascorbic Acid for Maximum Bioavailability – Vegan (8 oz.)",
        "price": "$44.50",
        "originalPrice": "",
        "rawPrice": 44.5,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/GMO-Free-Vitamins-Ingredients-Bioavailability/dp/B085KX3ZX9",
        "soldBy": {
            "sellerID": "A3B0SE0N97R77Z",
            "name": "GMO Free Vitamins LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3B0SE0N97R77Z&asin=B085KX3ZX9&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B088QSS9HQ"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "6",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41MoAp4cp8L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51P0 01EPdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qG3PVOlPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FgZ9BlIQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51IGQfUDO3L.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: GMOFreeVitamins",
            "link": "https://www.amazon.com/GMOFreeVitamins/b/ref=bl_dp_s_web_20514452011?ie=UTF8&node=20514452011&field-lbr_brands_browse-bin=GMOFreeVitamins"
        },
        "brand": "GMOFreeVitamins",
        "merchantInfo": "GMO Free Vitamins LLC",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 698,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 19 - 21",
            "Or fastest delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "HIGHEST GRADE VITAMIN C: Manufactured by a leading Dutch company, we use DSM's highest grade of Quali-C for Ultra-Fine Vitamin C Powder with L-Ascorbic Acid.",
            "TASTE THE DIFFERENCE: With a pleasant lemon citrus flavor, it’s never been so easy to mix in essential nutrients for immunity and energy support into your new favorite drink.",
            "FINE LIKE POWDERED SUGAR: This ultra-fine Vitamin C powder easily dissolves into your glass without the crystal residue often apparent in cheaper sources of Vitamin C.",
            "ONLY THE GOOD STUFF: Unparalleled in its purity, this non-GMO formula is free of additives and fillers, gluten, lactose, sorbitol, egg, fish, tree nuts, peanuts, and soy.",
            "Amazon has changed their policy and stopped showing the 325 reviews from our 16 oz size. They are still visible on our website. Help us get back on track by leaving us a 5* review and email us a copy so we can offer you a 10$ off coupon for your next purchase. Get your next unit at our cost!"
        ],
        "description": "GMO Free Vitamins is proudly manufactured by DSM, a highly respected Dutch company in the industry. Their manufacturing plant in Dalry, Scotland makes Vitamin C from Non-GMO corn grown in Great Britain, a rarity for a Vitamin C source. Dedicated to only selling DSM's highest grade of Quali-C, try and C for yourself what makes you feel better!GMO Free Vitamins - Ultra Fine Vitamin C Powder With a light lemon citrus flavor and an ultra-fine powder for easy absorption into your glass, getting your daily boost of Vitamin C has never been easier (or tastier!). Made from the highest-grade Vitamin C possible, DSM's highest grade of Quali-C makes for a powerful and Ultra-Fine Vitamin C Powder. With 1,000 MG pure L-Ascorbic Acid per serving, you get 1,667% of your daily value of Vitamin C. Scoop away, with 454 servings per container.How is DSM’s Quali-C Vitamin C Different? Not all Vitamin C is created with the same standards, 90% of the vitamin C on the market is manufactured in China. Of the remaining 10%, all five manufacturers of Vitamin C in the USA use GMO corn as the source. DSM’s Quali-C Vitamin C is made in Scotland, exclusively from Non-GMO corn grown in the U.K. and always tests over 99.7% purity with .01% sulfated ash and metals in the lowest parts per million on the market, making it the highest grade available.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Vitamins, Minerals & Supplements",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23675621011"
            },
            {
                "name": "Vitamins",
                "link": "https://www.amazon.com/Vitamin-Supplements/b/ref=dp_bc_aui_C_3?ie=UTF8&node=6936790011"
            },
            {
                "name": "Vitamin C",
                "link": "https://www.amazon.com/Vitamin-C-Supplements/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3774771"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 4.21 x 3.66 x 3.62 inches; 8 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ March 5, 2020"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ DSM"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B085KX3ZX9"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#73,080 in Health & Household (See Top 100 in Health & Household) #460 in Vitamin C Supplements"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 698 ratings"
            },
            {
                "name": "Brand",
                "value": "GMOFreeVitamins"
            },
            {
                "name": "Item Form",
                "value": "Powder"
            },
            {
                "name": "Primary Supplement Type",
                "value": "Vitamin C"
            },
            {
                "name": "Diet Type",
                "value": "Vegan"
            },
            {
                "name": "Flavor",
                "value": "Citrus, Lemon"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVV5GNOWPBBAQPATOBXE5HCYBUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGN3PHITKCFES?ASIN=B085KX3ZX9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 25, 2017",
                "reviewTitle": "5.0 out of 5 stars ... recently did some serious research to decide what’s the best Vitamin C for me to take",
                "reviewText": "I recently did some serious research to decide what’s the best Vitamin C for me to take, and concluded that UltraFine Quali-C, manufactured in Scotland from exclusively GMO-free corn, is it. No better Vitamin C is made in the entire world.‘UltraFine’ is composed of incredibly tiny particles. It’s one of the finest, fluffiest supplement powders I’ve ever seen. In this case, SIZE DEFINITELY MATTERS. The smaller the particle size, the better the C passes the gut wall into the bloodstream, then the better it crosses the cell wall to get INSIDE the cells where it’s most needed.This is what sets Vitamin C’s apart, and why the performance of UltraFine outshines all the others, in my opinion and experience. When I first started taking higher amounts of Vit C a few months ago (using a lower quality product), it was easy to run into issues with gas production. Since I started using UltraFine (47 days ago), I’ve had no more issues with that at all. That tells me the Ultrafine is absorbing into my body and doing what I want it to, instead of trending toward elimination.Most Vitamin C is manufactured in China. That doesn’t mean it’s bad, but China hasn’t gained a reputation for consistent highest quality. I’m committed to optimizing my Vitamin C levels, by taking multiple doses daily to keep my organs and tissues saturated, especially the C-hungry adrenal glands. Since I'm taking it several times every day, I feel more comfortable using a C made in Europe by a reputable and trustworthy company.Surprisingly, in spite of this being the absolute best Vit C that’s made, few people sell the ULTRAFINE Quali-C. (Others sell Quali-C, but when you look closely it’s not the best quality UltraFine, but a lower grade with larger particle size.) Buying UltraFine here on Amazon from GMOFreeVitamins (i.e. Andrew Vajda) is the only affordable source I could find. I found two other sources (both good people whom I respect), but they charge almost 3x times higher than Andrew’s price. If Andrew were not selling it, I would not be able to afford it.I always compare prices carefully to save money, and usually find 5-10%, maybe up to 25% price difference separating competing vendors. I can’t remember a case where I found a whopping 270% price difference between serious competitors. I want to be clear I am not connected with the seller Andrew Vajda in any way, except that I am now his regular customer. I depend on him to supply me with the Vit C I intend to take the rest of my life, as long as I can afford it (and as long as he makes it available). I’ve never met Andrew, and probably never will. I emailed him a few times, and was pleased to find him quite responsive to my questions. But I have no connection at all to his business.I’ve been involved in natural healthcare for many years, and taken a lot of supplements in my life. Yet I only recently had my eyes ‘opened’ to the value of Vit C. For years I was influenced by the myth ‘if you take much C, you just dump it in the urine’, so the idea is, it would be a waste of time and money to supplement C.I learned of the critical value of Vit D in 2009, and since then have taken D regularly (important to also take Vits A & K2 along with it!). When you learn how the body works, it’s pretty obvious that Vit D is extremely important, because our bodies were designed to produce D from the sun. For me, that puts it as a high priority. However, after using sun exposure for two years as my source for Vit D, I developed some skin cancers (eliminated effectively with black salve). So no more sunbathing for me. I take D in a supplement.I was unaware until earlier this year that ALL living things – both plants and animals – can produce their own Vit C internally. (The need for ascorbic acid, an essential antioxidant and electron donor, is ubiquitous among all living things.) We have those genes as well! Vit C is so important, we wouldn’t have to get it from our food, or even from the sun, but our own bodies would make it for us 24/7. Sadly, apparently 100% of people on earth have lost the ability to do this.Our DNA contains the genes to make ascorbic acid out of glucose (simple blood sugar), and if it weren’t for genetic mutations, our body would constantly be making ascorbic acid 24 hrs a day to supply our needs. However, the last step in the conversion process, the GULO gene, is broken, and we can no longer make our own. Thus we are forced to meet our ascorbic acid needs by consuming it. Comparing our body weight to animals, if our genes worked properly we should be making a minimum of 3 gm Vit C daily, and possibly 2-5 times more. It’s impossible to get that much from just eating food.Now that I know this, in addition to what else I take, I now intend to supplement Vit C generously the rest of my life. What is typically considered ‘high dose’ Vit C is not really high, but simply the amount our bodies were designed to make and use on a daily basis.For sake of those new to taking higher dose Vit C (as I was not long ago), here's some ideas on how to take it. First, don’t take one large single dose for the whole day, but multiple smaller doses spread throughout the day. Why? Because the half-life of Vit C in the blood is extremely short, on the order of 30 minutes or less.Second, should you add your C to a larger amount of water (such as a quart) and sip it over 2-3 hours? Or should you dissolve it in a very small amount of water and drink it right down? That's debatable. The first method emulates what our body would be doing if the GULO gene worked right, and simultaneously encourages one to drink more water. Those are both good things. The negative with using the larger amount of water is that ascorbic acid slowly oxidizes in aqueous solution. For example, you would not want to add Vit C to a quart of water, and then wait till the next day to drink it. I would guess it needs to be consumed within 2-3 hours. The longer you wait, the more oxidized C you will be consuming, and oxidized ascorbic acid is a toxin the body must eliminate. But if you consume it within 3 hrs or so (and your water contains no alkali, copper, or iron, all of which speed up the oxidation process), I think frequently sipping a weak solution of Vit C water would be fine. If you already are in the habit of slowly drinking 2-3 quarts of water through the day, this might be the best method.If using the latter method where you take a dose all at once, put 1 inch or so of water in a glass, add your Vit C, dissolve it, and drink it right down. Dissolving the UltraFine Quali-C only requires a few swirls of the glass, no stirring required. It’s amazing how rapidly it dissolves. The advantage of this is it’s quick and easy. For convenience, this is the method I use. I personally take a 2 gm dose (1 tsp) of UltraFine 3 times per day most days. Some people may need much more, depending on their situation (see Dr Cathcart for more on this).Third, don’t swish the acidic Vit C water through your teeth before swallowing. The acidity can slowly dissolve enamel. This won’t be a problem if you keep the liquid toward the center of your mouth, drink it right down after tasting it, and then rinse your mouth several times with plain water after you take your C.Re a single large dose, Dr Thomas Levy mentioned he took 1-2 tablespoons of Vit C (a big dose!) at the beginning of each day for about six years, to purposely flush his colon out, and then he was free and clear the rest of the day. That is a valid use of C, but you would probably want to use a cheaper, much lower grade Vit C than UltraFine for that purpose. (My focus is on getting the C inside my body and inside my cells where it is most needed.)How can you tell when you’re taking enough - the optimal amount - of Vit C? I mentioned the importance of Vit D. The only way to tell if your Vit D level is optimal is through a lab test. That is not the case with Vit C. Your own body tells you when you have enough! When you take more C than can be absorbed into the bloodstream, the rest must go out the other end. It will cause gas production and loose stools. When your stomach starts to rumble, then you know you’ve taken the amount of C (for that time) that your body can handle.(Cathcart states that in special situations, you can push past this limit and go ahead and take more, which will cause the gas and loose stools, in order to cause your body to absorb more, though it will be a lesser percent than was at first absorbed.)I highly recommend reading Dr Robert Cathcart’s 1981 paper, because he describes better than anyone else how to take Vit C. (He also states that about 20% of his patients did not tolerate larger doses of C.) Andrew Vajda has that paper posted on his website, along with comments from additional experts - gmofreevitamins.com/vitamin-c-dosage/. I also recommend watching Andrew Saul’s excellent Oct 2016 message titled High Dose Vitamin C Therapy for Major Diseases (Youtube).Personally, I don’t take Vit C by itself - I take 'Vit C & friends'. Dr Cathcart stated that plain ascorbic acid is about twice as effective as taking a buffered form such as sodium ascorbate, so I never take buffered forms of C. But in addition to C I’m also intent on optimizing other nutrients, such as Magnesium and Iodine. (I think most people in the world are deficient in Vit C, Magnesium, Iodine, and Vit D, in regard to consuming the optimal levels required for best health.)With every 2 gm dose of UltraFine Quali-C, I add some ReMag (which I believe is one of the finest magnesium supplements on the planet, again due to small particle size), and this provides some balance to the acidity of the C. To me, the UltraFine Quali-C + ReMag always tastes better than the C by itself. Also, with two of my Vit C doses each day, I take 3 drops Detoxadine. I find these combine together extremely well, and I don’t believe they hinder the absorption or efficacy of the C. For those looking to optimize their magnesium and/or iodine levels, you may want to experiment with this. If you haven't been taking ReMag or Detoxadine, start at lower doses and work up, to avoid potential unpleasant detox reactions.Some say that too much Vitamin C is dangerous. I have found no evidence of this. Dr Cathcart trained thousands of his patients to take high dose Vit C, and the only serious side effect he observed over the years was enamel erosion in those who weren’t careful to keep the C water off their teeth. Excess Vit C may cause gas and loose stools, which is inconvenient, but it is definitely not dangerous.Some respected nutritionists claim that bioflavonoids (found in all foods with higher ascorbic acid content) are more important than the ascorbic acid itself. This claim is not based on research, but on simple reasoning. Though sincere, I am certain this idea is wrong. Bioflavonoids are good for us, and I personally take bioflavonoids daily. But don’t be deceived into thinking they are more important than ascorbic acid. We don’t have any bioflavonoid-making genes inside us, nor does all life on the planet. We DO all have ascorbic-acid making genes. When we take frequent doses of ascorbic acid, we are simply trying to return our bodies closer to the original function intended by our genetics.Last comment. I’ve stated that UltraFine Quali-C is the best Vit C on the planet. In my opinion it is. LivOn Labs produces a liposomal ‘Lypo-Spheric Vitamin C’ which is famous for absorbing and getting into the cells very efficiently. Prior to using UltraFine, I ordered a couple boxes of the LivOn liposomal C. It is certainly a good product, but I found I really didn’t like the high amount of sodium in it. I still have over a full box of it sitting in the fridge.I have no way of measuring the performance of UltraFine versus the liposomal C, that is, knowing for certain what percent of each ends up inside the cells of the body tissues. The LivOn C product has performed very well for some. But for me, considering the cost and unwanted sodium content, the UltraFine Quali-C is far better.Consider current prices: Per dollar spent, you get 1.00 gm liposomal Vit C from LivOn Labs, and 11.35 gm UltraFine Quali-C from Andrew Vajda. That’s an eleven-fold difference. Thus, just to break even in price value, the LivOn product would have to deliver 11x more ascorbic acid into the cells than the UltraFine. I don’t think it does that.Update May 18, 2018When I wrote my review above, the price was $40/bottle. Even though the price has gone up to $45 a bottle now, I’m still just as high on this product as I was a year ago. That still is a very good deal. There’s a lot of Vit C in the bottle, and it lasts me quite a while. This is one of my most consistently used supplements, and it is extremely effective. I no longer have to take as much as at the beginning. Most days I take 1 tsp 1-2x per day (if more stress, then more C).Since I earlier said I always add Remag and Detoxadine in with my Ultrafine Vit C, I must mention I had to stop taking Remag (not sure why; perhaps I became sensitive to the sorbic acid in it?). So I now take mag powder from Bulk Supplements w my Vit C water, and that works well enough. Otherwise, there is nothing I would change in my initial review. The Ultrafine Quali-C is still one of my most highly recommended supplements, and I’m so thankful it continues to be available for a reasonable price.",
                "reviewVotes": "64 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KellyKelly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4SBEJSCJAWM7CRKJDBQF3O7RGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XCTQML44BGBZ?ASIN=B085KX3ZX9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 29, 2021",
                "reviewTitle": "5.0 out of 5 stars The BEST, highest quality pure ascorbic acid on the market!",
                "reviewText": "I am a biochemist and have been supplementing for years. I know a thing or two about what makes a good supplement and what makes a bad one. If you're reading this review, chances are you've already realized that most multivitamins are a complete waste of money, that higher than RDA doses of vitamin C can literally work miracles for the human body and that not all ascorbic acid is created equal.Vitamin C’s many roles in the body are so basic to healthy function that it is almost a wonder drug. It is a powerful antioxidant, anti-inflammatory, anti-viral and anti-cancer compound. Vitamin C is essential to help protect against the free radicals generated by fat cells. No matter what ails you, adequate amounts of vitamin C will help. Many incurable conditions have been remedied simply by providing the required C.Sadly, almost all Americans are deficient in vitamin C, which contributes significantly to our epidemic of chronic disease. Vitamin C has the ability to donate or accept electrons easily, thereby facilitating the flow of electricity in the body. Electron flow controls and regulates the bodies functions by promoting cell to cell communication. Disease happens when electron flow is impaired. Life ends when electron flow stops. Insufficient vitamin C impairs flow, which is why vitamin C deficiency is a significant contributor to disease. It is also why adequate C both prevents and reverses disease. When electron flow is optimized, health and vitality are optimized.That being said, it's a LOT harder to find high quality pure ascorbic acid crystals or powder that is not synthetic and NOT derived from corn!! After searching far and wide and trying many different brands, this is the one I have settled on for my own personal use and my family's and I have been extremely pleased with it. It dissolves and mixes better than any other I have tried.Dr. Thomas Levy who wrote; \"Curing the Incurable: Vitamin C, Infectious Disease and Toxins\" advises a minimum of 6,000 mg of C per day but usually more like 10,000-20,000 mg per day depending on the person. For acutely ill patients his recommendations go as high as 100,000 mg per day or more. A good rule of thumb is to start small and increase the dose until you find your own \"bowel tolerance\" or the point at which you begin to have softer or looser stools as a result. My personal tolerance (as a very healthy 39 y/o woman) is somewhere between 8,000-10,000 per day.Be aware that pure, un-encapsulated C in this form is VERY tart! I love to put it in smoothies with flavors that compliment it, like orange or raspberry extract with some monkfruit to make it like an orange julius. Just don't be shocked when you take it.See a side by side picture with this and another crystal form C I just finished using up. This is like powdered sugar and the other like granulated sugar in consistency. This kind mixes so much better!My only complaint about this specific brand is that while they included a scoop which I REALLY appreciate, the scoop handle is WAY too long for the container! I can barely get it back inside even when digging a significant hole for it. That's not a big deal though. You can always cut the handle or just use your own 1/4 tsp. I really couldn't be happier with the quality and sourcing of this powder and I use it multiple times per day every day! You won't be sorry if you buy this. It's really the best your money can get!I sincerely hope this review has been helpful to someone else! And yes, I pay full price for this. Feel free to ask my any questions!I haven't been sick in over two years taking my bowel tolerance daily.",
                "reviewVotes": "74 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/814k-fE8qXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/815lmL1+RWL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81Ox4NISjIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81ndjpBgPQL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "jacqulyn r.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIQ2W4CVGF4WFDARIFW47BLIGPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T91JKR594ELD?ASIN=B085KX3ZX9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing!!",
                "reviewText": "This product is beyond amazing!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Snowcat60",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJQW6K5HIESKIXX2FRNN2VSANJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UT51RIIS0VRL?ASIN=B085KX3ZX9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2020",
                "reviewTitle": "5.0 out of 5 stars Tart and tangy",
                "reviewText": "If your looking for a fast easy way to get in some serious quality vitamin C, then look no further. This stuff if fantastic!One tiny little scoop is 1000mgs of vitamin C. It’s gentle on the stomach and tastes great!I mix mine with MSM and warm distilled water for a nutritional boost daily. You literally can never have too much vitamin C in my opinion. Linus Pauling was on to something and you should be too.The power is extremely fine and mixes well with warm or cold water. This is nice for those who have problems swallowing pills. Best yet is it’s non GMO and not sourced from corn.Although pricey, it’s worth every cent and your body will thank you.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sheena Beana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTAXKNJY45WZ3NUITX7SI6LUXFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23BUGUKAA9VWL?ASIN=B085KX3ZX9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2019",
                "reviewTitle": "5.0 out of 5 stars Healthy body beautiful skin",
                "reviewText": "I don’t usually rate anything I purchase but this product is so amazing I had to rate it! I absolutely love the tart taste. I put it in my green tea and it dissolves right away! I decided to give it a test and see if it would dissolve inside a cold drink as well; and yes it did dissolve instantly when I added it to my lemonade. Now what really blew me away was when I woke up this morning and seen how my skin was glowing. Before I went to bed last night I added a tiny amount to my rose hip oil. I rubbed it over my entire face and I woke up this morning with the most beautiful glow! I will continue to use this product and update you all after a month of continuous use. I see a lot of people complaining about the price but you get soooo much Vitamin C for your money. I’m very happy with my purchase!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SHOP2MUCH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWNKF7QFHHGEIQQZ5H74MD5R3VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HHSK3GAZPRLM?ASIN=B085KX3ZX9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 30, 2023",
                "reviewTitle": "4.0 out of 5 stars EXPENSIVE!!",
                "reviewText": "I ordered for histamine, adrenal issue and general health. Good Vitamin C, not derived from corn but very expensive for the amount you receive in the jar.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}