{
    "remaining_requests": 3754,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Building-Toddlers-Educational-Preschool-Montessori/dp/B0CK7MJT3K",
    "body": {
        "name": "Stem Building Toy for Toddlers Tube Pipe Toy Educational Preschool Toys for 3+ Years Learning Building Blocks Toy with Storage Box Gift Kit Montessori Toys for Boys & Girls",
        "price": "$22.99$22.99",
        "originalPrice": "",
        "rawPrice": 22.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Building-Toddlers-Educational-Preschool-Montessori/dp/B0CK7MJT3K",
        "soldBy": {
            "sellerID": "A1PJ88GRXV449G",
            "name": "Straw Building Club--US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1PJ88GRXV449G&asin=B0CK7MJT3K&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 20% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51DNhMyp3GL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51jHXMlcJLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 MlYh1zCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EZlBQtsoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JY3q5WokL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51kok3tbniL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91gQPZ5zuAL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2f5453fa-92e2-46e2-aba6-6d210f966c08/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ggiibro Store",
            "link": "https://www.amazon.com/stores/StrawBuildingClub/page/EFA20B00-C1D3-4043-863E-8482C9F15E78?ref_=ast_bln"
        },
        "brand": "StrawBuildingClub",
        "merchantInfo": "Straw Building Club--US",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 30,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 11 hrs 36 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 20 hrs 6 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "STEM building toys: It's a Tube Sensory toys,assembled into various shapes through the connection of tubes,can be used to build shapes such as windmills, airplanes, cars,houses,animals,and so on. It can cultivate children's early counting, fine motor skills, and spatial thinking awareness.The Creative toys can effectively exercise children's imagination and creativity.",
            "Fun learning preschool toy kit: Kindergarten toys for ages 3+ early stage exercise 3D construction thinking, children use their hands to create a variety of imaginary shapes, stimulate imagination and hand-eye coordination skills. It can even be connected to the water pipe (slow flow rate) to present the fountain effect of the toy.",
            "Social play toys: 106 pieces of sufficient number, including straight pipe, turning pipe, cross pipe, wheel, enough number of children can share toys, is also a good parent-child toy. Don't even worry about the mess after use, the upgraded version comes with a high-quality storage box for storing toys.",
            "Great gift toys: 2023 upgraded version of the pipe toy, thicker pipe walls, more exquisite packaging, more quantity and colorful accessories. This toy would be a perfect gift for a boy or girl. Holiday toy gifts for kids, the first choice for Christmas toys.",
            "High quality interlocking building set: The use of high quality, non-toxic children's toy materials, through ASTM and CPSIA international inspection certification, the texture is perfect, its surface is smooth and does not harm the child's skin. It can be washed without discoloration or distortion."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6.6 x 4.6 x 10.75 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.43 pounds"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "ASIN",
                "value": "B0CK7MJT3K"
            },
            {
                "name": "Manufacturer recommended age",
                "value": "36 months - 10 years"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 30 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Manufacturer",
                "value": "HC-019"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "GGIIBRO brand in the latest development of the new product - the 2023 upgraded version of the tube toy, with more parts, thicker tube walls, smoother surface, the gift of a stronger storage box, it can build more shapes.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/65018599-db01-4c1f-91bf-31ee8b7e1d8f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Come and see, is there a lot of shapes that can be built? With six rotating wheels, it can even build a windmill. Cars, houses, dogs, rocket launchers, seesaws, etc., toys that tap the imagination of children, suitable for kindergarten toys. Great preschool toys.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c2f53fa-a987-4712-9f08-1525c36eb3d6.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Very simple construction method, only need to connect 2 accessories, with greater strength can be connected more closely. Six wheels that can turn, can change the shape. Yellow collocation is very bright toys. The connector can turn and change the Angle. Toys of high quality and good workmanship.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a0eb4c5e-150e-4828-b201-b13b246ee5a4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/50eef584-cd86-49e0-b334-508e4817a277.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b743ada-8614-4fea-a80e-3bc9f933f584.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "The 2023 upgraded version of the storage box, thicker and harder, not easy to break. Use it to tidy up the messy toys, let the children develop good living habits.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb5eb94f-16d2-458c-8224-35aa07d49a8d.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "The tube toy with beautiful storage box packaging, it will be a family toy for the holiday, the best Christmas gift. Let's do it. A gift for the child. Give it to him now.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7a51b21-a06f-40d7-bafa-692b924a3fbe.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8e7dd360-cc38-4a3e-84ce-fb1b6e7300aa.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/65018599-db01-4c1f-91bf-31ee8b7e1d8f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c2f53fa-a987-4712-9f08-1525c36eb3d6.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a0eb4c5e-150e-4828-b201-b13b246ee5a4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/50eef584-cd86-49e0-b334-508e4817a277.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b743ada-8614-4fea-a80e-3bc9f933f584.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb5eb94f-16d2-458c-8224-35aa07d49a8d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7a51b21-a06f-40d7-bafa-692b924a3fbe.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "KzooKzoo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ3WYLV4QN3B6UZZNGFJD6FVYYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R269GAJKIWBWJH?ASIN=B0CK7MJT3K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Something a Little Different, Lots of Fun",
                "reviewText": "The directions say \"Ages 3 and up.\" Which is fine, but I'm afraid that many grownups are going to think that means \"For Three Year Olds.\" And that would be a shame. I could see my older grandsons enjoying this just as much. Maybe not the 10 year old, who prefers more complex projects, but definitely the 8 year old. Maybe the label should read \"For ages 3 - 8.\"I opened the box which was roughly the size of a shoebox, to find it brim full of colorful pieces. The first thing I bet most preschoolers will do is to make a long, tall tower. They'll stack every piece possible just one-piece wide and as long as they can. Great! Encourage them. Can they make is as tall as they are? Sure! As tall is Grandma? Maybe as tall as the room? And that might be all the child wants to play with it on the first day.I like to shake the pieces out of their original container and put them in a large dishpan - preferably one with a lid. It was hard for me to dig through the toy bin it came in to find just the right piece I wanted without spilling other pieces on the floor. Putting the toys into a larger bin will make searching for the right piece much easier. On a side note, there are only just exactly enough pieces in the box for one child. If you have two or more children, buy an extra set. It's just not fun to play with a small set of blocks - it limits the child's imagination. I think it's better to have a really large collection of one or two types of building toys, than to have every kind of building toy imaginable but only in small numbers.I built a dune buggy out of the blocks looking at the idea book. There are three of the bigger wheels and three of the smaller wheels. If you get two sets, they'll all match up. With a single set, you have to put smaller wheels in front of any vehicle and larger wheels in the back. I think this is a mistake. There should be four small wheels, or four large wheels. Three wheels is just nonsense. But the idea book shows using the wheels more for decorations, for the tops of buildings and not just as wheels for a car.The blocks go together super easily, and they come apart easily too. That can be great for small hands, but it could be frustrating, too. My dune buggy came apart several times while making it. But eventually I got it together.These pipes could be a lot of fun, but I don't think they'll be the favorite toy in the box. They're fun for something different. I'd probably keep them out of reach and bring them out once in a while - so they're something interesting and new on rainy days or when the children seem especially fractious. I find that if I leave too many toys out, the children can't seem to make up their minds what they want to play, and they instead play the annoying game of \"let's dump all the pieces of all the toys out into a big pile and then scatter them around the house.\" So I only leave out as many toys as the child can easily pick up by himself in under an hour. More than that is too many.So, I give this STEM building toy for kids ages 3 - 8 five stars!And in case some of you don't know what STEM means, it's an acronym for Science, Technology, Engineering, Math. STEM toys are supposed to encourage children in those four areas. Any building toy is good for engineering, science, tech, etc. Building a tower that balances without toppling is engineering. Building a tower as tall as you are is math. Building a tower with balconies and buttresses builds on technology. Knowing what happens when you kick the tower down is science. It's all good. The child could build a tower out of straws and it's still a STEM toy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Bs7jnpu6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71apkpncxwL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "sjutton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBIDC6PDRIK2CXIETKUPRFUXEFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z0TDINPPZTVW?ASIN=B0CK7MJT3K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Bought as gift, great toy",
                "reviewText": "Bought this as a gift for a two year old boy. He loves it and it is very age-appropriate for that age and above (his older siblings play with it too). Great gift and toy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Concerned Ape",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF6I4XKHK5NKVTLWHUH7N2IOOMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD8MMMQJBZFYU?ASIN=B0CK7MJT3K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "4.0 out of 5 stars Fun stem blocks",
                "reviewText": "These are fun and remind me of the pipe game. They are great for 5-6 yrs old and are pretty easy to clean up. They are a tad small which makes me nervous about younger kids using them. Just keep on eye out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Girl Utah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIPJBAN7A55Q5DFFPZSR2UV3OKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN4JSO57WZNUS?ASIN=B0CK7MJT3K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars A perfect option that can truly grow with a child.. Kids LoVe!!",
                "reviewText": "This is the perfect toy that grows with a child.. for a young age, attractive and bright colors draw you in and ease of connectability making patterns and groups is perfect. As a little mind and cognitive ability continue- these are perfectly used to create objects or design abstract ideas.. The options are endless. This moves seamlessly into an ability to mix and incorporate with other types of play.. littles can create a city or make road for hot wheels… create a zoo out of these for tiny plastic animals etc. But, it doesn’t stop there!! This could be a set to help with a school science project as a child will be tasked with in the future- SEE, THIS SET GROWS WITH YOU!!!Set is a shoe box size filled tightly with a variety of so many parts and pieces- includes carry bag for use “on the go..” this makes it ideal for travel. I emptied set into a larger bin making it far easier to gain access and have a visual of choices.. it’s also far easier on cleanup- no need to Tetris fit back into box! (Simply store carry bag inside as well.. too perf!) this type storage will allow me to add more along the way.Solid option that could last thru child rearing years.. set is unisex and fun for boy/girls alike. Love more than x1 can play at a time and easy to keep clean. Solid robust pieces have longevity about them- A great addition to preschool or daycare. Make a fun gift for any.. Hoping info can help- stay safe everyone.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenda B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGMAAY2VAVSYQVL5MBLFM2WBY3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDPK7J4D1L78L?ASIN=B0CK7MJT3K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Great starter for little fingers",
                "reviewText": "These are a great size for little fingers, fit together easily and the colors are bright and attractive. Lots of building options!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAIDYHKGRPHFYSYW5LT33UIM4YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31HA9SGHDRJ40?ASIN=B0CK7MJT3K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars perfect stem toys",
                "reviewText": "The Stem Building Toy for Toddlers is an engaging and educational preschool toy designed for children aged 3 years and above. This learning building blocks toy fosters creativity and cognitive development as toddlers explore endless construction possibilities with tube and pipe pieces. The Montessori-inspired design encourages hands-on learning, enhancing fine motor skills and problem-solving abilities. The set comes with a convenient storage box, promoting organization and easy cleanup. This thoughtful gift kit provides a fun and interactive way for both boys and girls to explore STEM concepts through play, making it an excellent addition to early childhood education and development.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BizyOwnerBizyOwner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTXFAXKFP5DIFSMXBKNZTPH7Z6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FXN70EQLZPUS?ASIN=B0CK7MJT3K",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "3.0 out of 5 stars Not much versatility",
                "reviewText": "This review is for the \"Stem Building Toy for Toddlers Tube Pipe Toy Educational Preschool Toys for 3+ Years,\" currently selling for $25. I broke these out for the grandkids thinking it would provide hours of fun, but they tired of them in a matter of minutes. There are limited shapes making building options simple and limited. Nothing like the versatility of something like tinker toys. They are a good size for the little hands of toddlers, and they were immediately drawn to the colors, but the value just is not there. The two-year-old did have fun making a snake by putting them together in one long line after the other kids tired of them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7132RtHaWKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81+QBgysQ-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Zme0e3DDL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81e60xHAGHL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}