{
    "remaining_requests": 3696,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/PicassoTiles-Construction-Excavator-Bullsdozer-PTQ11/dp/B0CLLLWNCF",
    "body": {
        "name": "PicassoTiles Magnet Tile Building Block Set with 8 Construction Vehicles Crank Truck, Excavator, Bullsdozer, Road Roller, Concrete Mixer, Tractor, Dump Truck, & Forklift Magnetic Toy Kid Ages 3+ PTQ11",
        "price": "$39.99",
        "originalPrice": "",
        "rawPrice": 39.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/PicassoTiles-Construction-Excavator-Bullsdozer-PTQ11/dp/B0CLLLWNCF",
        "soldBy": {
            "sellerID": "A2D0OSBUL1MVAK",
            "name": "Picasso Toys",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2D0OSBUL1MVAK&asin=B0CLLLWNCF&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CSF8M9JG"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CP1TZ9H3",
                "variationName": "Style",
                "variationValue": "Aquarium",
                "price": "$29.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CLLLWNCF",
                "variationName": "Style",
                "variationValue": "Construction",
                "price": "$39.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CL6SKSV3",
                "variationName": "Style",
                "variationValue": "Dinosaur",
                "price": "$29.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CP1VXDZC",
                "variationName": "Style",
                "variationValue": "Farm",
                "price": "$39.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CP1TL8LP",
                "variationName": "Style",
                "variationValue": "Forest",
                "price": "$39.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CP1Q17W9",
                "variationName": "Style",
                "variationValue": "Metro",
                "price": "$29.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CL7HXR3W",
                "variationName": "Style",
                "variationValue": "Safari",
                "price": "$29.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CHVLRGB1",
                "variationName": "Style",
                "variationValue": "Store",
                "price": "$39.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51SFcwM14AL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51O9JNhVpNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KSsbpg6kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bxbGbQe-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51s3LcTjdqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yLFoqxdqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71uJ5VR4S L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4ae5d1a0-51ca-4fd5-a4d1-18de691f9ac2/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the PicassoTiles Store",
            "link": "https://www.amazon.com/stores/PicassoTiles/page/5DA64870-F2C0-453D-B6DD-F697890B60A6?ref_=ast_bln"
        },
        "brand": "PicassoTiles",
        "merchantInfo": "Picasso Toys",
        "customerReview": "4.9 out of 5 stars",
        "customerReviewCount": 97,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22",
            "Or fastest delivery Tuesday, February 20. Order within 20 hrs 29 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "UNIVERSAL COMPATIBILITY: This magnetic tile construction building toy playset provides versatility as the magnetic building tiles effortlessly blend with other magnet tile structural playsets, which allows you to dream big and build big! Our magnetic character action figures are designed to connect seamlessly with other magnetic tile toys. Create unforgettable storytelling adventures with our toy set and let your imagination run wild!",
            "DREAM BIG & BUILD BIG: Our 45-piece magnet tile set includes 17 square pieces with construction designs, 5 triangular builder-themed units, 2 colored triangles, 4 rectangular motif slabs, 2 clear squares, 7 colored square parts, and 8 construction vehicle machinery character action figures, in addition to the printed theme. Snap these magnetic parts together to create and craft stories through your masterpieces. Unleash unparalleled storytelling adventures! Character action figures are compatible with other magnet building tile playsets.",
            "LEARNING BY PLAYING: Our magnet building block toy set not only delivers hours of fun but also fuels STEAM education. As kids connect and experiment with these magnetic tiles, they'll naturally enhance their fine motor skills, bilateral coordination, cognitive abilities, and ignite their creativity. Whether for preschool educational purposes or at-home play, this kit promises an exhilarating playtime that nurtures young minds.",
            "PERFECT FOR GIFTING: This play set is the ideal present for aspiring builders aged 3 and above. Its vibrant and engaging design makes it a standout gift choice for any occasion. It's not just a toy; it's a gateway to unleashing a child's creativity while nurturing their fascination with construction and building. Whether it's a birthday, holiday, or a special celebration, this toyset combines the joy of fun with the opportunity for young minds to explore and express themselves.",
            "BPA-FREE & NON-TOXIC: We place safety above all else. Our PicassoTile toy sets are BPA-free and non-toxic, creating a safe environment for your child's playtime. Every magnet tile is thoughtfully shaped with smooth edges, enhancing the protective shield against any accidental cuts or bumps. With us, you're not only guaranteeing enjoyable amusement, but also embracing the peace of mind that comes from knowing your little one’s exploration is shielded from harmful elements."
        ],
        "description": "PicassoTiles Magnet Tile Building Block Set with 8 Construction Vehicles Crank Truck, Excavator, Bullsdozer, Road Roller, Concrete Mixer, Tractor, Dump Truck, & Forklift Magnetic Toy Kid Ages 3+ PTQ11",
        "breadCrumbs": [
            {
                "name": "Toys & Games",
                "link": "https://www.amazon.com/toys/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165793011"
            },
            {
                "name": "Building Toys",
                "link": "https://www.amazon.com/kids-construction-blocks-models-building-sets/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166092011"
            },
            {
                "name": "Magnetic Building",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=23462539011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "13 x 10 x 2 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.86 pounds"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "ASIN",
                "value": "B0CLLLWNCF"
            },
            {
                "name": "Item model number",
                "value": "PTQ11"
            },
            {
                "name": "Manufacturer recommended age",
                "value": "3 years and up"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,946 in Toys & Games (See Top 100 in Toys & Games) #75 in Toy Magnetic Building Sets"
            },
            {
                "name": "Customer Reviews",
                "value": "4.9 4.9 out of 5 stars 97 ratings 4.9 out of 5 stars"
            },
            {
                "name": "Manufacturer",
                "value": "PicassoTiles"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "debra L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3DXFP6TQIG2UKDRI3Z5FBKOK2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R281PYYE90Q6VF?ASIN=B0CLLLWNCF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Made beautiful",
                "reviewText": "This is the third set I have purchased for my three-year-old grandson. He loves them and they’re very easy to use and are flat so easy to store. I like these so much better than other blocks.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Meg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMHGJU7NWLY6KC5LFZ5C2QQLXOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXE66UND803PT?ASIN=B0CLLLWNCF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect",
                "reviewText": "These are great add on to our collection",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Morgan Gregory",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDKGHQOKRVSAUGO7EAVLXVWUBTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12ZOMLKGDIPTS?ASIN=B0CLLLWNCF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Woo",
                "reviewText": "Our son LOVES it!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dustin Aunkst",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4ETIVRFDY6IJCNL43TX5TMBPMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2P06HEFTGLYCO?ASIN=B0CLLLWNCF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Entertained for HOURS!",
                "reviewText": "My kids (ages 5 and 3) first discovered magnet tiles at our local library and became obsessed and quite talented at building different structures. They would come home and talk about these tiles for days afterwards. Santa gifted the kids' their first set this past Christmas and it immediately was a one of the top toys that got played with the most, and still is. The one problem is that that set came with 100 which you think at the time would be enough but not for two kids that don't really like to share or I would find that they would run out of tiles in the middle of building something. I have been tossing around the idea of adding more into their collection but just didn't know what brand I wanted to get since there are so many.Then I stumbled upon this set. Holy cow was I impressed all the way around the border. Not only is it an unique concept with the \"Toy store\" scene but the price point was where my family was needing it to be. Some sets can cost over $100. These arrived in a durable, thick box and was easy to open. When we opened it up the first thing that caught my eye was how bright and vibrant the colors were. These were all decorated so cute and very well detailed. It came with a laminated floor that you lay down before you start to build on it to give it the whole store aesthetic. Then it came with an open fold guide to multiple different scenes that you can build within the set. They were labeled with beginner, advanced, then they would show what the left, right, front and back views should look like. That guide was very helpful will building up our store. We all were so pleased and excited after it was assembled. Yes, i said we, because even these adults will find fun and mildly addicting.The one thing that I was hopeful for but hadn't had the opportunity to test out yet, was if the different brands would all be \"universal\" and be compatible with one another. We currently only have two brands that I can report on but I am happy to say that they are compatible and you can't tell a difference and are just as strong as the other. That makes this all that much better knowing that you can add to your collection as you please, growing it as big as your heart desires. I know we will be adding to ours. I without a moments hesitation would recommend this to all the magnet tile lovers!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gailgail",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBSCKAXQ5TMC4ESQUFNC5MUT7XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D44LACWXUF6U?ASIN=B0CLLLWNCF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars This Toy Store is unbelievably awesome!!!",
                "reviewText": "If you have a kid that loves magnetic tiles, this would be an awesome addition to any set they have. This is made as a stand alone set, and is compatible to all my other many, many sets we own from different companies.I got this out and started to set it up for my review. There is a picture direction sheet and a fold out paper base layer to build your creation on top of. There were so many different options shown of what you could build that I could hardly choose! We have a 5 year old and 2 year old grandkids that LOVE magnetic tiles and this will absolutely provide hours of building fun. It can be as simple or as complex as they would like and they can build with just this set or they can mix it with the plain tiles that we own.I can hardly begin to explain how amazing this set is. It is not only the inside of the TOY STORE but also the outside of the toy store. You can move things around, you can angle the pieces so it is like the inside of a doll house (just explaining it so you can picture this in your mind…. No actual doll house pieces).Honestly, I love toys and I knew I could be here for hours building with this. It would be so great not only for kids to play with by themselves , but would make a wonderful building time with a parent or grandparent. I am not sure if our 2 and 5 year olds could play with this together as the 5 year old would have a definite idea in mind of how to proceed.I would highly, highly recommend this set and could kick myself for not purchasing other sets similar to this when I had a chance to review them. I thought that since we had so many plain tiles of different shapes that we didnt really need something like this. Oh, I was so wrong!! You can be sure that I will be looking for more sets that are similar to this one. Just put it in your cart and accept the praise you deserve when your kiddo opens this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7188qO0qZtL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71kMy58sXuL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "KzooKzoo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ3WYLV4QN3B6UZZNGFJD6FVYYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R196RIIM1SABAM?ASIN=B0CLLLWNCF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Cutest Tile Set Yet!",
                "reviewText": "I absolutely love the magnetic tile toys! They are the coolest thing! I wish they'd been around when I was a kid, but they aren't that old. There are a lot of different companies now that make magnetic tile toys and they are all pretty similar. So they are all pretty cool! But this set is unique for a few reasons.I really love the construction theme in this set of magnetic tiles. Young children, ages 3 - 5, are often very interested in construction machinery. I'm not sure why. Maybe because they are so big? Maybe because they are painted bright yellow? Or because they make a lot of noise? I don't know if anyone has ever answered that question, but construction toys have been popular with this age group for nearly as long as there have been toys.I'm throwing a construction themed birthday party for my three-turning-four year old grandson next month. Guess what magnetic tile set he'll be receiving? That's right! Picasso Tiles construction set with 8 vehicles. A popular toy with a popular theme - it's a win/win!I should point out that the wheels don't actually turn on these \"vehicles.\" They are pictures of vehicles painted on a tile. But I don't think the kids care. I'll let you know for sure after my grandson opens his gift. I do like that the tile sets usually come with an idea booklet on various projects they can try. While it's great for kids to make up their own ideas, copying someone else's design can also be useful. Being able to copy a design takes concentration, the ability to pay attention to detail, recognizing patterns, and more. Following a design helps the child realize what the tiles are capable of, and it inspires their natural creativity to copy that and go beyond.I give this PicassoTiles Construction Set with Vehicles five big stars!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71t04QWoiaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71uPj7Ofh8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rama Martin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMN6C7AXIGFQLKLPODXICKY2UDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NXG5OWJHK1GF?ASIN=B0CLLLWNCF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Magnetic tiles",
                "reviewText": "The kids love these... all the picasso tiles are most played with items in our home right now",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2024",
                "reviewTitle": "Awesome",
                "reviewText": "a super addition to picasso world of magnets ---they love it - spend hours playing with it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$41.99",
                "sellerName": "Picasso Toys",
                "sellerRating": "5"
            }
        ]
    }
}