{
    "remaining_requests": 14017,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Amazon-Essentials-Cotton-Brief-XX-Large/dp/B09GPXDV4R",
    "body": {
        "name": "Amazon Essentials Men's Tag-Free Cotton Briefs, Pack of 7",
        "price": "$18.30 - $21.80",
        "originalPrice": "",
        "rawPrice": 18.3,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Amazon-Essentials-Mens-Cotton-Brief/dp/B09H3H8M1H",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B09H3H8M1H"
        ],
        "asinVariationValues": [
            {
                "asin": "B06XW4364Y",
                "variationName": "Color",
                "variationValue": "Black/Charcoal/Grey Heather",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31fEEax9QmL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B06XWNL3MB",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31EXkMkX-yS._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09GPZN2BM",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/311ONFLeeYL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09GQ1M8JZ",
                "variationName": "Color",
                "variationValue": "Black/Blue/Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41GXrg2YEoL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09GPT6YWK",
                "variationName": "Color",
                "variationValue": "White/Grey/Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Nz1GUt+-L._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09GPZN2BM",
                "variationName": "Size",
                "variationValue": "X-Small",
                "variationImageURL": null
            },
            {
                "asin": "B09GPX9BQY",
                "variationName": "Size",
                "variationValue": "Small",
                "variationImageURL": null
            },
            {
                "asin": "B09GPVQSPF",
                "variationName": "Size",
                "variationValue": "Medium",
                "variationImageURL": null
            },
            {
                "asin": "B09GQ8SYQP",
                "variationName": "Size",
                "variationValue": "Large",
                "variationImageURL": null
            },
            {
                "asin": "B09GQ22R95",
                "variationName": "Size",
                "variationValue": "X-Large",
                "variationImageURL": null
            },
            {
                "asin": "B09GPXDV4R",
                "variationName": "Size",
                "variationValue": "XX-Large",
                "variationImageURL": null
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/311ONFLeeYL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41UCKzQN0FL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31hGcCmuVgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31YVsJgWaQL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Essentials Store",
            "link": "https://www.amazon.com/stores/AmazonEssentials/page/F8FB6F3C-F896-455C-BC52-7879F4CEF0CF?ref_=ast_bln"
        },
        "brand": "AmazonEssentials",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 16172,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fabric type 100% Cotton",
            "Care instructions Machine Wash",
            "Origin Imported",
            "Bottom style Briefs",
            "Soft, lightweight, breathable ribbed knit",
            "Tag-free",
            "An Amazon brand"
        ],
        "description": "We listen to customer feedback and fine-tune every detail to ensure our clothes are more comfortable, higher quality, and longer lasting—at affordable prices for the whole family.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Men",
                "link": "https://www.amazon.com/Mens-Fashion/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7147441011"
            },
            {
                "name": "Clothing",
                "link": "https://www.amazon.com/Men-Clothing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1040658"
            },
            {
                "name": "Underwear",
                "link": "https://www.amazon.com/Mens-Underwear/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1045706"
            },
            {
                "name": "Briefs",
                "link": "https://www.amazon.com/Mens-Briefs/b/ref=dp_bc_aui_C_5?ie=UTF8&node=1045712"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 16.81 x 8.23 x 2.13 inches; 13.44 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ S17AE80003"
            },
            {
                "name": "Department ‏",
                "value": "‎ mens"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ July 27, 2020"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Amazon Essentials"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B06XW4364Y"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#697 in Our Brands (See Top 100 in Our Brands) #5 in Men's Underwear Briefs"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 16,172 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JP",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMQT2H4UYQNTVIL74QXHZCPY2UA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GMJFXGIT8ZAD?ASIN=B09H3H8M1H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2017",
                "reviewTitle": "5.0 out of 5 stars Best basic underwear out there...and a bargain too",
                "reviewText": "I thought I'd share my search for the best underwear on Amazon. To help you judge things I'm 6 feet tall, 190lbs, with a 40\" waist. I'm 55 years old but still in somewhat good shape, probably 10lbs overweight.My previous underwear of choice was Dockers but they are no longer made. I loved the Docker's durability, fit, and comfort but nothing lasts forever (thin saggy big name undies are not even under consideration).I've always been a tidy-whitey guy but I thought I'd try to up my game and see if I couldn't find something that was both comfortable and sexier, so I tried to be open minded.My criteria:- Need to be comfortable to wear all day at my desk at work and walking around the office- Need to breath so things everything stays cool and dry- Need to provide comfortable support- Ideally something more sexy- Ideally reasonable cost (I've spent $30 for Patagonia underwear that is great and I use when backpacking or on extended trips but a bit pricey for everyday)There are a LOT of choices, it's overwhelming really. Different styles, materials, etc. I already knew I didn't like boxers (no support) and boxer briefs (ride up and uncomfortable). I just ordered some of everything else and returned most of it.Note that in general when it comes to anything more modern and sexy a 40\" waist puts you in XL territory which is the top range of most offerings so I just barely made the cut--obviously the target market is young & fit men.The good news is I did find several comfortable, surprisingly affordable choices, and sexy ones too (according to my girlfriend). To summarize here are the keepers: David Archy Briefs (MicroModel, $6/pair) https://www.amazon.com/gp/product/B071WNC5L6/ref=oh_aui_detailpage_o07_s01?ie=UTF8&psc=1 Sexy, modern, and comfortable Amazon Essentials Briefs (Cotton, $2.50/pair) https://www.amazon.com/dp/B06XWLNK5F/ref=cm_cr_ryp_prd_ttl_sol_4 Comfortable and inexpensive basic underwear, colored versions available Layer8 Mid-Rise Briefs (Polyester/Spandex, $4/pair) Comfortable & sexy but does not breath as well as the aboveHere are the full reviews of all the ones I tried (many were called but few chosen):Thongs/Bikini-------------==== MASS21 (MicroModel, $6/pair)https://www.amazon.com/gp/product/B0721QFF6G/ref=oh_aui_detailpage_o07_s02?ie=UTF8&psc=1Technically sold as swimwear but I thought I would try in the spirit of being opened minded. I thought I would hate them but they were actually quite comfortable and I wondered if I would grow to like them once I got used to the low-rise and butt floss. Your junk is basically in a pouch be well supported.To be honest I love a woman in a thong but didn't see it as doing much for me (perhaps milage would vary with different ass?) especially as my hair stuck our around the pouch...not sure I was up to manscaping to that extent. I was sure my girlfriend would like, and was surprised when she was unenthused. Without her being turned on it wasn't really compelling for me so back they went.==== YKC Bikini Bulge (Nylon/Spandex, $5/pair)https://www.amazon.com/gp/product/B071LLS3BP/ref=oh_aui_detailpage_o07_s05?ie=UTF8&psc=1A strange one: essentially a pouch in front but full coverage on the but with nothing on the sides. A thought it looked more manly than the thong but wondered if after repeated washings it wouldn't end up in my butt crack (in that case I think a thong would be better).Again, my girlfriend was cool on them so back they went.Low/Mid-Rise Briefs-------------------==== Layer 8 (Polyester/Spandex, $4/pair)https://www.amazon.com/gp/product/B075DJLF9D/ref=oh_aui_detailpage_o07_s00?ie=UTF8&psc=1These are a sexier version of a traditional brief but mid-rise so I didn't notice it as much as low-rise briefs (which take some adjustment period). The material felt great but the first time I wore it it obvious did not breath as well as cotton but not nearly as bad as previous polyester underwear I wore (and threw out because things got so swampy)...after a washing things improved quite a bit...acceptable if you are not active but not a choice for a hike IMPO.Washing direction mean I'll need to wash separately as a delicate but that is okay.My girlfriend thought they looked nice and I kept them...probably more for longing around the house than a full day at the office or working in the yard. I will wear these but may not order more right away.==== 2(X)LIST Brief (Cotton, $15/pair)https://www.amazon.com/gp/product/B00LO0GJC8/ref=oh_aui_detailpage_o07_s02?ie=UTF8&psc=1Looked sexy-ish and pima cotton felt nice and fit well out of the package but I thought \"these are not going to fit after they shrink in the wash\". Not as comfortable as the best on my list. Not worth the money IMO...back they go.==== Lacoste (Cotton/Model, $17/pair)https://www.amazon.com/gp/product/B01M7RZ3WE/ref=oh_aui_detailpage_o07_s02?ie=UTF8&psc=1Very well made feel and nice pima cotton. The only brand that fit me a bit baggy around the legs, perhaps it would get better after shrinking in wash but with better valued options why bother...back they go.==== UnderGents (MicroModel, $13/pair)https://www.amazon.com/gp/product/B0741GWV85/ref=oh_aui_detailpage_o07_s04?ie=UTF8&psc=1Very high bikini cut in front that I did not like as it exposed lots of hair. Material very smooth but I wasn't convinced it would hold up as it was quite thin. Didn't like them especially for the price, so back they go.==== Emporio Armani (Micro Modal, $22/pair)https://www.amazon.com/gp/product/B007ZYJQ2M/ref=oh_aui_detailpage_o07_s05?ie=UTF8&psc=1Very nice material and fit. Low-rise and sexy. I think I might have keep these except that the cost is crazy and they are not that much nicer than cheaper options--also at this price point I would consider technical underwear from Patagonia. Just too expensive for what you get, so returned.==== Calvin Klein (Cotton, $7/pair)https://www.amazon.com/gp/product/B00JQRSGWW/ref=oh_aui_detailpage_o09_s00?ie=UTF8&psc=1Even the largest size is too small, returned. Better choices on this list.Full-Briefs, think Fruit-of-the-Loom (Cotton, $2.50/pair)---------------------------------------------------------==== Amazon Essentialshttps://www.amazon.com/dp/B06XWLNK5F/ref=cm_cr_ryp_prd_ttl_sol_4Amazon has a major winner here in my opinion. These are the closest replacement for my old Dockers if being sexy is not an issue...in fact I think they are better than the Dockers and what a bargain!My girlfriend initially like the colored one, then after seeing some of the other underwear though she did not like the super-full coverage.These I keep and will order more...perfect for office or working in the yard. Workhorse underwear but other choices are also comfortable and sexier.==== David Archy Pouch Brief (MicroModel, $6/pair)https://www.amazon.com/gp/product/B071WNC5L6/ref=oh_aui_detailpage_o07_s01?ie=UTF8&psc=1Very comfortable with an innovative 2 pouch system (they include directions on how to wear lol). Very breathable. Washing direction mean I'll need to wash separately as a delicate but that is okay.These are good everyday sexy underwear for men at a reasonable price...I could see only having these in my drawer. Plan to order more.Mini-Boxer Briefs-----------------==== Kronis (Cotton, $10)I thought these looked great on me, low rise, manly, and sexy...but the mini leg part rides up and is uncomfortable.If I'm feeling sexy I might wear these with my girlfriend but not for a day at the office.I vacillated between keeping and returning these but in the end I decided why not have in my drawer to wear now and then. I don't intend to order more right away.",
                "reviewVotes": "97 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PB2008",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBJ6SCP6DY54M7OPVN7F6S5EJHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OCGHO93SSD11?ASIN=B09H3H8M1H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2020",
                "reviewTitle": "5.0 out of 5 stars Outstanding Quality. Great Fit and Support. I Explain the Size Chart.",
                "reviewText": "Updated review:I still think very highly of these briefs. Some further insights: Amazon sent the wrong size. I ordered Large. A prominent label on the package said Large. But the small print on the package and the product's tagless label say Medium. The briefs shrank very slightly after washing - maybe 0.5 inch (1.3 cm). That made them a bit tight on my 38 inch waist. I looked at the garment and package more closely and realized they are size Medium. So I returned them - yes - you can return them. Please wash them first!I am now evaluating the Large and XL to see which fits me best. These briefs are really well designed. They are the widest I've found in the crotch and they have plenty of room to provide comfortable support in the crotch.SIZE CHART EXPLAINER: It is telling you the unstretched waist size of the garment. For Extra Large it says 34\". If you lay the garment flat on a table and measure the width of the garment it is 17\". Double that to get the total width of the garment - 34 inches. The fabric stretches! So XL will fit a person with a 38\" waist with a small amount of fabric stretching. I find this gives very comfortable fit and very good support in the crotch. If you prefer more stretch to give a tighter / snugger fit AND SUPPORT then consider the Large (31\" in the Size Chart). The Medium (28\" in Size Chart) will also fit a 38\" waist but a bit too tightly at least for my preference.I highly recommend these briefs.If this review is helpful please give it a vote to let me know.Original review without edits:These are excellent briefs. The fact they are reasonably priced is just a great added plus. Completely ignore the Size Chart and order your regular size.I have a 38 inch waist. According to the size chart I would need a XXXL that does not exist. I ordered my normal size Large. It fits well.The fabric stretches some when putting it on and the fit is comfortably snug. The garment width at the narrowest point in the crotch is slightly more than 5 inches, which is a lot more than other brands I tried. This give a very comfortable \"pouch\" and great support. I suppose IF it shrinks a lot with wearing it might become too tight; if that happens I will update this review.I have heard from others that if one needs to wear an incontinence pad it works very well with these briefs. Not surprising.The fabric is soft and comfortable. The brief sits at the natural waist. I suppose if you prefer a looser fit or less support then order one size larger than you typically need.Very highly recommended.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric Law",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZNFW4NEC4MVJTRYWYRWBJMWP7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26H6AFZ0PCBST?ASIN=B09H3H8M1H",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2023",
                "reviewTitle": "4.0 out of 5 stars Fits As Expected...After Some Wear",
                "reviewText": "In search of new underwear I happened upon these Amazon Essentials Men's Tag-Free Cotton Briefs. I've always been a guy who wears only white underwear. I decided to venture out on the wild side and bring a little color into the mix. These Amazon Essentials Men's Tag-Free Cotton Briefs piqued my interest.As I read reviews, one common theme was the underwear has a smaller fit. In the normal brands I buy, I wear a large. I decided to go with XL based on the reviews. One hesitation I had was due to a reviewer that mentioned the underwear go all the way up to the bellybutton. I definitely did not want that! Since I only saw one person mention this, I proceeded with the order.My order arrived on-time and was well packaged. Though I sized up, I still found the initial fit to be tighter. It was not so tight that it was uncomfortable. On the positive end, the underwear did not come up to my belly button. They hit below my belly button, around my hips, as I hoped they would.After one wearing and wash, the underwear loosed up slightly. This has helped with the fit.Overall, I gave the overall rating 4 because they are at least one size off, but could be two sizes off for some people. I would like to order the set with the red ones. When I do, I plan to order them in a 2XL, which would be two sizes up from my normal size. I don't think I'll need to worry about them being too big, but I'd like to compare the 2XL to the XL to see which one offers me the best fit. The underwear are a quality product, they're soft, and look great. The colors are exciting! I would buy again, and I do recommend.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Timmy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 2, 2024",
                "reviewTitle": "Thumbs up",
                "reviewText": "Good value ,good product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Héctor Jonas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 20, 2023",
                "reviewTitle": "Excelente producto",
                "reviewText": "Muy buena relacion precio calidad, cómodos y justo a la medida.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Oscar J Zamora Sanchez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 27, 2021",
                "reviewTitle": "Muy cómodo",
                "reviewText": "Están hecho de material de buena calidad Son cómodos y frescos al usarse",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BRIBRI",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 23, 2023",
                "reviewTitle": "SLIPS",
                "reviewText": "PRODUIT DE BONNE QUALITE",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 18, 2023",
                "reviewTitle": "Top !",
                "reviewText": "Zu diesem Preis eine Sensation. Und auch unabhängig vom Preis einfach sehr gute Unterhosen. Guter Tragekomfort, nicht zu eng oder zu weit, nicht zu grob oder zu weich. Nach dreimal Waschen kein Nachlassen in Sachen Halt. Zwei oder drei Nutzer schrieben in ihren Rezensionen, dass man mit der Größe aufpassen muss. Ich für meinen Fall kann das nicht bestätigen. Bei mir mit meinen 78 kg bei 177 cm Körpergröße sitzt Göße L prima. Aus Erfahrung (bis vor sieben Monaten wog ich noch um die 95 kg und hatte immer L) kann ich behaupten, dass mir die Teile auch mit 90 kg noch gut passen würden. Darüber hinaus könnte es dann zwar eng werden, doch würden sie wahrscheinlich ohne zu große unangenehme Spannung noch tragbar sein. Ich habe den starken Verdacht, dass die Teile auch nach mehr als einem Jahr noch guten Halt haben und ich meine Wertung nicht korrigieren muss. Klar, Gewissheit kommt erst später. Erstmal: Rundum Top alles !",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}