{
    "remaining_requests": 14003,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hanes-Womens-Period-Protection-Assorted/dp/B094NYV5B1",
    "body": {
        "name": "Hanes Women's Comfort, Period. Moderate Leaks Period Underwear, Moderate Protection, 3-Pack (Colors May Vary)",
        "price": "$15.97",
        "originalPrice": "",
        "rawPrice": 15.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hanes-Boyshorts-Underwear-Moderate-Protection/dp/B0CKLWR6B8",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B0CKLWR6B8"
        ],
        "asinVariationValues": [
            {
                "asin": "B094NZQ37S",
                "variationName": "Color",
                "variationValue": "Bikini, Neutrals",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/415HfG4jKKL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09VH6K21Y",
                "variationName": "Color",
                "variationValue": "Boyshort, Neutrals",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31OKLlMc6gL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B094NY7Q47",
                "variationName": "Color",
                "variationValue": "Brief, Neutrals",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41aWGNC4J-L._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B094NZQ37S",
                "variationName": "Size",
                "variationValue": "5",
                "variationImageURL": null
            },
            {
                "asin": "B094NY7Q47",
                "variationName": "Size",
                "variationValue": "6",
                "variationImageURL": null
            },
            {
                "asin": "B094NX1NKW",
                "variationName": "Size",
                "variationValue": "7",
                "variationImageURL": null
            },
            {
                "asin": "B094NZ632T",
                "variationName": "Size",
                "variationValue": "8",
                "variationImageURL": null
            },
            {
                "asin": "B094NY8YGM",
                "variationName": "Size",
                "variationValue": "9",
                "variationImageURL": null
            },
            {
                "asin": "B094NYV5B1",
                "variationName": "Size",
                "variationValue": "10",
                "variationImageURL": null
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41aWGNC4J-L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41PFY-ar5kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aZrKLTWgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41as6wL6FaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xHodA9qFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51B-WNdzCYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51tXqwTUgGL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/87e59bee-9309-4849-93a0-d696e16018ca/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Hanes Store",
            "link": "https://www.amazon.com/stores/Hanes/page/F83022EC-A709-4B2F-BCB7-7BBFA1896AB0?ref_=ast_bln"
        },
        "brand": "Hanes",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 2071,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fabric type 58% Cotton, 37% Polyester, 5% Spandex",
            "Care instructions Machine Wash",
            "Origin Imported",
            "NO LEAKS, NO ODOR, NO STAINS, NO WORRY - Ideal for period or maternity underwear, their built-in absorbent liner means you no longer have to dread bladder leaks or bleed-through while laughing, sneezing, or coughing, on light-to-medium period days - or any days.",
            "COOL COMFORT, ALL DAY LONG - Moisture-wicking cotton-rich fabric feels great against your skin, keeping you cool and dry.",
            "THREE-WAY PROTECTION - These period undies have odor-protection, leak protection, and stain protection via an absorbency liner with odor-guard and stain-block technology.",
            "SEXY BIKINI SILHOUETTE - A modern bikini silo with a low-rise waist and moderate-coverage back for period protection without bulk.",
            "WASH AND WEAR, OVER AND OVER - These moderate-protection period bikinis will last and last, just like any underwear.",
            "EXTRA BACKUP'S ON THE WAY - Whether you need extra leak protection with your pad or tampon or are looking for postpartum underwear, our tagless period underwear for women and teens has you covered."
        ],
        "description": "Here's liberation from worrying about leaks, odors, or stains on period days - or any days - with Hanes®' COMFORT, PERIOD.™ period underwear briefs. A classic brief silhouette, this period underwear offers moderate leak protection on period days as well as life's other \"oops\" moments, from sneezing to laughing to coughing to exercising. Whether you need extra leak protection with your pad or tampon or are looking for postpartum underwear, our tagless period underwear for women and teens has you covered. They have been thoughtfully designed by the experts at Hanes® with an absorbent, stain-guard liner that holds liquid, prevents show through, and neutralizes odors. And, just like regular underwear, you can toss these menstrual panties in the washer and wear them over and over. These soft cotton-blend briefs feature a higher rise and excellent seat coverage for a smooth, bulk-free look under clothes. The moisture-wicking fabric is stretchy, comfortable, and so comfortable you'll forget how superbly these period panties perform. To top it off, they're tagless for itch-free comfort. Hanes® period briefs have become customer favorites, eliminating worry about embarrassing leaks, on period days or any days.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Women",
                "link": "https://www.amazon.com/Womens-Fashion/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7147440011"
            },
            {
                "name": "Clothing",
                "link": "https://www.amazon.com/Womens-Clothing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1040660"
            },
            {
                "name": "Lingerie, Sleep & Lounge",
                "link": "https://www.amazon.com/Lingerie-Sleepwear-and-Loungewear/b/ref=dp_bc_aui_C_4?ie=UTF8&node=9522931011"
            },
            {
                "name": "Lingerie",
                "link": "https://www.amazon.com/Lingerie/b/ref=dp_bc_aui_C_5?ie=UTF8&node=14333511"
            },
            {
                "name": "Panties",
                "link": "https://www.amazon.com/Womens-Panties/b/ref=dp_bc_aui_C_6?ie=UTF8&node=1044958"
            },
            {
                "name": "Briefs",
                "link": "https://www.amazon.com/Womens-Briefs/b/ref=dp_bc_aui_C_7?ie=UTF8&node=1044972"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 13 x 8 x 1 inches; 7.02 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ FD42AS"
            },
            {
                "name": "Department ‏",
                "value": "‎ womens"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ May 11, 2021"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Hanes"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B094NZQ37S"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#30,712 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #100 in Women's Bikini Panties"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 2,071 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/25fc307d-6598-4b5d-8dac-94e47f703c72.__CR0,0,2196,900_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cbddd39b-de78-46e3-8f1e-5f84d2b51088.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2738f017-fbdb-499c-99f5-2f9aa936ff3c.__CR0,0,2196,900_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fd9d0e26-311e-4e3b-803a-d6a0267be5e6.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f735601f-23e6-4cbe-be61-232156bcaa1c.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b3f57a1d-5025-4bc6-8303-1d5f3258a498.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/01356c82-9346-43ca-8e00-4f83e2805fff.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jake or Katie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEE62KT36QTPO777223AGFGRIYWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV47RG9HRTKA?ASIN=B0CKLWR6B8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing for all women",
                "reviewText": "First off this is from a mother’s POV so keepthat in mind that has a teenage girl.My daughter is tall, lean and small bone framed- and naturally awkward- so with her 5’6” almost 5’7” which is taller than me- it can be quite hard to figure out what works. Also I brought this one on desperation- we ordered it while at a convention because we did not have pads. It was over night delivery so we had it ready to go.Then we have sensory issues- things need to be soft, flowy, easy to clean. This I feel is human nature at this point- anything that touches our skins has to feel comfortable (but being comfortable is in the eye of the beholder).This product is in fact underwear. The sewn in- that is right- sewn in pad is the thickest part of the underwear but my daughter says it still feels like underwear- no extra bunching or embarrassing crunching sound when moving around.I have assured her that the outside world does not “hear her pad” but she swears they do. Confirmed with my parent- I said the same thing at her age. So maybe it is a thing.She can wear it all day- even doing her sports, waiting in lines and games with no leaks. She also sometimes has incontinence accidents as well- she thought it was just her period and well… it wasn’t. Again- she is a young woman figuring out her body and knowing different feelings and sensations. Completely normal but embarrassing.She would have accidents on a regular basis around her period since it was hard to figure out what was happening. Luckily she felt very comfortable with the school nurse and she was able to keep a spare of her clothes in her office.Now a few years have passed and my daughter was wearing pads for about half the month because she didn’t know when it would begin- again it is normal. She also didn’t want her dad to see blood or pee on her panties when he did laundry.My husband didn’t care- he knew she was having trouble and it’s normal and joked with saying I rather see monthly blood than a positive pregnancy test. *yeah he is that type of dad.My daughter can also wear them even when she is not on her period since they are just that comfortable and gives her a sense of security.Cost effective- we can buy these panties, wash them (more on that in a bit) and re use them.Eco friendly- since there are no pads, no paper waste. Since she does not feel comfortable wearing menstrual cups- this is a great alternative.Travel friendly- just place the dirty panties with the other dirty clothes and it’s fine. No smell, leakage (if wearing the right absorbent coverage) and it just looks like regular panties so for TSA searches- it isn’t embarrassing for a shy woman to have it in her carry on bag (as you know- always carry at least one outfit- underwear and socks included- in case there is delay or lost checked luggage).Discrete- she wear them and if her period begins- then it’s not a problem, she can just carry on with her day.Washing- beyond easy- first wash (except this order because we needed these panties and could not find her previous period panties) just panties by themselves- regular wash is just fine. We did do sanitize wash all of her period panties once a month when she is finished so she has fresh ones for next month but that is just our personal practice and no medical backing. Just something I figured it would be a nice tradition to do. Drying is easy- toss in the dryer and no big deal.She likes these because she can wear them at night and no issues.We have also realized that they make period panties with different padding for different flows. This is awesome since flows can vary- so can switch out and wear the ones that fit her best needs. She personally likes the heavier flow ones on her actual period and wears the light ones on non period days or testing days (she gets nervous and is afraid to have an accident- so if she does pee- it’s not noticeable and she can continue with her test/s).Overall I would recommend for any woman that has menstrual cycles and/ Urinary incontinence- these types of panties are perfect.Also it is true to size based off the size guide.Update: my grandmother is now using these panties post op because of her Urinary incontinence after her catheter was taken out. She also likes them and said they very comfortable. She also said it was true to size.",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carolyn Dillahunt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEP5TKGJHUT24CET6KKVK5XNT66Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W59C76U108O3?ASIN=B0CKLWR6B8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Useful for travel!",
                "reviewText": "I decided to try period underwear because I went on a safari this summer, and I wasn't sure how much regular access I'd have to decent bathrooms (part of the safari was camping). The period underwear enabled me to travel all day without worries--no leakage (though I do not have a heavy flow). The underwear is easy to clean--I could rinse it out until I had a chance to launder it. It worked really well for this trip, and I found the underwear comfortable and well-fitting.It's a little bulkier than regular underwear (though not any bulkier than regular underwear with a pad), so I'm not sure how much I'll use it for everyday, but it was well worth the purchase for me. I definitely like having it on hand, even if I don't fully make the switch to this more eco-friendly option for dealing with periods.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kay M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHGFKPI3LGM354O7GBCTV63XPGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E5MO3JBHEBFD?ASIN=B0CKLWR6B8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2023",
                "reviewTitle": "4.0 out of 5 stars The sizing is strange but they're awesome!",
                "reviewText": "Ignore the numbers in the sizing section, go to the last picture with the back of the packaging and match your pant size to the underwear size. The underwear size numbers don't correlate to any other sizing chart I've ever seen honestly but then again in women's fashion, the numbers are completely made up and arbitrary.The only issue I have with these is the very stiff seam that goes across the butt. You wouldn't be able to wear these with anything tight or very smooth without that seam showing. It'll also kinda give you a lumpy butt lolOther than the sizing weirdness and the lumpy butt seam, they're very comfortable. I think they're great starting on day 3 of your period. I wouldn't try these on days one or two.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heidi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXJOC7MLVQEGHIF5VPXXBPMX7JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11MQ445M225CC?ASIN=B0CKLWR6B8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars My first run w/o depends",
                "reviewText": "I am sick of wearing adult depends when I go for a run. They are expensive and I have actually had rashes and yeast infections from using them. I have also tried pads and I had urine leakage when running. I switched to these underwear and they really work well. No leaks on my first run. They are very comfortable.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susanne Bozzi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD5XJ6NB5GQ4NO7HYNQEG7IA5FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29C4I98SSCL8?ASIN=B0CKLWR6B8",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "3.0 out of 5 stars Works well to absorb minor leaks",
                "reviewText": "Seam on the back is uncomfortable",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sheila Williams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4WD3ZDILAZZK6MV4JM6HQSYJLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB501JV846DZN?ASIN=B0CKLWR6B8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Best ever!",
                "reviewText": "Fast delivery, size is accurate, washes very well, peace of mind if you sometimes have a little difficulty getting to the rest room., cough, etc.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sarah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF42PMRQIO4FWIC2I5E6HTFJHVVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BHRNTSSUWENB?ASIN=B0CKLWR6B8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Super comfortable",
                "reviewText": "I couldn't find this style in stores so I was happy to be able to get them here! They work as intended. Just remember not to use fabric softener or sheets as that can hinder their absorbency. Will order again when needed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joy Banner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3AXMRZIN5RKNL3JTKS55INRK7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HRZ725BXE0CK?ASIN=B0CKLWR6B8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Decent product for the price",
                "reviewText": "For a much cheaper version of others I have seen, these are decent and do the trick. The seams in the back make your butt look weird and feel weird, but I don’t regret buying these",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SheilaJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 17, 2024",
                "reviewTitle": "Game changer",
                "reviewText": "Nice to not have to wear pads everyday for bladder leaks. Fits fine. Have purchased a few times.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carla zuñiga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 24, 2023",
                "reviewTitle": "Ropa interior absorbente",
                "reviewText": "Son cómodos y cumplen muy bien con su función, solo que para flujo muy abundante no lo sugiero mucho, pero un flujo moderado sin problema lo absorbe.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sandra lovely",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 6, 2023",
                "reviewTitle": "Súper bien y suaves",
                "reviewText": "La talla está bien y no se ven apretados",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": " Evelyn Wards",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 27, 2023",
                "reviewTitle": "Would like to buy this again",
                "reviewText": "Would like to buy this again",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yvonne George",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 11, 2023",
                "reviewTitle": "They don’t really work",
                "reviewText": "Only work with extra pads",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}