{
    "remaining_requests": 39375,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Projector-GooDee-Bluetooth-Portable-Rechargeable/dp/B0C9T1M2TL",
    "body": {
        "name": "Mini Projector 4K, GooDee 1080P Support Pocket DLP Projector with WiFi and Bluetooth, Pico Portable Outdoor Movie Projector with Tripod&Bag, Video Rechargeable Battery Short Throw for iPhone/Android",
        "price": "$339.99",
        "originalPrice": "$359.99",
        "rawPrice": 339.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Projector-GooDee-Bluetooth-Portable-Rechargeable/dp/B0C9T1M2TL",
        "soldBy": {
            "sellerID": "A3P37WGXHRKITP",
            "name": "ANTONG TECH",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3P37WGXHRKITP&asin=B0C9T1M2TL&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CKXL2S7J"
        ],
        "asinVariationValues": [
            {
                "asin": "B081SZ72VB",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31AinuxrWcL._SS36_.jpg"
            },
            {
                "asin": "B0C9T1M2TL",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$339.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51m10kqSKXL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $50 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51m10kqSKXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51VzIK2SZnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Zqsdl9RYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41f0GCK6kuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bpv-xK9XL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514HGv002AL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41L9nUBr6BL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/29eafc07-3654-44b3-8682-751c5e30394b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1a962a01-7f86-4141-bb45-cb1388b2bf99/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5691d788-007c-4421-b1e6-ff2416076c1a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/53eb16d4-d40a-4178-8879-0cfe8ea1ea53/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a6f9197a-9134-440b-b659-4592b1320aa2/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 5,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/D13-7-uXa-L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/D13-7-uXa-L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the GooDee Store",
            "link": "https://www.amazon.com/stores/GooDee/page/831A7332-0976-4422-A99A-C691FE98C8E5?ref_=ast_bln"
        },
        "brand": "GooDee",
        "merchantInfo": "ANTONG TECH",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2055,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 5 hrs 47 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "🔥4K DLP Projector-GooDee DLP projector uses the newest Breakthrough Digital Light Processing Technology to provide superior light efficiency and color control, resulting in a remarkably bright 260 ANSI lumen image. The recommended projection distance of 1.64 to 9.85 feet (10-100 inches recommended), as well the capability to project up to 150 inches, this movie projector is ideal for a wide range of settings, Recommended for use in darker environments.",
            "🔥Pocket Size&Automatic Keystone Correction-This pico projector measuring just 5.9x3.9x0.9 inches and weighing approximately 2.6 pounds which impressively compact, incredibly portable, you could take it with you anywhere and at any time. Smart projector features automatic vertical ±45° keystone correction, so you don't have to worry about the image appearing blurry or distorted and which helps to correct quickly.",
            "🔥5G WIFI&Bluetooth Connection-GooDee Wifi&Bluetooth projector allows you to easily sync smartphone screen via both 2.4G and 5G WIFI. The ultra-fast 5G WIFI offers a smoother and lag-free online video streaming experience, making it easier for you to enjoy your favorite movies and shows. Just one -time wifi connection. The projector comes equipped with the newest built-in bluetooth technology, allow you to enjoy a wide range of bluetooth speaker sounds for immersive audio experience.",
            "🔥Rechargeable Battery&Power Bank Charge-This wireless projector could provide 2.5 hours of movie playback on a single charge owing to it has a built-in 7000mAh rechargeable battery, makes it an great choice for who need for outdoor movies or other outings. Small projector supports charging with power bank, giving you the flexibility even when you don't have access to an outlet, you can rest assured that your projector will always be ready when you need it, no matter where you are.",
            "🔥Wide Application&Lens Dustproof-Tiny projector boast a wide range of applications, allowing you to connect it to smartphones, iPads, laptops, TV boxes, DVD players, game consoles, USB drives and more. All activities such as cookie decorating, painting, drawing, tracking, home theater, video games, parties, and outdoor events for good. Meanwhile, this video projector is made of high-tech materials that are designed to be more dustproof and prevent black spot from appearing."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎GooDee"
            },
            {
                "name": "Item Weight",
                "value": "‎2.75 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎5.9 x 3.9 x 0.9 inches"
            },
            {
                "name": "Batteries",
                "value": "‎2 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Color Name",
                "value": "‎White"
            },
            {
                "name": "Special Features",
                "value": "‎✅Automatic Keystone Correction, ✅Short Throw, ✅Pico, ✅For Cookies/Painting/Drawing/Tracking, ✅Tripod&Bag Included, ✅Bluetooth, ✅WiFi 5G+2.4G"
            },
            {
                "name": "ASIN",
                "value": "B0C9T1M2TL"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,055 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#306 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "June 30, 2023"
            },
            {
                "name": "Brand",
                "value": "GooDee"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Home Cinema"
            },
            {
                "name": "Special Feature",
                "value": "✅Automatic Keystone Correction, ✅Short Throw, ✅Pico, ✅For Cookies/Painting/Drawing/Tracking, ✅Tripod&Bag Included, ✅Bluetooth, ✅WiFi 5G+2.4G See more"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, Wi-Fi, USB"
            },
            {
                "name": "Display resolution",
                "value": "1920 x 1080"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page 1 Rechargeable Battery 2 Zoom Function 3 Wide Connectivity 4 Auto Keystone 5 Outdoor Projector",
                "media_link": []
            },
            {
                "media_text": "Bluetooth Projector Connection 1.Press the \"Down\" button, turn to next page and select Bluetooth. 2.Click”Search”, select the name of the Bluetooth, click “OK”. 3. If is successful, \"Connected\" will be displayed in the top right. Learn More DLP Projector DLP projectors are low-maintenance, energy-efficient, and produce high-quality images, as achieved using tiny mirrors that reflect light, resulting in sharp and vivid pictures with minimal light loss. Learn More For Cookies Painting Best choice for activities such as cookie decorating, painting, drawing, tracking, home theater, video games, parties, and outdoor events. Learn More",
                "media_link": []
            },
            {
                "media_text": "This phone projector is ideal for people who love watching movies and listening to music while on the move that has an inbuilt high-capacity battery that allows for up to 2.5 hours of movie playback and up to 6 hours of music. You can use it outdoor without worrying about power.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/801e0750-8f65-43ed-a137-fc07e59d6e88.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "The 5G WiFi projector has impressive 2.4G+5G dual-frequency technology which provides lightning-fast and efficient streaming performance, which ensures no-delay viewing experience with seamless online video streaming. With this device, you can enjoy your favorite films, TV shows, and online media .",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e733269f-42dd-4e56-a106-cb928ac02f63.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Due to app copyright, watch the movie on Netflix, Prime Video, Hulu, only via connect a laptop, fire tv stick, Roku. For iPhone / iPad / iPod touch (iOS system)Streaming with your WiFi (wireless connection) Step 1. Turn on the projector, select \"ScreenCast\" screen mirroring as the inputsource, then go to the next screen and select \"Cast Settings\". Setting up your WiFi. Step 2. Return to the same screen interface to enter \"ios Cast\" Step 3. Connect your iPhone / iPad to the same WiFi. Open \"screen Mirroringon your device and click \"Flexi-A1-XXXX\" to connect. For Android Phone(Android system) Streaming with your WiFi (wireless connection) Step 1. Turn on the projector, select \"ScreenCast\" screen mirroring as the inputsource, then go to the next screen and select \"\"Miracast\". Step 2. Go to the Android device \"Settings\" and select your WLAN. Step 3. Activate the Multi-screen function in your Android device and search forthe projector, select \"Flexi-A1-XXXX\", and click to connect, Your Android devicedisplay will be projected to the wall/screen after a successful connection.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0ccf9872-e584-4398-b249-9110dfe6a4d4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0a231718-06e7-43b3-a923-a66ee0d91354.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/33f3d063-339c-4be2-979f-7e2ace4efbd1.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/851cac82-d067-4d2a-bb35-418a16530c9c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/47c1b3d0-ee28-4dcd-ac44-d1293f9bb902.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/24545632-6cbf-4db2-adb8-c84bad8b8f5f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c8968bc-a3be-4149-8e61-1d930b56cbbf.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fbea3783-e42d-4c9b-8f22-dcccf220c9b5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce3a231a-57bd-4b3e-8e16-74c60edb7c7c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/801e0750-8f65-43ed-a137-fc07e59d6e88.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e733269f-42dd-4e56-a106-cb928ac02f63.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Luke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNDH74RXBIJMIIX6Z53OU7J7PMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLDUXJTDKTMAD?ASIN=B0C9T1M2TL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2020",
                "reviewTitle": "5.0 out of 5 stars Five stars, but you get what you pay for.",
                "reviewText": "The key here is this is a five-star projector FOR TWO HUNDRED BUCKS. If you expect something to wow you in your home theater you'll be really disappointed.As a first-time projector buyer I really had to learn the ropes as far as what this projector is and isn't.Image quality:I can play games, movies, or even plug it into my PC and easily do any work on it. It is bright as advertised, but you will want generally a room with windows closed and lights off. Even with lights on in my room I can read the projector screen but there's no way I'd watch a movie like that. The colors and contrast are really lacking. Comparing it side by side to an entry-level asus 24 inch monitor I can notice so many more shades of color on the asus than goodee. And if you try to artificially mess with any of the settings it only ends up looking worse. For example in a dark show you really can't see much but if you adjust the brightness too much up then it blows out the whites. Certain colors like reds and greens do look fairly ugly when they are of subtle hues because the screen kind of blends them together.All that said movies are definitely watchable and FOR THE PRICE a great experience.It does do native 1080P 60Hz. Some competing brands say they do but they don't. This one seemed smooth when gaming I'm almost surprised to say.Positioning the screen:You can either mount it on the ceiling or put it nearer the ground depending on whether you place the projector right side up or upside-down. But you really do need it to pretty much be centered. There is no way to horizontally adjust the position of the screen from the center of the lens. And you can only adjust it vertically by 15 degrees, and even that I wouldn't recommend because you quickly get distortion. So the takeaway is you have to place the projector straight-on from the wall that you're using. It does allow you to downscale the image a little bit, but for the most part the size of the image will be 100% a function of the distance to the wall. At 10 feet away, the screen is 90 inches measured diagonally, for a reference point.Input lag:This is a very hard spec to find. And it can be a real issue on some of these budget Chinese projectors if you want to use it for gaming. Or even for desktop computing the mouse cursor can be very laggy on bad projectors! On this one I can see it is perfectly suited for computing or gaming. It is responsive, and yeah given a choice due to image quality I'd prefer to game on a different screen.Other features:I haven't tried the sound built in with the unit. It does emit a decent amount of sound from the fan, like.. well, like a quiet room fan. So anything with reasonable volume will drown it out. But if you have it near your head it could be annoying. It generates a lot of heat too not surprisingly. It's a pretty attractive unit with easy-to-use (albeit limited) menus.Let me just summarize again by saying that it is easy to get a lemon for this price and I have seen some horror stories. But this projector overall just seems to have a solid set of features for the price to do entry level viewing of really any kind of media. And not doing anything really badly for 200 bucks to me makes it a superior product. If you want something that will be for more serious movie watching I suggest you spend at least 500 bucks for some of the entry level viewsonic or other brands.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ThoughtGardenThoughtGarden",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2MBHAJ34HUA4K3HRNC4MGQFLMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FEATG92DUJC5?ASIN=B0C9T1M2TL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2020",
                "reviewTitle": "5.0 out of 5 stars Solid 4.5 Stars!",
                "reviewText": "We purchased this projector with three intent that it would be a great way to have our family over for some fun quality time while still being able to observe social distancing (for those of us not in the same household).We have not been disappointed.We use this outside every weekend, and it has performed very well without issue.I also purchased a 120\" screen to hang on our fence, and this projector pairs very well with it (see photos for reference).The device seems well-built, with the usual adjustments allowing for focus and keystone alignment on the lens.Connection-wise, 2 USBs, 2 HDMIs, 1/8 audio out work great. We bought a Roku stick so we can stream virtually whatever want without having to worry about connecting a Blu-ray, etc. The Roku is powered by the USBs on the back of the unit.The speakers in the projector are predictably mediocre; they were not designed to sound robust, or to fill a room with sound. However, using a 1/8 patch cable with splitter enable us to use multiple speakers placed throughout the yard for immersive sound for all viewers. Our 300w Sony Bluetooth speaker also works well when connected via wire (this projector does not have wireless audio).Image quality is actually quite stunning, given the price point, and design. This is not a $1500 home theater projector folks, but it is portable, easy to set up, and totally works for family functions.The image quality (native 1080) projected on a 120\" screen looks about as I would expect. The larger screens will always benefit from a 4k image, of course, but then again, it comes down to price point.Image adjustment includes the basics; contrast, brightness, saturation, etc. The only feature I wish it had was the ability to fine tune highlights, shadows, blacks, whites, etc. This is not a deal breaker though.If you purchase this, be sure to push the power cord in firmly, making sure it is seated all the way back in the socket on the back of the machine. We thought we had a defective unit with no power upon unboxing. We realized we had not pushed the plug in hard enough to make electrical connection.Overall, we are very happy with our purchase, and would do so again.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/6107VxPF3rL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71sZFGmijsL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "HAB10910",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXGOUPKAB2MHI2D22YZU67ZNEHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FCLRRUXTNNRC?ASIN=B0C9T1M2TL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2020",
                "reviewTitle": "4.0 out of 5 stars Really good quality for the price!",
                "reviewText": "Bought this to do movies outside on a screen and to use in the house on occasion when wanting a big screen.The picture quality was great! Nice and bright, good color. Even looked good in a room that was lit, but if using outside it needs to at least be dusk. Direct sunlight means you can't see the picture.Sound was good. It was plenty loud enough, but I would recommend using speakers if you are looking for really high quality sound. In my opinion, the sound was good enough and I have never opted to use speakers.The menu is clear and the buttons on the projector as well as the remote are simple to use.The only concern I've had is that it seems to get somewhat warm after a couple hours of use. The fan works well to cool it and isn't very loud. Not sure that the warmth is actually concerning, but I just like to be sure and turn it off if I'm not actively using it.It works good real well with my firestick and is easy to get started.The only down side is that to use the remote you have to point it at the front of the projector. I didn't think this would be an issue, but sometimes in order to have the screen the size I need it to be I have to sit behind the projector. So I have to get up when ever I need to use the remote or get up to use the buttons on the projector.Over all great buy! Super fun and easy way to make movie night a little more special!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$359.99",
                "sellerName": "GooDee-US",
                "sellerRating": "5"
            },
            {
                "price": "$359.99",
                "sellerName": "yingbindianzi",
                "sellerRating": "5"
            }
        ]
    }
}