{
    "remaining_requests": 39651,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Projector-Included-Synchronize-Smartphone-Entertainment/dp/B099N4NSSD",
    "body": {
        "name": "Projector with WiFi and Bluetooth, 2023 Upgrade 9500L Outdoor Projector, Mini Movie Projector Supports 1080P Synchronize Smartphone Screen by WiFi/USB Cable for Home Entertainment",
        "price": "$89.99$68.84",
        "originalPrice": "$99.99",
        "rawPrice": 89.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Projector-Included-Synchronize-Smartphone-Entertainment/dp/B099N4NSSD",
        "soldBy": {
            "sellerID": "ADDPLDMGGXFFE",
            "name": "RmoeasKloxomer",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ADDPLDMGGXFFE&asin=B099N4NSSD&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 40% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61Tzh GDANL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51BOZesn7nL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61M1OOam67L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/611oVfXu RL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61tRkg8Cv9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dWEF3VDVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61Z2NcseTsL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1I2tJAxwiL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1I2tJAxwiL.pdf"
        },
        "byLineInfo": {
            "name": "Brand: NISOO",
            "link": "https://www.amazon.com/NISOO/b/ref=bl_dp_s_web_116059861011?ie=UTF8&node=116059861011&field-lbr_brands_browse-bin=NISOO"
        },
        "brand": "NISOO",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 3343,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 10 hrs 56 mins",
            "FREE delivery Sunday, February 18. Order within 18 hrs 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "[Convenient WiFi Connection] Connecting deivces with our wifi projector through wifi. We have TWO things to make it friendly user: (1) Updated the wifi connection steps, make it easier and more stable; (2) Updated the wifi connection speed, you can connect the wifi more quickly. So own our wifi projector, you can enjoy it anytime anywhere, it makes your life easier and happier.",
            "[Three Added Bonus Better than others] (1) Higher Brightness: Our 9500L is more real than others. It is much brighter than 99% mini projectors. (2) Better Native Resolution: our wifi mini projector's native resolution is 1280 x 720P, with 1920x1080P supported, better than 90% mini projectors which are native 480P. (3) Add Bluetooth: It is a mini projector with wifi and bluetooth, you can hook up external speakers via bluetooth, the sound is greatly enhanced and sounded theater quality.",
            "[Meet Your Home Needs] Watch movies, take online classes, or keep the kids entertained with hours of cartoons and educational videos [ideal for use in low-light environments]. It's the innovation of traditional projector, built-in stereo speakers, adjust keystone and focus to get 32’’ 176’’ projection size with 1.5m-5m projection distance, bring excellent spectating experience. Perfect projector for outdoor movies and movie projector for indoor use.",
            "[Wide Compatibility and Application] Equipped with HDMI, VGA, AV, USB interfaces, the projector is compatible with TV Box, TV Stick, PCs, Laptops, Tablets, USB Flash Drive, players. It’s supposed to apply many environment—Home Theater, Video Game, Party, Outdoor activities. You can use it for small meeting in dark room, but it is not a professional office projector for PPT or text. As the copyright, some videos (such as Netflix) can't be played via phone connection (wifi or usb)."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "7 x 5 x 2 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.59 pounds"
            },
            {
                "name": "ASIN",
                "value": "B099N4NSSD"
            },
            {
                "name": "Item model number",
                "value": "M10"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 3,343 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "July 16, 2021"
            },
            {
                "name": "Manufacturer",
                "value": "Jinhu"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "NISOO"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Education, Home Cinema, Gaming"
            },
            {
                "name": "Special Feature",
                "value": "Built-in WiFi, Mini, Outdoor, Portable,Wireless, Bluetooth, High brightness&resolution"
            },
            {
                "name": "Connectivity Technology",
                "value": "HDMI, USB, AV, VGA, WiFi, BLUETOOTH"
            },
            {
                "name": "Display resolution",
                "value": "1280 x 720"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Why Should You Choose Us? This projector with its functionality is a dream come true for your evening hang-outs in your backyard. Can’t wait to use it outside at the pool! Perfect for a family movie and BBQ night! Our mini projector has many advantages, such as: (1) The first WiFi projector on the market. WiFi Function: Connecting devices with this wifi projector through wifi both for IOS and Android with simple connection steps. (2) The first Native 720P mini projector. We pioneered technological innovation, developed Natvie 1280*720P in the field of mini projectors. It also is 1920x1080P supported, better than 90% mini projectors which are native 480P or others who adopt this technology after us. (3) The realistic Lux parameters. 80% brighter than 99% mini projectors, the realistic lux will never let you down. (4) The Bluetooth projector. You can wirelessly pair with your bluetooth speaker, headphones, soundbar anytime and anywhere. It is a mini projector with wifi and bluetooth, you can hook up external speakers, the sound is greatly enhanced and sounded theater quality. Also, the built-in stereo surround speaker is good enough to enjoy the pleasure sounds in different scenes, if you don't want to add another speaker. Our wifi projector is better in many aspects, such as: (1) As the first wifi projector, wifi technology is more mature. (2) Wifi connection is more stable. (3) Wifi operation is easier. Note: As the copyright, some videos (such as Netflix) can't be played via wifi, nearly 99.99% projector on Amazon can't play them via wifi connection, but you can watch via HDMI connection such as laptop, tv stick and so on. If you want connect your smartphone with the projector, but you are in a place without wifi, you can use a USB to HDMI adapter. Please note you need to buy the adapter yourself, it is not included in the package. You can read the user manual or FAQ in the product package to get more information about how to connect a smartphone.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b8e2af66-8e7d-498f-8199-90a40b030f60.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "IN SHORT, TRUSTING AND CHOOSING THIS WIFI PROJECTOR WILL DEFINITELY SURPRISE YOU!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0cc160f7-d847-4bd9-9b35-04fee5def4a2.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "What You Can Get? Just Need Our Projector With It's Accessories, You Can Create A Wonderful Home Theater! Surprise! Perfect Meet Your Home Needs Since the special period, find a way to entertain yourselves, get this projector to watch movies and sports events outdoors with family. Put it outside on your deck and create your own drive-in movie theater. It's the way to show poolside movies and television. Great way to enjoy big screen movies at this time of social distancing. Specification You Need Know Image Lux： 80% Contrast Ratio： 2000:1 Max. Supported Resolution： 1080P FHD, Native Resolution: HD 720P Speaker： Built-in speaker, connect with other speaker via bluetooth LED Light Source： 55,000 Hours Projection Size： 32 - 176 Inch Keystone Correction： Manual ± 15 ° Advanced dual cooling fan： Lower noise Wide Compatibility： VGA, AV Port, USB, HDMI Smartphone & Tablet： WiFi Package： 1 x Projector 1 x HDMI Cable 1 x Remote Control (No Battery) 1 x Power Cable 1 x AV Cable ( NOTE: There is no screen in package. After we upgraded the projector with Bluetooth, there is no screen in Package now)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b39fda67-ce0e-4688-a055-ab253c597cb0.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b8e2af66-8e7d-498f-8199-90a40b030f60.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0cc160f7-d847-4bd9-9b35-04fee5def4a2.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b39fda67-ce0e-4688-a055-ab253c597cb0.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5d7d2585-b5cc-45c6-8fea-5b3be4599ce5.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d8f19c00-8ee7-44c0-b404-f793d344be05.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f6b9401b-23b0-498e-b36c-a2b796da2b97.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Z. Werner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI5IXJDL4UAU7JIWJR2ZAJMQEMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QLV0HQ7KZ3ID?ASIN=B099N4NSSD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent Value Projector for Family Movie Nights",
                "reviewText": "I recently purchased the WiFi Projector from this listing and, so far, I must say it's been a superb addition to our family movie nights. I was in the market for a budget-friendly projector that would offer good quality and a decent brightness level without breaking the bank - this one has more than delivered on that.First and foremost, the brightness on this projector is a standout feature. It's significantly brighter than other projectors I considered in a similar price range. The vividness and clarity make it an absolute joy to use in a dimly lit room. However, it's important to note that this isn't a high-end projector - if you're looking for cinema-level image quality, you might need to invest a little more. Yet, for a fun, family-oriented device to enjoy movies, this projector is a gem.As for the quality, it's surprisingly good given the price point. The projected image is clear and color reproduction is quite decent. I would stress that it's necessary to have a good screen or a white wall to get the best results. It's an inexpensive option that offers a good balance between quality and price, perfect for those who are just venturing into the world of home projectors.In terms of connectivity, I've mainly used the HDMI and USB ports to connect my devices. Both have worked flawlessly, with a seamless connection and no lag or interruption in video playback. While I haven't tried out the WiFi connectivity yet, it's a feature that could come in handy for those who prefer wireless streaming.The build of the projector itself is sturdy and compact, easy to set up and use, which makes it ideal for those who aren't too tech-savvy. The included instructions were clear and made the setup process straightforward.In conclusion, if you're seeking a budget-friendly projector that delivers good quality and brightness for your family movie nights, this one fits the bill nicely. It offers excellent value for the price and is a solid performer in its class. Just remember that it's not competing with top-tier projectors, and you won't be disappointed.Overall, I'm satisfied with this purchase and would recommend it to others looking for a fun, affordable home cinema experience.",
                "reviewVotes": "39 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elena",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZFMXD22MYNSV7BYMYPLOVV6BTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DPZ9VJCUBTN4?ASIN=B099N4NSSD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars A great projector for my kid's movie nights with friends",
                "reviewText": "I recently had the pleasure of experiencing the 2023 Upgrade 9500L Outdoor Projector with WiFi and Bluetooth, and it's safe to say that this device has taken our movie nights and outdoor gatherings to a whole new level. Boasting 9500 lumens brightness delivers stunning visuals, the wireless connectivity makes setup a breeze, allowing kids to easily stream their favorite movies from tablets or smartphones, immersive audio experience, compact size, durability, and versatile connectivity options make it a portable and robust entertainment hub.Say goodbye to the cinema lines; your backyard is now the premier destination for unforgettable movie experiences.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. WarrenJ. Warren",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG25IDZRG3QTY6YFCP2W4STLB4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZGGT439Z8DL2?ASIN=B099N4NSSD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2023",
                "reviewTitle": "5.0 out of 5 stars A great projector to use for all your holiday movie nights",
                "reviewText": "As the holiday season approaches, I found myself craving a heartwarming cinematic experience to capture the spirit of the season. Little did I know, the perfect combination of festive cheer and technological marvel awaited me in the form of the NISOO Projector with WiFi and Bluetooth and the delightful holiday film \"Last Christmas.\"From the moment I unboxed the NISOO projector, I was impressed by its compact and lightweight design. Lighter and more compact than budget friendly projectors I've pitched in the past, it was effortlessly portable, allowing me to set up my own personal cinema anywhere in my home. Its sleek, minimalist aesthetic complemented my living room décor seamlessly, adding a touch of understated elegance to the ambiance.As I connected the projector to my streaming device, I was immediately captivated by the stunning picture quality it produced. The impressively bright light source delivered a vibrant and crystal-clear image. The colors were rich and saturated, bringing the festive scenes of \"Last Christmas\" to life across my 100' movie screen.The projector's HDMI compatibility ensured a seamless connection to my Fire stick, allowing me to enjoy the film without any hiccups or interruptions. The built-in WiFi and Bluetooth provider additional enhancements to the viewing experience. I could stream the movie wirelessly and connect to external speakers for an immersive audio experience, though I would still recommend an aux cord if you have one available.Speaking of understand elegance, the real star of the show was undoubtedly the film \"Last Christmas\" itself. With its charming characters, heartwarming storyline, and a touch of holiday magic, it was the perfect antidote to the hustle and bustle of the season. Emilia Clarke's portrayal of Kate, a troubled young woman struggling to find her place in the world, was both endearing and heartbreaking. Her journey of self-discovery, aided by the enigmatic Tom, played to perfection by Henry Golding, an actor even more handsome than the NISOO Projector with WiFi and Bluetooth, was a testament to the power of human connection and the transformative spirit of the holiday season.The supporting cast, including Rob Delaney, Sue Perkins, and Patti LuPone, brought a unique blend of humor, warmth, and wisdom to the film. Their performances added depth and dimension to the story, creating a rich tapestry of characters that resonated with viewers of all ages.As the credits rolled on \"Last Christmas,\" I felt a sense of contentment and gratitude wash over me. The film had successfully captured the essence of the season, reminding me of the importance of love, compassion, and the transformative power of human connection. And the NISOO Projector with WiFi and Bluetooth had played a pivotal role in enhancing the viewing experience, providing a cinematic haven in the comfort of my own home.If you're looking for a heartwarming and technologically advanced way to experience the magic of the holiday season, I highly recommend the NISOO Projector with WiFi and Bluetooth and the film \"Last Christmas.\" They are a perfect combination of festive cheer and technological marvel that will undoubtedly leave you feeling uplifted and inspired.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71TSTPZbsdL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71m3MLpLAJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71wmQ1CHSvL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81RjhX3c2tL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joe Benedict",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTOYOOW37J2BC4IQMEN67VKDGPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OI6P6TBHNH1T?ASIN=B099N4NSSD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "4.0 out of 5 stars Tinny sound, good picture",
                "reviewText": "It's kinda cheap, and the sound is either tinny, or, if you hook up a Bluetooth speaker, delayed. That said, the picture is decent and I got what I wanted and paid for.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sajid",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHC7FPFC7TZ54ZO6IAY5ZTWCLQTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROC8X3862B7DX?ASIN=B099N4NSSD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy setup, superb performance.",
                "reviewText": "This projector is fantastic – great quality for the price, easy setup, and lightweight. Perfect for backyard game nights or summer movie evenings outside!Streaming via WiFi is so convenient! Perfect for spontaneous movie nights or last-minute presentations, hassle-free connectivity every time.In summary, if you're in search of an affordable projector that offers solid quality and brightness for your family movie nights, this one is a great fit.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "seema",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7V4NN4CXNHVHXN52Q6RP2WYURA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D6U0F8MVHM2P?ASIN=B099N4NSSD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Solid Projector",
                "reviewText": "This projector stands out for its excellence, offering both affordability (especially compared to projectors priced over $500) and impressive quality. Its compact size and lightweight design make it highly portable and user-friendly. The brightness and clarity of the projection are noteworthy, distinguishing it from the many alternatives we've explored. If you're in the market for a projector, this one comes highly recommended.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NurseKLANurseKLA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 12, 2023",
                "reviewTitle": "Take your camping trip to the next level",
                "reviewText": "The media could not be loaded. What a pleasant surprise this little machine is!!Light weight, affordable, and performs beyond expectations for this price point.Picture is clear and has a good range of focus (a couple feet from the screen or 12 ft from the screen, the picture is clear).Set up from box to screen is simple - there isn't a laundry list of settings to adjust. So that means you can pull it out on a nice camping night and be enjoying a movie with the family within 5 minutes.I recommend buying an HDMI to USB-C cable to instantly hook up your phone for streaming.We will be enjoying this projector for our camping trips this summer!*video attached is projected on a painted wall (not the included screen) and clarity is still awesome.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71mNSbKxkXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71MmZ-IAsVL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/E19mf X19DL.mp4"
                }
            },
            {
                "reviewerName": "RRTRRT",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 20, 2023",
                "reviewTitle": "We love it! Great Purchase!!",
                "reviewText": "The media could not be loaded. Watching movies and playing video games in the basement become our favorite family bonding activity after dinner. This is a great Projector with clear picture and easy to use with TV box and Game Console. The screen mirroring feature is a nice improvement.This is an upgraded version of my old one (higher Lumen,1080P support and built-in stereo speakers). The Wifi feature allows you to connect your device wirelessly, that means less cables to use for a mini theater at home. We did not use the screen that came with it but instead just use the wall. We barely use the TV now because we have a huge 100 inch screen.We are planning to use this outdoor when we go camping this Summer.I am happy with this purchase!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714jA6-KQpL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71NY5QuC6hL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61YG7usOl5L.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/F1h9xAXekQL.mp4"
                }
            },
            {
                "reviewerName": "MarkMark",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 29, 2023",
                "reviewTitle": "Great projector for the price",
                "reviewText": "Shipping was very fast to begin with. Comes with a HDMI and a RCA to 3.5mm audio cable. Power cable is long, good to have if you’re mounting on a tripod. Setup was super easy. Video is great and using my bluetooth speaker for sound. As for the features, love that is has Bluetooth and the wifi is a great option which allows you to AirPlay from IOS devices. Projector is mounted on a tripod and PS5 connected. Overall, very happy with the projector and its features.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/517JAK2f8jL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/610gmDGfU4L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maricar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 19, 2023",
                "reviewTitle": "Perfect for our family",
                "reviewText": "I recently purchased the projector and received it before the estimated delivery date. I am very happy with my home theatre experience. Perfect for movies, sports and k-dramas. The quality is better than expected. The picture is very clear and the menu is easy to navigate. You can easily connect to your phones and laptop. It's a great value for money for this price. Awesome projector!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mik-e",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 25, 2023",
                "reviewTitle": "Excellent Product for the Price",
                "reviewText": "I received the product a few days ago and have tried it out in the backyard. It was easy to setup and use (I had an earlier version of it). Picture quality was good. Sound worked well. Portable enough that I was able to take pack it up and move it. Recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$99.99",
                "sellerName": "RmoeasKloxomer",
                "sellerRating": "5"
            }
        ]
    }
}