{
    "remaining_requests": 39370,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Projector-Bluetooth-Keystone-Correction-Compatible/dp/B0B659QN18",
    "body": {
        "name": "Projector 4K with Wifi 6 and Bluetooth,ABoolon 1000 ANSI Outdoor Movie Projector,20W Speakers,500\"Display,Zoomable,4D/4P Keystone,PPT,Native 1080P FHD Home Projector Compatible TVStick/iOS/Android/Win",
        "price": "$349.99",
        "originalPrice": "",
        "rawPrice": 349.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Projector-Bluetooth-Keystone-Correction-Compatible/dp/B0B659QN18",
        "soldBy": {
            "sellerID": "A6NV2FUHGYVZU",
            "name": "luckystarjun",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A6NV2FUHGYVZU&asin=B0B659QN18&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CV79TYDG"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CKYXFV6Y",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$349.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51ohwD24WKL._SS36_.jpg"
            },
            {
                "asin": "B0B659QN18",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$339.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41fhZSsoyoL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "7",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $150 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41fhZSsoyoL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41yixpOsksL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qGxxYjOXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51e6CvdI-oL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Wjd0yR9QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wyvrRXhwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61pPlDW6mvL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9c15abe6-3ead-4916-802f-42f3bf64fa0f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e78c273-e010-45f5-bbe1-7ae4b0ff01a6/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fffccbfc-11ec-400c-9f4c-a1c0f3679da8/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the ABOOLON Store",
            "link": "https://www.amazon.com/stores/ABOOLON/page/4EA16DC0-9E79-410D-B633-FDE0B2F1508F?ref_=ast_bln"
        },
        "brand": "ABOOLON",
        "merchantInfo": "luckystarjun",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 340,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 16 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Native 1080P&UHD support 4K & 1000ANSI】ABoolon projector is the Brightest(1000ANSI)and clearest detailed 1080P(1920*1080)images for projector with wifi and bluetooth on the market, Enjoy wider color gamut,crisp and detailed images from HD content without downscaling or compressing with protecting your eyes.It adopts the latest full-screen technology,ensure the screen corners are as clear as the center. You will enjoy high quality home cinema experience with 4K ultra HD.",
            "【5G WiFi Connection & Support DNS & 4K Video】the newest 5G Wifi connectivity technology,not only use your phone network to connect,but the same router to screen mirroring.It offers much smoother and lag free online video streaming experience.It is set easily IOS & Android & laptop devices to make them more user-friendly and easily(No Need Cables or Adapters).Support 4K Video.You will enjoy all kinds of movie,music and game with your family and friends",
            "【5.1 Bidirectional Bluetooth & 20W HiFi Stereo speakers & Advanced Cooling System】 Bluetooth projector has a wireless Bluetooth connection function, you can use the technology to connect your Bluetooth headsets, Bluetooth speakers, and Airpods.The movie projector built-in dual stereo speakers with SRS, provide clear well-balanced sound quality, a truly amazing sound experience. Built-in advanced heat dissipation structure with 3 fans, greatly extend the movie projector lifespan.",
            "【500\" Big screen & 4D/4P Keystone Correction & Image zoom 50%】Viewing Experience with a wide range of 60-500 inches at home,This portable projector with the innovative 4D/4P Keystone correction. It can adjust Vertical and Horizontal angles ±50° and support side projection, you could watch from almost every angle.With the ZOOM function, it can adjust image size from 50% to 100% display what size you want without moving the projector.",
            "【Presentation via USB & Multi-device Connection & 3-YEAR WARRANTY】This portable projector can display Excel/Word/PDF via USB. This kind of portability makes your small meetings more convenient.Support HDMI/VGA/USB/SD/AV/TV input and Audio out, connecting PC, Fire Stick TV,Laptop, Provide 6-Month back and 3-Year repair, lifetime professional technical support. Any problems, please feel free to us know anytime."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎ABOOLON"
            },
            {
                "name": "Item Weight",
                "value": "‎6.8 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎10.6 x 9 x 4.7 inches"
            },
            {
                "name": "Item model number",
                "value": "‎P6"
            },
            {
                "name": "Color Name",
                "value": "‎White"
            },
            {
                "name": "Special Features",
                "value": "‎①Native 1080P&UHD ②1000Ansi③5G WiFi Connection & Support DNS④5.1 Bluetooth &10W HiFi Stereo speakers ⑤500 inches large screen ⑥ 4D/4P Keystone Correction & Image zoom 50% ⑦Presentation via USB & Multi-device Connection ⑧Supports Table, Tripod, Ceiling Installation"
            },
            {
                "name": "Speaker Type",
                "value": "‎Built-In"
            },
            {
                "name": "ASIN",
                "value": "B0B659QN18"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 340 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#267 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "July 9, 2022"
            },
            {
                "name": "Brand",
                "value": "ABOOLON"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Outdoor, Tv Stick, Presentation, Smartphone, Movie, Family Party, Home Cinema, Home, Office, Entertainment, Gaming, Business See more"
            },
            {
                "name": "Special Feature",
                "value": "①Native 1080P&UHD ②1000Ansi③5G WiFi Connection & Support DNS④5.1 Bluetooth &10W HiFi Stereo speakers ⑤500 inches large screen ⑥ 4D/4P Keystone Correction & Image zoom 50% ⑦Presentation via USB & Multi-device Connection ⑧Supports Table, Tripod, Ceiling Installation See more"
            },
            {
                "name": "Connectivity Technology",
                "value": "HDMI,USB, AV, VGA, WiFi, Bluetooth"
            },
            {
                "name": "Display resolution",
                "value": "1920 x 1080"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Native 1080P Ultra HD Projector with Wifi and Bluetooth Why choose Aboolon 4K projector with WiFi and Bluetooth? Ultra Bright Picture and no blurry in the edges of screen: You can watch the outstanding-quality images in day and clear in the edges of screen in variety of conditions.While you need watch TV and playing games under very dark environment for the other projector,the edge of screen is blurry tooSupport 4K and Native 1080P Resolution 1920*1080 pixels and 15000:1 contrast ratio: with outstanding sharpness, but the other led projector do not support 4K.Software is updated continuously: we will update the software according to the client's need and questions again and again, but the other led projector has no this function.Dual 10 W speaker: Built-in dual 10 W stereo speakers with SRS Sound system, It gives you an immersive experience, but the other projector only Built-in dual 5 W speakers.ABoolon projector more functions:WiFi Projector: No need to buy any additional HDMI adapter to connect to the smartphone. It supports wireless/wired connection. You only need to successfully connect via WiFi and USB cable. Cast screen quickly,bring you the ultimate visual experience. Choose our projector to make mobile phone synchronization easier.Includes the function of Bluetooth and support 4K,you can connect your ideal Bluetooth speaker wireless at any time and placeThe practical 4P/4D + 50 Keystone Correction and innovative 50%zoom function. It enable flexible placement in any environmentOffice software compatible for small conference.Big screen(Max 500\"display).4k urethra HD projector with and high brightness and dual 10w,enjoy it in 24 hours Tips: If there is no sound from the projector when playing media contents from a set top box, BD/DVD, Apple TV or streaming players connecting to the HDMI input, please check digital audio settings of the set top box BD/DVD, Apple TV or the player's and make sure it is set to \"PCM Stereo\" mode.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/45e759a2-84ca-4106-971b-de11201ceab1.__CR0,2,1083,670_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Enjoy the hignther 4K Ultra HD with 10 W Unrivaled Surround in 24 hours Support 4K & 98% of the RGB color signal 4K renders sharp and detailed images from high definition content without down scaling or compression. advanced 3LCD technology displays, 98% of f the RGB color signal for every frame.This allows for outstanding color accuracy while maintaining excellent color brightness, without any distracting “rain-bowing” or “color brightness” issues seen with other projection technologies4K projector with WiFi and Bluetooth is the best brighter on the marker one the marker.An incredible 900 ANSI of brightness, it can still project a clear, colorful and highly restored picture in 24 hours. Meantime,the led projector is clear in the edges of screen.But the other projector is blurry in the edges of screen and you can only watch the movie in dark environment Dual Dual 10W Speakers, Powerful HIFI Sounds Built-in Dual 10W high-power speakers, It uses high-quality cavity speakers to faithfully reproduce a powerful and immersive sound field.so that the sound can be spread evenly in all directions, ensuring the audience can get comfortable & balanced sound shocking at any angle.But the other 1080 P projector only Built-in Dual 5W speakers",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a83b2e7e-589b-4af1-8196-1e49913ee419.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Native 1080P Home Theater Projector for sharing your Home entertainment anytime. The total number of pixels of the movie projector determines the native resolution of the projector. The more pixels you can fit in the display, the crisper and more detailed your images will appear for outdoor movies. Higher resolution is especially important for outdoor projector, gaming projector and business projector.Comparing the number of pixels (resolution) of 1920*1080 Native Aboolon HD 1080P, it becomes 4 times higher definition. Aboolon Projector's chip consists of tens of thousands of reflective lenses, each lens is quickly switched every second to render full HD picture.The higher the contrast ratio, the better the image color will be. With 15000:1 contrast ration, Aboolon smart projector will bring you nature close color, instead of wash out color as other low contrast ration projectors.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d9850a77-0dd2-4411-bfa1-44c7f37539e2.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "5G Wifi connction 5G wifi projector,Fast and more smooth to connection. WIFI projector designed with the latest 2022 WiFi connection which compatible with the Android/iPhone/Windows 10. Synchronize the smartphone screen just need once-time WiFi connection without any wireless dongle, adapter or cable, WiFi projector gives you wireless freedom,you can enjoy games, videos, TV series, photos, sports games, UEFA Champions League, etc in any place. Supprot DNLA: The wireless projector also supports DLNA projection. With just one click on the mobile video APP, the video will be played on the projector, while freeing up your phone/tablet to do anything else, such as chat, work, shopping, etc. 100000 Hours Lamp Life You use this HD projector for about 55 years if you use it for 3-4 hours a day. meantime, As the projector light due to diffuse reflection does not enter the eye directly from the TV.it is possible to maintain a healthy ,soft and mild and view! All -inclusive design The Sealed Optical Engine of our dust-proof projector prevents dust from entering the machine or falling on the lens, ensuring no black spots on the clear image.Meantime it lasts more time for user Warm Tips: When using the WiFi function to connect with the mobile phone/iPad and the projector, please make sure to connect to good internet, which the WiFi network should be greater than 50M. And prevent the WiFi stream gets overloaded with too many devices connected to it. No matter the projector is connected to a 5GHZ or 2.4GHZ network, the mobile phone must be the same network.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b8c7cf71-720d-4ead-beee-b3da5b846ae3.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "The practical 4P/4D ±50° Keystone Correction 4P/4D ±50° Keystone Correction The Aboolon video projector supports 4P/4D ±50° Keystone Correction,You can adjust 4 corners of the image ±50° Horizontally and Vertically by the remote. 4P Keystone Correction makes it simple to project ideally aligned images from a variety of locations. With it, the projector can be placed off-center, allowing the presenter to stand in front of the screen without blocking the image. Let you get rid of the limitations of space and location, you can easily project from any angle, and you can watch movies more freely. But Most of 1080p projectors only have ±15° vertical keystone correction only or have 4D keystone correction(both horizontal and vertical).It is limited by the field restrictions of front projection.You can not place the projector where you want. With 100%-50% zoom function Aboolon 4K projector can adjust the display size by 100%-50% at a fixed distance, and frequently adjust the projection distance of the projector. 100%-50% zoom function is convenient watch for high brightness projector in any place. But the other projectors sold on the market generally only have a 100%-75% zoom function, It not fit your need for watching movie for lower brightness projector in any place and any time. Low Noise We adopt the newest cooling system, improved fan design and the application of innovative materials to reduce the noise. Compared with other projectors on the market, the noise is reduced by 30% to 40% Advanced Cooling System The built-in advanced heat dissipation structure with 3 fans enhances the heat dissipation capacity of the projector and prevents the projector from overheating. Create a quieter and warmer environment.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a69f64a-c386-4dfb-a4ec-133a1d2322d8.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "5.1 Bidirectional Bluetooth Projector and Support 4K Support Bluetooth It adopts the latest 5.1 Bluetooth chip and Bidirectional Bluetooth technology, easy to connect with many kinds of bluetooth speaker, bluetooth earphone and so on. Warm Tips: Bluetooth function of Aboolon projector can only transmit audio, it cannot connect to smartphones/pad. Due to the Bluetooth protocol compatibility issue, some Bluetooth speaker brands may don't support TP connect the projector.If there is no sound from the stereo audio output when playing media contents from a set top box, BD/DVD or streaming players connecting to the HDMI input, please check the set top box or the player's digital audio settings and make sure it is set to \"PCM Stereo\" mode.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d0e2b77e-a3fd-4349-8693-41a080de275f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Enjoy Large size, vivid and beautiful images for excellent watching experience! 500\" huge projection ABoolon Outdoor projector with vivid and clear images, fantastic brightness, adjust distance to get 500\" huge projection size to bringing you an excellent spectating experience like an IMAX .Plug your own TV Stick, just connect them with HDMI Cable.You can use it to watch outdoor movies,classroom course ware and business. Presentation via USB Smart projector can play Microsoft Office & Adobe PDF files directly by your USB Stick and view them on the projector. You can simply save your work onto the USB memory stick then plug it and play it. While other projectors only support text format and need to connect with the projector and Laptop/PC to project ppt/excel/word/pdf. Software is updated continuously we will update the software according to the client's need and questions again and again, but the other led projector has no this function. Warm Tips: Due to HDCP copyright issues, Netflix / Disney+ / Hulu / Prime video CAN NOT be mirrored or screen cast from the projector. You can use a TV Stick, Wireless Dongle or Chrome cast to connect the projector to watch video, and other similar services.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a99e041-0be6-4326-abc9-0dd2e3fc7645.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/45e759a2-84ca-4106-971b-de11201ceab1.__CR0,2,1083,670_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a83b2e7e-589b-4af1-8196-1e49913ee419.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d9850a77-0dd2-4411-bfa1-44c7f37539e2.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b8c7cf71-720d-4ead-beee-b3da5b846ae3.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a69f64a-c386-4dfb-a4ec-133a1d2322d8.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d0e2b77e-a3fd-4349-8693-41a080de275f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a99e041-0be6-4326-abc9-0dd2e3fc7645.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Danielle D.Danielle D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBL2CHN3M6ZHDOJUDURDAFKK3JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N6ZHG968K9M?ASIN=B0B659QN18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars High Quality Projector!",
                "reviewText": "We purchased this projector to replace our old projector that started acting up. It was very easy to set up and we didn’t need to purchase anything additional to get started. We projected it directly on our wall, which worked well. The colors are bright and vibrant even during the day. The resolution is crisp and quite impressive. The auto-focus worked well and is a very nice feature. I also love the loud built-in speakers. It also came with a carrying bag, which will be convenient when we use it outside in the future. Overall, I’m very happy with this projector!! Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61C0lxeQ+xL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717v8Sn9fDL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Pa3ZsLIGL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "PavmanPavman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3NBPCMEBGTKY4Y2UHNP3E7N5MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2P9YRYQ2Q6KHX?ASIN=B0B659QN18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Wow, I did not expect this projector to be so good!",
                "reviewText": "I have and do own several projectors, I have worn out a Sanyo, and I currently have an Epson and a Dell at my work and a Viewsonic in a warehouse I have that I use to watch football games when I have a large number of guests over. Recently, my Viewsonic has been acting up (probably because it is not in a air conditioned space) and I feared it breaking in the middle of a game that I had guests for so when this one popped up as a suggestion in my amazon feed, it got my attention for several reasons. 1. As a backup / replacement, 2. This projector has built in screen casting over Wi-Fi for apple and android devices, 3. It is LCD and does not require super expensive and hot bulbs. and 4. Because of the price..So first off, I really did not expect much as I know this is an off-brand product and its claims of easy use and brightness.. I honesty expected disappointment and that I would be sending it back.. The projector arrived four days after I purchased it, for some 2 day delivery was not available in my area for this product. It came in a marked box showing its contents so I was grateful nobody saw it on my doorstep to steal... I opened the box and was first surprised that it came in a grey cloth carrying case which is not heavy duty and the handle was a bit thin, but it is better than nothing. The projector was nicely packaged and comes with a remote (no batteries) and a power cord.. I decided to skip the instruction book and plug it in without reading the instruction booklet which is actually written pretty well and has photos of setup steps. Within a few minutes I had connected it to my wi-fi and was casting photos and videos from my iphone on the kitchen wall a few feet away. The projector turned on almost instantaneously unlike my other projectors and was pretty quiet and surprisingly bright. I then tried connecting my phone through Bluetooth and could not get the video to stream, but upon further reading it appears that Bluetooth does not have the bandwidth to support video, but I don't know if this will change in the future, but anyhow Wi-Fi is just fine. I also went to the projector settings and was delighted to find it connoted to the internet to check for updates which is a great feature.The next day I decided to bring my $1,000 epson projector home from my office to see how the picture and brightness compared between the two. Forgive my bad photos and videos as I am projecting against a dirty garage door with the projectors sitting on a cooler. Putting the two projectors against one another I made these initial observations: The epson seems a tad brighter but the photo and video looked washed out compared to this Abooln. The Abooloon colors were much deeper and maybe a bit oversaturated, but I have not adjusted any of the color settings so I am sure a little tweaking would help. The Aboolon also has better resolution as my expensive Epson is only 1080P. I then plugged my Roku streaming stick in to the hdmi port and used the usb port for power which it does provide. Sound quality on the Aboolon is MUCH better and while I will be porting the sound through my AV system, this projector sound is great for business meetings. The Aboolon is slightly taller than my epson but not quiet as wide and deep. The quality of construction is good, but here is where the Epson comes ahead of the game.. The Epson is heavier and feels like a more expensive piece of equipment, as it well should for more than double the cost. One other thing that I had never noticed until I put these projectors side by side, is that my Epson has a border / outline that is quite bright and noticeable around the picture which is distracting now that I notice it......So , these are my quick thoughts for the short time I have tested it so far. I will be keeping this projector and if it holds up for a few years it will be money well spent and appears to be an excellent value for the price.. I have not had any interaction with the vendor so I hope they stand behind thier product should something go wrong and will probably be buying the extended warranty that amazon offers because it is cheap assurance AND I will be keeping the projector in a un-airconditioned space in hot and humid Florida..",
                "reviewVotes": "65 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61wRjgM5V2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717fgkVxhqL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71DyVVq3KuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zZWmj+I0L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle Abanto",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTOIF3YMMPIB43X42JENOKY6E5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9TV0D4N2YNY2?ASIN=B0B659QN18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Good quality and packed with features projector",
                "reviewText": "This is a regular size projector, not compact, but it is not heavy which I like. The box comes with projector bag, remote control but batteries are not included, Video AV component adapter cable, HDMI cable, lens cleaner and manual. Ports available include headset, AV, VGA, 2 HDMI, 2 USB and lan which is quite a lot and useful. The other cool thing that I like about this projector which is not mentioned in the description is it is auto volt, meaning this will work even outside US.This projector is amazingly bright and has good audio quality and loud enough. I've tested this around 2pm in a well-lit room and it is surprisingly clear. The main purpose that I want projector is to be able to watch movie so this will really work for me. I had a problem with the sound initially as when a movie is played in laptop via HDMI, the audio is playing in my laptop instead of the projector which I did not encounter when I was mirroring using a mobile phone. I've reached out to the seller and they provided me an instruction/settings which resolved the issue.Another feature that I like about this projector is it has +-50 4D/4P Keystone Correction which will let you adjust the angle of the screen. Meaning if you setup this in the ceiling upside down, this will let you adjust the screen angle through few tweaks in the settings. This also eliminates the limitation of where to place the projector as it can be adjusted easily. This is 1 of the feature I’m looking for in projector because I have limited space in my room.Fan noise didn’t bother me. WiFi, bluetooth and screen mirroring are easy to setup. Note that Netflix will not work properly in the mirroring feature but youtube will. Another note is there’s no apps installed but these shouldn’t be an issue if you use TV stick or use a laptop. Overall, this projector has the features I'm looking for within my budget.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mayliet Gonzalez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGK2LIUVUBCGV4G2YFPF4HUBTPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9ELZQFX91O6F?ASIN=B0B659QN18",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "1.0 out of 5 stars Muy malo",
                "reviewText": "Muy mala calidad de imagen y no se enfoca bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nadim F. Hussein",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGQ26CQG3G5AZBB2MBDQ7IUPO6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LG52PGWL8YH7?ASIN=B0B659QN18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing projector with affordable price",
                "reviewText": "The picture of this projecter is very clear and it is easy to use. The kids like it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elaine Marshall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFH7PWMAU2YUZT2ZW4TFQM3K3Q6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1B504YZXKGYC1?ASIN=B0B659QN18",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2022",
                "reviewTitle": "4.0 out of 5 stars The company people were very kind with great customer service",
                "reviewText": "The first thing noticable was how clear the picture was from 6 ft and beyond. The projector connected easily to phone, just had to download EShare and connect the projector to the Wi-Fi.Youtube easily mirrored from my Samsung S7 tablet, playing a lovely oceanic scene on the wall that was gorgeous and high quality. It can mirror anything on your phone screen, even art projects, as a artist I find this feature extremely valuable.It even works on the ceilling, watching aquarium fish and beautiful sunsets on the ceiling was a magical experience.The projector also comes with a controller for easy access as well as has speakers with loud balanced sound and a headphone jack for silent listening.The coloring is excellent and it almost feels as if your in a movie theatre when you use this projector.The only issue i found was the update button because it would change the settings, forcing me to redo all of the settings.My rating for this projector is a solid 9.9/10 though i have never had a projector, it does not change the fact that i thoroughly enjoyed using this projector. This item is enjoyable and will make families smile, especially on movie nightMy family loved this wonderful projector, we are looking forward to using it for years.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$399.99",
                "sellerName": "luckystarjun",
                "sellerRating": "4"
            }
        ]
    }
}