{
    "remaining_requests": 39635,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ViewSonic-Brightness-Projector-Vertical-PA503S/dp/B071G5H5Q1",
    "body": {
        "name": "ViewSonic PA503S 3800 Lumens SVGA High Brightness Projector for Home and Office with HDMI Vertical Keystone",
        "price": "$329.84",
        "originalPrice": "$329.84",
        "rawPrice": 329.84,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/ViewSonic-Brightness-Projector-Vertical-PA503S/dp/B071G5H5Q1",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CRGBNL4Q"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CJ4LMLY8",
                "variationName": "Style",
                "variationValue": "1080p Resolution",
                "price": "$579.99",
                "variationImageURL": ""
            },
            {
                "asin": "B071G5H5Q1",
                "variationName": "Style",
                "variationValue": "SVGA",
                "price": "$329.84",
                "variationImageURL": ""
            },
            {
                "asin": "B071WPR7XK",
                "variationName": "Style",
                "variationValue": "XGA",
                "price": "$376.25",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41MW9Cnn5UL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61mvFBAWZJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BEf3vwsUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413gwpBM2ZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41a9sv6gVSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ELvA2gQHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/7190YiZne-L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/336c866c-0bfa-474c-a44f-e0c60cb10893/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c196ae5a-01e0-40ab-91ed-41fa7a283932/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fddf0b6-6a79-4d03-ae3e-50d9d428b3f4/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C12gz41fr7L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C12gz41fr7L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the ViewSonic Store",
            "link": "https://www.amazon.com/stores/ViewSonicCorporation/page/137763D7-E51B-4650-B00F-ED579E4052F5?ref_=ast_bln"
        },
        "brand": "ViewSonicCorporation",
        "merchantInfo": "Ships from and sold by ViewSonic Corporation.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1505,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 8 hrs 44 mins",
            "FREE delivery February 21 - 22.",
            "$13.57 pickup Thursday, February 15. Order within 18 hrs 23 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "VERSATILE PROJECTOR: High brighness 3800 Lumens SVGA projector with advanced visual features",
            "EASY SETUP: 1.1x optical zoom, 40 degree vertical keystone",
            "REDUCED INPUT LATENCY: A low 16ms input latency provides faster frame-by-frame action for smooth images without delay",
            "LONG LAMP LIFE: SuperEco Mode allows the lamp to shine bright for up to 15,000 hours",
            "FLEXIBLE CONNECTIVITY: Supports most media players, PCs, Macs, and mobile devices with inputs such as HDMI, VGA, mini USB"
        ],
        "description": "The view Sonic PA503S price-performance projector features 3, 800 lumens, native SVGA 800 x 600 resolution, and intuitive, user-friendly design. Exclusive Super Color technology offers a wide color gamut for beautiful image production in nearly any environment. The PA503S also features extensive connectivity including HDMI, 2 x VGA, VGA out, composite video and audio in/out. An energy-saving Super Eco feature reduces power consumption and extends the lamp life by up to 15, 000 hours. With advanced audio-visual features, flexible connectivity options, and an affordable price, The PA503S is ideal for use in education and small business environments.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "8.58 x 4.33 x 11.57 inches"
            },
            {
                "name": "Item Weight",
                "value": "5.5 pounds"
            },
            {
                "name": "ASIN",
                "value": "B071G5H5Q1"
            },
            {
                "name": "Item model number",
                "value": "PA503S"
            },
            {
                "name": "Batteries",
                "value": "2 AAA batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,505 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#118 in Video Projectors"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "June 7, 2017"
            },
            {
                "name": "Manufacturer",
                "value": "ViewSonic"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "ViewSonic"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Business"
            },
            {
                "name": "Connectivity Technology",
                "value": "VGA, Mini USB Type B, HDMI"
            },
            {
                "name": "Display resolution",
                "value": "800 x 600"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "600 Pixels"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About ViewSonic With over 30 years of experience developing award-winning visual display solutions and providing excellent 24/7 customer support, ViewSonic delivers a level of expertise that is tough to beat. In short, we’ve got you covered. ViewSonic PA503S 3,800 Lumens SVGA DLP Projector With advanced audio-visual features, flexible connectivity options, and affordable, the PA503S is ideal for use in education and small business environments. Amazing Color Accuracy 3,800 Lumen Brightness Up to 15,000 Lamp Hours Reduced Input Latency 3D Blu-Ray Ready HDMI Input Quick Power Off 2W Internal Speaker",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/0acfcd55-4f09-46dd-a8bc-1c054a21e70e.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/fef48def-7118-4111-af02-8096e1537eb2.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Features SuperColor: Amazing Color Accuracy ViewSonic’s proprietary SuperColor Technology features an exclusive 6-segment color wheel and dynamic lamp control capabilities, providing a wide color range and stunningly beautiful images. Bright Images in Any Environment Packed with 3,800 lumens and a high contrast ratio, this projector produces bright images in nearly any environment. Long Lamp Life SuperEco mode allows users to dim projection brightness by up to 70%, and extends the lamp life by up to 15,000 hours.* *Lamp life may vary based on actual usage and other factors.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/33a4bbe2-ad45-42de-a2ea-bcd2a4fa1df8.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/c70ead9d-f43a-489a-a375-df17e4b06a69.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ebbe676e-1a44-430d-ae5a-3a856d932057.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Features Reduced Input Latency This projector delivers smooth images without delay. Its ultra-low 16ms input latency provides faster frame-by-frame action. 3D Blu-Ray Ready HDMI Input Equipped with the latest HDMI, this projector is perfect for connecting to any HDMI-enabled device, and can display 3D images directly from 3D Blu-ray players. Vertical Keystone Correction Vertical keystone correction (+/- 40°) helps eliminate crooked and distorted images for a perfectly proportioned picture every time.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/36da0b5d-f361-417e-93e5-4ee2f1ab565e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a81aff81-4bb7-4564-90ac-0270e47deb19.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e8482a75-674d-4dad-9cf9-752aa564dff0.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "PA503S PA503X PA503W Resolution SVGA (800x600) XGA (1024x768) WXGA (1280x800) Brightness 3,800 Lumens 3,800 Lumens 3,800 Lumens Dynamic Contrast Ratio 22,000:1 22,000:1 22,000:1 Aspect Ratio 4:3 4:3 16:10 Throw Ratio 1.96 ~ 2.15 1.96 ~ 2.15 1.55~1.70 Throw Distance 3.9 - 43 ft / 1.19 - 13.11 m 3.9 - 43 ft / 1.19 - 13.11 m 3.28 - 36.02 ft / .99 - 10.98 m Display Size 30 - 300 in. / 0.76 - 7.62 m 30 - 300 in. / 0.76 - 7.62 m 30 - 300 in. / 0.76 - 7.62 m Lens Vertical (+/- 40°) / 1.1x optical zoom Vertical (+/- 40°) / 1.1x optical zoom Vertical (+/- 40°) / 1.1x optical zoom Light Source Life Up to 15,000 hours (Dynamic Eco Mode) Up to 15,000 hours (Dynamic Eco Mode) Up to 15,000 hours (Dynamic Eco Mode) Connectivity Mini USB Type B, 3.5mm Audio Out, 3.5mm Audio In, Control (RS232), HDMI 1.4, VGA In (x2), VGA Out, Composite RCA Video In Mini USB Type B, Audio Output, 3.5mm Audio In, Control (RS232), HDMI 1.4, VGA In (x2), VGA Out, Composite RCA Video In Mini USB Type B, Audio Output, 3.5mm Audio In, Control (RS232), HDMI 1.4, VGA In (x2), VGA Out, Composite RCA Video In",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/080ebd3a-aefc-4dac-95aa-0a43a6f272e8.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0acfcd55-4f09-46dd-a8bc-1c054a21e70e.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fef48def-7118-4111-af02-8096e1537eb2.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/33a4bbe2-ad45-42de-a2ea-bcd2a4fa1df8.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c70ead9d-f43a-489a-a375-df17e4b06a69.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ebbe676e-1a44-430d-ae5a-3a856d932057.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/36da0b5d-f361-417e-93e5-4ee2f1ab565e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a81aff81-4bb7-4564-90ac-0270e47deb19.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e8482a75-674d-4dad-9cf9-752aa564dff0.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ae3aa966-91ca-4dbe-a157-e9d4431a0fff.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/61d5491a-eff6-4b19-abe9-040d72a09db8.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2b6c6672-4d72-4816-8e10-539c3462ee62.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "CH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELSSHAPYTFYEG5JCM3XNWSOEQYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UGJJHEB2N98P?ASIN=B071G5H5Q1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 21, 2020",
                "reviewTitle": "5.0 out of 5 stars Projector Comparison – QKK vs ViewSonic vs Vankyo",
                "reviewText": "I use the projector for exclusively outdoor movie nights. My previous set up (an ageing NEC projector) has been the source of many happy family memories. With COVID limiting social gatherings, I wanted to create a better experience ... and hopefully one that was easier to set up. Achieving this turned out to be an interesting journey so thought I would share in case it helps anyone. The short version – the View Sonic PA 503S was the winner, but whether this makes sense for you does depend on what you need from a projector. Read on for the details...Initially I went back and forth on whether it was worth upgrading at all. My existing set up was a 10 yr old NEC projector, a bed sheet, and UE Boom speaker. It had the huge advantage of being available & free! However, there were some things I was looking for in an upgrade. Highest on my list was the ability to use a cell phone as an input source (the NEC projector could only use an input from a portable DVD player), plus it needed to be almost fully dark before I started the movie. In addition, it was fiddly to set up and the sound was not great.The screen was the first issue to solve. After significant research, I went with a Yard Master 135” screen. It was expensive, but it works great and I am very happy with it. I can relocate movie watching from where I used to hang the bedsheet to the more convenient location of my back patio – much more comfortable. I addressed the audio by using a Vizio sound bar I had lying around, which gave a huge leap in performance.Now for the projector... and here is where it gets interesting. I attempted to research projectors, but there were only a few sites I could find that did a decent comparison test. In fact, many sites comparing projectors seemed to simply re-cycle the marketing blurb from each product. One can spend $100 or $1000 on a projector, and its not easy to figure out whether spending more gets you a better experience. So I bought 3 projectors and ran a back to back test.The units I tested were the ViewSonic PA503S ($300), the Vankyo Leisure 3 ($127) and the QKK Mini Projector (2020 version, claiming 4200 Lux, cost $100). I also found a cable which promised to turn HDMI signal into an S-Video input, which I could then plug into the NEC projector. Findings below.4th place. NEC projector plus cable. Failed to get out of the starting blocks. The cable did not do as promised, and ended up mangling the Netflix formatting.3rd place. Vankyo Leisure 3. Did a great job with video display. It was a little brighter (but not by much) vs the NEC. The focus ring and keystone adjustment feel like the weak spot for this unit.. and likely all similarly priced mini projectors. On this particular unit, the keystone adjustment was so loose it shifted when you adjusted the focus. And the focus had to be cranked right to end extreme in order to get a sharp image ... to be honest it wasn’t really in focus even then. My guess is that this was just the unit I had... but it did not inspire confidence As with many reviewers, I could not get Netflix to produce sound thru the projector, but that was not a show stopper as I am using a sound bar with ARC-HDMI input as my audio.2nd place. QKK. Like the Vankyo, it did a great job of video, and had the same audio issues. Video was sharp, and a little brighter vs the NEC. It was relatively short throw... I filled the 135” screen at a projection distance of around 12 feet, which worked well for my set up. A word on quality control. Like the Vankyo, focus / keystone adjustment is a weak spot. It’s a very plasticky and crude mechanism. Incredibly I had to buy 3 of these units before I got one that worked. The first one was a lemon – it never focused properly. You could get focus in the center of the screen but not the edges, which really killed us when we had a movie with sub titles. The 2nd unit was lost in delivery. Amazon refunded it. The 3rd one I reviewed here. Its focus ring / keystone adjustment mechanism worked well, and it was easy to get good focus.1st place. View Sonic PA503S. The View Sonic is at a completely different level of quality, plus it offers one huge advantage – it is literally twice as bright as the QKK & Vankyo. Firstly the image – its clear, and the focus is easy to adjust to perfection. No softness at the edge of the screen, it was ‘movie theater’ quality. One slight difference vs the QKK... the throw is a little longer. I needed 19 feet projection distance to fill the screen, thankfully not a problem for my set up. Secondly audio – Netflix works on this unit. Again, I had a work around so this wasn’t essential, but in case that matters for your set up. Most importantly of all, the brightness. The View Sonic claims 3600 lumens. It was (by eyeball estimation) twice as bright as the others. This means I can start watching a movie just as the sun goes down, fully 1 hour before the QKK / Vankyo were viable options. This turns out to be a huge deal. The QKK and Vankyo both needed it to be fully dark to watch the movie. Around here that means starting to watch a movie at 9:20pm in the summer... and therefore finishing well after 11pm. With the View Sonic I can start watching at 8:15pm. For comparison the QKK claims 4200 lux, and after some digging I found a claim of 2200 lumens. So for me, a combination of brightness plus a generally much improved build quality convinced me to keep the $300 View Sonic and return the others.",
                "reviewVotes": "60 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sweety Pie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSJA53327ZMXAHDPWND4OKLA67A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KPQEFPTSYS8R?ASIN=B071G5H5Q1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent Projector",
                "reviewText": "I have been using this projector for over a year and I love it. It is bright and can be used with the lights on in the briefing room. It is, of course, better if the lights are off, but it is bright enough to use even with the lights on. I can plug the sound into my Public Address (PA) system for large audiences, and the picture keystone adjustment is outstanding and almost always necessary. The multiple connection capabilities are super--in particular the HDMI.The volume of the projector itself is not good enough for larger audiences, which is why I plug into my PA system. I have used this projector in large settings by running a cord from the audio out to my PA input. the image is so good that people will think they're sitting in a movie theater. Superb.This has proven to be a very reliable system, and reliability is key if you're frequently speaking in front of large audiences. I love this system. Five stars!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DTK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTJH5OWQFFE2FAUUFAYCDQSCDNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXSSXA4MW2DMT?ASIN=B071G5H5Q1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2020",
                "reviewTitle": "4.0 out of 5 stars Great for the price",
                "reviewText": "I bought this as an outdoor projector for family movie nights during COVID. It works great for the price, but there are limitations. First, the sound is terrible from the machine alone, you will need extra speakers if using outdoors - for a single family one smaller speaker like the Shark/OONTZ will work, but for a neighborhood night I needed to buy a high wattage speaker. The picture is generally great, but what you use as the source will make a difference (much crisper and clearer when hooked to Blu-Ray player versus streaming). If you are planning to use outdoors, timing and sunlight is a major consideration. It is not usable in any daylight. I live in Northern New Jersey and the sun sets in the front of my house. The back is shaded from 7PM on in the summer. I have used it as early as 7:45PM but the picture is very light and barely can be seen. It gets better at 8PM, but really not decent until 8:15PM at the earliest. My flood lights do not impact it that much, it is really a daylight issue.Overall we are happy with it. My kids enjoy movie night each week and we were able to have a drive-in themed socially distanced birthday party for my oldest.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MariaMaria",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGR5KPHOMUU4H3LGRZKLERAMJBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VGIPA1VG8JZS?ASIN=B071G5H5Q1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 6, 2019",
                "reviewTitle": "5.0 out of 5 stars Best brightness I've seen for a projector this price",
                "reviewText": "I use this product in daylight and at night to blow up reference for my large scale paintings and for movies. Resolution is perfect for all images so far, but small text suffers a bit as you can see on the right photo (800x600 60Hz). I run the projector for almost 6 hrs a day while working with 30 min breaks give or take. 3 weeks in and no issues. A powered adapter for a USB C port to HDMI (worth the $20 on Amazon for your highest speed port) is what I use and doesn't allow for any lag with cinematic experiences. These are both taken during daylight from southern exposure probably the most light you could get in a room inside, over grooves in the wall and items in the way, wanted to show the worst case scenario and that it doesn't diminish my experience. 3600 Lumens does not disappoint.The projector itself is a little larger than expected, BUT this really controls the heat. I used to use a thin Epson projector and always worried about it being around anything flammable since it would heat up any metal that was within a foot of it. I can't hear the fan on this projector and audio is best through my computer speakers (I've heard lots of complaints about audio, but the audio is subpar on most projectors in my opinion, whether you pay 700 or 200; to use computer speakers instead, find your sound output dropdown in settings). Manipulation of zoom and picture aspect lacks a little, but if you physically move and try out new positions for the projector it shouldn't be a problem and it also has manual focus which comes in handy since it doesn't have auto focus or auto keystone (only horizontal keystone settings for when you adjust projection at a vertical angle). Overall very satisfied. Will update review if run into any issues.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71dNpnrSxNL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71ygONU899L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Igor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 5, 2022",
                "reviewTitle": "Excelente",
                "reviewText": "Sem dúvida, excelente custo benefício.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "luis p.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 19, 2022",
                "reviewTitle": "Muy buena imagen y colores. Lo recomiendo.",
                "reviewText": "El proyector ofrece buena imagen nítida y brillante. Los colores se ven muy bien incluoso en lugares iluminados. Lo único que no me gustó es que el sonido no es muy bueno y no trae entrada para USB, sólo micro USB y hay que comprar un adaptador pero eso no es problema. El proyector vale la pena. Yo soy maestro de inglés y lo compré para dar mis clases. Estoy fascinado. Lo recomiendo mucho además de que es buena marca es muy funcional. Excelente inversión. Gracias Amazon usa",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 21, 2023",
                "reviewTitle": "ottimo prodotto",
                "reviewText": "ottimo prodotto in relazione al prezzo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mimidore",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 28, 2023",
                "reviewTitle": "Vidéo projecteur conforme à mes attentes",
                "reviewText": "conforme à mes attentes. bon rapport qualité -prix",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeanpapy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on August 27, 2023",
                "reviewTitle": "Concluant",
                "reviewText": "Produit correspondant aux attentes et livraison dans les délais.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$327.82",
                "sellerName": "OneDealOutlet Online",
                "sellerRating": "4"
            },
            {
                "price": "$329.99",
                "sellerName": "PCNation",
                "sellerRating": "4"
            },
            {
                "price": "$329.99",
                "sellerName": "ViewSonic Corporation",
                "sellerRating": "4"
            }
        ]
    }
}