{
    "remaining_requests": 39511,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/YABER-U10-SE-Compatible-Android-Premium/dp/B0CNWC4BFB",
    "body": {
        "name": "YABER U10 SE Projector with WiFi and Bluetooth, Native 1080P, 4K Supported, Projector for Outdoor Movies, 300 Inch, Zoomable, 10W Speakers, Home Theater, Compatible with TV Stick, iOS, Android-Premium",
        "price": "$117.96",
        "originalPrice": "$139.99",
        "rawPrice": 117.96,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/YABER-U10-SE-Compatible-Android-Premium/dp/B0CNWC4BFB",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CV7Y5RGW"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/510PYHhVKcL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/512ke-zrtjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gg1VGNAjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518LQQkfV1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dKOlxHPDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZhQ8PKwmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71oSXIc7bLL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e0a83efe-1358-4ffb-af2d-a1c59a58fe65/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the YABER Store",
            "link": "https://www.amazon.com/stores/Yaber/page/A1D73531-D896-4EF1-A270-C96CAEFB735E?ref_=ast_bln"
        },
        "brand": "Yaber",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 228,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 13 hrs 3 mins",
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Saturday, February 17. Order within 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "➤【Bidirectional 5.1 Bluetooth& 5G/2.4G WIFI】Official Feature Sponsor of New Orleans Film Festival-YABER Pro U10 1080P projector built-in the latest bidirectional Bluetooth 5.1 chip and stereo surround speaker, which not only can connect your Bluetooth speakers wireless but also can be connected to the mobile phone as a speaker at any time freely. With ultra fast &stable 5G WIF, Pro U10 can mirror videos/photos/games from smartphone or other devices to the big screen freely.",
            "➤【Native 1080P & 15000L & 20000:1 Contrast Ratio】U10 SE home projector is the first projector on the market that adopts high transmittance and refraction of lens with 12000:1 high contrast. It brings wider color gamut, sharp and detailed images than other 1080P projector. U10 SE adopts the YABER 2.0 Smart Engine technology, with excellent UI design makes the operation of the product more user-friendly.",
            "➤【4-Point Keystone Correction & 50% ZOOM Function】With upgraded 4-Point keystone correction, Pro U10 video projector can achieve a higher level of precision correction. The four corners of the image can be adjusted separately, not limited by the position of the projector. The digital zoom function can reduce the image size from 100% to 50% by the remote without moving the projector.",
            "➤【Advanced Cooling System & Presentation via USB】The first LCD projector equipped with sturdy anti-oxidation bimetallic brackets, which not only increases the height of the projector, but also expands the ventilation area. 3-sideds ventilation design ensures that the heat dissipation efficiency of the projector is increased by 40%. Excel/Word/PDF can be easily displayed on the projector via your USB stick. Say bye to complicated connections and make small conferences more efficient.",
            "➤【120000 Hours Lamp Life & Lifetime Professional Support】Adopt the latest SmarEco technology to minimize lamp power consumption to extend the useful life of the lamp to a maximum of 120000 hours. This portable projector is very suitable for home movie entertainment, outdoor, games, yoga, and party usage. YABER provides 6-Month back and 3-Year repair, lifetime professional technical support. Any problems, please feel free to us know anytime."
        ],
        "description": "Inspired by the space series of movies, Yaber U10 WiFi & Bluetooth projector first adopted outer space style design. The features of U10 are portable size carry 1080P resolution, 5GHz/2.4GHz dual-band WiFi, bidirectional Bluetooth, innovative 4-Point Keystone Correction Function (±50° for four angles), which is an upgraded 4D keystone correction function. Say bye to freeze problem, U10 WIFI projector brings smooth giant images to you.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "10.2 x 9.1 x 4.6 inches"
            },
            {
                "name": "Item Weight",
                "value": "4.8 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0CNWC4BFB"
            },
            {
                "name": "Item model number",
                "value": "U10 SE"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 228 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#360 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "November 23, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "YABER"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "YABER"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Home Cinema, Gaming, Business"
            },
            {
                "name": "Special Feature",
                "value": "Built-In Speaker, Portable, Digital Keystone Correction, Lightweight, Built-In Cooling System"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, Wi-Fi, USB, HDMI"
            },
            {
                "name": "Display resolution",
                "value": "1920 x 1080"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "YABER U10 Native 1080P Projector - Upgraded Projector with WiFi and Bluetooth 2023 Why choose our YABER U10 projector? Why we are special？ Compatible with 4K & 1080P Native Resolution: Equipped with the Yaber Basic 2.0 chip& high transmittance and refraction of lens, more of the image's original details and color are retained during image processing. The Yaber home projector delivers greater clarity and brighter images. 15000L Higher Brightness: The newly upgraded Yaber U10 projector has a superb level of brightness that allows it to be used even in a room with curtains drawn during the day and for an even more extreme viewing experience at night. Works as a Bluetooth Speaker: Built-in the latest bidirectional Bluetooth 5.1 chip and stereo surround speaker, which not only can connect your Bluetooth speakers wireless but also can be connected to the mobile phone as a speaker at any time freely. Let's experience the immersive audio-visual feast with the Yaber U10 home theater projector！",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/10bc3ce9-eb10-4e7c-bb86-3a7f6f364b05.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "What is BASIC Smart Engine？Is it Worth? BASIC Smart Engine is a creative projection technology developed by Yaber, through which the best audio-visual experience can be obtained in five aspects——Brightness, Abundant Color, Sound effect, Immersive Display, Clarity. Brightness——The function of the \"BASIC\" smart engine is to minimize the loss of reflected light, thereby increasing the brightness by 25% than all other 1080P LCD Projectors. Abundant Color——The BASIC Smart Engine technology enables the YABER projector to achieve full-color gamut coverage, making the picture more colorful and natural. Sound Effect——The BASIC Smart Engine technology can make the sound of the Yaber projector more outstanding and pleasant, achieving surround sound or stereo effects. Immersive Display——The imaging of the YABER projector can reach up to 300 inches (Different models, different projection sizes). The joy of getting the whole wall! Clarity——The YABER smart engine can clearly display the details of the image and its boundaries. Step into the world of Full HD!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fd55228e-8bff-4ec0-abb9-f1a0526130e2.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "50% Digital Zoom & 4P Keystone Correction, Take the Hassle Out of Adjustments YABER U10 home projector can use the remote control to select \"Digital Zoom\" to reduce the image up to 50% of the original length and width with the remote. At the same time, thanks to the 4P Keystone Correction function, all four angles of the picture can all be adjusted individually instead of only along the horizontal or vertical direction, making it more convenient and flexible. With these innovative features, users do not need to frequently adjust the projector distance to match the screen size or move the projector direction to get a circumferential picture.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/527bd83c-aec2-43c5-b8bd-67a4960dd3cc.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "High-Speed 5G WiFi, Goodbye to Lagging Delay YABER home projector can mirror movies/photos/games from smartphones or other devices to the big screen wireless via WIFI. Say bye to freeze problem, YABER U10 WIFI projector brings smooth giant images to you. Native Resolution: 1920*1080 (Support 4K)Brightness: 15000 LumenContrast Ratio: 20000:1Aspect Ratio: 4:3/16:9/AutoConnection type: Wireless /WiredProjection Size: 45-300\"( Optimum is 120\")Zoom Function: 100% -50% (Reduced-50%)Keystone Correction: 4-Point Digital Keystone Correction",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/496e974b-8c7a-4444-9f2a-b8eb2fa85efe.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Warming Tips Is Netflix/ Prime Video supported on this projector with wifi and bluetooth? Due to HDCP copyright, mobile devices cannot mirror the content of some streaming services (Netflix, Amazon, Hulu, etc.), but you could use amazon fire stick to enjoy over 1 million movies and TV episodes. Why is there no sound when playing videos？ When connect the TV stick, please disable Dolby Digital Plus. In other cases, please select a non-Dolby sound source. Any questions, please please please feel free to let us know, we will try our best to give you a best solution!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c91d3bf9-d30a-467e-9ac7-277ba17f3aa3.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/10bc3ce9-eb10-4e7c-bb86-3a7f6f364b05.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fd55228e-8bff-4ec0-abb9-f1a0526130e2.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/527bd83c-aec2-43c5-b8bd-67a4960dd3cc.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/496e974b-8c7a-4444-9f2a-b8eb2fa85efe.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c91d3bf9-d30a-467e-9ac7-277ba17f3aa3.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "EastonCoEastonCo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYWMCMPUEXQR2TE3VTCXBIUOL5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11C8YKXEJW3JF?ASIN=B0CNWC4BFB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 19, 2022",
                "reviewTitle": "5.0 out of 5 stars Budget Friendly, Quality Projector",
                "reviewText": "Yaber is a brand that makes affordable, yet quality projectors. This is my second Yaber projector, with the first being the V7 about two years ago.Aesthetics:The projector looks nice and modern with a leather type texture on the outside plastic. It comes with a sleek lens cover that is easy to remove and reinstall, which is nice as some projectors you have to fight with the lens cover.Mounting:This projector has a single post mounting point, so if you are looking for a mount, you can look up \"Portable Projector Mount\" and this should bring up what you need. I do prefer the 4 point mount, however, this projector is light weight and the single mount point should be fine.Picture: The picture is super crisp and clear and sports a multi demension keystone correction. The projector will need to be flat or projecting slightly upward, as the focus gets all messed up if you try projecting downward (Mount it upside down and change image direction instead!).Colors: The colors on this projector are better than most in this price range. Deep blacks help the colors pop.Brightness: I can say that the brightness of this projector is superb for the price point. I have reviewed many projectors and this easily has the best brightness of any in this price range. It certainly is not a BenQ, but considering such projectors are thousands of dollars, it's pretty dang good!Dust Note: All projectors in this price range use a color-filter display that works by shining a full-spectrum LED through a filter assembly. The assembly has 4 filtering layers; blue, red, green, and black. They each technically have a small little filter for each pixel, all switching on an off rapidly. For this reason, they get hot. Because they get hot, they need to be cooled. This is done with a cooling fan and air routing inside the projector. Unfortunately, if you live in an area with a high amount of dust, this will end up building up on the filter assembly. I live in Phoenix, AZ and it usually has a line down the edge of the screen within 6 months, however, I have not had that much time with this projector so I can not say that for sure yet! My next category is cleaning, which makes up for anything that may happen here.Cleaning:The YABER projector is the only one in this price range, using filter display assemblies, that makes cleaning the display assembly easy. They provide you with several long q-tips in a bag along with a microfiber cloth. On the back of the projector there is a little filter door that pops off so you can look in and even stick the q-tip in (After dipping in alcohol) and clean off any dust build up. There is also a door you can open on the bottom to give you direct access to the display assembly. There is not much that can be done to stop dust from building up with these types of units, so it is awesome to see that Yaber thought ahead. Another thing you can do to help with this is remove the panel they have on the projector for the air intake. It has a little black screen on the inside. You can cut out a piece of filter material (HEPA) and replace it with that and you will have much better results with dust!This projector is perfect for presentations, movie nights, or watching sports. It is also low power, so you don't have to worry about it driving up your energy bill!Overall, very good find and will continue using Yaber in the future.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/312JBZn1dPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51BEPuAZyzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71f1HVjdoiL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "KristopherKristopher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCNKM2MC5OASGKDBHDQ2E6DD57A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25EH6L2YPDTRE?ASIN=B0CNWC4BFB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2022",
                "reviewTitle": "5.0 out of 5 stars Fantastic, Powerful Projector",
                "reviewText": "I'm coming from a Yaber Y30 and this is a fantastic upgrade. The form factor is smaller, which is a plus if you're looking to conserve space, or just want a projector that's more portable. In the case of the latter, the projector comes with a nice backpack to hold itself, the remote, and all the cables you could possibly need.The good:•Projector has 1 HDMI, 1 AV, and 2 USB ports.•Vents and fans are on the sides making it much easier to clean.•The inside lens is completely encased, ensuring dust doesn't show up on the backside of the lens, something I struggled with on the Y30.•Picture quality is greatly improved over the Y30.•Myriad options for tweaking color/contrast/brightness, etc.•It has wifi and bluetooth connectivity.•It's quieter than the Y30.The bad:•Focusing the projector is a task. It has your normal focus ring and an x-axis adjust and I'm still tweaking the focus to get it just right. IE, the top left side and center is focused but top right is fuzzy. If I get the top right to focus, the left will become blurry. X-axis adjust is VERY sensitive which may be part of my problem, and most likely user error and NOT The fault of the projector.•The projector came with firmware dating back to 4/2022 which provided very stunted picture quality options. Presets were way too yellow or red, and manual adjustments were not available. Connecting to wifi and checking for updates, the projector reported I was up to date, but after an email with support, I discovered there was an 8/2022 update and I had to install it manually. Would have loved to take an OTA update instead.•If/when updating, your flash drive MUST be FAT32 formatted, otherwise the projector won't update. Getting the projector to recognize the update file is a bit of trial and error.Overall, I'm really impressed with this projector and it has taken the place of my Y30. Being able to project at a higher resolution makes watching movies much more enjoyable, and I'm really liking the fact that there's less cleaning/maintenance required to maintain a clean picture. Customer Support is fantastic and they'll work with you to ensure any problem you have is resolved. This is a great projector and you can't go wrong!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Mnfo7b3nL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ZKn5Mmp5L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61e-Hzs2BgL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71eqova2bsL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71qAj3P48BL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francisco Carranza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 20, 2023",
                "reviewTitle": "Muy bueno",
                "reviewText": "Es lo que me ofrecieron",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jerson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 19, 2023",
                "reviewTitle": "En la imagen se ven manchas y puntos blancos",
                "reviewText": "La imagen se ven manchas y puntos blancos👎👎",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}