{
    "remaining_requests": 39653,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Projector-Bluetooth-WiMiUS-Outdoor-Keystone/dp/B0BTHDPTSG",
    "body": {
        "name": "[Auto Focus/4K Support] Projector with WiFi 6 and Bluetooth 5.2, Projector 4K, WiMiUS P62 Native 1080P Outdoor Movie Projector, Auto Keystone & 50% Zoom, Smart Home Projector for iOS/Android/TV Stick",
        "price": "$289.79$188.09",
        "originalPrice": "$289.79",
        "rawPrice": 289.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Projector-Bluetooth-WiMiUS-Outdoor-Keystone/dp/B0BTHDPTSG",
        "soldBy": {
            "sellerID": "A16BRZ2F2CC5AR",
            "name": "Mitop",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A16BRZ2F2CC5AR&asin=B0BTHDPTSG&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BTSYTJ2H"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $100 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51BZPv p1FL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41fbip126WL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515jvmHKNzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41FUZRgti8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31u3AIx2XmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DK0knykZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1IV7e09-BL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a8e0240b-3b64-4b44-bc7b-20161677ea01/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bf945f0b-36fb-4b48-af74-72894e95c88f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/31a13c34-81b6-4a7f-b967-e497070e8d4a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1e7b4f0c-ba4b-4e8c-8ed6-be364b0e2332/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6a6b5d8-daea-4663-b514-35b942629160/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5d726f80-bc6b-4509-a2cf-080bd816916f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/78161fb0-619e-4916-af59-35ff98ab5fd2/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2af494ff-a84a-497c-870b-3fdcd1a758ca/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 8,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1NUwkQfFqL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/D1FkmAS94LL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the WiMiUS Store",
            "link": "https://www.amazon.com/stores/WiMiUS/page/40EE88F6-9B8E-4617-AA2B-759B8F3BE298?ref_=ast_bln"
        },
        "brand": "WiMiUS",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1460,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 20 hrs 26 mins",
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 2 hrs 11 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "➤【Innovative Auto Focus and Auto Keystone Correction】WiMiUS's first auto focus projector is here! P62 video projector adopts auto-focus and 6D auto-keystone technology, Say goodbye to troublesome manual adjustment, and you can get a clear rectangular picture within 5 seconds after starting up! The built-in displacement sensor can detect the movement of the projector at all times. Even if the projector is moved, the P62 can automatically adjust the focus and correct the image.",
            "➤【Native 1080P & 500 ANSI & 20000:1 Contrast Ratio】P62 WiFi and Bluetooth projector adopts imported concentrating technology glass lens, with high-definition native 1080P and 20000:1 high dynamic contrast ratio, and supports 4K video. With 99% NTSC technology, it highly restores the original image without compressing the picture quality, giving you the best game and movie look and feel.",
            "➤【The First Wi-Fi 6 Projector】Wi-Fi 6 is not only compatible with 2.4GHz and 5GHz networks, the maximum rate can reach 9.6G bps. As the first projector equipped with WiFi 6, the P62 can achieve smoother and more stable content transmission when used with a WiFi 6 router, and the projection will no longer be delayed and stuck, which greatly improves the gaming experience and wireless projection experience. Ideal for patrons who prefer a big screen movie/game experience.",
            "➤【Upgrade Bluetooth 5.2 and Hi-Fi Built-in Speaker】The Bluetooth projector P62 is equipped with the latest Bluetooth 5.2 chip, which supports stable connection to various Bluetooth speakers, bringing you more shocking and immersive sound. With built-in 12W stereo speakers, P62 is both a smart projector and a standalone Bluetooth speaker, providing great loud sound for your home theater without connecting external speakers.",
            "➤【Fully Sealed Engine and Multi-device Connection】P62 is based on a fully sealed optical core, which is not easy to enter dust, effectively reducing screen black spots and image quality loss, so that P62 can accompany you for a longer time. Equipped with AV/USB*2/HDMI*2/audio ports, it can easily connect Phone/PC/TV Stick/Switch. ➤For any questions, our 24/7 after-sales email support, 2-year Money Back guarantee, 3-year Repair warranty, and Lifetime Technical Support are at your service."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "10.2 x 7.8 x 4 inches"
            },
            {
                "name": "Item Weight",
                "value": "6.45 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0BTHDPTSG"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 1,460 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#25 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "January 31, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "WiMiUS"
            },
            {
                "name": "Brand",
                "value": "WiMiUS"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Home Cinema"
            },
            {
                "name": "Special Feature",
                "value": "🚩1 Note: ONLY Mitop and Rui Direct are officially authorized WiMiUS stores. Others are unauthorized and do not offer warranty support., ✔️500ANSI High Brightness✔️Bluetooth 5.2 and 6W*2 Independent Sound Cavity, ✔️Auto Focus and Auto Keystone Correction, ✔️After-sales email: support@wimius.com, ✔️WiFi 6 Support and 5G/2.4G See more"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired/Wireless/Bluetooth/WiFi/HDMI/USB/AV/3.5Audio"
            },
            {
                "name": "Display resolution",
                "value": "1920 x 1080"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "WiMiUS 2023 Lastest Auto-Focus Projector with WiFi 6 Bluetooth 5.2 500ANSI Lumen",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7df2c758-d4db-4d99-96e7-8b7acd533a90.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Previous page Next page 1 Auto Focus &Auto Keystone 2 4P/6D Keystone Correction",
                "media_link": []
            },
            {
                "media_text": "Specifications Model: WiMiUS P62 Light Source: LED Resolution: 1920 x1080P and 4K support Brightness: 500 ANSI lumens Bluetooth: Bluetooth 5.2 Network: WIFI 6+5G/2.4G Smart Screen Adaption: Auto Focus & Auto Keystone Speaker: 2x6W Projection Size: 30-300 inches Zoom 50%-100% Size/Weight: 10.2*7.8*4 inches/5.3lb Ports: 2*USB,2*HDMI,1*AV,1*3.5mm Audio Out What's More Brightness/Contrast/Saturation/Sharpness can be adjusted while playing videos via HDMI&USB Warm Tips: 1) Due to copy right protection, most of LCD Projectors do not support wireless mirroring contents from Netflix, Hulu, Disney etc. Please insert a TV Stick (Not Included) into our projector to enjoy wireless mirroring of these streaming services. 2) Dolby Sound is not supported, please turn off any Dolby sound settings on your connected devices or Apps.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7df2c758-d4db-4d99-96e7-8b7acd533a90.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4ad50a69-7627-40d3-8aca-b0d4f65c8a02.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/638461e9-cfa3-493c-9a14-a5576f525247.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/31c52a27-d439-462c-9dc2-32ba2e2d80b2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4e957325-680f-4e48-8687-983c5c704e0a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fe360678-32ad-4d1a-8307-ba465d4a5f0a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2602bd3e-514d-4a78-a328-28c2dac45ac6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Cal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZ2EEPVWYMGNCOSJ2P46QP3SWWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3W3B540B9ZJGK?ASIN=B0BTHDPTSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Great features for great price.",
                "reviewText": "I was looking for an inexpensive but feature rich project to use occasionally for movie nights in the bedroom. This projector absolutely fits that bill. I got it during prime day, however, I noticed that this company often has deals on their projectors.First of all, and most importantly, the picture quality is excellent. I just project onto my bedroom wall and it looks great. I’ve watched a few different things, from comedies to action, movies, and it all looks great. I’ve only used HDMI extensively, but I have also connected my iPhone to the projector wirelessly, and it worked well. Truly good high definition viewing. The colors are great, the images are sharp, and everything is smooth.The auto focus and Keystone feature is fantastic and works great. When you turn the project on it automatically does this for you and if it’s just a little off, there is a button on your remote with a plus and negative sign to dial it in just a little more. I’ve only done that maybe once, and it was such a minor change that it really didn’t matter. I’ve never had to worry about fixing the Keystone, though, he gets that perfect every time. Obviously, the built in speakers on as good as an external Soundsystem, but they work really well. I’ve connected my JBL Bluetooth speaker and it works really well and sounds really great with that. I would recommend you use an external speaker, especially if you’re watching something that really depends on loud volume, but if it’s just for casual, watching in your bedroom, the internal speakers are fine.The one thing I think people might be upset about is that you can’t watch Netflix on it if you connect directly from your phone. It’s a licensing issue. You can obviously connect your laptop with Netflix or Firestick, but you can’t use your phone and wirelessly connect to watch Netflix. This was mentioned by the projectors maker, so it wasn’t a surprise to me, but just keep in mind that you will have to use a computer or a Firestick if you want to watch Netflix.At the back, there are two USB inputs, to HDMI inputs, a socket for the AV adapter and an audio jack. The power cord plugs in at the side. On top, there are eight buttons, so if you lost the remote, you wouldn’t be completely ruined. It has the power on button, the four directional buttons, a button to take you back to the home, projector page, a back button, and an OK button. At the bottom of the projector there are four rubberized feet and a height. Adjustable twist stand to aim the project, a higher if needed.In the box, there is a really nice carry backpack, the power cord, a remote, AV cables, a HDMI, cable, a lens cover, a cleaning kit, and, of course a nice thick user manual. Everything was packaged really well and obviously it has everything you need right out of the box.Personally, I don’t think it runs too loud at all, it’s just got a small fan that deals with heat. Obviously, it’s not silent by any means, but it also isn’t too loud. The built-in speakers allowed enough to drown out the fan easily.Overall, it’s a great unit. Especially if you can get it under $200 like I did, it’s a really good deal. The picture quality plus the auto focus alone make this worth the price. Obviously, I can’t speak to the longevity of the projector, as I’ve only had it about a week, but it is well made from what I can tell, and just like anything, if you look after it, it’ll probably last longer than if you don’t. Great product.",
                "reviewVotes": "42 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manalo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHB5FV55HL2VZXGDZPBV3ZVNMZQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16EGVX51MC8NF?ASIN=B0BTHDPTSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Great picture quality and autofocus!",
                "reviewText": "This is my first time purchasing a projector. I like that it was pretty easy to set up and also easy to operate, it has a remote and you can connect through bluetooth which is very convenient. We have been using it for a few hours now with a 100 inch screen. The imagine quality, coloration and brightness is perfect. It's nice that you have an option to mount the projector or rest it on a coffee table.There's a 3 years warranty programm you can sign in for, don't miss this opportunity! I'd highly recommend this projector to anyone who cares about quality and conveniences.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ZachZach",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEQICE532OIYIGO3EWOLV3KKZXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28TZ1KX0CSQ6Z?ASIN=B0BTHDPTSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Does everything I need and more for daily use",
                "reviewText": "The media could not be loaded. I'm not by any means a frequent projector user, so this is one of 2 home projectors I've spent some time with. I've tested out a ton of apps and video types and inputs and I can say this passes the test for pretty much any typical user. Initially the device takes less than 20 seconds to boot up before it directs you to a simple and clean home page. From here I was able to change any picture or sound settings, select the input, connect wifi, Bluetooth, etc.The remote itself feels sturdy and the buttons have a nice click feel to them. A few times it didn't register a button press, but I presume this is because I'm normally a fast button clicker. The sound was only at 50% volume to start and I could tell it was loud and has some substance to it. I was impressed when I started playing some videos, I almost felt I could manage without an extra Bluetooth speaker for most occasions. Compared to my other projector, this unit has a more simple and user friendly interface, I didn't find it difficult at all to adjust picture settings or make manual adjustments. I'm sure if I had a child they could figure it out just as fastAfter exploring the settings, I messed around with the auto keystone and auto focus a bit. They're both fantastic features to have, however the auto keystone was giving me a little trouble since I was projecting on a 120\" screen in a room that should've been a little bigger. I kept the auto focus on and any time I accidentally touched the projector, it would do its thing and auto focus, pretty much as clear as I could get it. Obviously the manual fine tuning is still an option if you really wanted the control. I ended up turning off/resetting the trapezoid correction since it kept making the right side of the screen shorter than the left, and this resolved my issue, but I'll keep attempting in other environments.As I did with my previous projector, I connected a Roku 4K stick to the HDMI and plugged the USB into the USB slot on the projector rather than trying to find a second wall outlet to occupy. Still worked great for me and opened up more options for content rather than trying to mirror from my phone or attaching a laptop every time.All in all, the quality of the image and sound are fantastic, the build quality has nothing to complain about, and the software overall is just what I need. Playing YouTube videos allowed me to project a definition up to 1080p 60fps and this was excellent enough, especially with a totally dark room. Image quality can be subjective and can also depend on the input method, so from my point of view it was excellent for an affordable projector. Other than the auto keystone needing some extra practice in other rooms or screens, I've found the lens cap was a little tough to get back on when the auto focus moves the lens out further than the initial opening of the projector out of the box. This isn't a huge deal, there's a layer of styrofoam that protects the plastic cap and the glass lens, so I'm not totally uncomfortable if it's a little tight. I just ended up manually focusing the image to a point where the lens retracts far enough to fully place the lens cap back on. Again, not a huge inconvenience but something to watch for.Nothing is totally perfect but I would definitely recommend and purchase this again if I needed to, and I'll update keep updating if I find any changes",
                "reviewVotes": "41 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71VVtfsKwQL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71cStsozCaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71fuu1AYrtL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71wm0z2yMBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/816lW9QxtCL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/197ead40-53f8-49b3-b8a2-ce4dc7551a16/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Mohit Singh NegiMohit Singh Negi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBHEPICC7T5BA6MV3YMBEM2PWZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3N42E96N8DUL0?ASIN=B0BTHDPTSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "5.0 out of 5 stars The Best Projector in the price range..",
                "reviewText": "This projector has everything I need. The picture quality and the picture brightness is super. I really loved the auto focus and auto keystone feature. It’s so easy n convenient to use. The sound quality is also very good. A nice carry backpack is a bonus.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/715cLJNC8-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71xpPUT7VLL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sekhar KatreddySekhar Katreddy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 18, 2023",
                "reviewTitle": "Exceptional Performance and Value",
                "reviewText": "I have had the pleasure of using the WiMiUS P62 projector for nearly a month now, and I must say it has exceeded my expectations in every aspect. This review aims to highlight the key features that make this projector a standout choice, making it an excellent investment for both casual users and home theater enthusiasts.Ease of Use/Setup (5/5):Setting up the WiMiUS P62 was an absolute breeze. The user-friendly interface and straightforward setup process make it accessible even for those less tech-savvy. From unboxing to projecting my favorite content, the entire process was seamless and hassle-free.Autofocus Excellence (5/5):The autofocus feature on the WiMiUS P62 is nothing short of impressive. Say goodbye to the tedious task of manual focusing; this projector takes care of it effortlessly. The autofocus function ensures that the picture is consistently sharp and clear, allowing for a truly immersive viewing experience without any extra effort on the user's part.Excellent Picture Quality (5/5):The WiMiUS P62 delivers excellent picture quality that truly enhances the overall viewing experience. Colors are vibrant, and details are sharp, contributing to a cinematic feel, whether you're watching movies, playing games, or enjoying other multimedia content.Bright and Vibrant Projection (5/5):I tested the WiMiUS P62 on a 300\" display, projecting onto a wall, and the results were outstanding. The brightness of the image remained consistently high, even at such a large size. The colors were vibrant, and the details were sharp, creating a cinematic feel within the comfort of my home. I have yet to try it on a dedicated screen, but the performance on the wall alone has been more than satisfactory.Value for Money (5/5):One of the standout features of the WiMiUS P62 is its exceptional value for money. Given its competitive price point, the projector offers a plethora of features that rival more expensive models on the market. The quality of the image, combined with the ease of use and advanced autofocus, makes this projector a wise investment for those seeking a high-performance device without breaking the bank.Overall Recommendation:In conclusion, I wholeheartedly recommend the WiMiUS P62 projector to anyone in search of a reliable, user-friendly, and high-performance device. Whether you're a casual viewer or a dedicated home theater enthusiast, this projector delivers on all fronts. The ease of setup, autofocus excellence, excellent picture quality, bright and vibrant projection, and outstanding value for money make the WiMiUS P62 a top contender in its category. After a month of use, I am confident in endorsing this product as a fantastic addition to any entertainment setup.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/21UjdakZ4BL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/11wXGBWJ5aL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51scB9eyMmL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ravrav",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 21, 2022",
                "reviewTitle": "High quality Video.",
                "reviewText": "The media could not be loaded. The delivery is really quick, and the packaging is good. This is, as of right now, our top investment for the year 2022. The projector and the case are both of really high quality and the instruction handbook was really straightforward. Because setting up the projector is so simple, you can literally take it with you everywhere you go in this specially designed carrying case. For streaming movies and shows, the picture quality is better than average. An excellent and low-cost option for watching television on a large screen. Highly recommended, without a doubt.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61UewAFyESL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61mgTF+XQrL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/E1ltVVLDWiL.mp4"
                }
            },
            {
                "reviewerName": "fredaygfredayg",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 16, 2023",
                "reviewTitle": "Vidéoprojecteur Wimius",
                "reviewText": "Ayant déjà acheté un vidéoprojecteur de marque Wimius dans un cadre professionnel le 8 juin 2022, j'ai acheté ce modèle il y a une semaine pour un usage personnel. Déjà très satisfait du premier modèle, je suis encore plus agréablement surpris par la qualité de l'image même dans une pièce éclairée par les lampes ou par le soleil. Installé dans une chambre d'amis à une distance de trois mètres du mur, l'image fait environ 1.20m par 2m.La qualité et la luminosité sont vraiment irréprochables aussi bien en vidéo que en projection d'un PowerPoint.Fourni avec une housse de protection servant aussi de sac de transport. On trouve aussi les câbles d'alimentation et HDMI, la télécommande (qui fonctionne quel que soit la direction dans laquelle on la dirige ) .En ce qui concerne le mode d'emploi, je n'ai pas eu besoin de l'ouvrir tellement l'utilisation est simple.Le haut parleur est nettement suffisant pour une pièce de 12m². Le ventilateur fait vraiment peu de bruit et ne gêne en rien l'utilisation. Test fait avec une tour Bluetooth connecté en quelques minutes et c'est un résultat parfait.La mise au point se fait très facilement alors que la correction trapézoïdale se fait dans les menus.En conclusion, je suis vraiment très satisfait de cet achat et je reviendrai sans hésitation sur cette marque pour des prochains achats.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ZQmJvJuWL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Qbziy3s6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/614eRV1PF9L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71eBKpmqo-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Aqva4wKyL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ROItLdiLL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "HC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 11, 2023",
                "reviewTitle": "Eine gute Wahl für einen preisgünstigen Projektor mit guter Bildqualität und Funktionalität.",
                "reviewText": "Ich habe mich bewusst für den Beamer „Wimius K1, 1080p “ entschieden, da er sowohl in seiner Funktionalität als auch im Preis meinen Vorstellungen entspricht. Ich benötige den Beamer lediglich im privaten Umfeld für Vorträge, Reiseberichte oder Präsentationen zu Geburtstagen etc.. Dafür ist dieser Beamer ausgezeichnet geeignet. Das Preis-/Leistungsverhältnis erscheint mir auch, nachdem ich ihn ausprobiert habe, weiterhin sehr gut. Die Projektionsfläche kann in der Diagonalen Werte zwischen ca. 50 und 300 inches annehmen bei einem Abstand zwischen ca. 1,50 bis zu 7 m. Das Handbuch enthält eine Tabelle mit 7 Abstandswerten und den dazugehörigen Diagonallängen. Ich habe unterschiedliche Abstände zwischen 1,50 m und 5 m ausprobiert und jedesmal gestochen scharfe Bilder einstellen können.Der Beamer ist mit seinem Zubehör (3 Kabel: Strom, HDMI und AV) sehr handlich in einer Tragetasche untergebracht. Er hat 2 USB - und 2 HDMI Anschlüsse sowie eine Kopfhörerbuchse und einem AV-Ausgang.Der Beamer ist schnell einsatzbereit, die Handhabung ist überwiegend selbsterklärend. Inhalte von mobilen Endgeräten, die über USB mit dem Beamer verbunden werden, sind sofort sichtbar. WLAN und Bluetooth müssen aktiviert werden, alles geht schnell und unproblematisch. Für den Normalgebrauch reicht der interne Lautsprecher, dessen Lautstärke bequem über die Fernbedienung eingestellt wird. Übrigens gehören die Batterien (2 AAA) nicht zum Lieferumfang, man sollte sie also bereit halten. Über Bluetooth kann ein externer Lautsprecher oder ein Soundbar angeschlossen werden.Bei Bildern kann man unterschiedliche Filter wählen, um die Farbgebung der Originalfotos besser zu treffen.Smartphones (Android oder iPhone) werden nicht über Bluetooth mit dem Beamer verbunden sondern übers WLAN, es muss also sowohl beim Beamer als auch beim Smartphone dasselbe WLAN aktiviert werden.Die manuelle Keystone Korrektur kann bis zu ±50° eine trapezförmigen Projektionsfläche in eine rechteckige transformieren.Deckenmontage ist möglich, die zugehörige Aufhängung muss getrennt bestellt werden.Auch wenn die Bedienungsanleitung darauf hinweist, den Beamer im abgedunkelten Raum zu benutzen, ist er durchaus bei Tageslicht verwendbar.Die Bedienungsanleitung erzeugt auf Grund der maschinellen Übersetzung aus dem Englischen immer wieder Heiterkeit. Hier zwei Beispiele:„Verwenden Sie diesen Beamer beim Zeichnen des Vorhangs“die Fortsetzung des Satzes „oder in einem dunklen Raum“ gibt Aufschluss: „to draw the curtains“ bedeutet „die Vorhänge zuziehen“, „to draw a picture“ dagegen „ein Bild zeichnen“.Im Abschnitt „Verbindung mit Smartphones und iPad“ heißt es „Stellen Sie sicher, dass Ihr Mobilgerät für den Beamer geschlossen ist“, erst ein Blick in den Englischen Text bringt die Erleuchtung. Dort steht: „is closed“ statt „is close“, die Übersetzung „ist geschlossen“ ist somit korrekt, gemeint ist aber „befindet sich in der Nähe“Der einzige Kritikpunkt: Die Lüftung erscheint mir recht laut, aber da habe ich keinen Vergleich.Zusammenfassend: Der WiMiUS 1080p-Projektor ist eine gute Wahl für alle, die einen preisgünstigen Projektor mit guter Bildqualität und Funktionalität suchen. Er verfügt über 2x HDMI, 2x USB-A und 1x 3,5 mm Aux-Anschluss.Ich kann den Kauf nur empfehlen und gebe dem Beamer 5 Sterne.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Prometheus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 2, 2023",
                "reviewTitle": "Super Preisleistungs Verhältnis",
                "reviewText": "The media could not be loaded. Toller kompakter Projektor mit gutem Preisleistungs Verhältnis. Ich habe mir diesen Projektor gekauft um für meine Kinder Bilder und Videos an die Wand projizieren zu können. Meine Kinder sind total begeistert die Bildqualität ist absolut in Ordnung und die Helligkeit ist auch gut.Der Projektor kommt in einer praktischen Tasche in der das Gerät und die Kabel gut verstaut werden können.Bedienung sowie die Verbindung mit dem Handy war kein Problem und funktioniert gut.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/D11zVf1KBqL.mp4"
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$289.79",
                "sellerName": "Rui Direct us",
                "sellerRating": "5"
            },
            {
                "price": "$289.99",
                "sellerName": "Kuenzi Connections",
                "sellerRating": "0"
            }
        ]
    }
}