{
    "remaining_requests": 39378,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Theater-Projector-Courtyard-Standard-110V-240V/dp/B08ZPX5G43",
    "body": {
        "name": "Mini Projector, Portable Projector for Cartoon, 1080P Video Projector for Home Theater, Smart LED Small Home Projector, Movie Projector Compatible with Laptop HDMI USB VGA AV and Remote",
        "price": "$35.22",
        "originalPrice": "$37.94",
        "rawPrice": 35.22,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Theater-Projector-Courtyard-Standard-110V-240V/dp/B08ZPX5G43",
        "soldBy": {
            "sellerID": "A3ANPSAKKHEH2F",
            "name": "Folanda-US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3ANPSAKKHEH2F&asin=B08ZPX5G43&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/314IAtMmQpL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/510 IBpOssL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411bvlP4eOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411dA1saylL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41o0GhqHlcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41uDsfEqq6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ABzrTN0lL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Jiawu",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=Jiawu"
        },
        "brand": "Jiawu",
        "merchantInfo": "Folanda-US",
        "customerReview": "3.3 out of 5 stars",
        "customerReviewCount": 5,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 11 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Mini Private Home Theater: Mini video projector is small and portable, and can be carried in a pocket or bag. Even children can hold it easily. Movie projector allows you to enjoy movies, videos, games in dark environment, no matter at home or outside for courtyard, travel, camping, etc. It's your great private theater!",
            "1080P HD Video Projector: Portable projector support 720P, 1080P display, allows you to enjoy clear and images and videos in a large screen. 1500lm High brightness delivers stunning true color presentations, stands out in abundant color and details displaying. Improve the brightness and color saturation of the projected picture to make the picture clearer and more comfortable (dark room is better).",
            "Best Viewing Experience: LED projector supports for manually adjusting focus, you can freely adjust the aspect ratio from 16 : 9 to 4 : 3, and allows up to 1.5‑2.0 meters projection distance. When viewed from a distance with a mini portable projector, it can project a24-60in inches.",
            "Multiple Input Interface: Small projector support HDMI, AV, VGA, USB, and small memory card input, it can be easily connected to multiple media devices, such as TV box, laptop, desktop computer, digital camera, HDMI enabled devices and more, so that you can enjoy videos in various ways.",
            "Children: Mini projector is a must-have product for children to watch cartoons and videos, which is very popular with children. It’s like a mini TV for kids that can be used as a picture projector or a story projector. Keeping children away from mobile phones and tablet can protect children's eyes. Order and enjoy it!",
            "Best Viewing Experience: Supports for manually adjusting focus, you can freely adjust the aspect ratio from 16 : 9 to 4 : 3, and allows up to 1.5‑2.0 meters projection distance."
        ],
        "description": "Features:Mini Private Home Theater: Small and portable design makes it easy to carry for travel, allows you to enjoy movies, videos, games in dark environment, no matter at home or outside for courtyard, travel, camping, etc.Support 1080P high definition Displaying: Support 720P, 1080P display, allows you to enjoy clear and images and videos in a large screen.1500lm High Brightness: delivers stunning true color presentations, stands out in abundant color and details displaying.Multiple Input Interface: Support HDMI, AV, VGA, USB, and small memory card input, it can be easily connected to multiple media devices, such as TV box, laptop, desktop computer, digital camera, HDMI enabled devices and more, so that you can enjoy videos in various ways.Best Viewing Experience: Mini LED Projector supports for manually adjusting focus, you can freely adjust the aspect ratio from 16 : 9 to 4 : 3, and allows up to 1.5-2.0 meters projection distance.Using 30 thousands hours of long life LED light source, which is harmless and no radiation, environmental-friendly and durable to use.Multiple media formats supported: Supports most of audio, video and image formats, enriches your viewing experience.Pretty and Elegant Looking: Super mini size, coating with two different colors, a beautiful decoration for your room.Specification:Multimedia Interface:1 x HDMI1 x USB1 x AV1 x VGA1 x Small Memory Card1 x 3.5mm Earphone PortPackage list:1 x Projector1 x Remote Control (NOT includes battery. )1 x Power Adapter (US/ EU/ UK/ EU)1 x AV Cable1 x User ManualNote:Please note that the new type and old type of this product will be sent randomly, and make sure you will not mind before ordering.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎Jiawu"
            },
            {
                "name": "Item Weight",
                "value": "‎15.5 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎7.68 x 7.09 x 3.15 inches"
            },
            {
                "name": "Color Name",
                "value": "‎U.S. standard (110V-240V)"
            },
            {
                "name": "Special Features",
                "value": "‎Portable"
            },
            {
                "name": "ASIN",
                "value": "B08ZPX5G43"
            },
            {
                "name": "Customer Reviews",
                "value": "3.3 3.3 out of 5 stars 5 ratings 3.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,370 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "April 3, 2022"
            },
            {
                "name": "Brand",
                "value": "Jiawu"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "家庭影院"
            },
            {
                "name": "Special Feature",
                "value": "Portable"
            },
            {
                "name": "Connectivity Technology",
                "value": "VGA, USB, HDMI"
            },
            {
                "name": "Display resolution",
                "value": "1920 x 1080"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Richard FaulknerRichard Faulkner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ4MA65UIQCQ2ZGTZ26E4FJHSPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GOCU9GY2TJ0U?ASIN=B08ZPX5G43",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "1.0 out of 5 stars There's a very good reason for this projector being CHEAP! Upside Down And Backwards Menus ?",
                "reviewText": "It is very difficult to hide my disappointment in this purchase. I knew the projector was cheap, and I'm well aware of the adage, \"You get what you pay for!\", but this, if it were not so unbelievably sad would be truly laughable.First thing I noticed was that the \"User Guide\", (It equals about 1/3 of a sheet of standard paper), was in a terrible state by being torn and becoming loose at the folds. This contributed to my ever growing suspicion that this unit was a \"return\" which SHOULD have been but had NOT been \"refurbished\".The \"Upside Down and Backwards\" comment is not a joke. (See picture) In addition, I'm not really sure what language in which it is written and I have yet to discover how to select a language.The buttons on the remote only work \"intermittently\".The unIt does register as reading a USB stick, but so far I have found no way to access it. All efforts to select the buttons on the projector or the remote fail to provide any action beyond moving the highlight on the projection. Of course, part of this may be because I'm trying to navigate the display upside down and backwards...The projected image displays correctly only if the projector is placed upside down. The projection does present in the correct orientation when projected onto a screen as a rear screen projection and if the projector is upside down. So, if I were capable of standing on my head and somehow looking out of my backside this unit would work for me just fine!The unit runs HOT. VERY hot! Ironically, it makes a SIZZLING noise as if some circuit inside is beginning to fry after only a few minutes of attempting to operate the unit. So maybe there is a valid reason for the unit running hot.If anyone is considering this unit, I'd highly recommend investigating other units.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61uGwjyeCzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pino",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSIF3KTGXIJKWX5VTSUHBSKP7FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30U9P31T3HZRO?ASIN=B08ZPX5G43",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "3.0 out of 5 stars Good for kids",
                "reviewText": "It was ok just not quite what I wanted. Good for cartoon’s",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}