{
    "remaining_requests": 39380,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Projector-Screen-100inch-Portable-Projection/dp/B09JC48GKN",
    "body": {
        "name": "Projector Screen and Stand,Large Indoor Outdoor Movie Projection Screen 4K HD 16: 9 Wrinkle-Free Design for Backyard Movie Night Easy to Clean, 1.1Gain, 160° Viewing Angle & A Carry Bag (Screen-100ST)",
        "price": "$69.99",
        "originalPrice": "$69.99",
        "rawPrice": 69.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Projector-Screen-100inch-Portable-Projection/dp/B09JC48GKN",
        "soldBy": {
            "sellerID": "AZ4FZ4E59MEHC",
            "name": "LEJIADA",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AZ4FZ4E59MEHC&asin=B09JC48GKN&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BD4L556M"
        ],
        "asinVariationValues": [
            {
                "asin": "B09JC48GKN",
                "variationName": "Model",
                "variationValue": "Screen-100ST",
                "price": "$69.99",
                "variationImageURL": ""
            },
            {
                "asin": "B09B8SXDRZ",
                "variationName": "Model",
                "variationValue": "Screen-120ST",
                "price": "$89.99",
                "variationImageURL": ""
            },
            {
                "asin": "B09B8R6X6W",
                "variationName": "Model",
                "variationValue": "Screen-150ST",
                "price": "$119.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CHVW1ZCS",
                "variationName": "Model",
                "variationValue": "Screen-180ST",
                "price": "$249.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "11",
        "stockDetail": "In Stock",
        "couponInfo": "Save 10%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51fLv3CPaqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51LxM9ZPqwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mi0FidKIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515aDYPU1oL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VhGfP5bKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/617K227NLhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91PxLZ30q8L.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a97f26fb-7db6-4fdf-ab6a-ad0bce60ef5a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1409127b-56c0-4dd7-9ee9-a7aba9d0079f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/275610a4-eb8c-4d94-8197-18793b7a15dc/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8f2990a6-c630-49d0-9627-151b399abb2d/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the lejiada Store",
            "link": "https://www.amazon.com/stores/lejiada/page/B146EE3F-AC0E-4F1C-B14E-D1472D5C012A?ref_=ast_bln"
        },
        "brand": "lejiada",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1434,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 17 hrs 48 mins",
            "FREE delivery Sunday, February 18. Order within 4 hrs 3 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Excellent Projection Display: This 100inch Movie Projector Screen with Stand, 16:9 Aspect Ratio, and 160 Degrees wide Viewing Angle. The Portable Projector Screen will Become your Projector and your Best friend. The Movie Projector Screen is Designed to Provide Clear, High-resolution images, Rich colors, and an excellent viewing experience in different viewing positions.",
            "Innovative Design: This Projector Screen High Quality Steel Retractable Tripod Stand, more Convenient to Carry, More Stable to use. With the upgraded Projection Screen, your Viewing Experience is Guaranteed Even in Windy Conditions.",
            "High-quality Accessories: The telescopic design of the Projector Screen with Stand bracket is made of high-quality steel pipes, and the surface is rust-proof paint, so there is no need to worry about rust and bending. The buckle structure is matched with the eye nuts to make the overall support more stable. The triangular structure and the attached fixed accessories further enhance the user experience.",
            "Lightweight and Portable: Our projector screen with stand weighs 11.3 pounds and takes up less space, making it is easy to carry and pack both indoors and outdoors, providing an excellent audio-visual experience for you and your family anytime, anywhere. It is the perfect gift choice for birthdays, holidays and anniversaries.",
            "After Service:This product is equipped with a 16:9 HD projection screen 1*Projector Screen, 2*tripods, 1*Storage bags, And we provide professional customer service, you can contact us with any questions about this product, we will answer your questions within 12 hours."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Television & Video",
                "link": "https://www.amazon.com/Televisions-Video/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1266092011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/TV-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3230976011"
            },
            {
                "name": "Projector Accessories",
                "link": "https://www.amazon.com/Computer-Video-Projector-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1232269011"
            },
            {
                "name": "Projection Screens",
                "link": "https://www.amazon.com/Video-Projection-Screens/b/ref=dp_bc_aui_C_5?ie=UTF8&node=1286610011"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "8.8 pounds"
            },
            {
                "name": "ASIN",
                "value": "B09JC48GKN"
            },
            {
                "name": "Item model number",
                "value": "Screen-100ST"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,434 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#141 in Projection Screens"
            },
            {
                "name": "Date First Available",
                "value": "October 15, 2021"
            },
            {
                "name": "Manufacturer",
                "value": "lejiada"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Mounting Type",
                "value": "Tripod Mount"
            },
            {
                "name": "Product Dimensions",
                "value": "87\"W x 79\"H"
            },
            {
                "name": "Material",
                "value": "Alloy Steel"
            },
            {
                "name": "Display Dimensions",
                "value": "100 inch"
            },
            {
                "name": "Brand",
                "value": "lejiada"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "1)No tools needed, extremely easy to assemble and disassemble. 2) Portable and convenient to carry with the zipper bag included. 3) Strong light absorbance, fully restored image's color saturation. 4) Active 3D and 4K Ultra HD, decent size 16:9 aspect ratio. 5) 1.1 gain, 160°wide angle for all-round viewing, you can enjoy a pleasant watching experience from any position you like. 6)The frame is durable for freestanding in light wind for outdoor use.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e3198714-a8ef-46b1-9fd9-59d9f1715963.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "100-inch/120inch and 150inch projection screen with stand the perfect addition to your home theater, business, sports bar, or event space! With our large projection screen, you can bring the cinema experience to your living room for movie nights, streaming movies and TV shows, and gaming. Imagine immersing yourself in your favorite games and movies on a massive screen, with crisp and clear visuals that bring your entertainment to life. For businesses and educators, our projection screen is the ideal tool for presentations, meetings, and classrooms. Our large screen ensures that your audience can see your content clearly, and the 16:9 aspect ratio is perfect for displaying widescreen presentations and videos. If you're a sports fan or fitness enthusiast, our projection screen is a must-have. Watch sports events on a massive screen with other fans at sports bars or venues, or take your fitness classes and workouts to the next level with larger-than-life visuals that keep you motivated. Our projection screen is also perfect for weddings and receptions, outdoor movie screenings, concerts, and festivals. With a large screen that ensures everyone can see the content clearly, our projection screen is the perfect addition to any event or gathering. And for art and culture enthusiasts, our projection screen is perfect for displaying multimedia content in museums, exhibitions, and art installations.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a2ff91e-413d-477a-a91b-907cb34584ec.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Outdoor movie nights: A 150-inch projection screen can create an outdoor cinema experience, particularly in larger outdoor spaces such as parks or beaches. Home theaters: A 150-inch projection screen can provide an immersive cinematic experience in a home theater setup. Conference rooms: In a conference room, a 150-inch projection screen can help to ensure that everyone in the room can clearly see presentations, graphs, and other important information.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/49e75bdc-8aa9-4314-bdcd-fd5585312e7a.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "100 inch projector Portable: lightweight and easy to carry design. Easy to install: Easy to understand installation method, no expertise or tools required to install. Versatility: Compatible with a wide range of projection devices, such as portable projectors, TVs and computers. Space saving: compact design with small footprint for small spaces. Easy to maintain: The stand and curtain are easy to clean and maintain, and the device is always in top working condition. Reusable: Made of high quality materials, durable and reliable, reusable, saving users' cost. 120 inch projector Adjustable: adjustable stand height and angle to suit different projection needs. more Stability: Stable design to keep the projection device stable. 150 inch projector The portable projection stand screen brings you unlimited possibilities.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c4863c35-3b0b-4167-bc05-06118ef2e3b4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/056d6b1a-c02c-4703-bf0b-efbbb325a41e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2171e0b1-f0b3-4ab7-bef5-2ff09b685c2c.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "portable projector screen 100inch antilight projector screen 100inch antilight portable projector screen projector screen with 120 projector screen with 150inch projector screen 120 inch Size 100 inch 120 inch 100 inch 84 inch -small 120 inch-large 100 inch",
                "media_link": []
            },
            {
                "media_text": "Large-scale business presentations: A 150-inch projector screen is suitable for use in large-scale business presentations, where it can provide a clear and impressive display of business content. Educational institutions: Educational institutions such as universities and schools can use a 150-inch projector screen to provide a clear and engaging display of educational content to students. Movie theaters: A 150-inch projector screen can provide an immersive and cinematic experience for moviegoers in a movie theater setting. Sports events: Sports events such as live broadcasts of football games or tennis matches can benefit from the use of a 150-inch projector screen to provide a clear and engaging display of the action. Concerts and performances: In a concert or performance setting, a 150-inch projector screen can provide a clear and impressive display of the performers and their art. Tourist attractions and exhibitions: In tourist attractions and exhibitions, using a large screen can better showcase the features of the attraction or the details of the exhibition. Large gaming arenas: Using a 150-inch projector screen in large gaming arenas can enhance the excitement and atmosphere of the games for participants and viewers alike. Hotels and conference centers: Using a large screen in hotels and conference centers can display conference schedules and speaker content, helping to ensure smooth conference proceedings. Large shopping malls and squares: In large shopping malls and squares, using a 150-inch projector screen can attract attention and provide special promotions or advertising information. Home theaters and entertainment rooms: In home theaters and entertainment rooms, using a 150-inch projector screen can enhance the viewing experience and provide a better entertainment effect for family members. Large religious events: In large religious events, using a 150-inch projector screen can help participants better understand and experience religious rituals and culture.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6bf4d426-1650-45d6-8056-97937143d02f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Portable projection stand screen brings you unlimited possibilities. Trade shows and exhibitions: In large venues such as trade shows and exhibitions, a 150-inch projection screen can help to attract attention and create an impact for marketing and promotional material. Large events: For large events such as concerts, festivals, and sporting events, a 150-inch projection screen can provide a big screen experience for viewers who are further away from the main stage or playing field. Educational settings: In classrooms or lecture halls, a 150-inch projection screen can help to ensure that all students can see and read information clearly, especially for large classes. Virtual meetings and webinars: In virtual meetings and webinars, a 150-inch projection screen can help to create a more engaging and immersive experience, especially for remote attendees. Gaming rooms: A 150-inch projection screen can create a truly immersive gaming experience, particularly for games with large environments or cinematic cutscenes. Museums and galleries: In museums and galleries, a 150-inch projection screen can be used to display large-scale artworks or multimedia exhibits. Product launches: A 150-inch projection screen can help to showcase new products or services in a visually impactful way, particularly for products with large or detailed features. Sporting events: In outdoor venues such as stadiums or arenas, a 150-inch projection screen can provide a larger-than-life experience for viewers who are further away from the action. Concerts and performances: A 150-inch projection screen can provide a stunning visual backdrop for live music performances or theatrical productions. Houses of worship: In houses of worship, a 150-inch projection screen can be used to display lyrics, scriptures, or visual aids during services or events.",
                "media_link": []
            },
            {
                "media_text": "Portable projection stand screen brings you unlimited possibilities. Trade shows and exhibitions: In large venues such as trade shows and exhibitions, a 150-inch projection screen can help to attract attention and create an impact for marketing and promotional material. Large events: For large events such as concerts, festivals, and sporting events, a 150-inch projection screen can provide a big screen experience for viewers who are further away from the main stage or playing field. Educational settings: In classrooms or lecture halls, a 150-inch projection screen can help to ensure that all students can see and read information clearly, especially for large classes. Virtual meetings and webinars: In virtual meetings and webinars, a 150-inch projection screen can help to create a more engaging and immersive experience, especially for remote attendees. Gaming rooms: A 150-inch projection screen can create a truly immersive gaming experience, particularly for games with large environments or cinematic cutscenes. Museums and galleries: In museums and galleries, a 150-inch projection screen can be used to display large-scale artworks or multimedia exhibits. Product launches: A 150-inch projection screen can help to showcase new products or services in a visually impactful way, particularly for products with large or detailed features. Sporting events: In outdoor venues such as stadiums or arenas, a 150-inch projection screen can provide a larger-than-life experience for viewers who are further away from the action. Concerts and performances: A 150-inch projection screen can provide a stunning visual backdrop for live music performances or theatrical productions. Houses of worship: In houses of worship, a 150-inch projection screen can be used to display lyrics, scriptures, or visual aids during services or events.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e3198714-a8ef-46b1-9fd9-59d9f1715963.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a2ff91e-413d-477a-a91b-907cb34584ec.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/49e75bdc-8aa9-4314-bdcd-fd5585312e7a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c4863c35-3b0b-4167-bc05-06118ef2e3b4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/056d6b1a-c02c-4703-bf0b-efbbb325a41e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2171e0b1-f0b3-4ab7-bef5-2ff09b685c2c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1d2c83da-be00-454c-9d9c-3cb65235693e.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8cb42d77-db0c-48df-a503-fba4ce6004ae.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d2fe9787-76a9-4d78-bbb9-1026022dc394.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/11397dc5-e992-450c-a2a4-da9ab70a4d57.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/826cc37a-0e58-42d3-9a27-87e5764ab3a8.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/31f6a65a-9359-4146-9799-b0ae5a8fc167.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6bf4d426-1650-45d6-8056-97937143d02f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MoniromMonirom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHFDUQNTNTQSXQLHLZPASR3B3QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R80I5XAP167QW?ASIN=B09JC48GKN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars This Screen (150in) is HUGE. Best bang for the buck.",
                "reviewText": "The media could not be loaded. This is my third screen, all from different manufacturers and for the price I am extremely pleased. So much so that I'm thinking of buying a second to use as my mobile/portable screen so I can leave this one permanently assembled indoors. However, this is not a screen that can be left out in the rain or exposed to the elements for extended periods of time. One thing I did like very much about this brand is that the extending tripods feel sturdier than others I've bought and the poles are a heavier guage steel. It is easier to assemble with two people but not impossible for a single person to erect on their own. To assemble on your own just slot the crossbar through the screen and connect it to the tripods at half-height. Then slowly extend each vertical pole 12 inches at a time switching between the two. For indoor use if you don't have high ceilings you can shorten the height by not fully extending the last section of the poles. There is a little give on the top crossbar but that's expected since it's constructed of 5 interlocking sections that span almost 14 feet. The first time you put this together you'll be amazed, people forget a 150 inch image area is 12 and 1/2 feet. Though the screen does not come with weighted bags, you can purchase those from Photography Supplies. This will help with ensuring the screen doesn't tip inlight winds when used outside. The stakes and cords supplied would work as well but you need to attach those at an angle as if you were pitching a tent.For me this was a great value for money. The screen is reflective and really highlights the projected image. For reference I'm using a Nebula Mars 3 projector with 1000 ANSI Lumens and a 1080p resolution. The screen is wrinkle resistant, pulls tightly and adjusts via Velcro straps, providing a much better image surface than the photo backdrop or other screens I've tried. I did not have the same build quality issues others have experienced but I can only assume the manufacturer has been listening to feedback and improving their product. Really this is the best bang for the buck. I would buy this again.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/614oXmf9IEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61QeshuvUrL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71GNERBmAXL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d24f4368-953b-4090-a641-afbbb545db43/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "L. Radley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFB3RY3DLNMAZDGHVXQQRHW74LAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDMCNJP6H3J7?ASIN=B09JC48GKN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy setup and takedown",
                "reviewText": "Great 150\" screen, sturdy, easy to assemble and take down and stores nicely in a carry case provided. Comes with ropes and stakes to keep it stable if it is a bit breezy (as it is like a giant sail!). Projector picture looks great on it as well, even a cheap projector.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Candi Corona",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFR46KYJSWIFFDOJZHI7SOH3QDZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VICNG21TN2R4?ASIN=B09JC48GKN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Easy setup and take down",
                "reviewText": "This screen is very big, which is perfect for us. The first night there was zero wind and it stood well on its own no teachers used. It definitely requires two people to setup because of its size and design. The second time we used there was a slight breeze and teachers were necessary as it falls very easily with and wind. The frame is not as sturdy as I had hoped and if you are not careful I could see it becoming damage. I think it could have been designed with a middle support. The screen its self is fantastic very light weight and can be used with either front or back projection. I am ok with our purchase but hope the company can improve some of the frame features",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVVXAJNU2WDBYUTVKYQJPID72HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SYAGUI7ROJXZ?ASIN=B09JC48GKN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Great customer support",
                "reviewText": "I had this review for just about a year and it started tearing. I used it 2-3x a week to present at schools. I contacted customer support and they sent me a new one right away. There is a bit of wrinkling but if you position it properly it helps straighten it out. Overall, I'm happy with this as an affordable option for my presentations.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen HKaren H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUB6BXKH2STGWIK55KCJYXVZR2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16528GJ7J7D3R?ASIN=B09JC48GKN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Functional",
                "reviewText": "Screen is tight. Easy to put up. Definitely need 2 people to set it up. Works great. Looks great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71AdpfwUM9L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mitchell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPD4UDWV7DZX2OSLZINNEK2QG3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RENVY90ARLF73?ASIN=B09JC48GKN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars School",
                "reviewText": "We bought this for our daughter’s school. The IT department was very impressed with how easy it was to set up. The teachers were impressed as well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffany Bergonzoni",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ5KELDSXPKESNCL56KVE3EFO4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLTBSWJIX2BZO?ASIN=B09JC48GKN",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2023",
                "reviewTitle": "1.0 out of 5 stars Definitely not as described (not useable outside)",
                "reviewText": "This is flimsy. The screen fell over even with the provided tiedowns. At best, this could be used inside a room with no air flow. I am completely disappointed and Amazon should require this product to be relabeled. You can not use this outside anymore than you can stand in a lightening storm with a copper rod held into the air (as in it can be done but should not and would be dangerous). I would appreciate a refund.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HugoHugo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOJJJRSTBRPWAUQDSIE7LYPNBCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AW6WBW6FB1L?ASIN=B09JC48GKN",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "3.0 out of 5 stars Came damaged",
                "reviewText": "The screen is pretty sturdy and easy to set up. However, one of the stands came damaged with a bent leg right out of the box.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61N3orXXRaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81b6NG+znrL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Studio Man",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 11, 2023",
                "reviewTitle": "Church Screen",
                "reviewText": "We purchased this screen to replace the other 100 wrinkled screen for our church sanctuary. Still tweaking the stands but the image is stronger more detailed less the old unsightly wrinkles.In much needed time for the Advent and Christmas season.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nikolas A.Nikolas A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 5, 2024",
                "reviewTitle": "Super Leinwand 👍🏼",
                "reviewText": "Die Projektor Leinwand ist eine solide Wahl. Stoff ist Gut Verarbeitet und nicht Durchsichtig was für eine klare Projektion Beiträgt. Der Aufbau gestaltet sich unkompliziert und leicht, was die Handhabung angenehm macht. Wenn Sie eine einfache und zuverlässige Leinwand suchen, die ihren Zweck erfüllt, könnte die Projektor Leinwand die richtige Wahl sein.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61BFw8ogyaL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sebastian Allerhed Garcia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on December 19, 2023",
                "reviewTitle": "Bästa",
                "reviewText": "Den är lätt att montera och demontera. Bra bild för våra familjerfilmer!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "IvánIván",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 26, 2023",
                "reviewTitle": "Fácil de montar y muy portátil.",
                "reviewText": "Pantalla extraportátil y muy fácil de montar. Incluso para una persona sola, solo añadir que para moverla mejor entre dos personas debido al tamaño. Muy recomendado para eventos o lugares donde haya que proyectar y posteriormente recogerlo. Tamaño más que suficiente y misma calidad de tela que las de precios superiores.Lo mejor de todo los trípodes de sujeción, que le dan más estabilidad que las típicas que vienen con patas metálicas.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/811YP5GGqWL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Rx-Df+chL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "stephanie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on July 19, 2023",
                "reviewTitle": "Très pratique",
                "reviewText": "Simple effice pas trop lourd stable et facile à installer et démonter... top",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}