{
    "remaining_requests": 39327,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Portable-Projector-Bluetooth-WiFi-Phone/dp/B09BZFCWMH",
    "body": {
        "name": "2023 Upgrade Mini Portable Projector with WiFi and Bluetooth for Outdoor Movies, 13000 LUX 1080P HD Video , Compatible w iPhone, TV Stick,PS4,HDMI, Laptop Proyector",
        "price": "$69.99",
        "originalPrice": "$79.99",
        "rawPrice": 69.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Portable-Projector-Bluetooth-WiFi-Phone/dp/B09BZFCWMH",
        "soldBy": {
            "sellerID": "A2NRVJPX6ZZOX2",
            "name": "SalangeDirect",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2NRVJPX6ZZOX2&asin=B09BZFCWMH&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09LS63LQM"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51LLo3psI7L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41qz6mLOA7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HgNY25rUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qi8La8DcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NdoHue3-L.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Salange Store",
            "link": "https://www.amazon.com/stores/Salange/page/10BB4C93-CED2-4B9A-A8AA-3F259CE23706?ref_=ast_bln"
        },
        "brand": "Salange",
        "merchantInfo": "SalangeDirect",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 332,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 5 hrs 25 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "[ SMALL PROJECTOR PORTABLE with EXCELLENT PERFORMANCE ] This outdoor movie projector adopts the latest 4.3 LCD display technology with advanced LED light sources, featured with a high brightness rating of 13000L. 1080P Full HD resolution supported and 10000:1 contrast ratio ensures picture clearer, more delicate. Mini portable body design can be carried anywhere, perfect for backyard, travel or camping movie night,video gaming,outdoor Christmas video carnival, yoga video teaching.",
            "[ BLUETOOTH PROJECTOR with HiFi SOUND ] One price, two experiences. The sharp image of the hd video projector can fully satisfy your visual enjoyment, and not just that, it is also a Bluetooth-Speaker with a built-in dual 5W Hi-Fi speaker. You only need to turn on the Bluetooth mode of your smartphone to easily connect to this phone projector. At this time, it will be a perfect music player. Even if the volume is turned up, the sound quality is still loud and realistic.",
            "[ EASY WiFi CONNECTION ] The wifi projector small is compatible with your Android / iPhone / Laptop ( Win 10), with no hassle of extra adapters and dongles, only a one-time Wifi connection is needed to sync the smartphone screen for enjoying 50-300 inch large viewing experience.（Watching the movie on Netflix, Amazon Prime Video, Hulu, only via connecting the laptop, fire tv stick, Roku, or Chromecast due to app copyright.）",
            "[ MULTIPLE DEVICES WIDE CONNECTION ] Equipped with HDMI, USB, and AV interfaces, this home theater projector is compatible with Amazon Fire Stick TV, iPad, Chromecast, Xbox, Roku, TV Box, PS4/PS5, PC, laptops, tablet, external speakers, DVD player, media players to play video, photo sharing and games, etc.",
            "[ ADVANCED COOLING SYSTEM & 3 YEAR WARRANTY ] Updated an advanced silent cooling system with double fans running simultaneously. Adopt the latest Led-tech to minimize lamp power consumption to extend the useful life of the lamp up to 80,000 hours. Salange team tries our best to offers every customer 100% satisfaction and lifetime technical support."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎Salange"
            },
            {
                "name": "Item Weight",
                "value": "‎3.74 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎5.9 x 6.1 x 6.3 inches"
            },
            {
                "name": "Item model number",
                "value": "‎HY300UK"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Color Name",
                "value": "‎White"
            },
            {
                "name": "Special Features",
                "value": "‎Wireless, Portable, Built In Wi Fi"
            },
            {
                "name": "Speaker Type",
                "value": "‎Built-In"
            },
            {
                "name": "ASIN",
                "value": "B09BZFCWMH"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 332 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,104 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "October 6, 2021"
            },
            {
                "name": "Brand",
                "value": "Salange"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Gaming"
            },
            {
                "name": "Special Feature",
                "value": "Wireless, Portable, Built In Wi Fi"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Display resolution",
                "value": "1280 x 720"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Wifi Movie Projector with built-in Bluetooth Speakers Salange Wifi Bluetooth Projector Built-in Bluetooth Signal Receiver, Support Wireless Connect to Your iPhone and Android Phones, that is a professional Bluetooth Speaker. This home theater projector with a 13000 Lux brightness, 10000:1 dynamic contrast ratio, and 16.78 Million colors, the picture quality is natural, and closer to real life. Small Projector is allowed to Projection 50-300''Large Screen， Compatible with Amazon Fire TV Stick, Chromecast, Xbox, Roku, TV Box, PS4/5, laptops, tablets, external speakers, DVD player, media players, etc. Portable Design can be carried anywhere, perfect for backyard, travel or camping movie night, Halloween Entertainment use, outdoor Christmas video carnival, and yoga video teaching. Warm Tips: *The red button on the top of the remote control switches the Bluetooth mode, and long presses for 3s to turn off the projector. *This projector does not have a built-in battery and must be connected to a power source at all times. *The external speaker can't be connected via Bluetooth.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/52aecfc7-0551-4a2a-85d8-39449d389d1d.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "The projector and Bluetooth speakers are combined into one, saving you money. Not just a portable projector, it also can be used as a Bluetooth speaker, Select the projector's Bluetooth mode, pick up your smartphone and turn on the Bluetooth function, easily pair the Bluetooth speaker projector successfully. Choose the song or music you are interested in, a family concert begins. The newly upgraded high-quality built-in Speaker with Hi-Fi Sound, which fully meets your listening enjoyment. Two loudspeakers are distributed on the left and right sides of the projector, and their volume is 3-4 times that of other projectors. Even if you turn it to the maximum volume, it will not emit the harsh noises of other LCD projectors. In addition, if you use it as a projector to watch movies, whether in a large room or in an empty backyard, you don’t even need to connect additional speakers to enjoy a high-quality movie night. Note: When the outside projector is used as a Bluetooth speaker, it will not mirror the text or image of your phone screen. The led lamp will automatically turn off, so you will not be disturbed by any projection light. (Bluetooth technology is not used on projectors or other devices to transmit image signals.)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/62221fd6-a887-4e6a-9388-247b4213e0a9.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Excellent Performance 13000 LUX Higher Brightness （Upgrade）: Adopting the most advanced LED lamp technology with a 4.3'' Lcd display Tech and eye protection LED light source, Salange portable WiFi Projector has an amazing +30% brightness gain and a brightness up to 13000Lux. It is bright enough to project a clear image at dusk onto a white wall or a projector screen. Image Clarity: The iPhone projector delivers fantastic image clarity, outstanding color accuracy, and sharp image detail fitting home and outdoor movie use. Enjoy smooth colors with no obvious image graininess. Enjoy a high-level immersive home movie theatre experience with your family or friends. 10000:1 High Contrast Ratio: This HD projector with a 10000:1 high contrast ratio. And the higher the contrast ratio, the better the image color will be, so the shadow or black detail of the image is more clear, which increased the dimension and readability of the picture, and provides you with a real, dynamic, and vivid image quality. Up to Max 300\" View Go big with the home projector 300\" picture for that true home cinema . The better viewing size recommend is 100''-120\" and the best viewing distance between the projector and the screen should between 4.3ft to 16.7 ft. Let's begin to share happiness with your family, lover, and friends. Note: This outdoor and indoor projector is mainly used for home theater, NOT RECOMMENDED for a large conference, teaching activity, or commercial usage. Recommend use it in a dark environment for better effect. Don't expect to use this projector outdoors in broad daylight because the picture will disappear, but once the sun goes down, it will work perfectly.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/91bb94d9-46e3-4b7c-867a-bdbf63d785e2.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Wifi Connection Wireless Connection: Synchronize SmartPhone Screen via WiFi It is easy to build a wifi wireless connection with your iPhone/iPad/Android Phones/Tablets/ laptop (Windows 10 system). Say goodbye to the hassle of cords, adapters, dongles, and no install APP needed in the connection process. Just hassle-free to connect your phone to the same Wifi network as this wireless projector, now you can enjoy a 300\" large projector screen. Wire Connection: Mirroring Your iPhone/iPad Screen via Original USB Cable Watch your favorite movies even with no WiFi environment.No worries, connect the projector to your phone via the original USB cable easily. This Wifi Projector allows you directly connect to your iOS devices via the lightning to USB cable, just plug it into the projector's USB interface and no extra cable and steps are required, even not in a wifi environment, you also can share your mobile screen with the projector anywhere.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3aa95db6-1a51-4130-9fb9-51054b0d300b.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Note: Due to HDCP copyright, copyrighted content from Hulu, Netflix, Amazon Prime, and similar services CAN NOT be mirrored. But you could plug an Amazon fire stick, Roku stick, or Laptop to connect through an HDMI port into the projector to cast Netflix, Amazon Prime, Hulu, or Disney +. Make sure the wifi projection image is stable and smooth, the WiFi network should be greater than 50M. And prevent the WiFi stream gets overloaded with too many devices connected to it. Wifi connection stability depends on the distance, the closer the projector to your home router, the more stable the WiFi network connection will be. * If the projector has no sound or the Dolby icon is on your screen. Please check the Audio Setting on your Amazon Fire TV and try turning off Dolby Digital Plus to ensure the sound working. [ On your Amazon Fire TV or Fire TV Stick, go to Settings > Display & Sounds > Audio > Dolby Digital Output > and then turn Dolby Digital Plus OFF. OR choose the PCM (Setup-Audio output-PCM).]",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d55c9c6e-73f2-4889-8566-667df2f74b48.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "High-Efficiency Cooling System & Advanced Low Noise & 80,000 hours Long Lamp Life The unique internal vertical structure design with the advanced cooling system is more effective for heat dissipation, not only extends the life of the LED up to 80,000-hours but also effectively solves the problem is that the LCD screens of other ordinary led movie projectors are prone to Black Spots after being used for a period of time. With the multiple fans' latest noise reduction and cooling technology, machine noise is reduced by up to 68.7%. Focus Correction Focusing on a projector can be accomplished by twisting its focus ring until the projected image appears sharp. A lens design that is 2-3 times high than other projectors is clever to replace the ±15° manual keystone correction, which is perfect for work with a Projector stand. What's in the box? 1. Projector 2. HDMI Cable 3. AV Cable 4. Remote control 5. Manual (Warm Tip: Projector screen is not included and needs to be purchased separately.)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dde4681e-30b9-4767-bc86-a3462293524d.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/84c290d7-295c-4d01-83ab-0658d2f74960.__CR0,0,600,180_PT0_SX600_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/52aecfc7-0551-4a2a-85d8-39449d389d1d.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/62221fd6-a887-4e6a-9388-247b4213e0a9.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/91bb94d9-46e3-4b7c-867a-bdbf63d785e2.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3aa95db6-1a51-4130-9fb9-51054b0d300b.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d55c9c6e-73f2-4889-8566-667df2f74b48.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dde4681e-30b9-4767-bc86-a3462293524d.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mckayla Mckayla ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWG24SOSYLCRHRYIAMNRUH6SPFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12GR27LTQGAK6?ASIN=B09BZFCWMH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2020",
                "reviewTitle": "5.0 out of 5 stars Perfect for Kpop MV’s! ASTRONORD ALTERNATIVE",
                "reviewText": "The media could not be loaded. I was about to purchase the kpop Astronord projector to watch my music videos from youtube. It was more than 130 with shipping and no free returns so I quickly came to amazon & decided to try this one instead based off of the amazing reviews. I can definitely say I am extremely happy with this purchase! Anybody who wants to get the Astronord projector should definitely go for this one instead! The pros: much cheaper, amazing quality, and free returns with amazon!The images above were taken in the day and the image is super clear! The picture quality is the best that I’ve seen on a projector with this price! The brightness is also amazing and can go up a little more if you change the picture setting to vivid in the settings. The remote control is also a really nice touch for those lazy ones out there like myself.Overall I say do not think twice about this projector, just get it! It is everything I could’ve wanted in the Astronord one for an amazing price! Amazing alternative for a television! I dont remember if the other comments mentioned but for the size I didn’t expect the sound to be very good but the sound was absolutely amazing! It can get very loud and I could close my room and hear it from outside. Extremely loud, amazing picture quality, amazing overall. No need to get a super expensive projector when this one exists! Truly amazing buy from Amazon & I do not regret it one bit and neither will you! Do not think twice, just buy this if you’re looking for a great projector! Worth every penny (: I am excited to try it tonight in the complete dark for optimal image quality but I really love that it works even in the daytime! So amazing I could continue recommend this product enough! I was not disappointed at all!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/714U2WcLdKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71DjOjcVIxL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71TfHxd5MKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71gPC54Ya2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71o0+UWnjlL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f02e603f-eb67-4d33-bfb1-7ee2b7d74fdc/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Matt Hannan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUB3V3LCG4UIL7XB52CFIBY3YEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27VVHAVZI0145?ASIN=B09BZFCWMH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2020",
                "reviewTitle": "4.0 out of 5 stars Loud start up tone",
                "reviewText": "The only complaint is that when you turn it on there is this ear piercing start up tone that is entirely way to loud . Maybe there is a way to mute it permantly.. other than that it’s excellent bright and clear and really a nice projector ..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "UrlmrlsUrlmrls",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVF5LPMHTXCNGZJTRZZCSYAVHTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FGPY31QZ6N71?ASIN=B09BZFCWMH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2020",
                "reviewTitle": "5.0 out of 5 stars A bang for your buck!",
                "reviewText": "Alright, I know you’re scrolling through all the projectors and read reviews to see if you convince yourself to get something.This time I went with a low review product that was completely new and took some chances, I was not disappointed.This Salange projector surpassed my expectations,the image is sharp and bright even for a colored wall, can you imagine what it can do on a proper white screen?There’s plenty of sources to stream your image from, I personally use a laptop for when I want to watch movies outdoors, it comes with a built in speaker and or an output to use your ownspeakers. You can sync your device via Bluetooth for audio only.Great if you wanna hook up your Nintendo switch and play Smash with the bois.Of course it does come with cons, I couldn’t figure out how to reposition the image so you have to point the projector directly into the desired height, I highly recommend purchasing a tripod.Overall this is the best value projector I’ve owned.Check it out!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61Hf9APnDgL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71dondedwbL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71pz5kQt+vL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71ymbIPp-RL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Elder GoddessThe Elder Goddess",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGIQUZNY2J22IO6IBHQTRQLNTWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM3166818BDC3?ASIN=B09BZFCWMH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 11, 2020",
                "reviewTitle": "5.0 out of 5 stars Such a great item!",
                "reviewText": "I ordered this about a month ago and just got around to opening the box and playing with it.I love this, it is such a great little projector. I love how I can play movies on it, or even do some gaming and project it on a wall. Perfect for those times when I want a larger area for some multi-player action.I wish I had ordered this sooner, as I would have had movie night with my family and their families, projecting a movie up on the back wall.I am certainly going to use this at Halloween, as it would be great to set up outside to watch some movies as we have people trick or treating.There are so many possibilities I am super excited about the prospects.The picture was clear, and it was very easy to set up and use. I did take some pictures of the projection as well, but they did not come out too well on my cell phone.I will be using this ALL year long!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61CAod2EezL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71U-GFRWsxL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71eCn50BDRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81Z096+z4zL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81qpQIP68jL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chelsea B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3PKGB6PEU5IBAHM2L6GCLVBAPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JN29YTWYYNA8?ASIN=B09BZFCWMH",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 8, 2022",
                "reviewTitle": "1.0 out of 5 stars Doesn't work with \"tv stick\" fire stick",
                "reviewText": "No sound with the amazon fire stick. Second one that I have purchased where there is no sound. This one specifically says that it works with an Amazon fire stick. No way to contact seller. No way to figure out why this is happening. No instructions came with mine. This is absolute crap. The fire stick is the only way (that i have) to get around the copyright. I purchased a projector in 2020, with 4 fire sticks. I invested lots into these sticks to be able go use them around the house and in the backyard. Now I have to use my streaming box with this projector which doesnt get any signal outside... how am I supposed to watch a movie that doesn't have sound? If you say it works with a fire stick, you better make sure it actually works! I might have to return this. If I proves to be more than its worth to get the streaming box to work outside, then I don't want this garbage. Again, another projector that is useless to me.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert J. Robertson ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCLBONPTTNFQGUNRRVKCWM7CA6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VQDJJD4R1GH7?ASIN=B09BZFCWMH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2020",
                "reviewTitle": "5.0 out of 5 stars Low price for a quality product.",
                "reviewText": "Received my projector today was very impressed with how bright and easy it is to use. We will primarily be using this for backyard events with family and friends. We will also be taking it in our RV on family vacations.I was very pleased with the price of this projector considering my friend paid more for lower quality picture and brightness.Looking for a portable projector?..... this one is it!The Robertson Family",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hayden Steel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWURMIOIBQADKUXSIO7DXDVWVMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FG9LGG0NNR14?ASIN=B09BZFCWMH",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2021",
                "reviewTitle": "3.0 out of 5 stars Could use some improvement, but it’s still good!",
                "reviewText": "This projector is really cool in a lot of ways, but lackluster in others. For me, it had really high brightness, so much I could watch shows with the lights on without compromising quality. Speaking of picture quality, it was pretty underwhelming. Actually after just 3 uses, there were lines running through where it was projected to & I couldn’t get them to go away. I didn’t like how there wasn’t a tilt, BUT for the price this is a great pickup.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elías Rodríguez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 28, 2023",
                "reviewTitle": "EXCELENTE PRODUCTO ⭐",
                "reviewText": "Cumple perfectamente con lo descrito, tenía mis dudas pero al recibirlo, pero me lleve una muy grata sorpresa, es de muy buena calidad el producto, la imagen proyectada es HD, incluso al encender las luces, la imagen se sigue viendo, el sonido es perfecto y sobre todo es compacto.Excelente relación Precio-Calidad.Recomendadisimo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gerard Nash - ThePhotoMender",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 9, 2023",
                "reviewTitle": "Very Impressed",
                "reviewText": "Picture quality is better than expected. Easy setup and interface. Setting up an external Bluetooth speaker is a bit confusing and there is only one HDMI port. Thus the 4 star rating instead of 5.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "margery m.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 4, 2022",
                "reviewTitle": "Funciona mejor de lo que esperaba",
                "reviewText": "La calidad de imagen es muy buena, es fácil de utilizar, su diseño es muy lindo y práctico. Quizá el sonido pueda decepcionar un poco en espacioa grandes pero es perfecto para una habitación pequeña",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 8, 2023",
                "reviewTitle": "Excelente producto 100% recomendable",
                "reviewText": "La imagen es muy buena, los 600 ansi lúmenes creo que si son reales en general muy buen producto tanto en video como en sonido felicito a salange, lo único que me gustaría que agregaran sería ajustes de audio y video para personalizar un poco estas 2 al gusto de cada usuario o depende del escenario dónde se encuentra tales como brillo, color, nitidez, temperatura de el color y en audio bajos, medios y altos. Fuera de eso el producto es excelente, solo faltaría eso para calificar las 5 estrellas todo está perfecto!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacques lefebvre",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 10, 2022",
                "reviewTitle": "Plusieurs problèmes",
                "reviewText": "Lag souvent. Ne prend pas en charge le son ambiophonique 5.1, ce qui force de reparametrer à chaque écoute de film. Sinon il n'y a pas de son. Le Bluetooth désynchronise le son.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$139.99",
                "sellerName": "SalangeDirect",
                "sellerRating": "4.5"
            }
        ]
    }
}