{
    "remaining_requests": 39626,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Projector-AKIYO-O1-Portable-Keystone/dp/B09HT8LL87",
    "body": {
        "name": "Mini Projector with WiFi and Bluetooth, 1080P Supported iPhone Projector with Projector Stand, Portable Movie Projector for Home Theater/Outdoor, Compatible with iOS/Android/Laptop/TV Stick/HDMI/PS5",
        "price": "$55.99",
        "originalPrice": "$69.99",
        "rawPrice": 55.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Projector-AKIYO-O1-Portable-Keystone/dp/B09HT8LL87",
        "soldBy": {
            "sellerID": "A3FDRLKHVF5T2G",
            "name": "CENLI",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3FDRLKHVF5T2G&asin=B09HT8LL87&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CNZ44D2R"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 20% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ilkNpAKcL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/516XOQe-PyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415uuR3lxZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/416T0eA-E2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-uJOg6GLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wPR5FAryL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91l0UcqG47L.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aeddcbf7-2a6e-4afe-8839-624126d3ccd7/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2952afda-e68a-4cd1-bffe-3ea9f88ae090/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aa265f58-c4bb-420c-8f34-7f291fa2fff3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/536aa3dc-4d0a-4a72-a83b-1234aaf93567/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e512afa6-9d6d-422a-9bf3-3d1469108250/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/836e71a8-a730-445b-85d0-741343e66168/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1W5RkAzOPL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1W5RkAzOPL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the AKIYO Store",
            "link": "https://www.amazon.com/stores/AKIYO/page/7EA96248-DA78-467E-9E65-AC137F2499A1?ref_=ast_bln"
        },
        "brand": "AKIYO",
        "merchantInfo": "CENLI",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1922,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 20 - 22",
            "Or fastest delivery February 19 - 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✅【2024 Upgraded WIFI Wireless Screen Mirroring】AKIYO's upgraded Mini WiFi Projector supports 2.4G WiFi connectivity designed to be compatible with Android/iPhone/Windows 10. With no additional conversion cable required for screen mirroring, you can connect your device to the smart projector at any time.(★Note: Bluetooth does not support connection with smartphone)",
            "✅【Native 720P & Full HD 1080P Supported】 The AKIYO 2024 updated mini WiFi projector has a native resolution of 1920*720P and supports full HD 1080P. High-definition images and superb color brightness are provided by the 100 ANSI brightness and 2000:1 contrast ratio, giving you the greatest video experience. ★The mini projector will work best in a dark environment.",
            "✅【Ultra Small Size & Portable Cinema】The size of the mini projector is 5.35*4.33*2.28 in, which is the size of two Coke cans. It's small enough to fit in your pocket or bag. The projector weighs only 420 grams, making it easy for even a small child to hold. The elegant design makes it ideal for gift giving.(★NOTE: Copyrighted videos such as Netflix, Amazon Prime, and Disney may not support direct playback through mobile phone mirroring. It is recommended to connect to a TV stick to play)",
            "✅【Multiple Connections & Lifetime Tech Support】Multiple input source interfaces to meet your diverse equipment needs: HDMI, AV, USB and 3.5mm audio output jack. Compatible with PC, Fire Stick, PS5 multi-device connection, one-click connection can easily meet your daily needs! AKIYO Brand offers Lifetime Technical Support for all AKIYO products.★If you have any questions, please contact us immediately and get a 24H service response via \"Order - Get Help\" from the Amazon Station Message.",
            "✅【Big Screen & Low Noise】The mini projector supports a projection screen size of 32-120 in, and the best projection distance is 3.28-9.84 ft. The projection screen can be reduced to 75% by adjusting the screen without moving the mini projector. The improved mini projector has the most up-to-date high-efficiency cooling technology, which produces 50% less fan noise and is far quieter than other projectors. ★Warm Tip: Dolby sound is not supported with the mini projector."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎AKIYO"
            },
            {
                "name": "Item Weight",
                "value": "‎14.8 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎5.35 x 4.33 x 2.28 inches"
            },
            {
                "name": "Item model number",
                "value": "‎O1"
            },
            {
                "name": "Color Name",
                "value": "‎Black"
            },
            {
                "name": "Special Features",
                "value": "‎✅Bluetooth5.0, ✅Native 720P, ✅Mini Size, ✅ Tripod, ✅WIFI Connection"
            },
            {
                "name": "ASIN",
                "value": "B09HT8LL87"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,922 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "May 12, 2022"
            },
            {
                "name": "Brand",
                "value": "AKIYO"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Indoor/Outdoor"
            },
            {
                "name": "Special Feature",
                "value": "✅Bluetooth5.0, ✅Native 720P, ✅Mini Size, ✅ Tripod, ✅WIFI Connection"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Display resolution",
                "value": "1280 x 720"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "AKIYO O1 Pro Projector with WiFi and Bluetooth AKIYO has been specialising in projectors for almost a decade. This WiFi projector from AKIYO is the latest upgrade projector for 2024! The smallest body on the market and with the most powerful features: native 720p, upgraded WiFi and 5.1 Bluetooth capability. AKIYO has always believed that technology can make life enjoyable and wants everyone to spend more time with their families. Let AKIYO projectors make your home entertainment more enjoyable! Packing list: O1 WiFi Mini projector, HDMI Cable, Power Adapter, User Manual, Mini Tripod. Tips on connecting the projector: Not recommended for office use where high resolution is required. It is recommended to use this projector in a dark environment.Not Very Loud. This projector is very mini and portable, if you find that the volume cannot meet your needs, it is recommended to use an external speaker.Not used product. AKIYO never sells products returned by customers. If you find that the packaging is damaged, it is likely due to logistics. please let us know as soon as possible.No battery. The projector must always be connected to a power source in order to operate.With LCD projectors, the corners will be more blurred than the centre. If you are unsure if the projection is working, please let us know and we will help you.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ca116172-86f9-4d50-8075-aca763c4778c.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "WiFi Connection & 5.1 Bluetooth Function iPhone Cellular Connection 1. Select \"iOS Connect\" on the projector. 2. Turn on phone’s WLAN and add \"O1_xxxx\" network. 3. Select \"Screen Mirroring\" on your phone to connect to \"O1_xxx\". iPhone Wi-Fi connection 1. Select \"iOS Connect\" on the projector. 2. Connect the projector and the phone to the same WiFi. 3. Select \"Screen Mirroring\" on your phone to connect to \"O1_xxx\". Android Wireless Connection (Please make sure your device has the \"screen casting\" function.) 1. Select \"Android Connect\" on the projector. 2. Turn on your Android device's WLAN/Wi-Fi. 3. Turn on \"Cast Screen\" in your phone's settings, then select \"O1_xxx\" to connect. Bluetooth Connection 1. Click “Setting” on the projector. 2. Open the \"Bluetooth Setting\" option. Find your Bluetooth device and pair it with the projector. (The Bluetooth function can only connect to Bluetooth devices such as Bluetooth stereos, headphones, etc. It is not possible to connect to a mobile phone.)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce3badde-e698-425f-b85d-a12c88819d86.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Important Parameters: Resolution: Native 1280 × 720P & Support Full HD 1080PWiFi Support: YESBluetooth Function: 5.1Lamp Life: 55,000 HoursProjection Distance: 1-3mProjection Size: 30 - 180 inches.Zoom Function: 100% to 75%Keystone Correction: manual correction ±20°.Speakers: Built-in high-fidelity speakers.Throw Ratio: 4:3/16:9Optimal Projection Distance: 3.28-9.84 tfProjection Modes: front/rear/ceiling/tripod",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ecb5f88d-cc70-4d0c-96af-3e79f567185b.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Why Choose Our Mini Home Projector? 1. Eye Protection Mode: This projector uses advanced liquid crystal technology to effectively reduce the effects of blue light and direct light. Protect your eyes from additional fatigue caused by emitted light. 2. High Performance: The projector supports 1080p resolution, advanced technology minimizes lamp power consumption, and 55,000 hours LED lamp life lets you enjoy family entertainment to the fullest! 3.Portable Projector : This projector is compact with dimensions of 5.35 x 4.33 x 2.28 inches. Palm size and light weight, you can put it in your pocket, very convenient to carry. 4. Built-in Speakers: The built-in dual audio speakers bring clear and balanced sound, creating a realistic music experience for you.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b1e054d6-c949-45e4-a75a-4182c484ee73.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Perfect for Indoor and Outdoor Entertainment ✔ Portable Mini Size: as small as a Coke can and weighing only 420g, it's stress-free for carrying outdoors.✔ Tripod Equipped: with the help of a tripod, the projector can be better used outdoors.✔ Super-Sized Gaming Experience: the HDMI cable allows you to connect directly to the game console, giving you a super-sized gaming experience.✔ Learning Assistant for Kids: watch online lessons or entertain your kids with hours of cartoons and educational videos through the projector.✔ Exercise at Home: watch exercise instruction videos on the big screen and stay fit at home.✔ Low noise: at a distance of 1m the projector is barely noticeable. AKIYOupgraded projector has a significantly lower noise level than LCD projectors.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fa5ee98d-7d70-4175-99ff-ac7ec52ab7f2.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Some Questions You May be Interested in: 1. Can I have a wired connection to the projector? YES! For Android: Please purchase additional adapters: Dongle HDMI or Type-C to HDMI cable. For iOS: Please purchase additional adapters: Dongle HDMI or Apple Lightning to HDMI Cable. 2. Why can't I play Netflix/Amazon Prime/Disney videos? Some streaming videos or shows (Netflix, Amazon Prime, Disney) are protected by copyright and are therefore protected. You can connect the projector to your laptop to play the video or use your Fire Stick to enjoy the video. 3. Why is there no sound when playing videos? The projector does not support Dolby Audio. If there is no sound in the video, please check if Dolby Audio is turned off or switched to surround sound. 4. Why is it not recognized when I insert a USB stick? The Mini Projector supports USB2.0 (black) USB flash drives (up to 64GB), please check the file system format of the USB flash drive on your computer. The projector supports USB flash drives with \"NTFS\" and \"FAT32\" system file formats but does not support \"exFAT\". 5. Does the Mini Projector need to be connected to a power source at all times in order to work? The Mini Projector does not require batteries and must always be connected to a power source to function properly. 6. When connecting the Firestick, can I connect the power side of the Firestick to the projector at the same time? AKIYO's mini projectors have enough distance between the HDMI and USB ports to connect both the TV Stick and the TV Stick's power supply at the same time. Other projectors require the USB power supply of the TV Stick to be plugged into another socket when the TV Stick is plugged in.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/34b1ba63-d596-4bf2-84a9-50d30895b89a.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Mini Projector WIFI Bluetooth Projector Modle O1 O7 Resolution 1280*720 1920x1080 WIFI ✓ ✓ Bluetooth ✓ ✓ Technology LCD LCD Scenes to be used Home theather/ indoor party Home theather/ indoor party",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ca116172-86f9-4d50-8075-aca763c4778c.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce3badde-e698-425f-b85d-a12c88819d86.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ecb5f88d-cc70-4d0c-96af-3e79f567185b.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b1e054d6-c949-45e4-a75a-4182c484ee73.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fa5ee98d-7d70-4175-99ff-ac7ec52ab7f2.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/34b1ba63-d596-4bf2-84a9-50d30895b89a.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e6e156a2-a31d-47b4-8747-8edfe17f72f4.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6e218ab6-e2c6-4fbd-8807-6971ef0f56b3.__CR0,0,300,600_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JCJJCJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3WJWFK5DB37GPESRTIPPQ7JFTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UBCHS6R5SV08?ASIN=B09HT8LL87",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Cute, versatile, compact and clear.",
                "reviewText": "I use this Akiyo mini to project my digital inks onto paper so i can ink over it traditionally. Saves me hours of work. I've ordered projectors in the past to do this and none of them were as good as this little dude!!It's small & lightweight, (see picture for scale reference, I didnt have a banana handy, comes well packaged and cared for, the display is clear, the projected image is clear and bright, the interface is pleasant and straightforward. Focusing is easy and I have it mounted to an arm on my desk to face straight down. i also feel pretty safe with the 2 year warranty, thats more than most companies give for way more expensive items.Since I use it for inking, I have not watched anything on it but i did have something accidentally play while screensharing and found that the speakers are quite loud even at the default set to 50% percent.I am pleased with all the connection possibilities, but HDMI is the easiest. I had to get an HDMI to Usb-c adapter because my of my laptop limitations. The remote is nice too, because it sucks trying to control buttons with a device thats upside down.Only negative I have is that the fan is quite loud but i dont notice it after a while.I'll update this review should something unfortunate come to light (no pun intended).",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/6124fIMy1vL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Vj9eCwbdL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert Boeve",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5YT2F5HW6FGHZ2XKTFBFMLHLXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HH5CNYE1BAHL?ASIN=B09HT8LL87",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Value for the Price",
                "reviewText": "Use this for my Golf Simulator. No issues. Good detail. 1080P, WiFi, BT, HDMI, with speaker. Can’t beat this thing. Note: zoom function works well, but did have to move it back to fill an 9’x10’ hitting screen. Easy Peasy though.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donald M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLGE7PBRFVUMWJAM2PWDGIDEQ6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DBBNWCMBICNO?ASIN=B09HT8LL87",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "4.0 out of 5 stars As advertised",
                "reviewText": "Sets up in minutes and works well",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos nievesCarlos nieves",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE73ULZ6ASG4N2W5JXIZFMMNPIEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IPIBN37EF27G?ASIN=B09HT8LL87",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "5.0 out of 5 stars I feel like a kid with a new toy!",
                "reviewText": "The media could not be loaded. I have just been using this mini projector for a couple of hours now and its been fun! is small and powerful. I can connect it to my wifi and cast from my laptop, and i can cast from my phone directly using smartview on Android, it also can cast from an iPhone, its 1080p, it looks good, I have it like 12 ft away from wall to wall and it looks clear and colorful, of course it has to be used in the dark, with the lights on is barely visible. I like that it has a section on the menu with instructions on how to connect your devices, the tripod is a good quality one and the remote control can let you browse the menu and turn up and down the volume. it has to be connected to 2.4 ghz wifi signal. the sound is perfect for a room but it also can be connected to a Bluetooth speaker for external sound! for the price is perfect! it has all the basic features to have a nice experience you can adjust the lens, tilt it up and down and resize the image from 75% to a hundred. im using it on 75% and the display is like 120 inches! keep it close to whatever you're using to display it and it will look good! check my pics and videos!",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ST2bsK02L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61e5uDawWqL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61wPFhn7+2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71CSfCAmMlL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0ab9e216-18b7-4ea6-8926-6b433b88f113/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Cylas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYKW2P3UBFL6TKBNMH3TBVWYFOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MDMD3KHEAD00?ASIN=B09HT8LL87",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "1.0 out of 5 stars Connection Issues",
                "reviewText": "The projector setup was easy and projector turned on and focused pretty well for an inexpensive product. However could not connect to WiFi as advertised, and also won't connect to Bluetooth or hotspot. This was also after I triple checked the WiFi password was correct, reset the wifi router, and tried to connect it to phone hotspot. It would still be worth the money maybe if it had a way to connect to devices with a cord but that won't even work because no such cord is provided, only an HDMI adapter. Would not recommend, you're better off spending more money on a common brand and not these cheap ones.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2BAWFS36OPT4LU7QTKSVG3QPTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R173QXKCMY4U9Z?ASIN=B09HT8LL87",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "3.0 out of 5 stars Works in dark room only",
                "reviewText": "This is a decent product for the money. Just wanted to state that I got this projector for my Golf simulator set up. The size and quality of the projection is ok, however it only shows in a dark room. Ive put some high beams on my golf mat and play in the dark until i figure out which projector i want to invest in.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T ST S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTEVSM7UY3XJMSEW7JL6NPCBJOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D2Q7DWHLE4AF?ASIN=B09HT8LL87",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2022",
                "reviewTitle": "5.0 out of 5 stars Nice little projector!",
                "reviewText": "The media could not be loaded. It’s a nice projector. Little, inexpensive, but pretty powerful! One photo shows what it looks like when the lights are on, it’s not super bright, but you can still see it. Lights off, it’s very bright. Picture quality is pretty good for a $45 projector. Mine came with a tripod, which was very helpful for setting it up. It has multiple options for orientation/mirroring in case you mount this the ceiling or if you project through a mirror. Sound is pretty good, but if you’re picky about sound quality, I’d just go ahead and buy a wired speaker. The built in speakers arent super powerful.One small issue: if you have a newer Mac book or Windows device that only takes USB-C, you might have some issues. My newer Mac that needed an adapter for the HDMI cable didn’t connect, but my older Mac that can directly take an HDMI cord worked! As did my Xbox. However, my Switch did not work. Again, I’m guessing it’s because it doesnt directly take an HDMI cable, only through it’s port. Just be mindful when purchasing.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61-QliO4xsL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61xGEnQdF5L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ClsVwpzkL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a7a7bf7-9f02-4d4d-9b21-3790b5dd565d/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Katrina Martinez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZGWFQQQLF7CXVDBGQPQ5TTI5QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE93WX2QP2B1?ASIN=B09HT8LL87",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars This is awesome",
                "reviewText": "Bought this to use in my Sunday school class, I needed something compact that I can screen mirror from my iPad or android. Did that very easily. This is a good value for the money. Under 55 dollars and it works great I have no issue with the speaker it is fine in my view as long as you are not watching a full length movie and expect premium sound. But really the speaker is quite good and loud enough to hear over 18 little kids rustling about.I am having fun with it my new toy.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AshAsh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 31, 2023",
                "reviewTitle": "Cat Approved",
                "reviewText": "Turned my entire bedroom wall into a TV for 55 bucks. Not the clearest video ever but not blurry enough to make it awful. The fan does make noise but it's like a very lowkey white noise, so easy to tune out. The speakers work well. Overall a great product for the price that I got it at.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714O9RWqe9L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "VICTOR S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 4, 2023",
                "reviewTitle": "Excelente proyector CALIDAD-PRECIO",
                "reviewText": "Excelente proyector CALIDAD-PRECIO. resolucion nativa 1080P, bocina integrada con buen volumen ni muy alto ni muy bajo, funciones extras como wifi screenshare y bluetooth con buenas conexiones, menú muy simple pero funcional, la calidad de la imagen es buena y su brillo igual nada destacable pero funciona genial. Por menos de 2000 pesos, $1570 MXN eso me costó a mi para ser exacto. Para su precio muy bueno.Veremos cuanto dura...",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karla",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 7, 2022",
                "reviewTitle": "Lo amo!",
                "reviewText": "No es la gran calidad de imagen, no se enfoca toda la pantalla, tienes que elegir si quieres enfocar la parte de arriba o la de abajo y las orillas quedan desenfocadas pero con el tiempo te acostumbras,En una habitación donde no le de el sol directo y con cortinas se ve super bien y de noche se ve aun mejor!100% lo recomiendo",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dunhio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 12, 2022",
                "reviewTitle": "Amazing Value for Price",
                "reviewText": "TLDR: AKIYO's 1080p and picture in normal and bright scenes was awesome for the low cost. I'll be using this for impromptu movie nights on the bedroom wall (100in screen size from 10ft).Set this up in my bedroom for impromptu movie nights with my partner and/or my children. At about 10 feet this projector will put up an approximately 100 inch screen (diagonal) at 1080p resolution. I did not use the onboard speaker as I connected to a bluetooth speaker using AUX cable, which showed no latency with the video.I have a Bomaker 2021 that I used prior to this and the diff between the AKIYO's 1080p resolution (720p Bomaker) was immediately noticeable. Although the Bomaker had better contrast in the dark scenes and was a brighter overall projector, I still preferred the AKIYO's overall experience.Pros:- 1080p resolution is MUCH better to the eye than comparable 720p or 480p projectors. Do not go with anything lower than 1080p in 2022.- Bright scenes look great (watched Frozen so far)- Aux output works well- Very simple and easy to use interface- Remote is useful (albeit cheap feeling)Cons:- Very low contrast, especially in the dark areas of the screen. Dark colours are absolutely crushed to black, so you lose contrast in dark shirts, dark scenes at night, etc. But, for the price, this is nitpicky.- There is a slight hum from the fan on the projector, but it gets drowned out by movie audio. Again, for the price this is nitpicky.- Not as bright as slightly more expensive budget projectors. In a fairly dark room though, it's fine.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heidi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 27, 2024",
                "reviewTitle": "Nice little projector but....",
                "reviewText": "I bought this small projector to connect to my laptop to watch movies. It seems to be good quality. The fan is a bit noisy. But for some reasons, my laptop didnot recognize it. Cannot connect to my laptop. Tried everything but in vain.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}