{
    "remaining_requests": 39331,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/NEBULA-Mars-Air-Projector-Built/dp/B0CHW168LV",
    "body": {
        "name": "NEBULA Mars 3 Air GTV Projector - Netflix Officially Licensed, 400 ANSI-Lumen Brightness, Native 1080P, Dolby Digital Sound,150-Inch Picture, Built-In Battery for 2.5 Hours of Playtime Anywhere.",
        "price": "$599.99",
        "originalPrice": "",
        "rawPrice": 599.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/NEBULA-Mars-Air-Projector-Built/dp/B0CHW168LV",
        "soldBy": {
            "sellerID": "A294P4X9EWVXLJ",
            "name": "AnkerDirect",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A294P4X9EWVXLJ&asin=B0CHW168LV&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTMLGJBL"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CHW168LV",
                "variationName": "Style",
                "variationValue": "Mars 3 Air",
                "price": "$599.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07PX8PN5S",
                "variationName": "Style",
                "variationValue": "Mars II Pro",
                "price": "$469.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $100 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/216W 0jKoFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41SbLHzGs2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iLA1Tb4 L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Su5fK1xYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZhAWc-aLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NWAxaXsuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1gYtDFFs8L.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c7b01466-ceca-4ebe-bda0-c91c38e519d1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cfa1c462-fcbd-4596-8b6b-4c346dec6bed/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b6a32da6-0dcc-4735-8019-f65f00c70428/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b3c652bd-d790-4280-982b-a6a8f35d5724/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/D1jzOpV0HXL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/D1jzOpV0HXL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the NEBULA Store",
            "link": "https://www.amazon.com/stores/NEBULA/page/A836DB9B-3AD4-4696-A071-A0A11B4E59A2?ref_=ast_bln"
        },
        "brand": "NEBULA",
        "merchantInfo": "AnkerDirect",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 1096,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 7 hrs 11 mins",
            "FREE pickup Sunday, February 18",
            "Or fastest pickup Tomorrow, February 14. Order within 16 hrs 41 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Take the Big Screen Anywhere: This portable Google TV projector lets you watch all of your favorite content and apps—including Netflix—wherever you are.",
            "Jaw-Dropping Display: Enjoy a truly cinematic experience with rich detail and high clarity thanks to the 1080P HDR display and 400 ANSI Lumens brightness.",
            "Ultra-Long Playback: Fully charge to enjoy watching up to 2.5 hours of movies and series, or listen to up to 8 hours of music.",
            "Dual 8W Dolby Audio Sound: Delivers immersive sound for movies, and can even function as a portable speaker to pump out the music at a party.",
            "Set Up in Seconds: Our Intelligent Environment Adaptation Technology performs auto keystone correction, autofocus, keystone correction and obstacle avoidance in just 3 seconds."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎NEBULA"
            },
            {
                "name": "Item Weight",
                "value": "‎3.7 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎7 x 4.8 x 5.23 inches"
            },
            {
                "name": "Special Features",
                "value": "‎Pico"
            },
            {
                "name": "ASIN",
                "value": "B0CHW168LV"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 1,096 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#114 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "November 19, 2023"
            },
            {
                "name": "Brand",
                "value": "NEBULA"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Indoor/Outdoor"
            },
            {
                "name": "Special Feature",
                "value": "Pico"
            },
            {
                "name": "Connectivity Technology",
                "value": "HDMI,USB-A,AUX,DC-IN,BT,WiFi"
            },
            {
                "name": "Display resolution",
                "value": "1920 x 1080"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page 400 ANSI Lumens With 1080p Resolution Enjoy HD resolution with exceptional brightness. 150-Inch Screen Experience a next-level viewing experience. Dual 8W Dolby Sound Use as a portable speaker and listen to your favorite tunes anywhere. Next page 1 HD Image Quality 2 Huge Display 3 Dolby Sound",
                "media_link": []
            },
            {
                "media_text": "Previous page 2.5H Playback on a Single Charge Charge once to watch a full movie wherever you are. Cast From Your Phone or Laptop Multiple Ports to Connect External Devices Next page 1 2.5H Playback 2 Cast Content 3 Multiple Ports",
                "media_link": []
            },
            {
                "media_text": "Previous page Watch Netflix on a Huge Screen Just turn on the projector to start enjoying your favorite Netflix content—no installation required. Tailored Content for All the Family Add multiple user profiles to get the content you want to see. All Your Favorite Apps on the Big Screen Watch Netflix, Hulu, Disney+, and more—all in one place. Supports Voice Control Control via Google Assistant. Next page 1 Licensed by Netflix 2 Multiple User Profiles 3 Google TV 4 Google Assistant",
                "media_link": []
            },
            {
                "media_text": "Previous page Intelligent Environment Adaptation 3.0 Performs screen fit, auto keystone correction, autofocus, and obstacle avoidance in just 3 seconds. Next page 1 IEA 3.0 2 Product Description",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4e4eac65-a048-4561-b27a-cf83cc101a96.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d05449be-88e4-44b4-8c8f-7ad1f131323b.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3b465dff-93bb-469e-9655-b460842621ca.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c73e1748-4fb9-4400-b263-2e16b1270997.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/89cff6fb-0c78-46c4-80e0-0247d663a0ef.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/666f99f7-157c-43c7-840d-7762e68ead70.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c57c1972-bf95-45b1-a1e5-92b088b985a7.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ddc8025b-fcb4-49a4-aeac-cfca222fa9fb.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f4b790e-0ae5-402b-bfe4-6bb99d5cdb2e.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/22832a2d-b9f1-4ba9-8cd5-f4a2ae83d62c.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4d877527-95c7-4abd-bf89-bb932573e65d.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ee5ea247-423a-4ebb-963f-4f1d16fccd94.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5a26c621-d54d-41c9-86d6-bb0be4fd1b47.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/60b45a32-e2b1-466a-be06-90d6cb6a94af.__CR0,0,1464,600_PT0_SX1464_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Misty C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECDLK3GKOIRYYLPW6TR3XTWPDTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EGLKV4AFVY6T?ASIN=B0CHW168LV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 15, 2021",
                "reviewTitle": "5.0 out of 5 stars Great backyard projector",
                "reviewText": "We bought this to do backyard movies and television. We live in a garden home neighborhood, which means we're close to our neighbors and their lights and have plenty of streetlights and other light pollution. Even with all that, once the sun sets, this projector does a fabulous job. We often have the fire pit going or the lights on in the gazebo, and there's still a great clear picture. The only time you really need a truly dark environment is with shows or movies that have a very dark ambience-- for some episodes of the Mandalorian, for example, we needed to kill the gazebo lights to see it well. Finding Nemo did not need such considerations. We do typically run the projector in the brighter mode since we have the ability to run power to it in our backyard. We have tested it on battery power and got about 2 hours of viewing. Even on battery power, there's plenty of brightness in the picture if you're using it after dark.I highly recommend setting up all your accounts in the projector ahead of time. It makes it SO much easier to deal with logging into all the accounts and typing in your passwords if you're just shining it on the wall in your living room the night before movie night instead of trying to set everything up while everyone stares at you! Some of those apps are a pain to navigate, and there's a bit of a learning curve to using the remote and/or phone app. You get used to it, but it takes a minute.Our setup:We project onto a projector screen (just the 100\" Amazon Basic one)-- we attached projector screen mounting brackets with to our house under the eaves and attached a set of carabiners rated for 75 pounds (extreme overkill) on each end of the projector screen. My husband can pull the screen out from the storage closet and clip the it onto the hooks in the mounting brackets in less than a minute. We have a set of ground anchors near the wall, and we use two bungee cords (I used a pair of pliers to widen the hooks a bit) so that they loop around the bottom ends of the projector screen and then connect to the anchors. They're long enough that they only have a tiny bit of tension on the screen-- just enough to keep the screen from blowing, twisting, and kinking if there's a breeze.When we're not using the screen, we disconnect the bungees and roll it up, where it's safely tucked away under the eaves. We leave it up during good weather but can easily unhook it and put it away if rain threatens.We paired our projector with a cheap tripod from Walmart and a couple orange traffic cones from Home Depot so that the kids don't run into the tripod in the dark. Like some others have commented, the tripod mounting hole is a little shallow, so it can make the projector feel unstable on a tripod mount. Thanks to those commenters, I anticipated having the same problem and was armed with supplies to solve it. We bought a couple neoprene washers from Home Depot and placed them between the projector and the tripod mount. That made it a snug fit and eliminated any wobble. We leave the tripod mount attached all the time and just store the whole unit in its bag. (It does NOT come with any kind of storage bag, by the way-- we ordered the Anker one off Amazon because I disliked having to put it back in the cardboard box each time we used it.)We often sit back a good ways from the projector, and while the built-in sound is fine for me, my husband is kind of hard of hearing. We pair the projector via Bluetooth with an Anker Soundcore Flare 2 speaker we already owned and sit the speaker right next to us. They play together fabulously. There's no sound lag at all, at least none I can discern. We did discover that it helps to turn the speaker on a few seconds before turning the projector on. They pair quicker and more easily when the speaker is turned on first. And as we already have an actual bluetooth speaker, we've never really tried to use our projector as a bluetooth speaker. The Soundcore Flare 2 is a lot cheaper and more durable if my kids get a little too crazy with their elementary dance parties.We've had this thing for going on three months and love it. I did a lot of research and agonized over which portable projector to buy, and I'm really happy with the choice I made for my family. If that changes, I'll update this review, but I don't suspect I'll need to.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steven",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5C2PEMVLXY7WMPVYLC3WHQX7XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LN8SH9GCC0CD?ASIN=B0CHW168LV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "5.0 out of 5 stars An Awesome Projector for $500",
                "reviewText": "I don’t usually write product reviews, but since this is a new product with only a few short reviews, I’d thought I’d write one for the people curious about this projector.Picture Quality/Size- The 1080p picture looks great, the picture doesn’t look too over saturated and I found that I can project images over 200” in a darker environment, well above the 150” stated on the product page. This projector CAN’T handle bright environments, it CAN handle late afternoon to night time viewing.Software- Built in Google TV is GREAT. I thought I’d use my Amazon fire stick with it, but Google TV works well. The OS is responsive and has all the usual apps, even native Netflix support. Most other projectors need a work-around to install Netflix. Auto keystone is pretty good, it’s fast and reliable. I sometimes need to fine tune the picture slightly but I’m OK with that.Built in Battery- It’s good I guess. Not much to say. I found to get just over 2hrs of battery life. I did seem to notice the battery drain a bit even when turned off.Speakers- The speakers are GREAT. It gets pretty loud but the quality stays clear. I have two Bluetooth speakers I’d thought I’d use with it, but there’s no need, the internal speakers work great. Now it’s not a home theatre system, but it works good for built-in speakers.Fan- The fan is always on and has a slight hum, but if you turn the speakers above a whisper, they drown out the fan noise.Remote- it’s good, not much else to say. Hot buttons to Amazon Prime and Netflix are nice, as well as the auto keystone button. The projector has buttons on itself as well, in case you don’t want to use the remote.Great OS + great picture/size + great speakers = Great portable projector. Overall I’m very happy with this projector and I think anyone who’s looking for a portable projector will be too.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7OYLTBSQIKD53EWCCMOJGX4XIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYY408PRE426R?ASIN=B0CHW168LV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "4.0 out of 5 stars GREAT value buy",
                "reviewText": "At a prime day price of $380 this projector is at that value sweet spot; when you want to get the most out of spending a little more on your setup.PROS:-Image is high quality and bright-Portable w/ good battery life (a solid 3hrs on battery saver mode)-Good build quality-Solid remote & remote app-Fast autofocus-Can load & play media from a portable drive-Has a bluetooth speaker modeCONS:-Store only has old/unsupported versions of apps (i.e. less features, more glitchy) ((this can be solved with a Roku etc.)-Speakers aren’t amazing but do the jobtl;dr - Great value buy projector for when you want something better than the cheapest options. Wouldn’t pay more than $450 incl. tax.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}