{
    "remaining_requests": 39359,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Philips-Smart-Projector-Built-Compatible/dp/B0BR3WPF2B",
    "body": {
        "name": "PHILIPS Android TV Projector with Apps and 5G WiFi Bluetooth - Smart Projector Built-in Netflix, YouTube, Outdoor Movie Projector 4D 4P Keystone, Zoom, Compatible w/ iOS/Android/Xbox/PS4/TV Stick/HDMI",
        "price": "$199.98$199.98",
        "originalPrice": "",
        "rawPrice": 199.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Philips-Smart-Projector-Built-Compatible/dp/B0BR3WPF2B",
        "soldBy": {
            "sellerID": "A2OWM9PDLX8LH2",
            "name": "JP Office",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2OWM9PDLX8LH2&asin=B0BR3WPF2B&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "15",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51bdZLGiN0L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51E0acC8uTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51k3GXfi8aL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oM54fFd8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51CwQLTmyeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517f9tYpwtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91BioKHx1AL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1285b0f9-9fca-41f6-b864-9a73de9be7b2/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a7b734d5-639f-4164-8eaf-49dd6d5fd5d5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88cf5e78-441d-4b76-b776-e52814bf602c/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/D1BnmIZNZtL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/D1BnmIZNZtL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Philips Store",
            "link": "https://www.amazon.com/stores/Philips/page/2CC50240-3735-4291-842F-2E61630248F2?ref_=ast_bln"
        },
        "brand": "Philips",
        "merchantInfo": "JP Office",
        "customerReview": "3.7 out of 5 stars",
        "customerReviewCount": 40,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 10 hrs 30 mins",
            "FREE pickup Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "🔥📺【𝐀𝐧𝐝𝐫𝐨𝐢𝐝 𝐏𝐫𝐨𝐣𝐞𝐜𝐭𝐨𝐫 𝐰𝐢𝐭𝐡 𝐁𝐮𝐢𝐥𝐭-𝐢𝐧 𝐀𝐩𝐩𝐬 - TV & Projector Combo】PHILIPS Smart TV projector adds the Android system is more intelligent. You can directly use the preloaded app such as 𝐍𝐞𝐭𝐟𝐥𝐢𝐱, 𝐘𝐨𝐮𝐭𝐮𝐛𝐞, 𝐏𝐫𝐢𝐦𝐞 𝐕𝐢𝐝𝐞𝐨, 𝐚𝐧𝐝 𝐅𝐢𝐫𝐞𝐟𝐨𝐱,which greatly reduces the complicated connection steps, and brings you and your family a more comfortable experience.",
            "📱【𝟐.𝟒𝐆 + 𝟓𝐆 𝐖𝐢𝐅𝐢 𝐏𝐫𝐨𝐣𝐞𝐜𝐭𝐨𝐫 - More Smoother transmission】 Philips Prime 2 outdoor projector embedded with high-proform 5G WiFi chip, Make you own a more stable and lag-free network, which means you can screen mirror with your phone on this projector. Let's enjoy playing games and movies right now, Philips home projector will bring you the ultimate viewing experience.",
            "🎤【𝐁𝐥𝐮𝐞𝐭𝐨𝐨𝐭𝐡 𝐏𝐫𝐨𝐣𝐞𝐜𝐭𝐨𝐫 𝐰𝐢𝐭𝐡 𝟏𝟎𝐖 𝐒𝐭𝐞𝐫𝐞𝐨 𝐒𝐩𝐞𝐚𝐤𝐞𝐫 - 2 Modes of Audio Output 】This outside camping projector with the latest Bluetooth 5.0, support achieves you Bluetooth speakers and headphones immersive sound experience. (Bluetooth not support smartphones). Besides, this backyard projector has built-in stereophonic 5W*2 speakers, a unique form of multi-directional sound, bringing you a powerful auditory feast.",
            "⚙️【𝐏𝐡𝐢𝐥𝐢𝐩𝐬 𝐕𝐢𝐝𝐞𝐨 𝐇𝐃 𝐏𝐫𝐨𝐣𝐞𝐜𝐭𝐨𝐫 𝐰𝐢𝐭𝐡 𝟒𝐃 𝟒𝐏 𝐊𝐞𝐲𝐬𝐭𝐨𝐧𝐞 & 𝟔𝟎% 𝐙𝐨𝐨𝐦 𝐒𝐮𝐩𝐩𝐨𝐫𝐭】 ①Recommends display 80\"-100\", projector distance 5-10ft; ②Digiatl zoom to 60%, ±50 4D | 4P keystone correction, rotation auto, and panel flip functions, you can place it anywhere and easy to get the best viewing effect; ③Adopt self-developed \"Pioneer 2\" Processor, which the imaging tech from cinemas, now brought together in the home, provides amazing realism.",
            "🧰【𝐅𝐮𝐥𝐥𝐲 𝐂𝐨𝐧𝐧𝐞𝐜𝐭𝐢𝐨𝐧 𝐏𝐫𝐨𝐭𝐚𝐛𝐥𝐞 𝐏𝐫𝐨𝐣𝐞𝐜𝐭𝐨𝐫 & 𝐏𝐡𝐢𝐥𝐢𝐩𝐬 𝐏𝐫𝐨𝐟𝐞𝐬𝐬𝐢𝐨𝐧 𝐒𝐞𝐫𝐯𝐢𝐜𝐞】 Not only a 5G wifi projector with built-in apps, but also a movie projector with HDMI, USB, VGA, and MicroSD, you can connect any device such as laptop, tv box, PC, etc. The projector also equipped with exquisite packaging, 7/24 fast responsive replie. It’s supposed to apply to many environments—Games, Camping, Party. It's a good gift choice for friends or family."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎PHILIPS"
            },
            {
                "name": "Item Weight",
                "value": "‎5.46 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎8.5 x 6.6 x 3.12 inches"
            },
            {
                "name": "Special Features",
                "value": "‎Wireless, Portable, Built In Wi Fi"
            },
            {
                "name": "ASIN",
                "value": "B0BR3WPF2B"
            },
            {
                "name": "Customer Reviews",
                "value": "3.7 3.7 out of 5 stars 40 ratings 3.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#377 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "August 1, 2023"
            },
            {
                "name": "Brand",
                "value": "PHILIPS"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Gaming"
            },
            {
                "name": "Special Feature",
                "value": "Wireless, Portable, Built In Wi Fi"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, Wi-Fi, USB"
            },
            {
                "name": "Display resolution",
                "value": "1920 x 1080"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Philips NeoPix Prime 2 5G Wifi bluetooth Projector -- a full-featured smart projector with built-in Android TV system Product Specifications Resolution: Support 1080p,720p,480pBuilt-in Speakers: 5W*2WIFI: 2.4+5G (Wi-Fi 6 technology)Bluetooth: Version 5.0 (Bluetooth Remote Control)Keystone Correction: 4P | 4D (±50° Horizontal Vertical)Zoom Funtion: 100%-60%Recommended Screen Size: 80-100 inches in dark roomUSB*1; HDMI*2; Micro SD*1; VGA*1; 3.5mm Audio Out; 3.5mm AV in Power Consumption Output DC-in: 24V, 4A (AC 100-240V); Operation: 100W, Stand by<0.5W Package List（User manuals can be downloaded from the listing or Philips Office-W-e-bsite) Smart Android TV Projector/ Quick Guide/ Remote Control/ 4-IN-1 Power Cable/ Lens covre/ 2*AAA Batteries for Remote （If any accessories missed or broken, please consult us for help.）",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a2c91708-0b1f-46fc-9c5f-4b0a2cc62b64.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Smart TV Projector with built in Apps - Philips Android Projector Makes Things Easier Do you remember why you want a projector? -Maybe because you can take a outside projector anywhere, like camping, outdoor party, movie time in the backyard; -Maybe projector it is more portable and more cost-effective than TV; -Or perhaps the projector is a really straight-from-heart gift ; ...... Yes, of course, except...a traditional projector must be used via a TV stick or screen mirroring. Thus, Philips NeoPix Prime2 projector was born - a projector with built-in app, such as netfilx, prime video, youtube, etc，never worry anything, it's an true outdoor TV projector in the absolute. Here is the detail - Smart Philips OS System & Built-in Android TV System & Streaming Netflix, Amazon Prime, Youtube This outdoor projector with a built-in Android tv system and integrated smart Philips OS with preloaded apps, which is a more convenient and efficient projector. (More apps will be pushed via FOTA);Compared with traditional projectors, this movie projector makes the operation easier, no more tv stick, and Put down your phone.In addition, you can also change the wallpaper for the projector;and there have time show comes with the projector. Tips: Some app requires login or paid subscription, which is the behavior of the video copyright holder.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/49c922c7-ab86-4e66-a562-8a634a074a3a.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "5G WiFi Connection Advanced Lighting Technology Brings You High-Definition Imaging High-Speed 5G WiFi Projector for phone iPhone smartphone laptop We know that strong and stable WiFi projector can bring us a better experience, so we have adopted the most advanced dual band 2.4G 5G wifi technology to meet users' needs. 2.4G WiFi allows you to use the screen mirroring smoothly without delay; 5G WiFi made the stability and fluency have been greatly improved. So, Use Philips Airplay(for iOS) and Miracast function (for Android), you can share your phone's screen with a few simple steps, and play games more than addicting! How To Connect You iOS Android Device via WiFi Projector？ For iOS Device: Connect both your iOS device and this projector to your home‘s WiFi.Click ”Setting“ and find \"AirPlay\" on projector and enter it.Select ”sreen mirroring“ on your iOS device so that you can successfully use this function. For Android Device: Connect both your iOS device and this projector to your home‘s WiFi.Click ”Setting“ and Find \"Miracast\" on projector and enter it.Select ”Multi-screen“ on your android device so that you can successfully use this function. Tips: Make sure your iOS/Android device connects to the same WiFi with the movie projector Due to HDCP copyright, this wireless projection doesn't support Netflix, Amazon Prime and Hulu, but you could use projector with built in apps.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/506c6f93-d372-4cf4-a1b6-0c99c7377ac4.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Bluetooth 5.0 Outdoor Indoor Projector with HiFi Speaker - Let's Have a Music Feast The latest Bluetooth 5.0 is also a big feature of the projector! Philips Bluetooth projector, which makes the transmission more stable. Connect your bluetooth audio device Bluetooth 5.0 function makes easier to connect with bluetooth devices such as external speakers, wireless earphones etc. and the degree of freedom is greatly improved. （ Bluetooth NOT support smartphones.） Connect to the projector's remote control via Bluetooth Except for the ordinary infrared remote control, this Bluetooth projector adds the function of Bluetooth connection remote, which makes the control more responsive.By the way, once you connect the remote control via Bluetooth, you can operate it like a mouse to select the function you want. Tips for Audio Out: Not support Dolby, if the projector has no sound, turn off the Dolby sound. (Go to Settings > Display & Sounds > Audio > Dolby Digital Output > Turn Dolby OFF) When using Amazon fire tv stick, if the main unit has no sound, open the setting menu of Amazon fire tv stick and change it to [PCM].",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/83ecaccc-ae8a-4ec3-8f9f-071deb2c557f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Philips movie projector for outdoor use with 4P 4D Keystone and 60% Zoom Play on Anywhere, Anytime - It's a Camping Outside Indoor Outdoor backyard Bedroom Projector Customized projection - 4-Point , 4D Keystone Corrections The keystone correction combined with the focus technology allows you to fine-tune images to your needs.Manual Focus: Use the knobs on the projector to make adjustments to achieve the image you want as quickly as possible;Electronic correction(Not AUTO Focus): Use the 4P and 4D(±50° Horizontal Vertical) Keystone functions in the \"setting\" to adjust the image more precisely and make every frame come to life. Equipped with 100%-60% zoom function Compared with the digital zoom of most projectors on the market, we have updated the digital zoom of this pilips projector.We change the ratio of digital zoom to 100%-50%.You can scale the picture to any size you want freely, without changing the colors and proportions of the image. Recommended Projector Size:80-100\" This projector realizes the projection size of the customized projector in the range. The official recommended projection size is 80-100\" in the dark room.The installing methods is also supported table mount, ceiling mount and tripod mount, which can meet diffrerent using requirements!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/84ebd317-b516-4dfb-a236-c4de48ea3de2.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Projector with speaker, Hifi Everywhere The projector is equipped with 2 HIFI speaker. Integrated stereo speakers with equalization and surround sound, and this stereo sound effect brings you unprecedented high-quality sound quality, make sound everywhere, speakers for captivating sound. Bright Pictures, Special Viewing The projector advanced LED light source and support 1080P, it can restore rich and vivid colors and clear pictures. After using this projector, you can enjoy colorful and happy movies time that you'll see, hear, and feel like never before. Advanced Low Energy Consumption Low energy consumption greatly prolongs lamp life to 30,000 hours. You won't need to replace it, it lasts 20 years if used 4h per day! It’s definitely reduces the cost of bulb replace and plays an important role in promoting the green development of the environment.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c84823aa-b206-4d0e-b95d-2c5b7fa097ec.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a63bd59-6a0f-45bd-b215-2b7f4ec17615.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0b813fdb-71c2-4b71-b332-702bbbd8506d.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Philips Outdoor Projector with WiFi and Bluetooth Built in Apps, Enjoy home entertainment Multiple Compatible Device & Installation Methods You can choose the built-in app like NETFLIX,YouTube or download new apps you want. Besides,With multi ports of USB*1, HDMI*2, AV*1, Audio*1, this video projector is supported to connect with most daily using equipment like PC, laptop, iPhone, Andriod phone, USB driver, TV, DVD player, PS4/5, Speaker, TV stick, Roku, Xbox etc. Your life will become more interesting with this movie projector. It's a ideal gift, also Celebrate Holiday decoration projection(projector fake window, birthday party, christmas, halloween, graduation. etc)Immersive experience the world in the game, sports eventsProjector favorite movies with friends outdoors/campingLie in bedroom and enjoy your time alone with a movieWatch the video together to memory the sweet time in the pastEnjoy fitness course at home Hi Customer, Before you bring this bluetooth projector home, there have some points： Philips Prime 2 projector is mainly used for home cinema, not recommended for business presentations or teaching. You will get the best effect with a dark environment.Any questions, let Philips know, we will try our best to give you the best solution.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b61bc99f-7743-4338-96b3-ba95d214eea8.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a2c91708-0b1f-46fc-9c5f-4b0a2cc62b64.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/49c922c7-ab86-4e66-a562-8a634a074a3a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/506c6f93-d372-4cf4-a1b6-0c99c7377ac4.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/83ecaccc-ae8a-4ec3-8f9f-071deb2c557f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/84ebd317-b516-4dfb-a236-c4de48ea3de2.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c84823aa-b206-4d0e-b95d-2c5b7fa097ec.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a63bd59-6a0f-45bd-b215-2b7f4ec17615.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0b813fdb-71c2-4b71-b332-702bbbd8506d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b61bc99f-7743-4338-96b3-ba95d214eea8.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sanjay DC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2YTMIDIFPSH5NHURK3YNYL2KIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VIKM3PUCES85?ASIN=B0BR3WPF2B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect home Projector",
                "reviewText": "The PHILIPS Android TV Projector with Apps and 5G WiFi Bluetooth has exceeded my expectations in every way, earning a solid 5-star rating. From the moment I unboxed and set it up, I was immersed in a world of entertainment that redefined my home viewing experience.The built-in Android TV operating system is a standout feature, offering a user-friendly interface and access to a vast array of apps and streaming services. With compatibility for popular platforms like Netflix, YouTube, and Amazon Prime Video, I can easily access my favorite content with exceptional clarity and color thanks to the Full HD resolution.One of the projector's most striking features is its remarkable brightness and contrast levels, making it ideal for both well-lit and dark environments. The ability to project a large screen size ensures an immersive cinematic experience right at home.The addition of 5G WiFi guarantees seamless streaming and minimal lag, even with high-quality content. Bluetooth connectivity allows me to connect external speakers or headphones, enhancing the audio experience.The built-in speakers themselves offer impressive sound quality, providing an immersive audio-visual experience without the need for additional equipment. The compact and modern design adds an aesthetic touch to any room, and its portability means I can enjoy it wherever I want.With voice recognition, I can control the projector and access information effortlessly. Multiple connectivity options, including HDMI and USB ports, cater to various devices, while casting from my smartphone or tablet is a breeze.The auto keystone correction ensures that the image is always perfectly aligned, eliminating any inconvenience. The low fan noise ensures an undisturbed viewing experience.Overall, the PHILIPS Android TV Projector with Apps and 5G WiFi Bluetooth combines cutting-edge technology with ease of use, delivering a top-tier home entertainment solution. It has enhanced my daily entertainment, and I wholeheartedly recommend it to anyone seeking a 5-star projector experience.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hansa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ5A472VKITPN7MHZ65T6I3IZZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KV1CPE884S48?ASIN=B0BR3WPF2B",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 27, 2023",
                "reviewTitle": "1.0 out of 5 stars Literally the Worst Product",
                "reviewText": "Whatever you do, don't buy this projector. I bought it because it's Phillips and a trusted brand but I've had the worst issues. Setting up the remote with the manual given in the box was a pain. It took me half an hour to finally set up and use the remote. I then downloaded a software update which removed Netflix from my listed apps. So I had to do a factory reset just to get Netflix back. It got stuck with setting up the time and date, so I manually set that up and no matter how I changed it, I couldn't login to Netflix.Finally when I did login to Netflix and switched the projector off and on again it made me start right at the beginning from choosing language and setting up date and time. Every time you switch off the projector and switch it on again, you have to choose the date and time. It even signs you out of all the apps, so you have to sign in to them all over again every time you want to use the projector. I was looking forward to this and now I'm so disappointed.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ryan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEABEC3LJHXQ2HFN64EXOSG2HQFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4G27F8D14G96?ASIN=B0BR3WPF2B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome projector, super convenient and solid value!",
                "reviewText": "I recently purchased the Philips Android TV projector, and it has definitely helped transform my home entertainment experience. This projector has built-in Netflix and YouTube apps which is awesome for being able to move it around or take it somewhere else, not having to rely on connecting an external device to stream content from. It has an impressive array of streaming options right out of the box. Just a small note: make sure to follow the instructions and if you want to get the most out of the smart app features, follow their advice and avoid the updates so it doesn't interfere with the app compatibility.The image quality is very good for the price, giving a very nice display when watching movies and shows. Especially noteworthy is its 4D-4P Keystone and zoom capabilities, which make setting up for the perfect viewing much easier, especially in tighter/smaller rooms like mine.One of the best features has been the projector's compatibility with a variety of devices and flexible connection options. Whether it's my computer, phone, Xbox, or fire stick, the projector has connections and options for everything and allows you to select between them seamlessly. The WiFi and bluetooth connections are really awesome and convenient features to have for connecting as well.All in all, this Philips projector has been an excellent purchase for my home entertainment setup. It's a perfect blend of high-quality visuals, user-friendly functionality, and versatile connectivity options. Highly recommended for anyone looking for a good projector at a solid price.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}