{
    "remaining_requests": 39369,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Epson-EpiqVision-Streaming-Projector-Speakers/dp/B0BCXTVXMC",
    "body": {
        "name": "Epson EpiqVision Ultra LS800 Ultra Short Throw 3-Chip 3LCD Smart Streaming Laser Projector, 4,000 Lumens, 4K PRO-UHD, HDR, 150\", Android TV, 2.1ch Yamaha Built-in Speakers - Black",
        "price": "$3,499.99",
        "originalPrice": "",
        "rawPrice": 3499.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Epson-EpiqVision-Streaming-Projector-Speakers/dp/B0BCXTVXMC",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BGZXVLQN"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BCXTVXMC",
                "variationName": "Style",
                "variationValue": "EpiqVision Ultra LS800 - Black",
                "price": "$3,499.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BCXT6BSP",
                "variationName": "Style",
                "variationValue": "EpiqVision Ultra LS800 - White",
                "price": "$2,999.99",
                "variationImageURL": ""
            },
            {
                "asin": "B08R181KB9",
                "variationName": "Style",
                "variationValue": "Projector",
                "price": "$3,199.00",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31bCMdrqwKL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41-NwXTnVXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KZ0XvMPBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WU8iWtsoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ezhsMlP-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41a1vYJDHFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1151dsAvlL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/504c81d2-b96a-4829-9232-6ce46adf722a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/81dfa7a6-e8e6-43f4-93f6-804a3d97ef70/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4cac3de3-0039-441f-80c1-cb8887067f89/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a6c9ae73-e788-4d3e-a4e2-c71396a9f8ca/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a3b8310-1da4-4188-b2db-8b13148384e9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6cdcd5f-ad5d-423a-bcc5-6dbab08b7042/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Epson Store",
            "link": "https://www.amazon.com/stores/Epson/page/938A6E01-68B6-4115-8369-91F0063B474B?ref_=ast_bln"
        },
        "brand": "Epson",
        "merchantInfo": "Ships from and sold by Smart*Buy.",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 100,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 8 hrs 31 mins",
            "FREE delivery February 22 - 29.",
            "Or fastest delivery February 20 - 22."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Picture Size up to 150\" — Get closer to courtside for sports and gaming, or center stage for your favorite movies, with an immersive big picture; unlike regular-throw projectors, it offers hassle-free placement, projecting images up to 150\" from just a few inches away",
            "10-Bit HDR — Full 10-bit HDR color processing accepting 100% of the HDR source. When combined with the extreme brightness of 4,000 lumens – HDR content is faithfully reproduced for an exceptional visual performance.",
            "Modern Ultra Short Throw Laser Design — Sleek ultra short throw laser design seamlessly complements a variety of décor styles and audio/video furniture; features multi-point picture adjustment and individually adaptable feet for quick and easy setup",
            "Supports the Latest Streaming, Gaming and Cable Boxes — Take maximum advantage of your favorite gaming consoles and streaming devices with three HDMI ports; fully compatible with virtually all color formats, depths and spaces while simultaneously supporting 4K HDR (1) content at a full 60 Hz; ideal for gaming content, one HDMI port is dedicated for gaming and supports 1080p/120 Hz signals",
            "Epson SilverFlex Ambient Light Rejecting Screen (4) — Available and sold separately in two sizes, 100\" and 120\", these screens are engineered to absorb up to 90% of the ambient light to increase contrast and produce an astonishingly crisp picture",
            "Amazing Built-in Sound from Yamaha — Built-in 2.1ch virtual surround system designed by Yamaha exclusively for Epson creates immersive sound performance with presets for TV, Sports Movies and Music; connect your smartphone via Bluetooth to use as standalone speaker",
            "Smart Streaming Capability — Latest Android TV (5) interface with a simple-to-use remote—including voice search with built-in Google Assistant; watch all your favorite streaming channels including Amazon Prime Video, Hulu, Disney+, HBO Max, YouTube and more; even stream live TV with apps like YouTube TV (6)"
        ],
        "description": "Go Epic with a Courtside View! The best way to watch sports, the Epson EpiqVision Ultra LS800 3-Chip 3LCD Smart Streaming Laser Projector produces a larger-than-life picture up to 150\" for an astounding 4K HDR (1) experience. Equipped with proprietary 4K PRO-UHD (2), 3-chip 3LCD technology and an incredible 4,000 lumens of color and white brightness (3), the EpiqVision Ultra LS800 Laser Projector combines an advanced ultra short throw lens with a laser-array light source—along with an optional Epson SilverFlex® Ultra high-resolution ambient light rejecting screen (4)—to produce vivid colors and deep blacks for an exceptionally bright, colorful and sharp picture in virtually any viewing environment—even in brightly lit rooms. Featuring a sleek, modern design, the EpiqVision Ultra LS800 Laser Projector seamlessly fits within a variety of décor styles and complements the full range of audio/video furniture to create a modern-looking system. Plus, with its unique ultra short throw lens, the EpiqVision Ultra LS800 Laser Projector can be placed mere inches from the wall for easy, obstruction-free viewing. Whether you’re watching a live sporting event, streaming your favorite series, gaming on the latest generation of consoles or watching a blockbuster movie, the Epson EpiqVision Ultra LS800 Smart Streaming Laser Projector will simply amaze you. 1. HDR performance available with select devices. For more information, see www.epson.com/hdrcompatibility | 2. 4K Resolution Enhancement Technology shifts each pixel to produce an image on screen, up to the stated specification. | 3. Color brightness (color light output) and white brightness (white light output) will vary depending on usage conditions. Color light output measured in accordance with IDMS 15.4; white light output measured in accordance with ISO 21118. | 4. Available in 100\" and 120\". Sold separately. | 5. In order to use the Android TV, the device must be configured on a network via a wireless connection of 5 Mbps or faster. | 6. Requires wireless network connection of 5 Mbps or faster. Some apps require paid subscriptions. | 7. For convenient and reasonable recycling options, visit www.epson.com/recycle | 8. SmartWay is an innovative partnership of the U.S. Environmental Protection Agency that reduces greenhouse gases and other air pollutants and improves fuel efficiency.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "13.4 x 27.4 x 6.2 inches"
            },
            {
                "name": "Item Weight",
                "value": "27.6 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0BCXTVXMC"
            },
            {
                "name": "Item model number",
                "value": "V11HA90120"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 100 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#327 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "September 29, 2022"
            },
            {
                "name": "Manufacturer",
                "value": "Epson"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "Epson"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Gaming"
            },
            {
                "name": "Special Feature",
                "value": "Built-In Speaker, Ultra Short Throw, Short Throw"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, Wi-Fi, USB, HDMI"
            },
            {
                "name": "Display resolution",
                "value": "3840 x 2160"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page The Epic Way to Watch Sports. You have no idea what you're missing. This is an entirely new level of immersion and entertainment. Unique Ultra Short Throw Laser Array Technology A new type of laser projection, producing exceptional color & brightness only inches from your wall. The New 4K PRO-UHD & HDR Experience Benchmark Advanced picture processing for a stunning 4K PRO-UHD (1) and HDR (2) experience Proprietary Epson 3-Chip 3LCD Technology Impressive 4,000 lumens (3) of color & white brightness—ideal for virtually any viewing environment. A Perfect Match for ALR Screen Technology When combined with an Epson SilverFlex ALR Screen (4), the picture quality becomes truly epic. Next page 1 Image Size up to 120″ 2 Ultra Short Throw Design 3 4K PRO-UHD & HDR10 4 Ultra Bright Picture 5 Even Better with a Screen",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/13ccf9cb-45bd-4596-8d8e-2b241a9ed228.__CR0,0,4392,1800_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/147e993e-1add-4d3a-82d2-cfd2ab3f709b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c2345c6-a44f-4251-b79c-bf420dab654f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ed32a0af-c041-4a89-9783-5365634e31bb.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7c382e28-b1b4-4ff7-8ede-f6fb03d10870.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e0ff7f6a-b5af-4669-8033-3f69961f5a2e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/695e7766-149a-4739-8357-fe38d1e15eb8.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Noxink",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG75QAFHRW6VRIDV2QPGFVSWVIRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S94X4GM28WXK?ASIN=B0BCXTVXMC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing projector, and great for gaming",
                "reviewText": "This projector is fantastic. It has great color, an app that can adjust for wall waviness if you don't have a screen where you are using it, amazing blacks and whites, and keeps up with gaming with no trouble. Would definitely recommend.We do have a screen, but we haven't put it up yet. We just haven't gotten around to it, and the projector looks so good even without it.To be fair, we do have a pretty great area for a projector. We don't have a dedicated theater room, but it is in a basement room with half windows covered with blackout curtains on either side. It works rather well.My only gripe is that the physical size of the projector is big enough that it was a bit of a hassle to hunt down a surface to sit it on. We ended up with a coffee table. I'm not in love with it, but it works. We do have some added difficulty due to having to find something rather low to the ground since the ceilings are only 8ft in the room it is in.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Max Draco",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVW6AVBKDPY63XHAXIDYCQZF3HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLOIZE05WGQNL?ASIN=B0BCXTVXMC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2022",
                "reviewTitle": "4.0 out of 5 stars Sharp, Bright, Vibrant picture. AndroidTv needs some work.",
                "reviewText": "You can find a lot of reviews on the web regarding this projector. My experience with it matches with those reviews, and you’ll be able to find all the Pros of owning the projector in those write-ups. I’ll list a few of the Cons or issues that I didn’t see listed in most of those.- AndroidTv works fine, although it’s not as refined as the Nvidia Shield. I actually wish they hadn’t of included the OS because if feels a little incomplete or lacking in features. Hopefully they’ll release an improved version soon. The projector will be a nice all-in-one streaming device If they fix some of the bugs and provide more functionality.- No Netflix support!!! – I suppose it could be added later, but it’s irritating waiting for the OS to boot so you can switch hdmi inputs to use a full featured streaming device.- Lacks a default source option. It boots straight into AndroidTv, so each power up forces you to switch hdmi inputs when you prefer to use a third-party streaming device.- Built-in AndroidTv streaming HD can be flaky (spinning progress wheel) trying to buffer shows. This requires a reboot to fix. Although I haven't noticed it with firmware 1.02 yet.- HDMI-Arc CEC function is flaky and Arc doesn’t stay linked. I have to constantly disable and reenable HDMI-Arc with each power up. It will stay linked if the receiver is never powered off.- Sound output options are limited and the selected option is flaky too, it occasionally defaults and has to be reset.- Square Alignment is possible, but very time consuming, because it's very sensitive to minor adjustments. It will take a solid hour if you want the squarest picture before using their phone app to auto correct the image (which works awesome and flawlessly). Although one small bump or minuscule movement will distort the image again. Start with the rear height foot first and don't adjust the Left\\Right keystone feet until the top\\bottom image is where you want it.- Manual focus ring is stiff and does not have a very ‘exact’ or precision spot on feel to it (kind of feels like a cheap plastic toy camera).- My unit locked up during a firmware update. The system downloaded the firmware and started the install. Then it rebooted with fans on hi with a steady blue power light (system ok indicator), but no image displayed and the OS wouldn't boot. After a few mins the unit will reboot with fans on hi, a steady blue power light and no image (it kept doing this). There were no devices or cables plugged into the unit at the time. Epson support was easy to work with and offered to replace with a new unit, but I wasn't sure I wanted a projector that has the potential to brick with a simple firmware update. I played around with hooking up a receiver to the HDMI2-Arc port to see if something might output. For whatever reason that allowed the projector to continue the firmware update. The power button started flashing blue for awhile and eventually restarted successfully.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matt Pollick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESOYZOD7ASO25KJAAIQEVUAUEGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GNV5UEGJZHAL?ASIN=B0BCXTVXMC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing quality picture. Still will wash out some with ambient light, but the best I have seen.",
                "reviewText": "Love this projector so far. I have owned many over the years and this one is great, saves a ton of time and effort not having to ceiling mount it and it looks fantastic. Hopefully it will work well for many years to come.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TroybTroyb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGUZBGXATMQE7QABUJ5IKZH5VNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSZLRRXL7223F?ASIN=B0BCXTVXMC",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2023",
                "reviewTitle": "1.0 out of 5 stars I can't recommend this.",
                "reviewText": "The media could not be loaded. I can't give a proper review. all I can say is it's big and the colors on screen suck. Other then that I couldn't get it to work nor could the nice lady on Epson support line. I turned on the projector and everything was fine at first. I got to Google home and I started to watch YouTube. I could not get it to focus. I spoke to Epson and they said the focus is in the positioning of the projector. There are no option. So strike one. I moved this thing every direction. I'm very tech savy and not slow at all. this thing is broke or it just a blurry image. The tech support lady told me to update the projector. I get a notification to update the projector. I'm like that's it. All it needs is an update problem solved. Nope! It completes and installs. Everything is going well, except the focus is still off. it really blurry. I'm using a CLR screen from elite screens. So there nothing wrong with my screen. After it restarts and complete the update. I get back to Google home again. I play YouTube and then it goes blank and the fans are going high speed and the light is flashing on and off. I figure maybe it's loading it something. It does that for next 30 minutes and it finally stops. No picture though. So I turn it off and power it back on. still no image. I call Epson back. They said to check my HDMI cords and they were good then they recommend to unplug it for 30 seconds. That did work. Oh except I have a message that says play back has been stopped for safety reasons. What safety reasons. This stupid thing thinks the air is a person? I got a bad batch. It works then it doesn't. Buy at your own risk.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51znPRmWKrL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61qcZHh2fyL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eef79d1f-5d8d-4b45-9d2e-53f841de7032/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "RileyRiley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVKCTQBQWLYZ627IKGD6SJGETRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BSXS4J8DGDGC?ASIN=B0BCXTVXMC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Fantastic Projector",
                "reviewText": "I had a normal bulb projector for 5 years now and it was finally time to upgrade to a UST. I’m so glad I did, this thing works amazing! It’s soooo much brighter than my old one! I can finally watch it during the day with the curtains open. I’m pretty amazed by the brightness. It was super easy to set up, plug it in and you’re good to go. I need to move my existing screen up because as all UST projectors, the image needs like 5-8” of vertical space from the base of the projector to the bottom of the image. Something to keep in mind! Love the googletv interface too! Overall great projector!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Jxzw4JtFL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Shiner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJZM4VMUMO7TQHW7WT33Y5STMPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CQLIKF3SSTLB?ASIN=B0BCXTVXMC",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2023",
                "reviewTitle": "2.0 out of 5 stars Spend another grand and buy a 83' OLED",
                "reviewText": "NOT bright enough for a well lit room, plus when you turn up the brightness(which barely changes the brightness) the fan gets loud enough to be annoying. The interface is ugly and difficult to navigate. Did you want Netflix? You'll need to buy a Roku or something. Seriously what device doesn't support Netflix? When you DO get a Roku the HDMI port is wonky occasionally tossing up errors, requiring a power reboot of everything to get it working. I've tried many high end cables, same issue. I have a 65in OLED, it's vastly superior to this thing.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B Tugs 5",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 15, 2023",
                "reviewTitle": "It's huge",
                "reviewText": "Short throw is very, very nice. Good speaker, good picture. The unit itself is huge. I would say like an old dot matrix printer. For those under 40, they were really big.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 29, 2023",
                "reviewTitle": "Inputs are loose",
                "reviewText": "The HDMI and optical audio ports very easily loose connection, just trying to put cover back over ports can cause then to loose connection. Lots of image pixelation even with proper HDMI cables and motion correction set to low.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$3,498.99",
                "sellerName": "AVNation",
                "sellerRating": "4.5"
            }
        ]
    }
}