{
    "remaining_requests": 39413,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Projector-Bluetooth-Native1080P-Compatible-Smartphone/dp/B0BYJ3JLDW",
    "body": {
        "name": "Projector with WiFi and Bluetooth, 5G WiFi Mini Projector, Native1080P Portable Outdoor Projector with Remote Control, 9000Lux Movie Projector Compatible with Smartphone/TV Stick/PS4/Laptop/Switch",
        "price": "$49.99",
        "originalPrice": "",
        "rawPrice": 49.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Projector-Bluetooth-Native1080P-Compatible-Smartphone/dp/B0BYJ3JLDW",
        "soldBy": {
            "sellerID": "A26U46GO1KOIQ9",
            "name": "Windor Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A26U46GO1KOIQ9&asin=B0BYJ3JLDW&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CSFFZSWP"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51DNcAOLtQL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51oASrIyu5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61yvbhoAzcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51p-Uv2HEHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51k1bLvubsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41j3cny5A8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81n5G-Lf-hL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1fd95a98-d70c-450c-94e0-236d8f4fad46/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b529ea7-9a39-40e4-9d96-13b4f36260ec/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/91e870f3-5027-4d4e-95e5-20d8f56543c2/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8525cace-f3d9-47ae-98e3-40b8e277ff3b/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ab75674-b286-45db-89c0-886eb300a919/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 5,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the pericat Store",
            "link": "https://www.amazon.com/stores/Pericat/page/5BCE3E33-A3E7-405B-BC41-B4982698B618?ref_=ast_bln"
        },
        "brand": "Pericat",
        "merchantInfo": "Windor Store",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 11,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【❤️‍🔥Native 1080P Full HD Resolutions & 9000Lumen 】- Pericat X26 Mini Projector adopts the 2023 latest Projection Technology and LCD color calibration and high light transmittance with native 1920x1080P resolution, 3000:1 contrast ratio. Combining an innovative high-refraction 6-layer glassed lens ensures the best video experience. This Full HD 1080p projector has a high brightness rating of 9000 lumens for brighter, clearer, and more vivid pictures and videos.",
            "【❤️‍🔥Stable WiFi Connection & Mini Projector】- With latest dual-band 2.4G and 5G WiFi Connection, Pericat wifi projector offers you a more stable connection and lag-free online video, music enjoyment.This mini projector is only 5.5”x4.7”x2” (1lb), almost the size of your smartphone, you can easily put this mini projector in your handbag, backpack, or suitcase, Whether you are watching movies, or enjoy sports live streaming, outdoor camping or party with friends, this is the good choice for you.",
            "【❤️‍🔥300'' Giant Display& Zoom 50-100% & Built-in Speakers Bluetooth Projector 】- The Movie Projector offers a display 30\"-300\",50-100% Zoom function and 4:3/16:9 aspect ratio , 3.5-35ft projection distance. Built-in dual stereo speakers with HiFi system provide great sound, it gives you high-quality lossless sound quality without any noise. With the newly upgraded 2023 Bluetooth 5.1 technology, you can easily connect this projector to your Bluetooth device to better improve the sound quality.",
            "【❤️‍🔥Compatible with Multiple Devices 】- This 5G WiFi Projector is equipped with the built-in HDMI, AV, USB, and 3.5mm headphone port, this projector is compatible with TV Stick/Box, PS3/4/5, PCs, Smartphones, Tablets, Laptops, DVD players. Prefect for for movie, video games, party, outdoor activities, soccer game live etc.",
            "【❤️‍🔥Ideal Gift & 3 -Year Satisfied Warranty】- Equipped with exquisite and compact packaging, this mini video projector is an ideal gift for children, boyfriends, girlfriends, friends, and loved ones. Bring this projector to enjoy a wonderful reunion time with family and friends. We are committed to improving product quality and service, we provide 24/7 customer service and if you encounter any problems, you can contact our customer service team, and we will do our best to help you."
        ],
        "description": "Pericat HD Native1080P Projector Enjoy more fun with your family The 2023 new upgrade projector is very suitable for home theater and outdoor movies, and can also be used to match your Switch, Xbox, Playstation, etc. The length of this mini projector is close to your 5.6\" mobile phone, and it only weighs 1LB, Put it in your carry-on bag,you can use it at any time and everywhere. Pericat 5G WIFI projector X 1 Power cord X 1 HDMI cable X 1 AV cable X 1 Remote control X 1 Instruction manual X 1",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎pericat"
            },
            {
                "name": "Item Weight",
                "value": "‎2.05 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎5.5 x 4.7 x 2 inches"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎X26"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Color Name",
                "value": "‎Grey+White"
            },
            {
                "name": "Special Features",
                "value": "‎Family Party, Home Cinema, Outdoor, Indoor, Gaming, Birthday Party"
            },
            {
                "name": "Speaker Type",
                "value": "‎Built-In"
            },
            {
                "name": "ASIN",
                "value": "B0BYJ3JLDW"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 11 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#497 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "March 10, 2023"
            },
            {
                "name": "Brand",
                "value": "pericat"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Family Party, Home Cinema, Outdoor, Indoor, Gaming, Birthday Party"
            },
            {
                "name": "Special Feature",
                "value": "Family Party, Home Cinema, Outdoor, Indoor, Gaming, Birthday Party"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Display resolution",
                "value": "1920 x 1080"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Pericat 5G WiFi Native 1080P Projector, designed for your happy life! Want to spend a cozy time with your family? Do you want to play games with a bigger screen? Worried about not knowing what gift to give your child？ Do you not want to waste time and money going to the cinema to watch a movie? Pericat 2023 upgrade portable projector would help you with all these needs, start your home theater now. Why Choose Us? 9,000 Lumens High Brightness During the birthday party, anniversary celebration, or graduation party, our projector will help you to create the best atmosphere. You can also use the smart projector to project pictures to assist in cookie teaching, party decoration, virtual window projection, painting, sewing and so on. 5G WiFi Bluetooth Function With the latest 5G WiFi connecting function, ultra-high-speed 5G WiFi movie projector can offer you a faster wireless speed, wider range, and smoother transmission than other 2.4G single band projectors. Native 1080P Resolution The pericat video projector with a true 1920 x 1080 resolution,compared with the old 720P projector, the native 1080P is clearer, without noise, and the colors are bright and vivid, providing you with a visual feast, whether you are watching videos or playing games. Real Mini Portable Projector The powerful projector is very exquisite and compact, you can easily put it in a suitcase, handbag, schoolbag, and enjoy the cinema anytime, anywhere without limitation of time and space.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c75d82b9-3382-4384-803d-1269c0ced618.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Sharper Picture with Natvie 1080P It reproduces colors accurately and you can enjoy beautiful images with high quality and fine definition. It is especially recommended to use this projector in a dark environment, which can give you a high degree of restoration of the cinema effect. 9000 LUX for brighter lmage The projector has updated brightness, 80% brighter than the same level small projectors.and this 9000 lumens projector is almost the same as the original video display, without color distortion, highly clear, very suitable for watching ball games, sci-fi movies, playing games, etc. 3000:1-Wider Color 3000:1 contrast ratio, designed for you who have higher requirements for color, using a high-contrast projector, you can see a wider color gamut and more vivid and colorful colors. 300\" Large Screen The display size will vary depending on the projection distance. The max projection size of this Pericat projector is 300\". The recommend projection size is about 100\", while the projection distance would be 8ft-9ft.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c3fcc759-bb89-4a46-8324-c868c67999fc.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "About Pericat Pericat is a mature team focused on projector production and sales. Pericat has always been committed to listening to customers' voices, developing and innovating with customer needs as the center, develop and innovate, and are committed to providing customers with more and better products.At the same time, we continue to improve our after-sales support, so that customers can feel family-like care. We will do our best to help you with any problem. Pericat HD Native1080P Projector Enjoy more fun with your family The 2023 new upgrade projector is very suitable for home theater and outdoor movies, and can also be used to match your Switch, Xbox, Playstation, etc. The length of this mini projector is close to your 5.6\" mobile phone, and it only weighs 1LB, Put it in your carry-on bag,you can use it at any time and everywhere. Pericat 5G WIFI projector X 1 Power cord X 1 HDMI cable X 1 AV cable X 1 Remote control X 1 Instruction manual X 1",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f5ef6814-a117-44df-a223-af4f79f44211.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d0024155-bb47-4cd5-a9db-a2c19ebce7ee.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Newly Upgraded Bluetooth 5.1 Connection Technology With the upgraded Bluetooth function, the hd iphone projector has the same complete functions as the big projector. You can use Bluetooth to connect your advanced audio equipment and enjoy the stereo surround sound. Now start your home theater! Tips: 1.Due to copyright , Videos like Netflix,amazon prime, Disney and Hulu are not support to play it directly by mirror screen with smartphone , must be connected TV stick to Play it ; 2.Make sure both your smartdevice and the wifi projector are connect to the same wifi network； 3.Recommend to use in a dark environment for the best performance. 4.Be careful when plugging and unplugging power port to avoid port damaging. 5.Not Recommended for business presentation. 6.The TV stick needs to be purchased separately and is not included in the package. 7.If you encounter black spots on the screen, you can use a clean cotton swab, open the cover on the bottom of the projector (under the label), and gently wipe the dust to use normally. 8.Due to the variety of mobile phone models on the market, according to feedback, it is not suitable for Google mobile phones.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03d1a8a7-5f31-4b47-b82d-352b6ada3010.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Excellent LCD Lens The x26 4K projector ues 7 layers of well-grinding LCD lens to offer our customers the clearest resolution on every detail. And the advanced LED bulbs last up to 60,000 hours. The LED light source is healthy and has no infrared light and ultraviolet radiation, not blinding dazzling. It can be very good to protect the elderly and children's eyesight. Built-in HIFI Stereo Speaker Built-in dual stereo speakers,the projector provide you with high-quality stereo sound. Powerful speakers give you an immersive experience without the need to connect additional PA equipment in your home. You can connect the projector with external speakers via bluetooth or 3.5mm jack cable to improve the sound. Super Quiet operation & Fast Heat Dissipation Using the latest cooling technology, our projectors are very quiet and not prone to heat up, without the annoying machine running sound of the product when watching movies.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3c4530e0-a813-4ddb-8743-851511fa26f5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/878fa1b8-260b-4bf8-9a16-97c82ccf8d5d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d5fc0e86-0dab-40dd-905e-3fbaf7c2db34.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Zoom Function Our highpeak projector for iphone is equipped with the most advanced 50%-100% zoom technology. You can use the remote control to zoom and expand the screen without moving the projector. It is flexible to use and can easily adjust the screen to your desired size. Foucusing /Keystone Function: It may be difficult to directly obtain a clear and vertical picture during projection. You can use the ±15°keystone correction function to adjust the tilt angle of the picture, and then use the focus function to make the picture clear (the lens can be directly rotated and corrected to make the picture focus) Ideal Gift for Kids The X26 movie projector indoor adopts 7-layer high-refraction glass and anti-blue light technology, which can protect children's eyes very well. It has a cute mini appearance and a light weight. It is very suitable as a Christmas gift or birthday gift for children.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02e5e0c0-c90d-4555-a4a1-d12e873161fc.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8a2430aa-156e-4f60-9bcf-168d2c68f384.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a937ec03-6548-47fc-8cc8-993798fa2f34.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "How to Connect the Projector with Your Devices via WiFi? For iOS Device 1. Connect the projector to your home Wi-Fi router. 2. Select Screen Mirroring from the signal source to enter the iOS Screen Mirroring interface. 3. Connect your iOS device to the same Wi-Fi router. 4. Turn on screen mirroring on your iOS device and select \"X26-XXXXX\" from the search results to connect. For Android Device 1. Please check if your Android phone has a Screen Sharing function in Settings first; 2.Connect the projector to your home Wi-Fi router; 3. Select \"Screen Mirroring\" from the signal source to enter the \"Android Screen Mirroring\" interface. 4. Connect your Android device to the same Wi-Fi router. 5. Start the \"Multi-screen\" function of your Android device and select \"X26-XXXXX\" from the search results to connect.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/babc2bd9-f9e1-48c5-8828-c118f8dcde9f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c75d82b9-3382-4384-803d-1269c0ced618.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c3fcc759-bb89-4a46-8324-c868c67999fc.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f5ef6814-a117-44df-a223-af4f79f44211.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d0024155-bb47-4cd5-a9db-a2c19ebce7ee.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03d1a8a7-5f31-4b47-b82d-352b6ada3010.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3c4530e0-a813-4ddb-8743-851511fa26f5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/878fa1b8-260b-4bf8-9a16-97c82ccf8d5d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d5fc0e86-0dab-40dd-905e-3fbaf7c2db34.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02e5e0c0-c90d-4555-a4a1-d12e873161fc.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8a2430aa-156e-4f60-9bcf-168d2c68f384.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a937ec03-6548-47fc-8cc8-993798fa2f34.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/babc2bd9-f9e1-48c5-8828-c118f8dcde9f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marcus",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTEEGMYGUP7OPSFLFIW74W6T6QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YT9FGRBMSHCS?ASIN=B0BYJ3JLDW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars A really good projector",
                "reviewText": "I love it a lot haven’t had any problems yet and I’ve had it since September",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Happy shopper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNPWWIG57RYYWRPSQQPKBW2HK7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RA4HA1C7VHOI?ASIN=B0BYJ3JLDW",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "3.0 out of 5 stars Projector worked",
                "reviewText": "The projector worked however after many attempts of trying to get my IOS to pair with the unit which were both on the same WiFi and after reading the instructions a few times the unit failed to connect to my iPhone 13. I had no security features on my WiFi even made sure I was using the right password. It would show up on my phone when I attempted to cas via Airplay but failed ever time. I’m a techy guy so I know I wasn’t missing any steps so I returned it simply because of the inability to connect via Airplay",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CourtneyCourtney",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AES4OK6J6A4NBYSL5MXBE6VYVKHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11T0FXAMKX4EF?ASIN=B0BYJ3JLDW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "4.0 out of 5 stars Great picture and sound for such a small device",
                "reviewText": "This 1080P Full HD Resolution Mini Projector gives off bright vivid and vibrant LCD colors, and provides a very clear picture for watching movies and videos. Works off 5G WiFi Connection with little to no lag time. This mini projector is small and lightweight. It measures 5”x4.7”x2” and can easily fit in your purse or backpack, making this a convenient and transportable drvice. It is very easy to travel with. This has a Built-in dual 5.1 Blutooth Speaker technology that works amazing for its size. This also has a Zoom function with a 4:3/16:9 aspect ratio, and a 3.5-35ft projection distance. Easy to set up and use. Connect this projector to your Bluetooth device and you are ready to go. This can be used with most Bluetooth devices because it has a built-in HDMI, AV, USB, and 3.5mm headphone port and is compatible with TV Stick/Box, PS3/4/5, PCs, Smartphones, Tablets, and Laptops. This comes with everything you need for a successful watching experience.I got this to replace a tv in my daughters bedroom that broke. We put it on a small desk and pointed it at her white bedroom wall. She was able to stream and watch her movies that she's been using her phone for on a bigger picture right on her wall. I think this is a very nice and convenient product that can be utilized in many ways for leisure, home and for office. It is durable and sturdy and will hopefully last. This also comes with a convenient remote control. I definitely reccomend giving this device a try. The mini projector is a great value when compared to similar items with what this one offers. Thank you",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61MUc6IeoVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61VyHYztwkL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61k-T4clBpL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71OR9nI38iL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXYUA3UE4I7JCKI5C73UF2CHUYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R541J8TIXPSZ?ASIN=B0BYJ3JLDW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars great projecting",
                "reviewText": "I like how the projector screen sizing is changeable and can be adjusted. The projector came in great packaging and came with all the cables needed. The projector does need to be in a full dark room with not too much light in it to see in a better POV.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura Perez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWDF5OMJTQ66TSX6WSBMVV7SYYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39B3J947UO4JY?ASIN=B0BYJ3JLDW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Cheap, but good quality",
                "reviewText": "For the price, this is a good projector.I love the small factor and does what I need it to do. It is bright enough,great product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Duram",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHCBXIEGE7XTSECX4E5LNJJFOLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24OUA7EQ3YI2D?ASIN=B0BYJ3JLDW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome compact projector!",
                "reviewText": "This projector is pretty good!!If you need a huge screen for a small price, then this projector is what you need.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pennysue L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDV35EXPSUK5TTJ5RZYZWO7GMRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11YOW5PC8DP5D?ASIN=B0BYJ3JLDW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 7, 2023",
                "reviewTitle": "5.0 out of 5 stars it's the great!",
                "reviewText": "The powerful projector is very exquisite and compact, you can easily put it in a suitcase, handbag, schoolbag, and enjoy the cinema anytime, anywhere without limitation of time and space.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juelye",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCNMTG5ESUYL7TSW2FT4EH7TQYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QP406UTR9BOE?ASIN=B0BYJ3JLDW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Works perfectly",
                "reviewText": "The size was perfect and the projector was super light.We can see the image very clearly and it has great resolution.Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}