{
    "remaining_requests": 39475,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/WiMiUS-1080P-Projector-Supported-Bluetooth/dp/B0CSP8F66L",
    "body": {
        "name": "WiMiUS 1080P Projector 4K Supported With WiFi & Bluetooth 5.2",
        "price": "$249.99",
        "originalPrice": "",
        "rawPrice": 249.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/WiMiUS-1080P-Projector-Supported-Bluetooth/dp/B0CSP8F66L",
        "soldBy": {
            "sellerID": "A1XK8B3KB0YGSM",
            "name": "Fortune direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1XK8B3KB0YGSM&asin=B0CSP8F66L&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "Only 2 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51wsFi23wwL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the WiMiUS Store",
            "link": "https://www.amazon.com/stores/WiMiUS/page/40EE88F6-9B8E-4617-AA2B-759B8F3BE298?ref_=ast_bln"
        },
        "brand": "WiMiUS",
        "merchantInfo": "Fortune direct",
        "customerReview": "",
        "customerReviewCount": 0,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 3 hrs 44 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Innovative autofocus and keystone correction: Projector has autofocus and keystone correction technology, an integrated high-precision sensor, detects movements in real time and focuses faster and more accurately. A few seconds show the stable and clear image after booting the projector. The keystone correction chip and the Camera Intelligent work together and automatically correct the rectangular image when the side projection and tilt angle do not exceed 20°.",
            "WiFi 6 and Bluetooth video projector: projector uses the latest WiFi6 technology, a higher transmission rate and lower latency than 5G, a few seconds are wirelessly synchronised to get a large screen. No additional adapter required. Built-in Bluetooth 5.0 chip, the projector allows you to connect the ideal Bluetooth speaker/headphones at any time and save every detail sound effect to offer you different sound scenes",
            "1080P full HD projector and portable bag: with a native resolution of 1920 x 1080, a high dynamic contrast ratio and supports full HD 4K videos. The video projector is equipped with a 6-layer coated glass with high light transmission. With 90% NTSC technology and high reproduction of the original colour. the 1080P projector provides a more realistic and natural viewing experience.",
            "4P/4D keystone and 300 inch large screen: Wimius home cinema projector is not only equipped with horizontal and vertical 4D correction, but also adopts an extended 4-point keystone correction, so that the projector can be placed anywhere. The full HD projector supports front/side/ceiling projection. Enjoy the 300\" screen at any time, and 50% zoom allows you to adjust the image to a comfortable size without moving the projector.",
            "Multiple connections and presentation support: Equipped with 2 x HDMI ports, 2 x USB ports, AV port, 3.5 mm audio output, this LCD projector works easily with Fire TV Stick/laptop/DVD player/PS4/PS5/TV box/X box/smartphone, the projector also plays Microsoft Office files directly from the USB stick, while other projectors need to connect the laptop to play."
        ],
        "description": "WiMiUS full HD projector 1080P uses the latest auto focus and trapezoidal correction technology and has a WiFi6 Bluetooth function. Multifunctional, simplifies operation, cost-effective. Give you a different large picture experience.Projection mode: front projection ceiling mount/rear projection ceiling mount/front projection table mount/rear projection table mount. Auto focus and trapezoidal correction, say goodbye to lengthy operationsThe built-in high-precision global autofocus function combined with the camera module makes the focus of the projector faster, more accurate and convenient, and the image is clear within seconds of starting the projector.Maintain the electrical focus! You can also focus the image electrically via the remote control (F+/F-) and adjust it to your needs.The 1080P projector is equipped with a new hardware keystone correction chip and intelligently works with the high-definition camera to make the correction more accurate. Free your hands (the angle of the projector does not exceed 30°) Warm tips: It is recommended to use the projector in a dark environment, not for daylight useBluetooth cannot connect to smartphones and smart devices, but only to Bluetooth speakers, Bluetooth headphones and soundbars.It is normal for the LED projector that fan noise is about 45 dBThe projector does not support HDMI ARC functionThe projector does not support Dolby. If the Fire Stick has no sound, please set the sound to stereo sound or turn off DolbyThere are 4 holes at the bottom of the projector. Please pull out the padded rubbers. The screw size is M5 x 12 mm.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎WiMiUS"
            },
            {
                "name": "Item Weight",
                "value": "‎6.43 pounds"
            },
            {
                "name": "Package Dimensions",
                "value": "‎14.37 x 10.08 x 6.22 inches"
            },
            {
                "name": "ASIN",
                "value": "B0CSP8F66L"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#962 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "January 18, 2024"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [],
        "otherSellers": []
    }
}