{
    "remaining_requests": 39334,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bluetooth-Projector-CLOKOWE-Portable-Compatible/dp/B09C1SD5DC",
    "body": {
        "name": "Projector, CLOKOWE 10000L 1080P HD 5G WiFi Bluetooth Projector, Portable Movie Projector with Screen, Home Theater Video Projector Compatible with Android/iOS/TV Stick/PS4, Support 4K&300”",
        "price": "$124.35",
        "originalPrice": "$124.35",
        "rawPrice": 124.35,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bluetooth-Projector-CLOKOWE-Portable-Compatible/dp/B09C1SD5DC",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51mNkJS6gZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51FKeaAe79L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41whAfRu1YL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VrNQPyRuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mFVT0 IRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Ovw3rUL3L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/11f41c97-cece-4a9e-a9e2-6082459147c4/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the ClokoWe Store",
            "link": "https://www.amazon.com/stores/CLOKOWE/page/B9B821F6-7C81-4D3B-B6B6-09F3746296BD?ref_=ast_bln"
        },
        "brand": "CLOKOWE",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 339,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22",
            "FREE delivery Friday, February 23"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Native 1080P Full HD Resolution: Introduced the latest LCD display technology, CLOKOWE native 1920 x 1080P HD projector with 10000:1 high contrast provides over 95%+ brightness than other 1080p projectors. Packaged with a 100 inch portable projector screen, the outdoor movie projector gives you a brighter and sharper visual feast whether in home theater or outdoor. Adopted high-refraction glassed lens, the video projector offers an outstanding color accuracy for movie entertainment.",
            "Wireless & Bluetooth & Dolby Support: With 2.4G/5G WiFi connection, the outdoor projector can mirror movies/videos/photos/games from your iOS or android device to big screen(NO NEED TO BUY EXTRA CABLES), With Bluetooth connection, the portable projector can wireless connect to external speakers or Bluetooth earphone. Dolby audio improves the acoustic fidelity of the movie projector for outdoor use. The zoom function makes the projector easier to adjust the screen size from 75% to 100% by remote.",
            "Multiple Devices Connection & Low Noise: Equipped with HDMI / AV / SD / USB port, CLOKOWE YG661 home theater video projector can properly compatible with TV Box, Fire Stick TV, Chromecast, PC, laptop, tablet, external speakers, Xbox, DVD player, PS3, PS4, USB stick, media players, iPad, iPhone, Android smartphone and etc. With upgraded fan system and the application of innovative material, the mini bluetooth projector brings less noise. (4K Supported Partially)",
            "Hi-fi Stereo Speaker & Advanced Cooling System: Built-in 3W dual stereo speakers with an SRS sound system, the wireless projector provides a fantastic auditory sense experience to enrich your family entertainment life . Even without external speakers, the led projector is very easy to set up. Adopt the newest cooling system, the phone projector has a fast heat dissipation, making it cool down quickly even after a long-time use.",
            "Lifetime Professional Repair & Technical Support: CLOKOWE specializes in the production and development of projectors for more than 10 years and possess Dolby License, CE, FCC, RoHS, PSE certificates. We provide 6-month return & 3-year repair, lifetime professional customer service & technical support. If you have any problem, please feel free to let us know and we will be here for you 24-7-365. Absolute worry-free after-sales service for you."
        ],
        "description": "Projector, CLOKOWE 1080P HD WiFi Bluetooth Projector, Portable Outdoor Movie Projector with Screen, Home Theater Video Projector Compatible with Android/iOS/HDMI/USB/TV Stick/Laptop/PS4",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Video Projectors",
                "link": "https://www.amazon.com/Projectors-Monitors-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=300334"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "10 x 7.5 x 5 inches"
            },
            {
                "name": "Item Weight",
                "value": "2 pounds"
            },
            {
                "name": "ASIN",
                "value": "B09C1SD5DC"
            },
            {
                "name": "Item model number",
                "value": "YG661"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 339 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#935 in Video Projectors"
            },
            {
                "name": "Date First Available",
                "value": "August 6, 2021"
            },
            {
                "name": "Manufacturer",
                "value": "ClokoWe"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "ClokoWe"
            },
            {
                "name": "Special Feature",
                "value": "Speakers"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, USB"
            },
            {
                "name": "Display resolution",
                "value": "1920 x 1080"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "1920 x 1080"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "2023 Upgraded WIFI and Bluetooth Native 1080P Projectors Supersize the Fun in HD CLOKOWE 2.4G/5G WIFI projector offers faster transmission in movie. Native 1080P with 4K support deliver outstanding sharpness image. Dolby Audio & Bluetooth function which you can enlarge the outdoor movie sound without any lag, such as:backyard movie night,football games,home party,outdoor party. 1",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ea25f57a-7aa3-4825-b446-99363bdbdb92.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Previous page Native 1080P & 4K Support 4K Support & Native 1080P Resolution, and see the detail, colors, contrast truly pop in 1080p HD. Faster Wi-Fi Connection 2.4G/5G Wireless Screen Mirroring movie projector offers faster & stable transmission. Big-Screen Entertainment Supersize your entertainment from a huge 45” to 300” image and projection Distance from 4.3 to 28 ft Next page 1 Native 1080P & 4K Support 2 Faster Wi-Fi Connection 3 Dolby Audio & Bluetooth 4 Big-Screen Entertainment 5 Support Multiple Devices",
                "media_link": []
            },
            {
                "media_text": "Multi-purpose Projector With an advanced smart noise cooling system, the small projector has a fast heat dissipation and produces less noise.Not only can you enjoy movies and parties with your friends and family, but it can also be used for yoga, cooking, and painting to enrich your life. Perfect Gift for Any Occasion Great Christmas gifts, Thanksgiving gifts, birthday gift, congratulation gift, vacation gifts, Valentines day gift, Mother's day gift, anniversary gift for yourself and your family, which will bring the happiest to your loved ones smile.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ee59007-9c9c-4394-b9ca-7b654bdbb9a1.__CR0,0,650,350_PT0_SX650_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3dcca9b8-d30e-4509-866c-f2ab22a93e4d.__CR0,0,650,350_PT0_SX650_V1___.jpg"
                ]
            },
            {
                "media_text": "How to Pair the Bluetooth Device? 1. Make sure the Bluetooth device is in pairing mode. 2. Turn on the Projector and choose Setting- Find the Bluetooth and turn on the Bluetooth, then Press Scan to pair the devices. How to Screen Mirror the Android Device to the Projector? 1.Turn on the projector and select \"CAST\".Go to the \"WiFi Setting\" to make sure the projector connects to router's WiFi. 2.Connect your device to the WiFi. 3.Activate the Multi-screen function on your device, select the \"YG661-XXXX\"and click to pair. How to Screen Mirror the iOS Device to the Projector? 1.Turn on the projector and select \"IOS Cast\".Go to the \"WiFi Setting\" to make sure the projector connects to router's WiFi. 2. Open \"Screen Mirroring\" on your device and click \"YG661-XXX\" to pair. (make sure your phone is connected to the same wifi) Can the Bluetooth of the projector connect phones? The Bluetooth of the projector can connect with Bluetooth speakers/Earphones/Soundbar, but can not connect with Phones/Computers. Can the projector cast to stream \"YouTube, Amazon Prime Video, Netflix, Hulu\"? Currently only YouTube streaming is supported.Due to copyright issues, the mirror display function doesn't support protected videos (Netflix, Amazon Prime Video and Hulu), but you can play these videos via HDMI connection, such as fire tv and Roku.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ea25f57a-7aa3-4825-b446-99363bdbdb92.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/97a81d35-6880-4130-b08d-a7b41bd98cf4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/62c456e5-89f9-4207-ae66-ad90ef4e98b0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/56f88b20-91f3-4ddc-b871-4feaec8bcf83.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/af97820e-27d5-4f95-b910-56dc5e0a70d9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/25e52b58-7ef9-42df-a891-591702e254a9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/efbad4b4-9546-4a88-ab72-7adcef270291.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ee59007-9c9c-4394-b9ca-7b654bdbb9a1.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3dcca9b8-d30e-4509-866c-f2ab22a93e4d.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ea349a83-bd41-4a81-b053-fa28765d463b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Unclebull",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4YE43WD5XBN24VP2KADC7H22CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPNP8MY42GAR5?ASIN=B09C1SD5DC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2022",
                "reviewTitle": "5.0 out of 5 stars Excellent Projector at a Great Price",
                "reviewText": "I bought this as a treat for myself as well as for use at monthly meetings that I attend and conduct where we could conduct Zoom meetings while combatting the COVID viruses. I researched quite a few projectors but finally settled on this model due to previous reviews as well as the features offered on this unit. for my brother as he wanted a projector for a while and glad I did as he loved the gift.This being my first personally owned projector but familiar with other units while employed (happy retiree now 😊) I am very, very impressed with the video quality which in my opinion is impeccable when I compare it to those units used while employed. I can definitely see the difference between the antiquated models I was previously used to vs. this 1080P model.The CLOKOWE 9600L 1080P HD 5G WiFi Projector was extremely easy to set up. In less that 10 minutes I was able to start watching a movie on this projector. Once I got comfortable with the unit, which took very little time, I tried USB port & wireless casting via iPhone & windows laptop for playing movies.One of the other selling features for me was the fact that the unit comes with a 100-inch projection screen, but I also experimented and found that it works quite well with no blurriness when projecting on a white or very light-colored wall. The unit did an excellent job in both a darker room as well as an illuminated room.I found playing a 1080p movie to be very smooth, without any distortion or lag. I was also impressed that the pictures were clear and sharp when I tested at a screen size larger than the 100 inch screen provided. In the event that one needs to focus and make the image sharper/clearer, you can rotate the adjusting focus knob that is conveniently located on the side of the unit. I was also impressed as to how easy the menu options that are provided on the screen were very easy to navigate and use. The built-in speakers provided more than adequate sound.To recap, I would highly recommend this unit.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Magner CepedaMagner Cepeda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGY4GB6B5EWJQ7AGI3LRLJN26MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYRR7UATGQ1U?ASIN=B09C1SD5DC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Better overall in its price range than most.",
                "reviewText": "Very good projector for the money. Well-made and relatively easy to operate. The only problem with it is the very low volume of the speaker. You definetely need to buy a good dolby soundbar or else stick your ear to the projector to hear anything. The provided screen is totally worthless; it's just a flimsy transparent veil. If you don't have a smooth large white wall to project on, buy yourselves a good 200 inch screen. But this projector is very bright and responds good to the remote. It mirrors Android very well, and the Bluetooth works fine,too. It's compatible with Dolby sound. I'm very happy with it and recommend it. I had bought a different one of similar price, but had to return it for not supporting Dolby. Also the remote on that one was slow and erratic to act. This one is much much better. After using it for two weeks, I like it even more. I've found out, the hard way, that most problems with the quality of the image are actually caused by a defective screen. After tweeking my low-price screen a lot, I've been able to improve the image to where I feel satisfied. The best screen of all, in my opinion, is a smooth, flat-white wall. Fabric screens present a lot of problems; some are too translucent, others wrinkle easily. But this projector itself renders a very good image, plenty bright (even with one light bulb on in the room).",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/518tviC17TL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61qg2uPslcL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike Gardner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGP2GTUECHVA2QS74KISLEN5GBCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BLM5ID0AK7MM?ASIN=B09C1SD5DC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2022",
                "reviewTitle": "4.0 out of 5 stars Great picture quality. Audio is lacking",
                "reviewText": "So we decided to give this a try over a new tv for our gaming and movie nights. Got to say this is perfect for smash bro's with all of my friends. The built in speakers are a great volume for that. When it comes to watching something together it's just lacking a bit. So we went ahead and figured out the bluetooth (had to look up a video on it as it is not mentioned anywhere in the manual). There is just enough of a delay on the bluetooth audio where it drove all of us nuts. So we're going to have to get something that'll use the aux. Not end of the world but would have appreciated knowing that confidently before buying.Overall I'm already suggesting it to friends. It's really convenient and a lot easier to move around than a tv. If your the type that likes to have people over for any kind of screen time, this is an official need in your life.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tonja steelman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMAD7CVQMOHED22C2VIZKK2HI5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVQ1H47LMPDJ7?ASIN=B09C1SD5DC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2022",
                "reviewTitle": "5.0 out of 5 stars Good picture awful sound",
                "reviewText": "I have only used this 1 night as it needs mounted in my home, or has to be on a 4 ft. shelf in the center of the room, which doesn't work with kids running around. The sound is NOT loud enough to hear it unless sitting right next to it so if your gonna get it you might think about getting a good sound bar as well as a mounting unit. I think I will like it better once I get it mounted and a sound bar hooked up to it. UPDATE : February 14,2022The company got ahold of me after reading my review and gave me a full refund. I'm very impressed and will be changing the stars I gave them. I would happily buy from this company again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JRMom of 2",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZQBJZRFW3WNI564JZP26LHYTCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16YE4G2PDWXM5?ASIN=B09C1SD5DC",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "3.0 out of 5 stars Own 3...",
                "reviewText": "Purchased 3 for 3 different classrooms.First machine has barely any sound. I have to use an external speaker.Second machine works as it should.Third machine won't even power up. The blue power light just blinks. Returned it.Obviously this unit is very inconsistent. If you draw the lucky straw and end up with a good one, it is indeed worth it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeffrey D. Sauer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEEOVLED7EXKA6P4YS3SIUBNJHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN0B8MIYD0KXB?ASIN=B09C1SD5DC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 10, 2022",
                "reviewTitle": "5.0 out of 5 stars Nice little projector!",
                "reviewText": "For the price, I've found this to be a solid little projector. Image is very bright, and I like the placement of the controls: focus using the dial on the side, and keystone correction using the jog dial on the back. The wifi interface works well, but the password dialog doesn't accept long passwords, a minor issue that likely won't affect most users. My main setup is using an AppleTV device via the HDMI port and everything looks great. Again, for the price and features, I don't think you can go wrong with this device.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "14 from Babylon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3RQSW4YE5XMJMTFMNHUCVF5FLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLE06ZHL68QM0?ASIN=B09C1SD5DC",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 27, 2022",
                "reviewTitle": "1.0 out of 5 stars BUYER BEWARE",
                "reviewText": "READ BEFORE YOU BUY. THIS THING DOES NOT SCREEN MIRROR FOR WHAT IT WAS PURCHASED FOR. IT DOES NOT MIRROR NETFLIX, AMAZON, ETC. 50% OFF AND ITS STILL OVERPRICED FOR WHAT YOU GET. WORKS GREAT WITH MOVIES ON AN EXTERNAL HARD DRIVE. GUESS ITS BACK TO PIRATING MOVIES.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}