{
    "remaining_requests": 34015,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lodge-Square-Pre-seasoned-Draining-Grilling/dp/B0000CF66W",
    "body": {
        "name": "Lodge L8SGP3 Cast Iron Square Grill Pan, Pre-Seasoned, 10.5 Inch, Black",
        "price": "$21.90",
        "originalPrice": "$39.50",
        "rawPrice": 21.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lodge-Square-Pre-seasoned-Draining-Grilling/dp/B0000CF66W",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BNPSRDBL"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "6.5 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "10.25 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0000CF66W",
                "variationName": "Size",
                "variationValue": "10.5 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "Grill Pan",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0000CF66W",
                "variationName": "Style",
                "variationValue": "Square Grill Pan",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41VHD T7e4L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Qvh9pmQIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pWwsNLDBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 P-Jc7VJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61hKCL8JNEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MTA6fOzoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/712Aty2XvHL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Lodge Store",
            "link": "https://www.amazon.com/stores/Lodge/page/8CDF8DDD-A601-44CD-B8E7-BD01D910704A?ref_=ast_bln"
        },
        "brand": "Lodge",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 31632,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 3 hrs 41 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Foundry seasoned, ready to use upon purchase",
            "Use on all cooking surfaces, grills and campfires",
            "Oven safe",
            "Sauté, sear, fry, bake and stir fry to heart's content",
            "Made in the USA"
        ],
        "description": "Product Description The Lodge Cast Iron Grill Pan allows grease to drain away from the food while creating tantalizing grill marks. This square grill pan is seasoned and ready to use and perfect for cooking bacon, steaks and more. Brand Story By",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Cookware",
                "link": "https://www.amazon.com/cookware/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289814"
            },
            {
                "name": "Pots & Pans",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=19343857011"
            },
            {
                "name": "Grill Pans",
                "link": "https://www.amazon.com/Grill-Pans/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289822"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Lodge"
            },
            {
                "name": "Material",
                "value": "Cast Iron"
            },
            {
                "name": "Special Feature",
                "value": "Induction Stovetop Compatible"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Capacity",
                "value": "1 Ounces"
            },
            {
                "name": "Compatible Devices",
                "value": "Smooth Surface Induction, Gas, Electric Coil"
            },
            {
                "name": "Product Care Instructions",
                "value": "Hand Wash Only"
            },
            {
                "name": "Item Weight",
                "value": "6.5 pounds"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Is Oven Safe",
                "value": "Yes"
            },
            {
                "name": "Model Name",
                "value": "L8SGP3PLT"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "No"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Use in the oven, on the stove, on the grill, or over a campfire"
            },
            {
                "name": "Product Dimensions",
                "value": "17.25 x 10.5 x 2.62 inches"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "Lodge"
            },
            {
                "name": "ASIN",
                "value": "B0000CF66W"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "Grill Pan"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 31,632 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#810 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #2 in Grill Pans"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 2, 2001"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "10.5 Inch Square Seasoned Cast Iron Grill Pan A modern twist on a timeless classic, this Lodge Square Cast Iron Grill Pan features grill ribs that elevate food and collect cooking drippings. Product at a Glance The right tool to sear, sauté, bake, broil, braise, fryBrutally tough for decades of cookingSeasoned for a natural, easy-release finish that improves with useUnparalleled in heat retention and even heatingAt home in the oven, on the stove, on the grill or over the campfire",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/869800fe-b9e9-45a3-b156-d6f4db6aaa2a._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "Why Buy Lodge Cast Iron As the only full line of American-made cast iron cookware, Lodge's quality has been unmatched for over a century. Even heating, a natural easy-release finish, versatility and durability are the hallmarks of our great cookware. We don't just make cast iron; we make heirlooms that bring people together for generations.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/8ed0316d-8aac-4e79-bc46-658b1e069a6f.__CR582,0,1000,1000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "About Lodge Cast Iron Founded in 1896, the Lodge family has been making high quality cookware and accessories for over a century. Lodge Cast Iron operates two foundries on the banks of the Tennessee River in the small town of South Pittsburg, Tennessee; a town Lodge is proud to call home. The company is built on family values, American history, and high quality cookware. All Lodge seasoned cast iron and carbon steel cookware is proudly made in the USA, meaning you’ll get craftsmanship that has been passed down through generations.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e199aaff-785f-472a-8b14-67bae9507e0a._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "Cooking And Caring For Your Lodge Seasoned Cast Iron Caring for your cast iron doesn’t have to be complicated. Lodge cookware comes already seasoned and ready to use, so you can make your family's favorite recipes right away. You can use it on any heat source, from the stove top to the campfire (just not the microwave!). The more you use it, the better the seasoning will get. Wash cast iron by hand with mild soap or none at all Dry promptly and thoroughly with a lint-free cloth or paper towelRub with a very light layer of vegetable oil, preferably while the cookware is still warm Hang or store cookware in a dry place",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/df4a8811-003a-48ed-a27b-88ad88b14940._CR0,0,300,300_PT0_SX300__."
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/361c51a7-8dde-495e-a58b-fb808ab1e0d9._CR0,0,971,300_PT0_SX970__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/869800fe-b9e9-45a3-b156-d6f4db6aaa2a._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8ed0316d-8aac-4e79-bc46-658b1e069a6f.__CR582,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e199aaff-785f-472a-8b14-67bae9507e0a._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/df4a8811-003a-48ed-a27b-88ad88b14940._CR0,0,300,300_PT0_SX300__."
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kevin K. Fosler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFYECSDSHVFE3JEM3KAYVNFBDZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN6WRSX5J5NE9?ASIN=B0000CF66W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 12, 2006",
                "reviewTitle": "5.0 out of 5 stars Does a good job, things to be aware of ...",
                "reviewText": "I just cooked a thick ribeye steak using this grill. It's the first thing that I have cooked on it. Similar to a cast iron frying pan that I have, this generates a lot of \"smoke\". I had to take the battery out of my smoke detector, and open windows. I think I cooked it at a slightly higher temperature than I needed to. If smoke is a problem, think twice about buying this.The result is the best steak I have ever cooked indoors. It beats any electric grill I have ever used, and it beats the George Foreman grill hands down. I would say that the results are almost restaurant quality. I look forward to cooking hamburgers within the next day or so.I think this would work better with slightly less thick cuts of meat. Even at high heat it took longer than it would have taken on a grill. During the cooking I put a metal lid over the pan to control splattering.I think it will be a breeze to clean. Oiling it after cleaning, with the ridges, will be a little more work than for smoother surfaces.Because the ridges are so high, the grill does a great job of cooking away from the fat, and probably (my guess) does even a better job than the George Foreman grill in that regard.Pans like this pay for themselves. This pan is about the cost of a dinner for two, and it will result in less eating out.Update: I cleaned the pan after making the steak. It was more difficult to clean than other cast iron pans due to the ridges, however, I think I need to find a different tool to clean it with. Someone recommended a grill pad or brush. Also, I usually put the pan over enough heat to evaporate any water from cleaning, and then apply a thin amount of oil. This was also harder. I think it will get better with practice. In any case, the results were worth it.I will be trying burgers and pork chops soon, so stay tuned!Update: I cooked pork chops tonight on this grill, and they are the best pork chops I have ever had in my life. I let the pan heat up, and usually also have the electric burner on high heat when adding the meat. I then turn it down a bit. The cast iron doesn't cool off, and it sears the juices in. I have found that a metal cover over the grill works well to keep in splatters and heat. Another thing that is helpful is a temperature fork, which told me tonight that the chops were at 180 degrees, otherwise I would have overcooked them.This is by far the best money that I have spent on cooking equipment, and it will definitely save a lot of $$$ because I will treat myself to excellent home-cooked meals more often.",
                "reviewVotes": "843 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBJM3A6C5AMCJD72OC3VWAGEA2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPQ7RCT80AJRM?ASIN=B0000CF66W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Steak was grilled perfectly",
                "reviewText": "I had been thinking of buying a grill pan and I conveniently ran across a grill pan review in People magazine. The review rated this pan best overall so I decided to try it out. My steak was grilled perfectly the first time I used the pan! It had nice sear marks and the meat was juicy and tender. I have been known to overcook meat, I like my steaks medium rare, but this steak was done just right. And since I'm not a very good cook that says a lot. Since I tend to be a klutz in the kitchen I also ordered the silicone hand holder which worked great. With the hand holder I had no problem holding the pan. The scrapers that I ordered also worked well. Even with the scrapers the pan was slightly difficult to clean, but you are dealing with a pan that doesn' have a smooth surface., I plan on trying out some seafood and veggies on this pan this weekend.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Victoria EliasVictoria Elias",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2O5NZNU3K5EUVVB23LAMLTCSYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMWB9QENATDLW?ASIN=B0000CF66W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2018",
                "reviewTitle": "5.0 out of 5 stars Great grill pan, but read and follow the care instructions!",
                "reviewText": "This grill pan is great! I live in an apartment but longed for the grill marks and enhanced flavor from an outdoor barbecue. I don’t have good ventilation either, so indoor cooking that produces too much smoke is not a good idea. I was originally looking at electric grill pans, but most of them had reviews indicating they broke down easily. I like my regular cast iron skillet so I gave this a shot. So far, I’ve made bratwurst, corn on the cob, different types of chicken, bacon and then caramelized onion after in the fat (for a quiche), eggplant, homemade ground chicken burgers with garlic and jalapeño, and zucchini. I’ve also taken it camping. Nothing has gotten stuck, and I only used cooking oil the first few times (the others were either naturally fatty or I used the drippings from fatty foods cooked prior, which really kicks food up a notch in terms of flavor).To anyone who hasn’t owned a cast iron skillet, or has gotten rust on theirs: DO NOT ALLOW THIS TO STAY WET. I mean, no air drying, no soaking, no “let me loosen it up by letting the water sit a while as I do other things and forget about it.” You MUST dry this pan thoroughly, and then coat it with oil (make sure the pan is warm). Also, don’t use soap!! One of the best things about a cast iron skillet is the “seasoning” that forms. Soap eats away at it and then: 1. You have to go through the trouble of re-seasoning it the “long” way by baking the pan in high heat, and 2. Your food will probably taste soapy. This is how I care for mine, and I’ve never had any problems (e.g. rust, cracking, etc.). It’s the same advice I got when I bought my first cast iron skillet, mixed with internet research, and it’s the safest option to ensure its longevity:• I let the pan cool down before washing it (sudden temperature changes aren’t good, especially cold water on a hot pan... this is called thermal shock and will lead to cracks/broken pans)• I use a dedicated silicone sponge that I never use dish soap on to wash it in warm water. I also bought the Lodge grill pan scraper because it makes clean up much easier than getting into each groove individually• I wipe the pan down with a paper towel• I heat the grill pan on the stove on medium-low heat until the remaining water evaporates• After the pan cools down a little (but while it’s still warm), I use a clean paper towel to rub oil ALL over it (it’s made of one piece of metal so you need to protect the entire thing, including the handle and reverse side)• I put it back in the cabinet and make sure never to store a damp/wet pot or pan near itAlternatively, you can use salt instead of washing it. I don’t use this method because it adds another thing I have to worry about buying and/or I’d use up my good salt, so I just find it easier to wash it. But some people swear by the salt method. You just pour salt into the pan right after cooking, allow it to soak up remaining food bits and oil, and then wipe it down and season with oil as described above while it’s still warm (or after you’ve reheated it).Tips:• olive oil has a low smoke point, which means it’s ill-suited for use with grill pans. Use an oil with a higher smoke point instead (such as corn oil or grapeseed oil)• don’t go above medium heat• be careful when handling it, as it retains heat for a long time and heats very evenly, which means the handles are hot! I got the silicone handle cover AND silicone pinching mitts and with those, I feel safe handling the pan when it’s warm/hot, but otherwise I would avoid it because the pan is heavy (especially for a woman) so you have to hold it tight and you’ll probably drop it if you don’t protect yourself from the heat• you can use metal utensils on it, but be careful not to scrape that precious seasoning off• don’t cook overly acidic foods in it because the acid will eat through the seasoning (such as tomatoes)• if your food is smoking too much, turn the heat down and/or reassess the type of cooking oil you’re using• do a thorough cleaning and season the pan with oil every time you are done using it for a while. (If I’m cooking different meals over a day or two, I’ll sometimes just keep using it with only a wipe down, so you don’t have to clean it right away, but don’t let it sit too long and don’t use too much oil when seasoning it because eventually the oil can putrify. And never, ever leave it wet!)If you follow these rules, this pan should last decades, and you’ll have a great seasoning on it whenever you cook. Do a little research on long-term care, such as when and how to remove and re-season the entire pan, and what type of oil you’ll like most, and you should love this pan.",
                "reviewVotes": "1,792 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71-xsxWhmrL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71Ct2+YZbSL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71DuJoFH+PL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71JIuv1fBQL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71UD7YOKMJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71da6tngpYL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71iA3zck79L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71lKopzCopL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Clarence & Joyce T.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDKPA2KLK6NCSXXVK436ZIIKRJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DCK2GFVOOOQK?ASIN=B0000CF66W",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "4.0 out of 5 stars Too heavy......",
                "reviewText": "Love the way it's made. This is the type of Skillet I wanted. But it is much, much, too heavy......",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Badfinger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTZVNVMLSAQ4CO4DOFJZRUSQCKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2H3KKF7CCRENK?ASIN=B0000CF66W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Great cast iron grill pan",
                "reviewText": "I had one of these Grill pans before from Lodge I used it for years and is very easy to clean and reseason..Unfortunately when I moved it somehow disappeared.I am glad I found this one at Amazon with a great price.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 12, 2024",
                "reviewTitle": "Great substitute for the BBQ during those long winter months!",
                "reviewText": "Like my other Lodge cast iron pan, this one is well made and properly pre-seasoned. It's pretty much the same pan except square and with a grill bottom. This makes it a bit more difficult to clean, but not that much more so. It does a great job on steaks and grilled vegetables -- almost like having an indoor BBQ!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mario ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 9, 2023",
                "reviewTitle": "La qualité de la fonte Lodge Ce n’est pas #1 c’est Vraiment le Meilleur",
                "reviewText": "Parfait",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 26, 2023",
                "reviewTitle": "Duradero",
                "reviewText": "Muy buen sartén, tiene calidad de construcción.Lo buenoEs durable (con su debido mantenimiento).Asa muy bien.Lo maloEs pesado y su agarradera no es tan grande y te llega a lastimar.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juan Pablo ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 23, 2023",
                "reviewTitle": "Muy bueno!!!",
                "reviewText": "Muy bueno!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frank",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 15, 2022",
                "reviewTitle": "Cumplió mis expectativas.",
                "reviewText": "Excelente parrilla, solo es necesario seguir las instrucciones que vienen para evitar que se oxide. Básicamente lavar, secar y aceitar (aceite comestible).",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$21.90",
                "sellerName": "RestaurantSupply",
                "sellerRating": "4"
            }
        ]
    }
}