{
    "remaining_requests": 34104,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/GS-3400P-Portable-Backpacking-Emergency-Preparedness/dp/B01HQRD8EO",
    "body": {
        "name": "Gas One GS-3400P Propane or Butane Stove Dual Fuel Stove Portable Camping Stove - Patent Pending - with Carrying Case Great for Emergency Preparedness Kit",
        "price": "$31.53",
        "originalPrice": "$31.53",
        "rawPrice": 31.53,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/GS-3400P-Portable-Backpacking-Emergency-Preparedness/dp/B01HQRD8EO",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/419I4 HiGsL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/517jK38xRkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nRT-Y8F2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uFIam SbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41TpiiIj1aL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518Xi Qm8zL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91-XZUgGB L.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/47f36a73-a87b-4bbf-91e4-76f2501de532/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c92563b-c8c5-4dad-a71e-35029616dfe5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a713463-0f11-455a-a15a-611b895f422f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/abe90fa0-e494-4a3a-98f9-9389c529d7cc/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/00a1445b-b954-4328-a6a1-1b0117273277/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/90a8b91b-fc5a-44e4-81c2-9d369cc9acfc/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Gas One Store",
            "link": "https://www.amazon.com/stores/GasOne/page/B4418252-82D9-4038-883C-8E8E4E97CDEC?ref_=ast_bln"
        },
        "brand": "GasOne",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 12078,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 2 hrs 59 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Duel Fuel - Compatible With Both Butane (Fuel Not Included) And Propane Fuel (Fuel Not Included), Operates On A Single Butane Cartridge 8 Oz Or A Propane Cylinder 16.4 Oz , Propane Converter Regulator Included",
            "Automatic Piezo Electric Ignition - Piezo-Electric Ignition That Eliminates The Use For Lighter/Matches In Order To Ignite Flame, No Need For Lighters Or Matches With This Stove",
            "Easy To Use - Our Gs-3400P Is Easy To Use With Adjustable Heat Dial And Automatic Piezo-Electric Ignition",
            "Safety Features - Built In Pressure Sensor Cartridge Ejection System And Gas Flow Cut Off Mechanism (Butane), Will Eject Cartridge When Irregular Pressure Is Detected"
        ],
        "description": "Reward the experience of cooking outdoors by introducing the GS-3400P. The GS-3400P is the perfect portable stove that is perfect for any outdoor cooking and camping occasion. It is safe and easy to use! Designed with safety functions like the cartridge ejection device and the flame supervision system, the GS-3400P ensures safety and convenience.",
        "breadCrumbs": [
            {
                "name": "Sports & Outdoors",
                "link": "https://www.amazon.com/sports-outdoors/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3375251"
            },
            {
                "name": "Outdoor Recreation",
                "link": "https://www.amazon.com/outdoor-recreation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=706814011"
            },
            {
                "name": "Camping & Hiking",
                "link": "https://www.amazon.com/camping-hiking/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3400371"
            },
            {
                "name": "Camp Kitchen",
                "link": "https://www.amazon.com/Camp-Kitchen-Camping-Backpacking/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2204505011"
            },
            {
                "name": "Stoves & Grills",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3400941"
            },
            {
                "name": "Camping Stoves",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_6?ie=UTF8&node=19450136011"
            }
        ],
        "productInformation": [
            {
                "name": "Item Package Dimensions L x W x H",
                "value": "‎14.11 x 12.46 x 3.7 inches"
            },
            {
                "name": "Package Weight",
                "value": "‎2.25 Kilograms"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎13.5 x 11.2 x 4.4 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.1 Pounds"
            },
            {
                "name": "Brand Name",
                "value": "‎Gas One"
            },
            {
                "name": "Warranty Description",
                "value": "‎1 Year"
            },
            {
                "name": "Model Name",
                "value": "‎GS-3400P"
            },
            {
                "name": "Color",
                "value": "‎Stove"
            },
            {
                "name": "Material",
                "value": "Alloy Steel, Metal"
            },
            {
                "name": "Suggested Users",
                "value": "‎unisex-adult"
            },
            {
                "name": "Number of Items",
                "value": "‎1"
            },
            {
                "name": "Manufacturer",
                "value": "‎Gas One"
            },
            {
                "name": "Part Number",
                "value": "‎GS-3400P"
            },
            {
                "name": "Model Year",
                "value": "‎2017"
            },
            {
                "name": "Style",
                "value": "‎Stove"
            },
            {
                "name": "Included Components",
                "value": "‎Stove, Propane Converter"
            },
            {
                "name": "Size",
                "value": "‎Stove"
            },
            {
                "name": "Sport Type",
                "value": "‎Hunting, Outdoor, Tailgating, Camping"
            },
            {
                "name": "ASIN",
                "value": "B01HQRD8EO"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 12,078 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#583 in Sports & Outdoors (See Top 100 in Sports & Outdoors) #1 in Camping Stoves"
            },
            {
                "name": "Date First Available",
                "value": "June 29, 2016"
            },
            {
                "name": "Brand",
                "value": "Gas One"
            },
            {
                "name": "Fuel Type",
                "value": "Liquefied Petroleum Gas"
            },
            {
                "name": "Product Dimensions",
                "value": "13.5\"L x 11\"W x 4.45\"H"
            },
            {
                "name": "Power Source",
                "value": "Gas Powered, Corded Electric"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e454629c-573a-459e-98ef-77f6ef929a11.__CR1,0,2021,625_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f8998231-29b0-4a76-a0d2-8becb705a2ba.__CR0,0,2022,625_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4dc7b126-2ca0-45e5-9108-89cfa19265e5.__CR0,0,2022,625_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8f673cb7-fb72-43d3-9435-a861b435d329.__CR1,0,2021,625_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ba156915-81c5-4e59-8093-698474c46017.__CR0,0,2022,625_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "p1mkw",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELIFKAI6IKTPZASFTLRSYQMQYFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26ZWT27SLP3NQ?ASIN=B01HQRD8EO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Why did I wait so long",
                "reviewText": "First of all, depending on how you intend to use this, consider the 15,000 BTU unit instead. This works OK and will certainly come in handy if/when I ever suffer a prolonged power outage. I should have bought this years ago since I live in Florida, but thankfully, I have not been affected by a power outage after a hurricane. One of the primary reasons I purchased this unit was to be able to do some hot water bath canning. I have a glass top stove and they are not recommended for hot water bath canning. It's very hot here right now and I really didn't want to use this outside to do a batch of jelly. After doing quite a bit of research I felt safe using it inside. I did purchase a carbon monoxide detector 'just in case.' I also opened a couple of windows to created a cross draft and had no issues at all. My daughter also told me she has seen cooking shows on TV where they use this type of stove. I realize the manufacturers have to put the recommendation to only use outside due to liability. And I certainly would not use it in a small, enclosed space like a tent or shed. I'm not recommending anyone to use it indoors, but just saying do your own research and then make an informed decision. My only issue is that even using the propane fuel it took a very long time to get the hot water up to the temp needed. I don't blame the stove for that .. it's rated for only 8,000 BTU I believe and I thought that would be sufficient to use with a hot water bath. It did get the water hot enough to boil, just took a long time to get to that point. It seems well built for a camp stove. I have always preferred gas stoves to electric so I will probably use this from time to time depending on what I'm cooking. I ordered the 15,000 BTU version of this stove after making the jelly since I intend to do more hot water bath canning. While I have never used the butane canisters, I like the flexibility and option to use butane if I so choose. The storage case is nice to have and the set up is fairly easy. I do think the instructions could be a little more clear about setting up the propane option. Watching some YouTube videos it appears they have made changes to this unit over the years and I was unable to find a recent video that matched the propane connections exactly that are on the unit I received. I think this would make a great camping stove. It's small, lightweight and can be set up in just a few minutes. It may not last as long as a Coleman, but it's not priced like a Coleman either.",
                "reviewVotes": "72 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tamoshi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF64JEACU33U32KGL6YP7ZWV7WLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2710L0HCF7MCE?ASIN=B01HQRD8EO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Great consistent camp buddy",
                "reviewText": "Bought it for 32.99 at time of purchase. I was looking for a backup alternative to heating things up while camping.The cool bits:-This thing can pump out a good amount of heat. I've used it on a couple camping trips and mainly used it for boiling water and heating up food in a pan. I've yet to make a gourmet multicourse meal with it but, hey, why would you buy this for that? Brings water in my aluminum kettle to a boil very quickly. I swear I turn around for a bit and its spitting steam out by the time I look back.-Portable. Take this with a grain of salt because that can mean different things in camping. I'm not saying this is your next backpacking buddy. I'm saying comes in a nice black plastic carry case for your carry-to-car convenience. You flip the top grill upside down so it goes into the unit and its snug in its little black house.-Easy to use. If you even just glance do a passing glance at the manual which is like 1 page with pictures, you'll be able to understand all of the TWO things you need to know about this gas stove. I've yet to try out the propane mode of this but the other reviews says it works perfectly. Butane is so cheap and available.The ehh bits:-Honestly not really anything bad to say about the unit. It does what it needs to do and it does it well. You'd really have to TRY to mess this up for you to have complaints.-The grill top is a decent size but if you're trying to heat up something with a small diameter, it may not sit on the grill top. Keep that in mind if you want to heat up your aluminum camp mug with it.TLDR: Its a simple machine for a specific purpose but it does it very well. Not really anything to speak badly about as long as you're not unreasonable with your demands. Its a steal at around 30 bucks. You can use if for camping, emergencies, cookouts etc. World is your oyster.",
                "reviewVotes": "50 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Honest Reviews Only",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV2ZT26K7NPJ2ZHGLEKVFDLORNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E66N9T7I1QWD?ASIN=B01HQRD8EO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2020",
                "reviewTitle": "5.0 out of 5 stars A Great Camping Companion",
                "reviewText": "This product is one of my best addition to my camping gear.GREATS1). DependableBeen using this product daily for two months & it hasn’t failed me. Although I haven’t used butane with it, using a 1 lb bottle of propane gave me consistent flame. The igniter is always positive and lights up at every turn of the knob.2). DurableIt’s mostly made of sheet metal, but pretty strong to my experience. Although I haven’t dropped it & won’t do so, nothing is falling apart. It is very well made.3). VersatileEven though it’s only a one burner, having the versatility between a propane & a butane is a must for me. I can use whichever is available & less expensive.4). CompactIt’s small, squarish design is extremely necessary for me since I have very little space in my trailer. When not needed, I could quickly remove the propane bottle & place the burner in it’s carrying case to store in a cabinet or just anywhere out of the way. If using a butane, no need to remove it from the unit to stow away.5). Highly PortableNot only that the design is compact, but it’s pretty light too. Even with the additional weight of a one pound bottle of butane, I had no problem taking it anywhere I set up camp, even in my backyard (lol).6). Fair ValueBecause of all the positive things I mentioned above, I believe this purchase is at fair value. Other brands or even just other sellers charge at almost twice.SHORTS1). Only One BurnerUnfortunately, it’s not available in a two burner set up. That would make life much easier. Good thing that I also have an electric induction cooktop. I use it along this unit when demand dictates it.Thanks Gas One for not regretting my first purchase of your product. I’ve been recommending it to everyone I talk to regarding camping or survival.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}