{
    "remaining_requests": 33957,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lodge-Reversible-Griddle-Combo-Double-Sided/dp/B002CMLTXG",
    "body": {
        "name": "Lodge LDP3 Cast Iron Rectangular Reversible Grill/Griddle, 9.5-inch x 16.75-inch, Black",
        "price": "$33.89$27.74",
        "originalPrice": "$59.50",
        "rawPrice": 33.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lodge-Reversible-Griddle-Combo-Double-Sided/dp/B002CMLTXG",
        "soldBy": {
            "sellerID": "A1D09S7Q0OD6TH",
            "name": "FBA Top G",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1D09S7Q0OD6TH&asin=B002CMLTXG&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09H9X6NHB"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "10.5 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B002CMLTXG",
                "variationName": "Size",
                "variationValue": "16.75 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00008GKDQ",
                "variationName": "Size",
                "variationValue": "20 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B002CMLTXG",
                "variationName": "Style",
                "variationValue": "Double Burner",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "Single Burner",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B002CMLTXG",
                "variationName": "PatternName",
                "variationValue": "Grill",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BNPVTXH6",
                "variationName": "PatternName",
                "variationValue": "Grill + Grill Press, 6.75-inch x 4.5-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BNPVRYY3",
                "variationName": "PatternName",
                "variationValue": "Grill + Scraper, Set of 2",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BNPVV1PG",
                "variationName": "PatternName",
                "variationValue": "Grill + Scrapers, 2-Pack",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51yn73BF1KL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51gqa5jORIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/317CE-aIvnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jQEi 8keL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41V6gdzdeEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31jk5qTSS8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/712Aty2XvHL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Lodge Store",
            "link": "https://www.amazon.com/stores/Lodge/page/8CDF8DDD-A601-44CD-B8E7-BD01D910704A?ref_=ast_bln"
        },
        "brand": "Lodge",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 42343,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 3 hrs 31 mins",
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 3 hrs 31 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Seasoned with 100% natural vegetable oil",
            "Unparalleled heat retention and even heating",
            "Use in the oven, on the stove, on the grill, or over a campfire",
            "Get a restaurant-quality sear",
            "Use to sear, sauté, bake, broil, or grill"
        ],
        "description": "Product Description This double-burner Reversible Grill/Griddle functions as a dual cooking surface with both a smooth griddle and a ribbed grill. Fits over two stovetop burners. When used on the stove, set both burners to the same temperature for even cooking and excellent heat retention. Seasoned and ready to use. Features Seasoned with 100% natural vegetable oil Unparalleled heat retention and even heating Use in the oven, on the stove, on the grill, or over a campfire Get a restaurant-quality sear Use to sear, sauté, bake, broil, or grill Made in the USA Dimensions Length: 16.75 Height: 0.62 Weight: 9.35 Width: 9.5 Volume: 0.06 Fits: 8 eggs Great For: versatile use Cooking Surface Area: 141.25 Brand Story By",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Cookware",
                "link": "https://www.amazon.com/cookware/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289814"
            },
            {
                "name": "Griddles",
                "link": "https://www.amazon.com/Griddles/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289821"
            }
        ],
        "productInformation": [
            {
                "name": "Material",
                "value": "Cast Iron"
            },
            {
                "name": "Brand",
                "value": "Lodge"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Item Weight",
                "value": "8 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "16.75\"L x 9.5\"W x 0.63\"Th"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Use in the oven, on the stove, on the grill, or over a campfire"
            },
            {
                "name": "Max Temperature Setting",
                "value": "212 Degrees Fahrenheit"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "No"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "Lodge"
            },
            {
                "name": "ASIN",
                "value": "B002CMLTXG"
            },
            {
                "name": "Item model number",
                "value": "Lodge Cast Iron Rectangular Griddle"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 42,343 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#728 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #2 in Griddles"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "June 1, 2009"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Double Play Reversible Grill & Griddle What could be better than a reversible griddle? Meet the Lodge Double Play Reversible Grill & Griddle. The smooth side is great for making grilled cheese sandwiches as well as eggs and pancakes. The ribbed side is perfect for grilling foods such as steak, fish, chicken and hamburgers. Product at a Glance: Seasoned and ready to use for a natural, easy-release finish Brutally tough for decades of cooking Seasoned for a natural, easy-release finish that improves with use Great for the oven, stove, grill or campfire",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/62196485-cef5-4851-8a6c-8fcc9491785e._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "Why Buy Lodge Cast Iron As the only full line of American-made cast iron cookware, Lodge boasts quality that has been unmatched for over a century. Even heating, a natural easy-release finish, versatility and durability are the hallmarks of our great cookware. We don't just make cast iron; we make heirlooms that bring people together for generations.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/457824ed-a364-47fb-8bc4-984cd8f3c797._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "About Lodge Cast Iron Founded in 1896, the Lodge family has been making high quality cookware and accessories for over a century. Lodge Cast Iron operates two foundries on the banks of the Tennessee River in the small town of South Pittsburg, Tennessee; a town Lodge is proud to call home. The company is built on family values, American history, and high quality cookware. All Lodge seasoned cast iron and carbon steel cookware is proudly made in the USA, meaning you’ll get craftsmanship that has been passed down through generations.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/224c8b8b-3877-4440-a70f-87a0181542ac._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "Cooking And Caring For Your Lodge Seasoned Cast Iron Caring for your cast iron doesn’t have to be complicated. Lodge cookware comes already seasoned and ready to use, so you can make your family's favorite recipes right away. You can use it on any heat source, from the stove top to the campfire (just not the microwave!). The more you use it, the better the seasoning will get. Wash cast iron by hand with mild soap or none at all. Dry promptly and thoroughly with a lint-free cloth or paper towel. Rub with a very light layer of vegetable oil, preferably while the cookware is still warm. Hang or store cookware in a dry place.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4635ea3f-1e5b-4052-8cde-0e5808505649._CR0,0,300,300_PT0_SX300__."
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/9d9fbee0-5637-472c-b248-9ccb00935cd6._CR0,0,971,300_PT0_SX970__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/62196485-cef5-4851-8a6c-8fcc9491785e._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/457824ed-a364-47fb-8bc4-984cd8f3c797._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/224c8b8b-3877-4440-a70f-87a0181542ac._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4635ea3f-1e5b-4052-8cde-0e5808505649._CR0,0,300,300_PT0_SX300__."
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dagmar LeonDagmar Leon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSUNGC4KI5X2TL35YHE2ASO67TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HKNQ207QXD5I?ASIN=B002CMLTXG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 12, 2011",
                "reviewTitle": "5.0 out of 5 stars ABSOLUTELY LOVE IT!",
                "reviewText": "I recieved my Lodge Logic LPG Pro 20 x 10 7/16 Inch Cast Iron Grill/Griddle, back in May 2011. I absolutely LOVE IT!!! I coat it on both sides with pure grapeseed oil using a paper towel and then wipe the excess with a clean sheet of paper before using it. Olive oil is not for very high temperatures and canola oil is not a healthy choice. For high temperatures, I use either coconut oil or grapeseed oil. The smoking point for olive oil is as follows; Extra virgin olive oil 320F, High quality (low acidity) extra virgin olive oil 405F, Virgin olive oil 420F and Extra light olive oil 468F. But, according to olive oil manufacturers on their websites, the smoking point of olive oil is 210F. Olive oil unlike others keeps its nutrition content at this temperature as stated. Therefore, I just coated the grill/griddle with the grapeseed oil. Fabulous results on my chicken breasts on the grill. The griddle is perfect for pancakes, blackened fish and meats, grilled vegetables and sandwiches. I never cook bacon because the sugary substance in bacon becomes very sticky. Sometimes, chicken also creates a sticky substance from its juices. It is very easy to clean and remove by heating the grill on medium heat until the sticky substance burns. It cracks, then just scrape lightly and remove. Just a snap.When I make some fish fillets, I put a very thin layer of extra virgin olive oil only in the area where I would place the 2 fillets on the griddle, while it was still cold. Heated it up on medium high for just 2 minutes, turn the heat down to medium and placed the fish fillets, which I cook for approximately 3 minutes on each side. Before flipping the fillets, add some olive oil on top. This is for blackened fish. Nice light crust on the outside and flaky inside. YUM, YUM, YUM!It is important that you heat your cast iron cookware on medium high to medium temperature with a very small amount of grease until a drop of water sizzles and rolls in the pan, before adding your food. Otherwise, your food will stick.If this helps, I have a Whirlpool gas stove, that has 2 flat grates that go vertically across 2 burners. This Logic Grill/Griddle fits perfectly on top. The half moon shaped handle is on each end away from each of the burners. I measured my stove, specifically across the 2 burners before ordering. I recommend, you measure your stove and distance from burner to burner before ordering. If your grates are not flat enough that would make the grill wobbley, you could buy some flat grate to place on top of each burner, like some people have suggested.As cast iron is supposed to be, the Logic Grill/Griddle is a little heavy, but not too heavy that you can not carry it around. I also ordered the 7 inch round Logic press that weighs approx. 4 lbs. and both items came in the same box. I am a 5'5\" and 122 lb and 60 yrs. old female and I carried the box in, from the porch all the way to the kitchen, with no effort at all. Also, I believe that being a little heavy helps to keep the grill steady and firm on the grates on the stove, so I like that aspect of cast iron plus all the cooking benefits. Just in case you're not familiar with cast iron cookware, cast iron is supposed to be heavy. If you are over 80 yrs. old with a back problem, arthritis or parkinson, then perhaps it's not the type of cookware for you.I leave the grill/griddle on the stove. When I need all 4 burners, I just remove it and lean it against any wall in my kitchen out of the way. The other good feature about this grill/griddle is that if you are using just one burner, you can place your cooked food on the other end to keep it warm, while you cook something else.To clean it, I just use a paper towel to remove any burnt particles that were left and recoat with the oil before using it, if needed. Water and soap DO NOT kill germs 100%. Heat does. If it gets extremely dirty with hard to remove particles, I will scrub with just just water and if there stubborn stuck particles scrub it with the green scrubbing pads with or without soap, dry it on medium high heat on burner and coat with a very thin layer of oil. That's what I do with all my other cast iron Griswold cookware I have bought on Ebay. Always use stainless steel spatula and utensils on your cast iron cookware. Never use plastic or vinyl.You may remove old crud from your cast iron cookware with oven cleaner. After 24 hrs., wash it and scrub in water. Repeat process if there is still crud left. Then remove rust using a 50/50 white distilled vinegar and water solution, watching it carefully. Dry well and place it in 200 degrees F oven or on stove to dry completely and to open pores. Oil it immediately with a very thin layer of flaxseed oil. Place in cold oven and pre-heat at 450 to 500 degreesF (or highest your oven heats) and when it reaches temperature, bake for an hour. Turn oven off and allow it to cool in oven for 2 hrs.. You may repeat process about 6 times. Never add thick layers of oil that would drip because it'll make your cast iron sticky.There are other brands of good cast iron cookware like Griswold and Wagner, but I believe they are out of business today. You can find those items on Ebay but they go for an arm and a leg. Besides I haven't seen a grill by them so far. So, for this price you can't beat the Lodge Logic stove top grill. Perhaps not the best brand, but does the job!I used the Logic 7\" Round Press on chicken breast, steaks, fish fillets and sandwiches and it worked great! I keep the press in the warming drawer. I might order another press.I'm not a chef or professional cook, but I've always loved to cook and to create recipes, so I'm familiar with many cookware and products and of certain cooking temperatures.I'm adding a some pictures of an Argentinean Grill that I made on the Lodge Logic grill side. The pictures will only show the food after removed from the grill, but you can see some of the grill marks. I just love it!I have ordered many products from Amazon throughout the years and my experience has always been WONDERFUL. I used the Super Saving Shipping with these items and they still arrived within 5 and 7 days after I placed the order. Can't beat that!Good luck and hope you enjoy this product as much as I do! :)",
                "reviewVotes": "181 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51StEFXvZAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51zlmPikntL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "B. C. Dunlap",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHENBTY6WPCIBKOCBHUBTRXVZWAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XHDWT11O2Z4R?ASIN=B002CMLTXG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2011",
                "reviewTitle": "5.0 out of 5 stars Outstanding Cookware",
                "reviewText": "Some months ago, we went on a bit of a spree and purchased a whole bunch of Lodge Logic cast iron cookware items from Amazon. Our family had been using some pretty awesome Calphalon (aluminum/nonstick) cookware for fifteen years or so. The Calphalon was (and is) still holding up quite well (nothing, and I mean *NOTHING* can destroy that cookware), but we wanted to make the move to cast iron for all the usual reasons.Cast iron requires a bit of care - especially early in the relationship. Lodge Logic cookware comes pre-seasoned, which is nice, but you're probably going to want to treat it out of the box, anyway. There are innumerable website and videos (i.e. on YouTube) showing how to properly care for and season cast iron cookware. The effort is minimal for the payoff and you can take some solace in the fact that each time you use it - and subsequently care for it properly - it gets BETTER. It bears mentioning that I did not always \"get\" the concept of cast iron cookware and the black carbon coating it develops. Many, many years ago, I did a college housemate a \"favor\" and scrubbed his perfectly seasoned cast iron skillet down to the bare metal. It was CLEAN (and temporarily destroyed). I was a moron and my housemate let me know it, but, cast iron being what it is, it was possible to re-season it and get it back on the road to awesomeness.Lodge Logic items are sold at many common brick-and-mortar retailers so you can get a first hand idea of the size and weight of many of their items before ordering online. At the time I purchased these items from Amazon, though, the prices could not be beat and - absurdly enough (this stuff is HEAVY) - Free SuperSaver Shipping was available across the board.Now, for this particular item: Lodge Logic LPGI3 Pro 20-by-10-7/16-Inch Cast-Iron Grill/GriddleUTILIZATION- We have a typical four burner glass-top stove (with a warming element, too). The left side burners are \"small\" burners with a \"bridge burner\" between. This is where we use the griddle.- For cooking most things, we've settled upon setting all three burners (front/back/bridge) to about 6 out of 10. If you have a Spinal Tap stove that goes to 11, maybe try a 7. Put the burners on and let it heat for a little while. You'll know when its ready to roll (water beads, sizzles, and evaporates the same on different parts of the grill).- On the flat side, we have cooked pancakes, french toast, sausage, scrapple, grilled cheese, cheesesteaks, and hamburgers.- On the ribbed griddle side, we have cooked rib-eye steaks, filet Mignon, London broils, kielbasa and peppers, chicken breasts, and pork chops.- This item works great with the Lodge Logic Pre-Seasoned Round Cast-Iron Grill Press. We purchased two of them. When cooking steaks, chicken, burgers, etc..., having the presses reduces cooking time, reduces splatter, and keeps the food from curling up on the sides.CLEANUP- If you can wash it while it is still warm, all the better. Hot water + a plastic scrub brush (no SOAP!) works great. If you're just using the flat side, cleanup takes seconds. When using the ribbed griddle side, it can take a bit longer, obviously, because of the grooves and the types of things cooked on that side (meats). We lucked out and found a plastic kitchen scrub brush with a handle...the hard plastic head of which fits PERFECTLY within the grooves to scrape out the stuff that settles there. I once cooked steaks on the ribbed griddle side and left it on the stove until the next evening (oops!) and it cleaned up with hot water almost as easily as it would have the night before.- Dry it thoroughly and, with a paper towel, apply a very thin layer of vegetable oil everywhere. If you happened to use your oven to cook, throw it in there while the oven cools. The heat will be enough to get rid of any residual moisture and do a bit to expand the metal to allow further seasoning to occur.PROS- The griddle heats very evenly. I've filled it with meat from stem to stern and, with very little rotation, consistently end up with evenly cooked meals.- You can use whatever kitchen utensils you like with this puppy...kid gloves are not required. I've got a metal spatula that was in drydock for much of the Teflon era that has new life.- People love the ribeye steaks I make on the outdoor grill. The results indoors are different, for certain, but are absolutely outstanding. In fact, the results you can achieve with this item indoors may be more reminiscent of the high end steak houses (i.e. Ruth's Chris or The Capital Grille) than what you can get grilling outdoors.- It's big. You can accomplish things on this griddle that you cannot with a frying pan. For example, we buy those big bags of boneless/skinless individual chicken breasts from [a box store] and you can get eight or nine of those things jamming at once (so nice...throw them - frozen - right on the grill and season them for quick dinners).- It's cast iron. 'nuff said on that.CONS- It is HEAVY. That's not a problem for most people, but, in my case, my wife refuses to manipulate this griddle on her own. She asks me to set it up for her because she fears the weight and composition (a giant chunk of iron, baby!) combined with a glass stove top is a recipe for potential disaster. She is a wise woman. No big deal, really, since I do most of the cooking.- Fire up that range hood fan! This thing will throw off some serious smoke, especially when cooking meats. You've been warned.- Cleanup will suck if you don't have the right tools to do it. It's tempting to whip out the green scrubbies and get between those grooves, but you don't want to scrape off that precious carbonized coating. As I mentioned, a sturdy plastic kitchen brush is your best friend.- We bought separate, darkly colored dish towels to use on all of our cast iron cookware. When drying after cleaning, the towel may pick up some of that dark residue, which is fine because scrubbing all of that off would be pretty stupid. Don't ruin your nice white kitchen towels.IN THE END- This is a five-star item. The \"CONS\" are more warnings than anything...I would not recommend this item for your 88 year old grandma who doesn't have a range hood. Warnings aside, the results are consistently delicious. The product is well-built, works as advertised, and, if treated right, will still be in use by your great-grandchildren and beyond. How cool is that?EDIT: Almost 3 years with this griddle and I still love it. I use it all the time. At this point, it is perfectly seasoned with a healthy coat of carbon and NOTHING sticks to it. I clean it easily with a dishwashing brush and hot water. I shake off the water and put on the bridge burner on the glass-top stove and turn it on high for about 90 seconds and turn it back off - that gets rid of any water. It never rusts. My wife still hates it because it is heavy, though. Meh.",
                "reviewVotes": "261 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A CrucesA Cruces",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 12, 2024",
                "reviewTitle": "Buena calidad!",
                "reviewText": "Llego muy pronto (3 dias) se ve de primerísima calidad, pensaba comprar de otras marcas mas económicas, pero se nota que si lo vale, pesado con ganas , llego sin detalles, creo que si me va durar hasta que me jubile 💀",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81UL8aYbP-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Gp-f8uLPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81VXMUBE4vL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "George Skinner",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 11, 2023",
                "reviewTitle": "Great grill and stove accessory for smash burgers",
                "reviewText": "Provides a nice flat top griddle for my Weber gas BBQ - big enough to do 4 smash burgers at a time, and outdoor cooking means I can cook stuff that smokes or spatters without causing trouble inside the house. Factory seasoning is great, easy to clean up, and small enough to store easily.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gerry C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 20, 2023",
                "reviewTitle": "Excellent Size ... Heavy",
                "reviewText": "Size is perfect (easy to handle) and works on my induction cooktop (flat side down)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ben webbben webb",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 5, 2024",
                "reviewTitle": "Highly recommend",
                "reviewText": "The media could not be loaded. Can use on one or two gas rings.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81G2EMWdPpL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/C1fEJoCMvzL.mp4"
                }
            },
            {
                "reviewerName": "alessandra c.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 27, 2024",
                "reviewTitle": "Fantastica!!",
                "reviewText": "All inizio ero scettica e per diverso tempo lo sono stata, poi trattandola costantemente come indicato la situazione è migliorata nettamente ed ora posso finalmente dire fantastica! Certo il trattamento è lungo ma ne vale la pena",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$34.90",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}