{
    "remaining_requests": 33951,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/EcoZoom-High-Efficiency-Wood-Burning-Portable-Outdoor/dp/B005GQZ4O0",
    "body": {
        "name": "EcoZoom Rocket Stove, Portable Camp Stove for Outdoor Cooking, Versa Dual-Fuel (Wood & Charcoal)",
        "price": "$119.96",
        "originalPrice": "$159.95",
        "rawPrice": 119.96,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/EcoZoom-Rocket-Portable-Outdoor-Cooking/dp/B0C7LVN8VK",
        "soldBy": {
            "sellerID": "A1EIQSZBFALM8G",
            "name": "BioLite",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1EIQSZBFALM8G&asin=B005GQZ4O0&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C7LVN8VK"
        ],
        "asinVariationValues": [
            {
                "asin": "B005GQZ4O0",
                "variationName": "Style",
                "variationValue": "EcoZoom Versa (Wood and Charcoal)",
                "price": "$119.96",
                "variationImageURL": ""
            },
            {
                "asin": "B005GSGSTI",
                "variationName": "Style",
                "variationValue": "Ecozoom Dura\" (Wood Only)",
                "price": "$97.46",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/412pwtoCdSL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51vr1mVzelL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51tGI5kIwgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dI OX tSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 P9Yw8QDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EO3uvozzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/618w5OkwtAL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: EcoZoom",
            "link": "https://www.amazon.com/EcoZoom/b/ref=bl_dp_s_web_38886032011?ie=UTF8&node=38886032011&field-lbr_brands_browse-bin=EcoZoom"
        },
        "brand": "EcoZoom",
        "merchantInfo": "BioLite",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1371,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 2 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Crank up the heat on your outdoor cooking; Burns twigs, branches, charcoal and wood readily available at campgrounds, so you don't have to worry about carrying heavy fuel canisters",
            "Cook more with less fuel and smoke; Vertical combustion chamber reduces emissions and boosts fuel efficiency; Just a handful of wood or solid biomass is all you need to cook an entire meal",
            "Move around this stove safely; Sturdy stainless steel handles with heat-resistant silicone grips keep the handles cool even when the stove is hot",
            "Top door and combustion chamber insulation are refractory metal lined for lasting durability; Fully insulated body retains and transfers maximum heat to your pot or pan for superior efficiency",
            "Three-pronged cast-iron stove top accommodates flat and rounded bottom cookware to meet all your outdoor cooking needs; Weighs 14.25 lbs, perfect for camping, off-grid living and emergency preparedness"
        ],
        "description": "Power up your outdoor cooking adventures with our EcoZoom Versa rocket stove. Avoid bulky gas canisters and use easily available twigs, branches and wood as fuel instead. This stove burns wood, charcoal and solid biomass. Weighing just 14.25 lbs, this lightweight stove offers convenient portability. Fully insulated body retains and transfers maximum heat to your cooking utensils for excellent fuel efficiency. The durable three-pronged cast iron top is compatible with round or flat bottom pans and pots of various sizes, allowing you to cook with utensils of your choice.",
        "breadCrumbs": [
            {
                "name": "Sports & Outdoors",
                "link": "https://www.amazon.com/sports-outdoors/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3375251"
            },
            {
                "name": "Outdoor Recreation",
                "link": "https://www.amazon.com/outdoor-recreation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=706814011"
            },
            {
                "name": "Camping & Hiking",
                "link": "https://www.amazon.com/camping-hiking/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3400371"
            },
            {
                "name": "Camp Kitchen",
                "link": "https://www.amazon.com/Camp-Kitchen-Camping-Backpacking/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2204505011"
            },
            {
                "name": "Stoves & Grills",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3400941"
            },
            {
                "name": "Camping Stoves",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_6?ie=UTF8&node=19450136011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "EcoZoom"
            },
            {
                "name": "Material",
                "value": "Ceramic"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Item Weight",
                "value": "16.2 Pounds"
            },
            {
                "name": "Assembly Required",
                "value": "Yes"
            },
            {
                "name": "Ventilation Type",
                "value": "Direct Vent"
            },
            {
                "name": "Fuel Type",
                "value": "`"
            },
            {
                "name": "Portable",
                "value": "Yes"
            },
            {
                "name": "Mounting Type",
                "value": "Freestanding"
            },
            {
                "name": "Product Dimensions",
                "value": "10.5 x 10.5 x 10.5 inches"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "Eartheasy"
            },
            {
                "name": "ASIN",
                "value": "B005GQZ4O0"
            },
            {
                "name": "Item model number",
                "value": "VERSA"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 1,371 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,459 in Sports & Outdoors (See Top 100 in Sports & Outdoors) #23 in Camping Stoves"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "August 11, 2011"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "EcoZoom Versa Camping Stove - Portable Wood Burning Camp Stove for Backpacking The EcoZoom Versa stove uses wood, charcoal or solid biomass fuel. It is perfect for camping, outdoor cooking and emergency preparedness and is our most popular model in the United States. The Versa provides the same efficiency and heat output as the Zoom Dura when cooking with wood and offers a more controlled cooking experience while using charcoal. The fully insulated vertical combustion chamber forces gases to mix with the flames, leading to decreased harmful emissions while boasting tremendous fuel efficiency.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/2c5a0c85-b30b-4404-8bc2-c248ed4e262a.__CR0,12,600,600_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "The top door and combustion chamber insulation is lined with refractory metal to provide ultimate durability. Both the main combustion chamber door and the damper door have reinforced metal frames with hinges to securely close the doors for regulation of airflow. The Versa has a durable three pronged cast iron stove top that can support a flat or round bottomed pan, as well as stainless steel handles with silicone grips to assist you in moving the stove. The Zoom Versa offers big power in a portable package, ideal for any outdoor cooking experience!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/ca7f4fe2-6e1c-42f4-aefe-4d2a462fea3e.__CR0,0,464,464_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/2c5a0c85-b30b-4404-8bc2-c248ed4e262a.__CR0,12,600,600_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/ca7f4fe2-6e1c-42f4-aefe-4d2a462fea3e.__CR0,0,464,464_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "ReynmanReynman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBLYTQERQ4LRHKIAO5LOSHCX7QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I4FD6PJH138F?ASIN=B005GQZ4O0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 8, 2018",
                "reviewTitle": "5.0 out of 5 stars Very efficient emergency stove",
                "reviewText": "My wife and I live in a hurricane zone and have been affected by bruiser storms like Rita, Ike, Harvey. So we usually do something every year to increase our readiness. This year we added this stove.So I break it out of the box and decided to try to cook with it. An hour and a half later I got a fire going. I felt I should donate my camping gear and tear up my Eagle Scout card. Needless to say I was doing something way wrong. I was overloading the combustion chamber keeping air from flowing through it.Two days later I decided try again. This time I figured I need to go smaller, so I bought a bag of pecan wood to use as secondary kindling. I took one piece of pecan wood and used a hatchet to cut it into small pieces about the size of my pinky. I put a cotton ball with petroleum jelly on it into the chamber and carefully put my pecan wood pieces on top of the cotton ball (about 6). I lit the cotton ball and less than 5 minutes later I had fire. I placed 2 pieces of lump charcoal on it and now had a cooking fire. I took a medium skillet and made bacon and eggs for the family in about the same time it would take on the range (once the fire is lit). So as an effective stove replacement, so far it passes the test.Some observations:When you build a fire, think very small campire, not charcoal chimney. The only fire you will produce packing this thing full and lighting it are the flames of hatred that scorch your soul and nothing else.After the initial lighting, there is no smoke produced that I could see.There was no soot on the bottom of my stainless steel skillet.I only used 4 pieces of charcoal to cook breakfast and still had plenty of heat left over.The stove seemed to produce a steady, stable heat. It was like cooking on a range.I didn't have to tend the fire to often. I only had to add two pieces of charcoal.The sides got hot, but not enough to burn you.The handles make it easy to move. It is also light enough to not be cumbersome but heavy enough to be stable. It is too heavy to backpack with unless you have a mule with you.Cleanup is easy once it cools down. I honestly think it is better to let the fire burn out then empty it rather than close the doors and let it smother. It just seems just slow the burn when you do that, making you wait longer until you can clean it.I am sure if you got creative, you could use a fire steel to light it, but it would a little more complicated.Overall this is a great and efficient camping stove that should be part of your emergency preparedness kit. Also if you do a lot of camping, this stove would be ideal as it pretty much is an outdoor hot plate.There is something about cooking outside that is very peaceful. Definitely worth it.",
                "reviewVotes": "189 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71lqLfSeNbL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ellenoc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3MCGG6PKKM7VGRZOHVV74CX6YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU58QQL028YS3?ASIN=B005GQZ4O0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Love this stove.",
                "reviewText": "So easy to use. Cooks perfectly. Used dry leaves and thin twigs at the base to get it started. That was quick. Used 1” to 1 1/4” diameter limbs to keep it going. It is pretty amazing. Used Lodge skillet. Roasted marshmellows too. Can’t believe how efficient this is. The skillet sits firmly on top. It is made for several sizes. Super easy to “clean”. Poured the ashes out and that was that. No cons.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffany Pasquale",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHK2NMB7JBVM4LOPM5YDA24TEQ7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LQXYSOV4DH4P?ASIN=B005GQZ4O0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars A prepper's must have!",
                "reviewText": "My husband is a prepper for every circumstance. He loves this stove and is happy with the quality and ease of use. A great addition to any emergency preparedness plan.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEU6ISBUGHO7ZVYNHWLO62AQGSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39AJ1SS7XP844?ASIN=B005GQZ4O0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Incredible quality",
                "reviewText": "We have not had a chance to use this amazing piece of camping equipment just yet. But, WOW! The quality is superb top to bottom. A must have for any camper.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debbie Radmore",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAICFYSKQGLALNYIQOUJI5FRWZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XEK2HVRWPYC3?ASIN=B005GQZ4O0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Really great stove",
                "reviewText": "I have been looking around for a portable stove to cook on and finally found one that is easy to use and cook on . I have used it twice and love it. It works great for cast iron cooking and will store easy for traveling.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lost in the Pages",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBI3F3MFKKOYSKKPUZ5767RWOVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AUU10EWR6LJN?ASIN=B005GQZ4O0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 1, 2013",
                "reviewTitle": "4.0 out of 5 stars First Impressions -- and first run with charcoal matchlight",
                "reviewText": "Charcoal Matchlight review:On you-tube everyone has reviewed this with only wood. I thought I'd try it out with charcoal. I've not cooked with charcoal since a teen so it was a new experience overall. I bought the King---brand matchlight. I staggered 4 coals and two on top in the top chamber on top of the charcoal grate which I set at angle to the wood grate for a criss-cross effect. I tried to light the bricks with a lighter but they wouldn't catch. Tried with wooden matches and discovered problem seemed to be the minimal wind blowing in the opening so turned away from wind -- and a few more matches and it lit. Thought they'd be easier to light with that name. The coals fire up for about 10 minutes (per bag) and if you put pot on stove before that dies down it gets covered with soot. I took another reviewers advice and put drop of liquid soap and spread around on bottom of pans and it helped with cleanup. After coals were set tried to cook scrambled eggs on top without windscreen -- extremely slow -- added windscreen and still slow. It took nearly 30 minutes to get cooked to safe level. I think you need to put in a lot more charcoal than I anticipated with this \"efficient\" stove. I then added more briquets via the top throat and immediately put on a pot of water and eggs to make hardboiled eggs. It didn't even think about boiling. Had to dig out a propane/butane camp stove and use that to bring to a boil -- tried to then transfer to the Zoom to \"simmer\" -- no luck there either. It was a pretty full pot of a dozen eggs. I don't doubt this can be done but I suspect you must fill up the bottom and the throat of the stove AND have on the windscreen to get decent heat transfer to the pot. It was a breezy day as well so that definitely helps draw the heat away. I put a windscreen around my campstove or it probably wouldn't have boiled on there either. End result of first try was complete failure with charcoal. The stove \"ran well\" and the outside did not get exceptionally hot, the build quality seems good -- I really like the doors and the newly-encased firebrick. I cooked with the top door completly closed and the bottom open all the way. The stove stayed hot on the inside for many hours after done so don't expect to pick it up and move after a stop at a park unless you plan for dealing with the hot ashes/coals and the unit still being hot....Perhaps a metal ash can would allow it to be transported in that AFTER disposing of the ashes elsewhere. And by the way I still HATE that the picture was of a WHITE one and what I received is a Medium GRAY (ugh)...so, final word of wisdom, fill 'er up with charcoal if you want real heat!First impressions:Product shipped VERY quickly for something not fulfilled by Amazon. It was EXTREMELY well packed and other reviews stating this helped me choose this vendor over the other (I have not myself experienced the other vendor, so perhaps they've got that straightened out). The box is kept in the middle of the shipping box by neatly shaped cardboard inserts -- which you can later use as biofuel (unlike a foam insert! -- well-considered!). Fed-Ex did an excellent job and the outer box was not badly beaten up like my most recent UPS deliveries and most usps deliveries. The box had two crossed heavy-duty shipping straps around the stoves box to help you lift it from the shipping container -- and you need that help as it is hefty. I cut the shipping straps after easily removing from the shipping box and opened the box. Stove fits in tightly. But here I got into a little trouble. I saw they had slipped a paper-wrapped grate down the throat of the stove and thought I could get it out before removing the stove from the box. I reached in and a \"razor-sharp\" piece of the internal flashing cut me like a wicked metal paper-cut on the back of the finger just above the nail. Now normally one won't reach down the throat like that -- and you can NOT remove the grate that way -- but I've seen many suggesting stuffing paper/bio-bits down that way to heat up the throat and wanted to warn of this issue. The other reason is I notice the steel pot-skirt/support/windscreen has these same sharp edges where you size it. They really should sand these just to take the cutting edge off. It's right in a spot that you'd think people wouldn't handle but is really a typical paper-cut (in this case steel-edge cut!) location -- as you'll likely drift your fingers across while sizing and tightening the pot-skirt.Ok, now this is NOT a big deal to many guys but I think ladies will understand. The photo appeared to me to be of a WHITE stove, and as these come in colors from the other vendor, I THOUGHT I would get a white stove. Instead I received this quite medium shade of gray that I really do NOT like. Yes, I know with soot it'll get smudged up and it's probably more practical, but I LIKE WHITE and it appears this paint should clean-up well. I like white because it looks nice and it also shows more easily where you need to clean it so you don't get stuff all over your vehicle or yourself when carrying. No, I'm not going to demand/ask the vendor send me another as I'm sure the shipping for this weight is high -- but I wanted to be sure others know what they're getting. Dear ZOOM, please tell us the color, give us a choice, OR tell us we get the color you have on hand.Oh, and on the Ceramic firebrick on the top door issue I saw many reviews about. It seems the manufacturer listened to all the complaints -- or the vendors did -- at any rate it's now encased in a steel shell and no longer disintegrates all over the stove in shipping. I've not attempted to open that shell -- so I don't know if it's possible or if it experienced any shipping stress.LONG first impression but I thought it might help some folks who, like myself, were torn between the two vendors carrying what looks like an identical product. I paid $5 more for the Zoom version BECAUSE of the reviews about the other vendors SHIPPING/Packaging and CUSTOMER SERVICE issues. Now -- if they get that straightened out I suspect their customers will be kind enough to let us know. I followed the reviews for these on Zoom despite not being sure about the firebrick being encased and am VERY PLEASED I did! Stove itself is solidly built --hinges could be a little better but are probably ok. I'll update and probably chop down this initial as I get to use the stove and put it through it's paces with wood/bio and charcoal.",
                "reviewVotes": "79 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jcjc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEILDXIJ2R5RDDZAPL3VKU5BTP2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26PDW89BU8238?ASIN=B005GQZ4O0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Stonehenge from spinal tap",
                "reviewText": "I knew the dimensions before I bought it but man is this small. It's small but mighty! I fed it and it simmered a quart of water in 5 mins! It was a boil by 11 mins!!! I used a 15\" iron skillet with a lid. It is well built and a bit heavy to lug around for hiking (you need iron pan to cook as well). It is so low to the ground it was annoying to feed so I was placed it on a 1.5 inch thick 12 x 12 slate ($10 at local landscape supplier) base on top of my cast aluminum patio table. I boiled water for an hour and the temp of the outside of the stove was about 220 F max. The stone was around 110 F. I felt the table under where it was located and it was only warm. It takes a descent amount of attention to keep optimal. If you like to play with fire and cook this is a great product!",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71C4F+QrvPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81UMKLxAM6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jerbet D. Morales",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4GAVMKVOCEKLE56RWHMFIOHI6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PWLKPTKWIT8R?ASIN=B005GQZ4O0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Outdoor cooking is relaxing",
                "reviewText": "Excellent product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ann L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 1, 2021",
                "reviewTitle": "Very durable",
                "reviewText": "I love this sturdy little stove, all you need for great out door cooking and uses so little flue because it retains heat so well. Like a cast iron pot.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bluefusion",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 3, 2023",
                "reviewTitle": "This stove is Amazing!!! I cannot recommend it enough!!",
                "reviewText": "The media could not be loaded. This stove is great have used it so many times already well worth the price tag!used to cook on a wok open flame you name it great bit of kit and well made!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/C1DQa0yUU1L.mp4"
                }
            },
            {
                "reviewerName": "Salvador",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 21, 2020",
                "reviewTitle": "Excelente estufa.",
                "reviewText": "De x ele té construcción y calidad. Resistente y muy efectiva en el consumo de material combustible. Ideal para su uso en caso de emergencia. No es tan portátil, es una estufa para tenerse en una cabaña o traerla en el vehículo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Davidvfx",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 24, 2019",
                "reviewTitle": "La estufa perfecta para bosques, playa o en una zona de desastres",
                "reviewText": "5 estrellas, pe o hay que diferenciar entre las típicas estufas Rocket de cilindro que se usa para discos gigantes, esas están hechas para hechar gran cantidad de madera y odtener una gran flama para discos o discadas gigantes, está Rocket está pensada para hacer rendir la madera y el combustible además de ooteney una llama lo suficientemente para cocinar en discos o planchas medianas y hacer que rinda la madera, además de que permite seguridad de que no se escape chispas o cenizas alrededor de áreas inflables como un bosque o mucha oja seca... Es la mejor herramienta en casos de desastres naturales o si se te acabó el gas y se se fue la luz al mismo tiempo... Y de preferencia usarla en lugares no cerrados al inicio como todas hará humo ya después la combustión es tan buena que ya ni saldrá",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Liliane Ravion",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on July 26, 2020",
                "reviewTitle": "Solide, efficace et cuisson rapide",
                "reviewText": "Mise en place rapide. Stable. Facile à régler.Cuisson rapide (comme sur cuisinière). L'eau bout en quelques minutes.Economique en carburant: du papier ou des brindilles pour l'allumage et seulement quelques morceaux de bois de petite taille pour la cuisson.Très simple à utiliser, mais en extérieur car ça fume.Le bémol: le récipient se noircit de fumée. J'ai donc réservé des ustensiles exprès pour cette utilisation.Sinon excellent produit. Efficace.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}