{
    "remaining_requests": 33960,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Camp-Chef-Alpine-Heavy-Cylinder/dp/B002G55XXQ",
    "body": {
        "name": "Camp Chef Alpine Heavy Duty Cylinder Stove",
        "price": "$279.99",
        "originalPrice": "",
        "rawPrice": 279.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Camp-Chef-Alpine-Heavy-Cylinder/dp/B002G55XXQ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08XQLJS21"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41pkoDtxj1L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51YRuN0asML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412GeQRVajL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415NpDPxeJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HcX76r9qL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Koidli4vL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51mZ5Dk4GjL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Camp Chef",
            "link": "https://www.amazon.com/Camp-Chef/b/ref=bl_dp_s_web_2586718011?ie=UTF8&node=2586718011&field-lbr_brands_browse-bin=Camp+Chef"
        },
        "brand": "Camp Chef",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1175,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 8 hrs 1 min",
            "FREE delivery Tuesday, February 20. Order within 12 hrs 16 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Wide form shelf/drying rack",
            "Adjustable legs for uneven ground",
            "5\" diameter chimney pipe (over 10 ft. total height)",
            "Wire spark arrestor",
            "Fire grate in bottom to protect the base from overheating"
        ],
        "description": "Camp Chef:The Way To Cook Outdoors Whether you are an outfitter or just a lover of wall tent camping, you will be hard pressed to find a wood burning stove that has the value added features of the Alpine Heavy Duty Cylinder Stove. There is no fiddling around after the purchase trying to find a damper, internal log grate, spark arrestor, or accessory shelves. These items in addition to a five piece nesting pipe are included with our Alpine Stove package.Each component is designed to fit inside the stove, along with the removable legs, for easy storage and transport. We have even drilled the hole for you for installing your pipe damper. A roomy cook top and door damper makes it easy to control the heat for cooking chores. If you need more hot water the stove has been designed to take a standard wood stove water heater and it will also nest inside.FEATURES:Wide form shelf/drying rackAdjustable legs for uneven groundAll parts store neatly inside stove for easy transportationFeatures water tank brackets (tank sold separately)5\" / 12.7 cm diameter chimney pipe (over 10 ft. / 3 meters total height)Chimney includes 5\" / 13 cm damperWire spark arrestorFire grate in bottom to protect the base from overheatingHeavy duty steel construction20\" / 51 cm x 7\" / 18 cm multipurpose shelf/drying racks that can dry clothes, dishes or store itemsFlat top surface provides an area to cook onSpecifications:Stove Dimensions: 20\" W x 24\" D x 22 1/2\" H / 51 cm x 61 cm x 57 cmShelf/Drying Rack Dimensions: 22\" x 7\" / 51 cm x 18 cm5\" / 13 cm diameter, 10 ft. / 3 m chimney pipeTotal Weight: 74 lbs. / 33.5 kgs. About Camp Chef:Great tasting food will always bring people together and Camp Chef has that figured out. As an industry leading manufacture for more than 20 years, Camp Chef produces high quality products offering efficient ways to cook for almost any outdoor gathering. From social functions to campouts or even dinner on the back patio, Camp Chef can do it all.In 1990, Camp Chef was established on the idea that there just had to be a better way to cook outdoors. The founder and president of the company, Ty Measom, recognized many campers and sportsman had an interest in outdoor cooking but were struggling with what cooking equipment was available to them. That is when he designed a stove that would meet the needs of the avid outdoorsman.That simple stove design later became the Pro 60 and evolved to include the most versatile cooking system on the market by incorporating accessories to simplify and diversify any outdoor menu. BBQ boxes, flattop griddles, and pizza ovens now give users the ability to grill, griddle, bake, boil, brew fry, stream, and even cook Dutch oven - all on a single Camp Chef stove.After being in the campsite for nearly 10 years, Camp Chef began producing quality cast iron cookware with its signature True-Seasoned Finish. Another 10 years later Camp Chef addressed the demand for a versatile outdoor cooking system at home. Today there are several stoves, smokers, fire pits and more, designed specifically with the home and patio in mind. However, the roots of the company are in the great outdoors, continuing to give people the opportunity to experience nature without sacrificing a hearty meal.Camp Chef is located in the heart of Cache Valley, Utah, surrounded by the beautiful Bear River Mountain Range, a perfect site for product testing. Each product is a result of Camp Chef's dedication to outdoor cooking and its pledge to improve and create new products that fulfill the needs of its highly valued customers.",
        "breadCrumbs": [
            {
                "name": "Sports & Outdoors",
                "link": "https://www.amazon.com/sports-outdoors/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3375251"
            },
            {
                "name": "Outdoor Recreation",
                "link": "https://www.amazon.com/outdoor-recreation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=706814011"
            },
            {
                "name": "Camping & Hiking",
                "link": "https://www.amazon.com/camping-hiking/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3400371"
            },
            {
                "name": "Camp Kitchen",
                "link": "https://www.amazon.com/Camp-Kitchen-Camping-Backpacking/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2204505011"
            },
            {
                "name": "Stoves & Grills",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3400941"
            },
            {
                "name": "Camping Stoves",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_6?ie=UTF8&node=19450136011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "24\"L x 20\"W x 22.5\"H"
            },
            {
                "name": "Item Weight",
                "value": "73 Pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Camp Chef"
            },
            {
                "name": "ASIN",
                "value": "B002G55XXQ"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "CS14"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,175 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#36,639 in Sports & Outdoors (See Top 100 in Sports & Outdoors) #93 in Camping Stoves"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Brand",
                "value": "Camp Chef"
            },
            {
                "name": "Fuel Type",
                "value": "Wood"
            },
            {
                "name": "Material",
                "value": "Alloy Steel"
            },
            {
                "name": "Power Source",
                "value": "Propane"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Alpine Heavy Duty Cylinder Stove Chimney: 5 in. diameter, 10 ft. chimney pipe There is no fiddling around after purchase trying to find a damper, internal log grate, spark arrestor, or accessory shelves.These items in addition to a five-piece nesting pipe are included with our Alpine Cylinder Stove package. Each component is designed to fit inside the stove, along with the removable legs, for easy storage and transport. We have even drilled the hole for you for installing your pipe damper. A roomy cook top and door damper makes it easy to control the heat for cooking chores. If you need more hot water the stove has been designed to take a standard wood stove water heater and it will also nest inside. Enjoy wall tent camping, Alpine Heavy Duty Cylinder Stove with many value added features. Each component is designed to fit inside the unit, along with the removable legs, for easy storage A roomy cook top and door damper makes it easy to control the heat for cooking chores.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/db48db27-ec81-4718-b152-2baa6fc06bd6._SL300__.jpg"
                ]
            },
            {
                "media_text": "Easy to assemble Camp Chef Quality",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/42e6b6c3-535c-4bd7-a5d9-c8d72eeb9777._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9e035ec2-e385-4355-8bcd-60db18bc11b8.__CR25,0,336,336_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4aea0187-8c1b-47e3-b498-99bfab777d89.__CR0,833,3333,3333_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/db48db27-ec81-4718-b152-2baa6fc06bd6._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/42e6b6c3-535c-4bd7-a5d9-c8d72eeb9777._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9e035ec2-e385-4355-8bcd-60db18bc11b8.__CR25,0,336,336_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4aea0187-8c1b-47e3-b498-99bfab777d89.__CR0,833,3333,3333_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ea3a0186-4fc9-4244-8b63-cf24abbe0751.__CR0,127,2542,786_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "ShopShopShopShopShopShop",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJCW6XJTEFL2G4BHE3ELEMGJIQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12TNU0PZQU00S?ASIN=B002G55XXQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Genuinely surprised at how great this wood stove is!",
                "reviewText": "Purchased this camp stove for my 16’ canvas bell tent. I ♥️ camping, but hate being cold. Waffled between this stove and some other (highly recommended by many blogs and camping websites) more expensive stoves. Looked at cheaper options but didn’t like what the reviews said about them.I don’t regret this purchase in the least.First, it’s built like a tank. It’s going to last years, probably decades. It’s heavy, though, so you won’t be taking it on a hike up the mountain. But if you drive to your campsite or have a stationary camp, this is perfect.I read the other reviews and there is good information there. Use the driest of wood, open the damper, build the fire in the back of the stove until the stove pipe is hot enough to draw the air in and up, taking the smoke with it.Do the first burn outside so the fumes from the coating on the metal dissipate.I was concerned that the spark arrester wouldn’t be sufficient, but my very dry wood isn’t even sending sparks. No smoke after the initial paper and cardboard smoke that I used for getting the fire lit. So the spark arrester is fine.I was concerned that smoke might leak around the door because no gasket is there, but aside from the initial lighting, no smoke comes to the front. The draw on this thing ROARS when the door is open.The stove pipe is really high, and I think I will be adding metal eye screws for guy lines for peace of mind in case of heavy winds.It’s bigger than I thought it would be. I uploaded a photo with a work glove for size reference. I’m excited for fall camping, this thing really puts off some heat.The stove has a great design, and just works like it should. It’s well worth getting.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91Gi3niOV8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91L82i85DHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91RxXBMlAxL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91dF-Bc5iTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "CylonGolfer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMDEOJ3UKZLRM6M7EHY45BRE4QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R3V880UC4WXG?ASIN=B002G55XXQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Fantastic Shop Stove",
                "reviewText": "I'm amazed at this little stove! I wasn't expecting that it would exceed expectations, but it does. I researched small stoves for a couple of months and landed on this one. It's large enough to take 22\" pieces of wood and small enough to tuck away in the corner of my small shop. I can raise the tempreture of my shop 30 degrees in about an hour. It's truly amazing...I would also follow the instructions about prepping the stove with 2 or 3 burns in the open air. It's definitely worth every penny.My advice is to always go with something a little bigger that what you think you need. My shop is 12 x 16...800 square feet. And the stove is rated to heat an area of 2000 square feet. I definitely recommend this stove.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sergio Andrade",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBS7YHC4CVOHWKBQDSRSPN52J6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TCS8FEWEOJT4?ASIN=B002G55XXQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2017",
                "reviewTitle": "5.0 out of 5 stars Worlds Best Wood Stove & Install by far.",
                "reviewText": "Worlds best review how to house stove. Thpopularity trail is THAT way. Put on your blindfolds, go to Google's exciting sexy wood stove images, lay your throat back, open your wallet wide as it can go, and get vastly less results if that eye candy is 4u. Or, do this: \"I'm thwood stove king of kings. I got this way by ignoring forums, studying a stove in only 1evening. Wanna know where thdemon stove is? Simply follow thlovely popularity trail. Thmoney trail. Demons live down here folks. They need money2. If u combineall thworld's wood stoves into 1classic picture u would have thdemonic stove u show in this vid. Square, stubby legs, a window, weight average 500lbs, & it's triple wall cold chimney would go straight up vanish mysteriously thru 3 vulnerable walls b4dumping scary smoke where u can't even see it costing upwards 6k just 4the chimney. Do I smell snake oil? Basically u would have a stove engineered by an absolute demon. When Eve mated with Lucifer, she was hook line &sink 4shape of th eyeball. She was a presentation junky. Just like all u satanists are with these dreadfull wood stoves u buy, promote, 5star. Basically Lucifer puts 5lifelines in2your home. fuel, food, water, etc. &u must PAY 4them so when he enforce his beast chip RFID, u receive it &go 2hell. All manufacturing is controlled by Lucifer. Free fuel is a no-no. God will give u a way out. Thr IS an everest stove out thr but Satan isn't worried bcuz u people all are brilliant @5 starring th lies u bleev, so u upload these poison vids that lie 2our children. How did I become stove king of kings? I spent 10 years peeking in stove forums, it was 1chimpanzee after th other. Finally I gave up, bought what I thought was best stove. Left it in box a year, googling wood stove experts. That taught me what not 2do. I am a Dragonslayer of elite angelic warriour forces of Yahweh. &as a child Lord Yahushua sent his people over, me & some KIDS built a huge building with them. It was easy took us 2days. That gave me CONTRAST. I would NEVER attend 10 year college after that. Van Halen was my best friend in Cali. In 3 years I was playing better then Ed on a blank sheet never having heard thsong. Comprende? I designed thWolfganguitar he is finally now trying2 build. Sadly, Demonic manufacture breathes on it 1st. That taught me 2keep demons UNDERFOOT. Trump is hardly thpresident. \"I am.\" ..impressed? Stove? I finally gave up. Un boxed my stove, decided just ask it questions on a blank sheet? Bcuz Yasha taught me CONTRAST, &told me who runs manufacturing, I was step ahead. I also kind of have highest IQ in history of mankind so, in only 1day I nailed perfection in wood stoves from drawing board 2smoke stack install & I knowhat NOT2DO. Lucifer is Lords elder brother of 2million years. Thsolar system was heaven once... b4 thwar destroyed earth rise of Satan. Earth was re created Genesis. Get it? No? HE IS OLD. Get it? He CAN FOOL U. Thworld's best stove will weight 50 - 75lbs, NO MORE, will vent SINGLE WALL out a WINDOW, HORIZONTALLY. I have 2caps lock bcuz 4rum xprts are literally demons in flesh. Lucifer has a mind eraser. He puts thm in human bodies. (they don't know what they are so, don't try corner them) Satanists are cursed. Poison. As are their tools. I AM Talking 2U SATANIST READER. Yr home's, yards, gardens, lifestyles are saturated in Satanic venom filth top 2bottom & u walk around 5 starring it fast as u can review. Back in 1986 I taught a dozen guys 2destroy world hour record just by re positioning them on bicycle. That is how powerful Satan's tools are. 2day's bicycle? been ergonomically transformed bcuz of me. Worlds best stove is hidden. It comes with a label says DO NOT INSTALL IN A HOUSE. Chimney rule of thumb? There are gillion rules costing thousands $, chimney vanishes in attic where rats build puffy nests against them so fire chief claim u had a chimney fire. MY chimney is single wall 11 ft. horizontal releasing enormous heat b4 venting out window &simple 2 clean. It touches ONLY 1SPOT. That I CAN SEE. The smoke also, can be MONITORED. Do u drive a car with no rear view? I found resting chimney on 2 x 4 it didnt even brown it. Thus chimney vents thru window framed in 2 x 4 screwed long ways 3\" screws. pipe framed by aluminum gutter. Even if was a fire, I would see it. Get it? Worlds best stove is a CYLINDER Stove. Camp Chef Alpine. Same, only stove I would manufacture 4 entire world. It heats 760 sq. Ft. costs $200 @ $25 for chimney elbow, 2 x 4 install. It takes LONG pieces wood. Sjorr square stoves would wear my saw out cutting short logs. It has 15 times cooking surface stove vid, bcuz I bought 24lb cast iron griddle 16 x 24\". Worlds best cook surface. Never have 2 clean, no splatter, sell all your frying pans. (use 5 x 9 Camp Chef cast iron press.) Legs stay COLD on stove. So high up, no tiles needed. like outdoor cooking summer? Stove can be installed or removed in half hour. 500lbs won't warp your cabin floor. This stove DeSTROYS paying 4 Lucifer's fuels. That don't make a burger taste like heaven as this does. I now have a SMOKER outside chest level. I now have a FREEZER. I can preserve an entire deer with tastey insect repellent. Dehydrate greens, vegetables. Wood smoke makes a brilliant heat resist paint on guns, tools, pots, pans. Fuel is endlessly free. It connects u to a generous creator Lucifer dispise that lifeline which breeds heaven basically. If your house is big, buy 2 of these. DONT HEAT ANY STOVE RED HOT. If u still wanna be a greedy cherry window blazing visual hit fire huffing stove pig &reality is not good enuff, go stand up against thwall with th rest of thm. Get some gold plated trim lipstick. So u can even stand 2 look@ or kiss thpoison Satanist chrome trim stove u were dumb enuff2buy& married. Camp Chef stove also has window u never clean. Fire dances against your wall thru 4 quarter sized holes front. It has big smoke stack with lots surface area heat u home included4 $200 shipped. The paint is quality, must be burnt off outside 1st. This is the end all in cooking, deleting your expensive complicated cooking system,keeping humidity perfect, hearing ENTIRE home, etc. etc. 4 under $250. Stop thmadness. When u encounter poison manufactures, pray 4them. 4their destruction. This has 2stop. Even if u are evil, God's angels are on edge of d seat ready 2 honor yr prayer 2 end this perpetual nonsense. We know yr a sold out Satanist. Think of yr children.\"",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "xy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 10, 2022",
                "reviewTitle": "Excellenter simpler ofen im Zollmass",
                "reviewText": "Der Ofen ist wahrscheinlich doppelt so solide als alle anderen Outdooröfen und dabei gerade noch zu tragen. Das kleinste Rohr hat 5\", am Ofenausgang 125 mm. Man bekommt wirklich sperrige Holzstücke einfach verfeuert und es macht wirklich viel Freude. Kann ich nur empfehlen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Travis T.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 9, 2017",
                "reviewTitle": "AWESOME!",
                "reviewText": "This thing will keep you warm!! I have used about 12 times now in below 0 temps and haven't been cold once. If you have it choked properly it burns long enough that you only need to restock it once in the middle of the night. This will last for a long time, it's nice and beefy. The racks on the side are amazing to have. They are great for drying socks/gloves after a day in the bush and also handy for warming up food. Talk about heat, this stove rips! I have boiled big pots of water accidently. I put water on to warm up and cranked the stove open and next thing you know it was boiling over. Awesome stove. I'd buy it again if I had to but I'm sure I will never need to.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin is doing stuff again!",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 24, 2019",
                "reviewTitle": "Good product.",
                "reviewText": "Should come with a 1/4\" stove rope to better seal the door for longer burn time. I picked up 1/4\" stove rope at the hardware store and installed and absolutely love the stove.Stove comes with a stackable chimney to go straight up out of the roof about 10' up. The chimneypieces are all tapered and slip inside each other so they can all fit inside the stove for storage. As the provided chimney pipe tapers it increases in the diameter of the pipe as it gets higher. All very cool. I wanted to side wall vent the stove and needed two adjustable 45 degree elbows to do so, but as the pipe diameter gets wider, the wider diameter will not fit the 45 degree elbows. So I ended up buying all new 6\" duct piping to vent the chimney through the side wall. I also find that the side wall vent option slows the stack effect out the chimney and helps to slow the burn for increased burn times.Luv it though !",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "camra_guy67",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 15, 2018",
                "reviewTitle": "The racks are a nice feature too although one of them seems to have ...",
                "reviewText": "I bought this stove to use with a bell tent - 16 wide x 14. It throws off a ton of heat and then some. The racks are a nice feature too although one of them seems to have become attached permanently, but that's not a bad thing considering it is stationary, in my case. It is heavy duty and sturdy. My only beef is that it seems to be top heavy in the wind, sometimes dislodging the bottom pipe from the stove itself. Also when it rains, be prepared for rain water to end up side the stove. Some kind of stove pipe cap would have been a nice feature. Otherwise a honey of a wood stove!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 5, 2019",
                "reviewTitle": "Great Stove - OK Chimney",
                "reviewText": "This stove is heavy, and durable. All the parts fit snugly into the fire box for transport and storage. The steel is thicker than your typical camping stove/tent stove so heat takes a few more minutes to be felt but once your fire is going you'll be set. I used this on a camping trip with overnight temps below 0c and had a hot burning fire going all night. There was no warping of the stove. The chimney provided is made of pretty thin tin and could be thicker. The spark arrestor is small for the pipe and near impossible to place, and the mesh is too thick, allowing sparks to freely pass through.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}