{
    "remaining_requests": 34096,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Elite-Gourmet-ESB-301F-Countertop-Temperature/dp/B000B2WOWE",
    "body": {
        "name": "Elite Gourmet ESB-301F Countertop Single Cast Iron Burner, 1000 Watts Electric Hot Plate, Temperature Controls, Power Indicator Lights, Easy to Clean, White",
        "price": "$16.53",
        "originalPrice": "$18.99",
        "rawPrice": 16.53,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Elite-Gourmet-ESB-301F-Countertop-Temperature/dp/B000B2WOWE",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BWJPPS94"
        ],
        "asinVariationValues": [
            {
                "asin": "B000B2WOWE",
                "variationName": "Style",
                "variationValue": "Cast Single",
                "price": "$16.53",
                "variationImageURL": ""
            },
            {
                "asin": "B0BGYW4VZM",
                "variationName": "Style",
                "variationValue": "Coiled Single",
                "price": "$13.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Lnf7xn-qL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51nq600lw7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Mp7nIEeML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71164GscxdL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Elite Gourmet Store",
            "link": "https://www.amazon.com/stores/EliteGourmet/page/7C41F0D0-1198-4E29-9F0F-7F910F09B7C4?ref_=ast_bln"
        },
        "brand": "EliteGourmet",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 7655,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "EASY TO CLEAN: 6.4-inch Cast Iron flat cooking plate is nonstick and easy to clean with a damp cloth or non abrasive sponge",
            "ADJUSTABLE TEMPERATURE CONTROL: Quickly reach and sustain the desired LOW, MEDIUM or HIGH heat settings with the variable temperature knob to keep food warm or boil hot water.",
            "BUILT IN SAFETY: Power indicator light on the front of the burner reminds users when the item is powered ON; non skid feet ensures the burner remains stable during use.",
            "COMPACT & PORTABLE: The compact size of our burner makes it an easily accessible item to take on the go wherever an extra cooking device is needed, at school, office, camping trips or home.",
            "Efficient Power - With a wattage of 1000 Watts, the hot plate and individual temperature controls provides sufficient heat for all your cooking needs."
        ],
        "description": "Cooking is quick, easy and consistent with the Elite Cuisine Electric Single Buffet Burner. This portable electric hot plate offers reliable heating and takes up minimal cooking space. At 1,000 watts, it heats up quickly with an adjustable temperature knob. The non-stick cast iron hot plate will ensure even cooking and makes clean up a breeze. It features adjustable temperature control with Off, Warm, Low, Medium, and High settings. The heavy duty cast-iron flat heating plate is easy to clean. The cool-touch base and non-skid rubber feet for stable cooking. It's perfect when you need an extra heat source for holiday cooking and entertaining, or simply use it to keep food warm at a buffet station.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b?ie=UTF8&node=289913"
            },
            {
                "name": "Countertop Burners",
                "link": "https://www.amazon.com/b?ie=UTF8&node=13838451"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Brand",
                "value": "Elite Gourmet"
            },
            {
                "name": "Heating Elements",
                "value": "1"
            },
            {
                "name": "Product Dimensions",
                "value": "3.5\"D x 8.7\"W x 9.5\"H"
            },
            {
                "name": "Wattage",
                "value": "1000 watts"
            },
            {
                "name": "Controls Type",
                "value": "Knob"
            },
            {
                "name": "Voltage",
                "value": "120"
            },
            {
                "name": "Burner type",
                "value": "Sealed"
            },
            {
                "name": "Included Components",
                "value": "Hot Plate"
            },
            {
                "name": "Power Source",
                "value": "electric"
            },
            {
                "name": "Item Weight",
                "value": "1.98 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Elite Cuisine"
            },
            {
                "name": "ASIN",
                "value": "B000B2WOWE"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "ESB-301F"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 7,655 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,851 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #15 in Countertop Burners"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "August 3, 2008"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Cooking is quick, easy and consistent with the Elite Cuisine Electric Single Buffet Burner. This portable electric hot plate offers reliable heating and takes up minimal cooking space. At 1,000 watts, it heats up quickly with an adjustable temperature knob. The non-stick cast iron hot plate will ensure even cooking and makes clean up a breeze. The cool-touch base and non-skid rubber feet for stable cooking. Special Features Elite Cuisine Electric Single Burner Hot Plate [ESB-301F]. Adjustable temperature control with Low, Med and Hi settings. Cast-iron flat plate for easy clean up. Powerful 1000 watts for fast & efficient cooking. Power Indicator light. Compact and space-saving, perfect for small kitchen areas & apartments. Would make a great addition to any back-to-school college dorms or kitchens. Save energy and use in the office or small business kitchen areas. Perfectly even heat distribution with a flat heating element.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d4b4ed67-2597-43ec-bcbf-6d43271ded8b.__CR72,0,525,700_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a11e5b1f-1341-42cd-ad00-56206c462e2c.__CR0,112,2186,1093_PT0_SX350_V1___.png"
                ]
            },
            {
                "media_text": "Power indicator light lets you know when the burner is on & operating. Non-stick cast iron hot plate will ensure even cooking and makes clean up a breeze. Adjustable temperature control knob with Low, Med and Hi settings.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/805714ce-16e6-4ee5-9406-48fbbb544365.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/22b22c1b-62a6-4b69-ba47-21c9e931e896.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/0083fb3b-94e3-466e-b915-feaec097a049.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "ESB-301F, Elite Cuisine, Electric Buffet Burner, White 1000 Watts ESB-301BF, Elite Cuisine, Electric Buffet Burner, Black 1000 Watts ESB-301SS, Elite Cuisine, Stainless Steel Electric Burner, Stainless Steel EDB-302F, Elite Cuisine, Electric Double Buffet Burner, White, 1500 Watts EDB-302BF, Elite Cuisine, Electric Double Buffet Burner, Black, 1500 Watts EDB-302SS, Elite Cuisine, Electric Stainless Steel Double Buffet Burner Name Electric Buffet Burner Electric Buffet Burner Stainless Steel Electric Burner Electric Double Buffet Burner Electric Double Buffet Burner Electric Stainless Steel Double Buffet Burner Color White Back Stainless Steel White Black Stainless Steel & Black Burner Style Cast Cast Coiled Cast Cast Coiled Item Weight 3 lbs 3 lbs 2 lbs 8 lbs 8 lbs 4 lbs Adjustable Knob Controls ✓ ✓ ✓ ✓ ✓ ✓ Wattage 1000 Watts 1000 Watts 1000 Watts 1500 Watts 1500 Watts 1500 Watts Indicator Light ✓ ✓ ✓ ✓ ✓ ✓ Low/Medium/High ✓ ✓ ✓ ✓ ✓ ✓ Drip Pan ✓ ✓ Cool Touch No No Handles No No Handles",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b1c9d235-bb6d-4587-9dc4-0bfb12d68684.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d4b4ed67-2597-43ec-bcbf-6d43271ded8b.__CR72,0,525,700_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a11e5b1f-1341-42cd-ad00-56206c462e2c.__CR0,112,2186,1093_PT0_SX350_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/805714ce-16e6-4ee5-9406-48fbbb544365.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/22b22c1b-62a6-4b69-ba47-21c9e931e896.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0083fb3b-94e3-466e-b915-feaec097a049.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6891fefc-a6ac-4812-b05b-df34549db7a0.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c5313daa-842a-4b71-b2f0-05e8acf7031c.__CR0,0,2474,4948_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5de4c5b0-fb9e-4a7f-86ec-68684200511e.__CR0,0,2480,4960_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/34e1ea0d-253e-41d9-832d-4762a6ee53a5.__CR0,0,2506,5012_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/142b85b4-f0d9-4b52-afdc-eafbef353d99.__CR0,0,2368,4736_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/57ce9c48-2273-4803-a722-8d1df84c2be9.__CR0,0,2239,4478_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dbb13c38-a195-402c-a1c3-0527cb83b771.__CR0,0,2498,4996_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Professional Engineer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYKYO4USUHW3R6NQGUNZ6ARMAAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SBS7M1E20SJO?ASIN=B000B2WOWE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Works very well.",
                "reviewText": "I bought the burner to temporarily place in my barbeque for smoking five 2# blocks of sharp cheddar cheese for gifting my daughters. Aluminum foil, a steel pan and the smoking pellets (I use apple wood) make the actual smoking setup. A wire rack to set the cheese on next to the smoker setup. Quite simple and easy to use. Just remember to tent foil off the burner so that the cheese can't 'see' the burner. Make sure the barbeque is off and fully cooled. We only use the barbeque as a smoke container - we never turn the barbeque on, never. Never turn the barbecue on during smoking. Always use a cooled barbeque to begin smoking. Also when done smoking always remember the wood pellets in the steel pan are burning. Let them burn in a safe location. Do not pour water on the burning wood pellets in the steel pan while they are sitting on the ELECTRIC burner. If you must, unplug the ELECTRIC burner then pour water on the wood pellets in the steel pan. I place the burner on the barbeque rack on one side. I fill the steel pan with how much smoking pellets I want to use (usually ½ to ¾ full of pellets and NO WATER) and fold a doubled over layer of aluminum foil to seal the pan with pellets. Make the doubled over aluminum foil sufficient long so after folding like a top pie crust on the pan, it can be directed out and down the shield the burner element from the cheese. Put five or six random small ⅛ inch or so holes in the doubled over aluminum foil on top of and sealing the pan to let the smoke out. I don't want the aluminum foil to melt or bump something and short out so mine hangs out and down below the burner but does not ever actually touch the burner. But it can be very close (¼ inch away) just not touching the burner. Place the cheese on a cooking oil sprayed wire rack or stainless wire splash screen far away from the aluminum foil sealed, apple wood pellet partially filled smoke maker pan and burner (also inside the barbeque just on the extreme other side of the inside of the barbeque). Turn the burner to about '6' to get the wood pellets to burn then drop the burner down to #2 to #4 to sustain burning and smoking. Close the lid on the barbecue and let it smoke away. The barbecue will warm some from the smoking energy. I do my cheese smoking when it is cool outside (preferably less than 55°F). This helps keep the cheese from melting. I notice a lot of smoke wafting from the barbeque and that is normal. When it is in the 40's outside, I place something over the barbeque to slow the loss of smoke to retain some heat in the burning smoke pellets pan. A plastic large lawn bag over the barbeque helps retain the smoke and keep things going on a cold day. I generally smoke with as cool a smoke as possible by doing it on a cool day out of the sun or preferably at night. I let the smoke go for at least ½ hour, but usually 1 hour. I smoke raw meat the same way and at the same time. Just position the meat closest to the burner and keep it and it's drips off the cheese. Don't put the cheese on the bloody rack. That's it. In the morning after everything is cooked down, I remove the burner and wipe it down, I remove the pan to the sidewalk. Remove the aluminum foil and fill the burnt pellets in the pan with water and let the burnt wood pellets soak in the steel pan underwater for an hour stirring occasionally to ensure any microembers are extinguished. Then I place the burnt wood pellets in a steel container STEEL CONTAINER away from the house, car, outbuildings, etc. And on garbage day the the garbage cans to the curb then decanted the water off into the grass and dumped the extinguished and soaked burnt smoking pellets directly into the garbage can AT THE CURB away from cars, trailers, etc. The charred wood pellets help deodorize the garbage can.This is an electric burner review and it works perfectly, controllably, stable, and reliably to smoke cheese inside a closed lid barbeque. I can only imagine how well it will work operating as it was designed to as a burner on the table.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "zookeeperX",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECW6ZSGTCCHDQZDDNRKPXO4AJXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RI7FFBZQ9IXRW?ASIN=B000B2WOWE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 25, 2012",
                "reviewTitle": "5.0 out of 5 stars The Charred Taco Shell Lowdown....",
                "reviewText": "Just rec'd today....Tried out 'my purpose' for purchasing.....I've a secret recipe for black bean tacos. The tacos are tastier with 'charred/slightly blackened' corn tortillas; no oil/pan frying whatsoever -- place directly upon burner and let her char!The problem is that I've been using my induction stovetop burners and slowly but surely, with each dinner prep ---- more and more tortilla residue is left on the surface and even comet-like stuff won't remove it. Point being - my stovetop surface is slowly getting ruined :( :(A good decent hotplate was needed which led me to this purchase. A quick perusing here @ amazon and voila---it appears that I found just what I needed!*************THE LOWDOWN*************1) Cast iron heating element -- nicely done, love it!! Solid piece which means no 'food fall-thru's' & HOT, HOT, HOT!! I did not want one off those 'coil-burner' hotplates -- so I'm a happy camper having found this.And YES, it does seem to cook evenly. My tortillas were all evenly charred :)2) 1000 watts -- nice and hot, nice and quickly. Would have preferred 1100-1200 watts but they were not avail in the price range I was willing to pay for simple burning of tortillas :)3) Regarding the \"Cool Touch Base\" (there is no such thing)Yep, the entire base/casing gets quite hot also, so I use a wooden trivet (the tiny feet DO NOT get hot... but I'm not taking a chance). Personally, I can't even imagine such a small cooking utensil as this not getting hot.... that's the point --- heat.... and being so small, the base is bound to get hot also. Consider your stovetop... nearby any burner used gets quite warm too... so, it is what it is. Therefore, this DOES NOT have a 'cool touch base'. It's called \"precautions taken\" and one should be fine.4) How to clean the drip pan underneath the burner --- oh my, I can't see a way to do that! It appears to be one tightly made unit (instructions mention nothing of this). I suppose that over time you'll just burn that excess stuff away? Perhaps, once again -- just be careful not to spill liquids... and for crumbs (toast, etc) just turn upside down and shake? I'm perfect, so rarely do I have crumbs.... bwahahahaaaa ;)5) It's been 10 minutes since I turned it off. To make sure it was off, I unplugged it because 5 min into \"OFF\" - the darn thing was just as hot as it was \"ON\". It is STILL WARM enough NOW to keep the tortilla 'warming'. That is something I don't get with my stovetop burners ---- but I am willing to deal with that. Cool-down will be at least an hour+ before storage.6) There IS a 1 year warranty - good to know. But having bought thru amazon --- returns are easier than the manufacturer should something happen sooner than that. And, at least there is a warranty that extends beyond the avg 60 day timeframe.That's it!... I'm now drowning in my black bean taco diet and loving every single minute of it!!Hope some of this helps :)",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Olive Avocados",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGO5IBNBLMHX2LAVJERLTYRYKSFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRKBNOH4LG89P?ASIN=B000B2WOWE",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2023",
                "reviewTitle": "4.0 out of 5 stars NIce but the white frame gets too hot",
                "reviewText": "I really like this hot plate. It works well and gets the job done. (Our new stove is delayed by at least a month so this is a fill-in for now.) I have made a lot of nice meals on this hot plate and it boils water great for my morning coffee. The temperature control knob feels loose and flimsy but it does seem to be true to the temp I set it at. However, I don't recommend this and probably would not buy again because the entire thing -- the entire white housing around the hot plate -- gets really really hot. Too hot to touch. This doesn't seem right and doesn't feel safe. So I'm very careful with it. Also, I should've gotten one with two burners. I gave it four stars because it does work well but I'm worried about how hot the entire thing gets.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "npc",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 11, 2024",
                "reviewTitle": "Really outstanding",
                "reviewText": "I like so much",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cathy Miller",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2024",
                "reviewTitle": "Works great!",
                "reviewText": "My stove broke down and had to wait 2 weeks for a part. This came in handy. Heats up quickly.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JUAN A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 11, 2022",
                "reviewTitle": "FUERTE",
                "reviewText": "CALIENTA RÁPIDO Y PAREJO",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wale",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 4, 2024",
                "reviewTitle": "Works well.",
                "reviewText": "Heats up about 2l of water in 15minutes. It's an okay product. I use it to cook food that would require a lot of stiring the content in the pot. It helps to supplement my induction cooktop.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joan c",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 27, 2024",
                "reviewTitle": "Not safe",
                "reviewText": "Not stable under a pot. Couldn’t turn down the heat.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}