{
    "remaining_requests": 34099,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Duxtop-8100MC-Portable-Induction-Countertop/dp/B0045QEPYM",
    "body": {
        "name": "Duxtop 1800W Portable Induction Cooktop Countertop Burner, Gold 8100MC/BT-180G3",
        "price": "$62.99",
        "originalPrice": "",
        "rawPrice": 62.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Duxtop-8100MC-Portable-Induction-Countertop/dp/B0045QEPYM",
        "soldBy": {
            "sellerID": "A2EPN08Z0FPLG4",
            "name": "Lafraise",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2EPN08Z0FPLG4&asin=B0045QEPYM&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07Z34RCMN"
        ],
        "asinVariationValues": [
            {
                "asin": "B0045QEPYM",
                "variationName": "Color",
                "variationValue": "Gold",
                "price": "$62.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41cdyP4hsFL._SS36_.jpg"
            },
            {
                "asin": "B07HRPGBNH",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "$65.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41x5+TOKtKL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41cdyP4hsFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51g2mTWaomL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51giF-6WKqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qUaAyRVyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nA3ZkD8AL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51X7mONrwML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81usoziyjWL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the duxtop Store",
            "link": "https://www.amazon.com/stores/duxtop/page/711D0140-552B-47D7-BF5D-24775859B2AD?ref_=ast_bln"
        },
        "brand": "duxtop",
        "merchantInfo": "Lafraise",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 16219,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 5 hrs 58 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Duxtop Induction Cooktop uses 120V 15 amp electrical outlet - standard in all North American homes; lightweight and compact for easy handling and storage.",
            "Digital control panel. Built-in count-down digital timer with 1 minute increments up to 170 minutes; 10 temperature range from 140 °F to 460 °F; 10 power levels from 200 to 1800 Watts.",
            "With no open flame or heating element, food does not burn-on the glass cooktop so this induction burner is easy to clean—just wipe with a damp towel. Durable 7-blade fan rapidly dissipates heat to ensure a longer product life.",
            "The auto-pan detection will shut the unit automatically after 60 seconds if no cookware is detected; equipped with diagnostic error message system, low and high voltage warning system; ETL approved.",
            "Note: In order to use this and any other induction stove, you need to use cookware with a magnetic bottom, whose diameter is at least 5 inches. 2-year manufacturer's warranty, as well as customer service."
        ],
        "description": "Duxtop 1800-Watt Portable Countertop BurnerDigital control panel.Built-in count-down digital timer with 1 min increments up to 170 minutes.10 power levels from 200-1800Watts; 10 temperature range from 140 Degree Fahrenheit to 460 Degree Fahrenheit.Lightweight and compact for easy handling and storage.Safety features include auto-pan detection, over-heat protection with a diagnostic error message system and a low and high voltage warning system.120V 15 amps - compatible for use in all homes.ETL approved.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Countertop Burners",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=13838451"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Gold"
            },
            {
                "name": "Material",
                "value": "Glass+PP"
            },
            {
                "name": "Special Feature",
                "value": "Electric"
            },
            {
                "name": "Brand",
                "value": "duxtop"
            },
            {
                "name": "Heating Elements",
                "value": "1"
            },
            {
                "name": "Product Dimensions",
                "value": "11.5\"D x 13\"W x 2.5\"H"
            },
            {
                "name": "Wattage",
                "value": "1800 watts"
            },
            {
                "name": "Controls Type",
                "value": "Push Button"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Burner type",
                "value": "Induction"
            },
            {
                "name": "Included Components",
                "value": "Induction Cooktop"
            },
            {
                "name": "Power Source",
                "value": "induction"
            },
            {
                "name": "Item Weight",
                "value": "5.8 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Secura"
            },
            {
                "name": "ASIN",
                "value": "B0045QEPYM"
            },
            {
                "name": "Item model number",
                "value": "BT-180G3"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 16,219 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,493 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #10 in Countertop Burners"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 3, 2010"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "8100MC/8120MC BT-180G3 9100MC/9120MC BT-M20B 8500ST/E210C2 E200A 9600LS/9610LS BT-200DZ P961LS/BT-C35-D Power Levels 10 15 15 20 20 20 Temperature Levels 10 15 15 20 20 20 Temperature Range 140℉~460℉ 140℉~460℉ 140℉~460℉ 100℉~460℉ 100℉~460℉ 100℉~460℉ Output Power 1800 Watts 1800 Watts 1800 Watts 1800 Watts 1800 Watts 1800 Watts Timer Up to 170 Minutes Up to 170 Minutes Up to 170 Minutes Up to 170 Minutes Up to 10 Hours Up to 10 Hours Lock Function X X ✓ ✓ ✓ ✓ Control Ways Button Control Button Control Sensor Touch Sensor Touch Sensor Touch Sensor Touch Boil & Keep Warm Button X X X X ✓ ✓ Dimensions 11.4\" X 13\" X 2.5\" 11.4\" X 14\" X 2.5\" 11\" X 14.2\" X 2.8\" 11.6\" X 14.7\" X 2.2\" 11.4\" X 14\" X 2.5\" 12.9\" X 16.5\" X 4\" Weight 5.8 lbs 6.2lbs 5.9 lbs 8.4 lbs 6.2 lbs 12.4 lbs",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/ab5bfb75-d425-40a6-988c-62961da76aaf.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bfd88fd5-e05b-40c4-a2dc-94d05393323d._CR0,0,970,300_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fca0dd39-536c-4e5f-9586-9aaf59518a8e._CR0,0,970,300_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/567e9e00-ff70-4fd7-b3fa-f23126b2f915._CR0,0,220,220_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c8ca62f1-23c5-4946-ba58-982ccd3c6dbf._CR0,0,220,220_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ff4834e9-9e84-4fcf-a8c4-790371aefb5c._CR0,0,220,220_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/aa71cc9d-36f9-4603-aea9-958702f5c831._CR0,0,220,220_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/82c58560-1dc6-4cac-a4f0-7cc860ae6aaa.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c53368d4-214d-4539-af9d-db10e20cb5de.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2b7d2b61-2269-4d7f-85ff-f2115002c76a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8d6a87ee-d6e2-454a-9e94-54c6646738c0.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ddf3d822-e350-4343-8446-da72452edca3.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/377164be-eda8-4606-b1d6-de312a911641.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQ2PCAOYWQ3X4P3QBLNGSYXOAHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34D3AFLOUFYYS?ASIN=B0045QEPYM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2012",
                "reviewTitle": "5.0 out of 5 stars Great Duxtop 1800-watt Induction cook top",
                "reviewText": "A quick update. I have been using this induction cook top for 6 months now on a daily basis, it is the only cook top I use. I am still as happy with it as I was when I first started using it. Getting use to the heat settings did not take long and it does hold true to the temperature. I most certainly recommend this product to others. Am very happy with my investment.I just received my Duxtop induction cook top from Amazon a few days ago. I have to say, this is a wonderful cook top and I am glad that I made this purchase. I purchased it because my regular gas cook top was no longer safe to use and I needed a burner desperately. I did my homework on several of these cook tops and I found this to be the best option in its price range. There is a slight learning curve in using it as the heat settings are accurate and of course you have to use the preset heat ranges, they increase or decrease by 20 degrees and are not quite what you would expect them to be -- I would like it better if you could increase or decrease by 10 degree increments, and if low went a little lower, say to 120 degrees. I am not sure that on my regular cook top I ever actually cooked at 350/360 degrees even though I thought I was.I did read in other reviews as to the sound of the fan -- not even as bad as indicated -- and the red \"on\" light remaining lit -- not a problem and you know you have your appliance plugged in -- I am glad that the light stays lit and you can tell the difference between it being plugged in to power and the unit actually being on -- it is not rocket science -- with the light being on I can remember that I need to unplug it, as anything electrical from a TV etc. can start a fire if left plugged in and you have a faulty plug you might not know you have. I unplug everything when I leave or just when I am not using it -- I have all my electrical items on surge protectors so it is easy to \"disconnet\" them by just shutting off the surge protector switch. (you might want to consider purchasing a meter to check the working condition of your electrical outlets and then you can replace a faulty outlet before it can cause a problem (fire) -- they are inexpensive, you do not need to be an electrician to check the outlets and the device just plugs into the outlet and lets you know if the outlet is working properly or not -- a great safety device that will save a house fire.)An induction cook top reguires pans that have a magnetic bottom on them, so you do need to use a magnet to see if it adheres to the bottom of your pans. I mostly use Calphalon pans and they are not magnetic, but I also use cast iron pans (which I actually prefer except for the weight, but now I have found they are making light weight cast iron pans) which are. Also, be sure to take a magnet with you when you shop for pans for your induction cook top. I found I did have a couple of stainless steel fry pans that were magnetic, but I have no sauce pans that are and will need to purchase a couple or invest in the special magnetic round (amazon sells this) to put on the cook top between the cook top and non-magnetic pans so that you can use them. At $34.99 it is pricy for what it is - but if you do not want to have to purchase new pans and yours are not magnetic you will need to invest in one.As always, I was very pleased with the order processing and handling and had my unit within three (3) days. I am a Prime Member, if you are not and you order from Amazon on a somewhat regular basis you might want to consider becoming a Prime Member, AND NO I am not an Amazon employee -- their program just has great benefits including the 2 day shipping.Anyway, you can not go wrong purchasing the Duxtop and I am going to not replace my cooktop, but am going to keep on using this one and will purchase an additional one and then go with a stand alone convection oven. I would not hesitate to recommend this unit to my friends, and have done so, that they purchase this unit.I will say, you do not want to purchase an induction cooktop, or any kind for that matter, that is rated below 1500-watts (regardless of what they give you free along with it, you will not be happy with its performance, plus you will have paid excessively high shipping and handling costs both ways and for that cost you could have purchased two of these -- I am sure you have seen the infomercials a well known company has running whereby they will send you two for the price of one -- they obviously know the worth of their unit and that you will be returning it and they will not refund the shipping and handling cost -- so think seriously about how what appears to be a good bargain but is not!I also want to add that I live full time in an RV and the Duxtop works beautifully and does not take up too much space -- I have it on top of my non-working unit, I just put a cutting board over the top of my stove and set it on that. Hope this helps if you are contemplating the purchase of one of these units.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lee G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHW3AMAERU3DWIDXBS6NOBV5EJKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H2IOW747SV9I?ASIN=B0045QEPYM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 29, 2012",
                "reviewTitle": "5.0 out of 5 stars Great magnetic induction stovetop",
                "reviewText": "I have only had it a week, I found a favorite stainless pan that works wonderfully, So I fixed the handle to it. I tried mac & cheese, the water boils quickly, I spilled some food on the cook top, but it was cold, so it wiped away. I have always appreciated electric frying pans, they hold a lot of food, & they have temperature control, So cooking with this induction over is not much different, because I tell it the temperature, & it always cooks it right. I made a couple eggs so far. I use the @2 setting to toast the bread in the pan with butter, & add ham & cheese & cook the egg, then I put the egg on the bread, . I love the resturant style, because they always taste better that way. I tried the temperature setting, but with eggs & sandwiches, the pan gets too hot, too fast, before the temperature gets regulated, but with larger dishes, I prefer the temperature control better. If the butter burns the bottom black, on the carbon steel pan, that is a good quality, that makes the pan slippery, & the eggs won stick. I also tried sausage in the pan, & if you burn the sausage to the pan, just splash about two teaspoons of water in the pan & scrape it a bit with the pancake turner & take out the sausage before it gets too dry again. When you are finished, you can wipe out the pan with a towel, If you wash it with water. You need to dry it with a towel, so it does not rust & add oil & wipe it out with a towel.I have heard many people complain about the fan noise, My hearing is as good as anyone else, & it was very quiet to me, a little fan, much like one in the computer, is all you hear, & is a very quiet wind noise. I did make one mistake, I had a little stainless mixing bowl, I had the burner set on high, took off the big pan & for 3 seconds, I left the stainless mixing bowl on it. I never thought it had time to get hot, but it almost burned me. I think its great, no heat around the pan, only the pan & the food gets hot.If this thing works forever, I will never have a complaint against it. I made some french fries in the carbon steel pan that I just bought, I can tell you that the cooking process of frying, made more noise than the fan did, for a second, I thought the fan was not running, until I turned off the cooking cycle. I made some mac cheese for grandson, but with vegetables & extra cheese, I turned up the heat to #10, to heat the water quickly, when the water boiled, I turned it to 210 degrees, The stove top then goes to its normal #5 setting. This is good,& since water will not get hotter that 212 degrees, but to steam up the house. I let stove top watch the temperature until it was done. I only enjoy two pans on the stove, the one carbon steel pan for frying, & the stainless for things that could affect the pan seasoning. Cast iron is great, but I dont want to lift them anymore. I tried making popcorn in the carbon steel 12 inch pan with lid, it worked wonderfully, I worried about scratching the stove top surface, but had no problems, a little oil bubbled out of the pan & lubricated the bottom of the pan & it slid so smoothly, & when the pan is at 390 degrees, I believe it is when the e2 error command comes on, telling me that it is done anyway. The 390 degree limit protects the pan & the food, It also happens to me sometimes when I do my stir fries. When it happens, you dont need to cook it any more, it is done. I took a towel & wiped the stove top, & it still looks like new. I could not find a good stainless wok, that would work on the Ductop stove, so I got some two gallon stainless mixing bowls, They heat evenly on the magnetic inductive stove, So now i can make soups & spagetti too.I tried them & they work fine, just remember to use a hot pad to move the pan when cooking in it, a dry folded washcloth will work,they can get as hot as 212 degrees as long as there is food with water in them. Well it has been about 6 months since I bought this tuxtop magnetic induction stove top, almost everyone is using it now, no hot stove, no smelly smoke, the pan gets hot, & it cooks the food. Lately I ran low on food, grandson always like egg ham & cheese sandwiches, but he always leaves the crust. I decided to make pancakes, we have bisquit mix, self rising flour, margarine & eggs, So i took a couple slices of ham & two slices of cheese, chopped them up, & put 1/2 cup bisquick mix, 1/2 cup self rising flour, two eggs, some bacon bits( more flavor) stirred it up & put it in my favorite stainless pan, one that the magnet sticks to. I heat the pan until the butter begins to smoke. I had it on #10 & turn it down to #6 & make pancakes until the mixture is gone. 3 pancakes to each pan (12 inch pan) Grandson loves them, they are nutritious ( don't tell him that) easy & quick. We add a little syrup, He goes wild on sugar, so we are very conservative on that. He loves them, they are a cheap breakfast, & he is not hungry all the time. If you like them, change styles, you can use hamburger, sausage, Try a cheap sausage that is good for you, make hamburger, sprinkle a little sage on your hamburger while cooking it, It does not have as much fat as bacon or sausage & costs nearly half the price. I bought this Tuxtop 3 months ago, it served me well, despite some misuse, be cautious of overheating it. It shows that I did abuse it a bit. The bakelite top is connected to the button display pannel, in case of overheating, the display could slightly separate from the stove top, a leak could cause malfunction,& drip water on the display pannel. I took mine apart, dried up the water, checked for any other damage, then put it together & used JB weld quick a (350 degree epoxy),on the top to seal the leaky crack,to avoid additional malfunction. It still works properly, after time to dry out. I finally epoxied a small ridge in front of the control display, to keep the water out of the controls, it works well since. I make mostly french fries, grilled ham& cheese, stir fries, & popcorn. After a year of owning it, I dont think I could ever be comfortable without it. It is like any computerized appliance , water in the wrong place can cause malfunction. Even though my pans are big enough, moisture still runs over the sides of the pan during the cooking process. I bought a pop up camper, gas cooking can be very hot in a little space, but with the duxtop, all the heat goes into the pan & the food. We cook coffee & vegetables inside, but meats are messy & smokey, so we put a little table outside for the Duxtop under the awning, & cook the meat products there. Its a life saver for us campers. After two years it is still working, I turn it on, press plus until it is on #10,I boil water mostly for coffee, Great for beans, it heats quickly on #10 then I put the lid on it & cook on #1 setting, I think it automatically shuts of in an hour, I may turn it on again for a while. Makes soups, back to #10 til it boils, then back to #1 with a lid on it. I now use steel porcelain pans, they are at every thrift store in NC, I love them. I got a griddle lately & use the Tuxtop mostly for liquids & remind wife that it does not need to boil wildly, In NC at 2000 alt the water boils at 208 degrees no matter how high you turn it on, due to boiling point of water.Then I turn it on #1 with a lid. The griddle heats left overs, temperature is constant, it cooks hamburgers, warms up ready cooked fried chicken. makes toasted cheese sandwiches. BUt I will take the Duxtop camping or where ever I go, I take the griddle too & the portable gas grill, in case I can't get electricity. I bought another one, even though the old one still works too. I received this Magnetic Duxtop in fine condition & on time. My last one, I got was 4 years ago. I really abused it by cooking french fries on it. On setting #10 = 1800 watts, it cooks fast, but as it gets close to finish, the heat needs to be reduced to # 4 = 1000 watt or # 5 . This keeps the Magnetic Inductive stove from exceeding the safe range before shutting down. That mistake slightly melted the plastic below the bakalite table. I have cleaned the fan, Removed dust a few times & because of the abuse I gave it, I had to use JB weld to patch up the problems that I caused. . If it is new, all the functions will work, But, if you want to turn on your coffee & walk away to warm it up, it would be best to turn it On, press Temperature setting, & click on Minus untill you reach the 180° setting, then it will turn off when it reaches 180° temperature, & you will not have to clean out the burned coffee, from the coffee pot, when you get back. Where I live, we get good porcelain steel coffee pots for $3 at the thrift store. If you do not live near the Carolina's, this may not be so available. Shortly after I got my first Duxtop, we went camping, we cooked about everything in it for the next six months. We moved into a rental house, their stove was no good, we didn't care, our Duxtop worked just fine, even for camping, most campsites have electricity.. I did buy a Magnetic Steel pan ( flat bottom wok ) this is good for cooking greasy things. Do not wash those with soap, unless you want to re- oil it again. They are more sensitive to rust than cast iron, then I also bought a good stainless steel frying pan, But do not get tefflon, this will get hot enough to burn the teflon off.I have cooked pop corn, but you do need to be careful, not to run it into shut down. Like the problem I had with cooking french fries. When you buy Kettles, do not forget your magnet. If the magnet does not stick, don't buy it. My friend came from Florida & loved mine, so he went back to Florida to find one in a garage sale. This is the most incredible stove top that you can buy, but you have to follow the rules , if you want it to work for you. Some people returned theirs, just because they did not have Magnetic Inductive pots & pans. You can use cast iron, but they are heavy & take more time to heat up. I had to buy new pots for mine, but I love it anyway. I love cooking this way, you never feel the heat. The pan gets hot, & the food gets hot from the pan. If you spill something on it, you can lift up the kettle & wipe the stove with a moist wash cloth without interrupting the cooking process.",
                "reviewVotes": "86 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ely marve",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 15, 2021",
                "reviewTitle": "Es súper funcional y práctica, la amo",
                "reviewText": "Es fácil de limpiar, muy fácil de usar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LezMX",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 18, 2017",
                "reviewTitle": "Pésima parrilla.",
                "reviewText": "No duró ni 30 minutos y se apagó. Ya no volvió a prender. Además, hace mucho ruido porque tiene un ventilador. Pésimo producto. Devolución sin problemas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lawrence Ng",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 12, 2015",
                "reviewTitle": "Excellent product",
                "reviewText": "Definitely a great, solid product. Overall construction appears to be well made and thought out. Instruction manuals are adequate and clear. Heats water incredibly fast, I would never have expected 1500 watts to be able to heat a pot of water up that quickly. We've had no issues with pot detection.Issues that are annoying, but would not have affected purchasing decision:- it only heats up in the inner white ring, it does not apply heat in the outer ring. Somewhat deceptive.- noticeable fan noise- significant fan airflow - avoid having people seated directly behind this, the fan will blow air across their food and into their face- we only use the power function, and not the temperature function, but the Fahrenheit only setting is immensely annoying - with no option to switch to Celsius. If Duxtop takes their product seriously enough and wants to sell it internationally, they really should make Celsius available. It's the 21st freaking century, cooking food with freaking magnets, and you're sticking to outdated 18th century temperature scales. It's not even a huge engineering leap to add in a celsius calculation into your circuitry. It's pretty ridiculous. Anyways, that's enough of my ranting.Update May 22, 2015The product is still working well. However I think I should have purchased the touch sensor version of this product instead (which is only $10 more, I think) . I accidentally shifted a hot pot which ended up resting on top of the button membranes, and it melted the protective plastic covering.. completely my fault. Pay the extra money for the touch sensor version.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "H Baker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 25, 2016",
                "reviewTitle": "Good little countertop unit, I'd get another if needed.",
                "reviewText": "We don't use this item on a daily basis at the bakery (we mostly boil water, nothing strenuous or \"industrial\" and probably much less abuse than a home user would give) but so far, it's worked quite fine and without issue. If there's a noise problem with the fan, I've never noticed it - it would have to compete with the giant oven and other equipment we have going all the time to get noticed.I've not put it up against other styles/brands of induction cooktops so I have no idea if it's particularly fast or slow; I just know it works well and does the job in what seems a relatively short amount of time, the glass surface remains cool enough that a short time after use it can be wiped off and tucked back in its storage space, it doesn't need propane canisters, is easy to move around and has a few different cooking functions (by levels 1 - 10, by actual temp and by time).I am happy with it is the basic bottom line. For a cooktop we use now and again, it's perfectly acceptable. And the price was certainly reasonable. I'd have no problem getting another should the need arise. The only question might be if we changed our usage and it got a heavier, daily work out, we might need to look into a higher wattage unit. But at this point it's completely acceptable.We received it promptly, came in its original, retail style box and in fine condition so the seller's part of the sale was also acceptable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Teez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 15, 2016",
                "reviewTitle": "Nice unit. Will definitely make use of it.",
                "reviewText": "Hi.I received my Cook-top in four days, which was great. It arrived without issue and worked properly out of the box. The top is made of glass except for the control panel which is some sort of rigid plastic integrating the touch pad controls. The base is all plastic with four small rubber stops. The power cord is hefty to support the 1800 Watt rating. A serial-number label is stuck on the outside of the box that it came in, but I am unable to find its matching label on my Duxtop unit itself. There is no label on the exterior of the unit at all for that matter, and suspect that the label must be stuck somewhere on the interior of the unit.I purchased the Duxtop to use it mostly outside during the hottest summer days, to prevent unnecessary warming of my house. I will use it to boil water for corn, and other lengthy type cooking during the summer. My outdoor BBQ does not have any build in cook-top on its side tablets, so I plan to sit it on either side when I use it to cook. As other reviewers mentioned, I will also use it as a fifth indoor cook-top element if/when needed.I already owned a set of German made stainless steel pots (set of four), with thick sandwiched bottoms. I was happy to see my magnet stick to the bottom of these pots just fine. My magnet does NOT however stick to the sides of the same pots.I tried all four pots, ranging from 5.25 inches to 8.5 inches, and indeed they all work fine. Turning the Duxtop on without a pot, or using aluminium pots and pans displayed an error, as expected.I boiled water to test my Duxtop, and compared it to my 1.7L Oster 1500W electric kettle for the boil times. Here are all my observations:- Time to boil 1.7L room temperature water: Duxtop on Hi (10) power setting: 7 minutes vs. Oster: 6m 50 sec.- Turned on full power: Duxtop on Hi (10) power setting draws 14.10 Amps vs. Oster (no power settings) draws 12.33 Amps.- Turned off, but plugged in: Duxtop draws .31 Amp idle. That means it draws power even when sleeping. I will unplug it when not being used.- Duxtop on medium (5) power setting draws 8.66 Amp.- Duxtop on low (1) power setting draws between 0.33 Amp to 5.7 Amp (as it toggles itself on and off to maintain this low heat setting).- Duxtop on medium (320 degrees F.) temp setting draws 8.31 Amp.- Duxtop on high (460 degrees F.) temp setting draws 10.33 Amp.Duxtop glass-top does stay relatively cool after coking, with the only heat emanating from it after cooking being the heat transferred from the hot pot to the glass-top. My biggest surprise is that I did NOT notice any speed difference boiling water. From the reviews that I read, I expected a better boil time from the Duxtop (maybe my Oster got wind of what I was dong, and tried harder). Also, my Duxtop unit does NOT support Celsius units.There is a high pitched squeak almost like fingernails on a chalkboard, but even higher pitched, which occurs when starting a cooking session: When the high pitch tone does appear, it is only from the moment the Duxtop starts cooking. Then the high pitched tone changes tone slightly a couple of times (squeals), and dies down after ~10 seconds from the initial power-on. Once the high pitched tone goes away, it never comes back for the rest of the cooking session. Note that if I don't hear the high pitch tone from the moment that I power-on my Duxtop, then there is no high pitched tone during the cooking session: the high pitched tone starts from power-on, or not at all, and always goes away within a short period of time. I am guessing that it has something to do with the electronics driving the electro-magnetic field. As long as this appears to be normal behaviour, it's a non-issue for me. I have NOT been able to explain the logic of its intermittent characteristic.Reliability can only be determined with time and frequency of use.In summary, for the price, I think that this is an affordable, useful item, that will see most of its use outdoor, next to my BBQ, during the hot summer days.I took one STAR off for the \"disappointment\" that my hot water kettle boils water just as quickly, while using less power than my Duxtop (kettle rated at 1500W vs. Duxtop rated at 1800 Watt).I would not hesitate to by this product. I am satisfied with the delivery, build quality, functionality, finish, and initial performance.TZ.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}