{
    "remaining_requests": 18241,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Babys-Only-Toddler-Formula-12-7-Ounce/dp/B00MHTGXN0",
    "body": {
        "name": "Baby's Only Toddler Formula, Lactose Relief, Organic, 12.7-Ounce Can",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Babys-Only-Toddler-Formula-12-7-Ounce/dp/B00MHTGXN0",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Currently unavailable.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/519DVziTvQL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/518nP4osWiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519MBVCQ1mL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UrA4T0jrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31cu1yObujL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51YvIoV5vLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41KIjmE8wUL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Baby's Only Organic Store",
            "link": "https://www.amazon.com/stores/NaturesOne/page/D6E7324A-929F-4E0C-B0BC-83EF085E2CAD?ref_=ast_bln"
        },
        "brand": "NaturesOne",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1207,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": true,
            "details": "USDA Organic products are grown and processed according to standards addressing soil and water quality, among other factors."
        },
        "features": [
            "Non-GMO; Perfect for lactose sensitivity",
            "Organic Reduced-Lactose Dairy, No Corn Syrup, No Palm Oil",
            "Non-hexane-processed DHA in phospholipids fatty acids; more bioavailable to help brain and eye development",
            "100% BPA free packaging; Made in the U.S.A."
        ],
        "description": "Baby’s Only Organic Lactose Relief is intended for babies who are lactose intolerant and is the perfect alternative to parents who wish to avoid soy protein in their baby’s diet. Baby’s Only Organic Lactose Relief is a milk based formula, but the lactose or milk sugar has been reduced using a special enzyme process.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Feeding",
                "link": "https://www.amazon.com/baby-feeding-highchair-bottle-bibs/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166777011"
            },
            {
                "name": "Baby Foods",
                "link": "https://www.amazon.com/Baby-Food-Formula-Pouches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16323111"
            },
            {
                "name": "Formula",
                "link": "https://www.amazon.com/Baby-Formula/b/ref=dp_bc_aui_C_4?ie=UTF8&node=16323121"
            },
            {
                "name": "Powder Baby Formula",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=21401508011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 4 x 4.1 x 4.6 inches; 12.96 Ounces"
            },
            {
                "name": "Manufacturer recommended age ‏",
                "value": "‎ 3 months and up"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 0716514229034"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 716514229034"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ AmazonUs/NAVS4"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00MHTGXN0"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#66,628 in Baby (See Top 100 in Baby) #145 in Powder Baby Formula #19,620 in Climate Pledge Friendly: Grocery"
            },
            {
                "name": "#19,620 in Climate Pledge Friendly",
                "value": "Grocery"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,207 ratings"
            },
            {
                "name": "Brand",
                "value": "Baby's Only Organic"
            },
            {
                "name": "Size",
                "value": "12.7 Ounce (Pack of 1)"
            },
            {
                "name": "Item Weight",
                "value": "12.96 Ounces"
            },
            {
                "name": "Allergen Information",
                "value": "Eggs, Milk"
            },
            {
                "name": "Item Form",
                "value": "Oil"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "emonet",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWDL6YNIAD6HSVHTEOMFP7T6PUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MW3X6X3Z3NL5?ASIN=B00MHTGXN0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Using again for third child.. excellent formula.",
                "reviewText": "We used this product to supplement when milk supply was low, which was quite often. It's been a wonderful blessing to have this product available for my last two kids. They both did extremely well on it and even though there's new options on the market, I'm pregnant again and going straight to Baby's Only. It's quite seriously the only formula that I'll buy. My babies would go back and forth between this and breastmilk, no issues. Thanks so much for having this available online! The sensitive version is hard to find in stores. :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FatOrangeTabby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7NHAT2HSVNIBI6LH5QM6YFK4JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJY77TQITF4KG?ASIN=B00MHTGXN0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 3, 2012",
                "reviewTitle": "5.0 out of 5 stars Finally!",
                "reviewText": "I can't tell you how many times I have switched my 8 week old son's formula. We have tried Enfamil Newborn, AR, and Gentlease, we have tried Baby's Only Soy, Dairy and Similac Alimentum. Every single one caused my baby some kind of problem, from spitting up to constipation, gas, and pain while eating. At 5 weeks he was diagnosed with silent reflux and put on rantidine three times a day. I did not want to give him prescription drugs at 5 weeks old, but I thought I would try it. He was in so much pain, it was awful to watch. It was also affecting his sleep because he could not lie flat without having pain.To make a long story short, the rantidine did nothing to help his reflux. After two weeks I decided to call it quits. My pediatrician gave me samples of Alimentum because we suspected a milk protein allergy. The Allimentum did no good and gave him diarrhea. I switched back to Gentlease, even though it produced horrible green swamp poops and did not really help anything either. I almost gave up looking for a good formula, assuming that they were all horrible.We tried everything I could find. First we bought a probiotic and started that once a day. It seemed to help aid digestion but did nothing to ease his pain. Then we switched from Avent to Dr. Brown's bottles, which cut down on the gas and helped a little bit more. Finally, I decided to give this formula a try. I was in the middle of a feeding of Gentlease, and he was crying in pain. Just for kicks I popped open a can of the Baby's Only Lactorelief and BAM! No pain! He literally stopped crying right in the middle of the feed, gulped down 4 ounces, and crashed.I did not realize until visiting the NaturesOne website that they do compare this formula to Enfamil Gentlease and Similac Sensitive. It's the only sensitive organic formula on the market. The ingredients are similar to that of the other brands but it does not contain corn or hexane-derived DHA/ARA. It smells and tastes a ton better.I don't think my son is lactose intolerant. Or maybe he is. There are also theories out there that some babies are sensitive to corn or DHA. Whatever the problem, I don't care. After two days of eating this formula, the only time we are experiencing any discomfort is when he has to burp. Even that seems very minimal and the burps are easier to coax out. I always wondered how long I should wait to see results from a new formula. A day? A week? A month? In this case, I have seen improvement from the very first feed. I won't say it's perfect yet, but he may have inflammation from the previous formula. I will update.I know how frustrating it can be to figure out what the problem is if your baby is having reflux issues. It's trial by fire until you nail something down. If you are feeding Enfamil Gentlease or Similac Sensitive and would prefer an organic alternative, this is for you. Please do not let these people who insist that the arsenic will hurt your baby scare you. Do some research on hexane and DHA and decide which is worse, potential small amounts of arsenic (which is naturally occurring from volcanic activities in the areas of the world where rice is grown) or the hexane derivation process. This is the ONLY formula on the market which does not contain DHA/ARA.Yes, it's expensive. But so are Alimentum and Nutramigen, and if your baby needs it, it's worth its weight in gold. I'm so glad it's working for us, and I could not be happier with it.Update 9-14-12Still working great! After two weeks, it's almost like my son never had reflux at all! We still get the occasional feed where he has an episode, but I think that might be stomach related and since he can't tell me, I'll never know. It seems to help to burp thoroughly when he gets that way.Update 10-3-12Over a month later we are still loving this formula. I had an extra can of the Dairy formula lying around and wanted to use it up. It instantly gave my son horrible gas and an upset stomach. I think he really does have a lactose sensitivity. I'm so glad Nature's One makes this organic lactose-free formula. My son is growing and thriving on it, with no reflux issues to speak of.Update 1-23-13We were able to transition to the slightly cheaper Baby's Only Soy formula at 6 months without a hitch. Tried the dairy formula again to no avail. I really think it's the lactose. But the soy is working great and we are saving money while still using the same great company.Update 1-7-15My son is no longer a baby, but I thought I would do a finalUpdate because there has been interest. My son tested positive for a milk allergy after we introduced solids at 8 months. It was barely detected. We did a combination of almond milk and hemp milk at a year, and he continued to do fine with cheese and yogurt. Now he is 2.5, and while he dislikes cows milk he is free of any dietary restrictions. Despite the milk allergy, he tolerated this formula just fine until he bottle weaned at a year. We did end up switching back to this after trying the soy, simply because I did not care for the smell and texture of the soy, and was a little worried about the whole soy proteins mimicking estrogen thing. But all turned out well and he's a perfectly healthy 2-year-old.",
                "reviewVotes": "702 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Morris fam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3657PN4HZ45C3367YVU7YD3MOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R178P9CAVPKOIS?ASIN=B00MHTGXN0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2015",
                "reviewTitle": "5.0 out of 5 stars I've tried all the rest (8 different ones) and then I found the best!!",
                "reviewText": "I started out with the intention of breastfeeding my baby but after a week I had to start supplementing with formula because my supply was too low (cue the overzealous lot who think I just didn't try hard enough...I get it but you don't know my circumstances so you don't get to judge me and that's not what this review is about). I slowly transitioned to all formula by week 6 and as more and more of my baby's diet consisted of formula he became increasing fussy. He had green sticky blob poops that smelled horrendous and slightly acidic. He had gas and would arch his back in pain. His spit up was only slightly above average amounts except for the few times he projectile vomited it all up. We were giving him gas drops and gripe water at every single feeding and he still couldn't get comfortable.Through out this time we tried 8 different formulas. Some were marginally better that others or seemed to fix one problem but exacerbate the others. As an fyi this is a complete list of formulas we tried: Gerber gentle, gerber soothe, enfamil infant, enfamil gentlease, Similac sensitive, Similac total comfort, Similac soy, and Similac alimentum. We even tried mixing them to see if that would help.At 2 months and 8 different formulas nothing worked and my poor baby was miserable and started only drinking 2oz. at a time and only because he was starving. I started doing research and I decided my next formulas to try were Baby's Only lactorelief and Kabrita goat's milk formula. I went to Whole Foods and was pleased to find both (I wanted something immediate because my baby was suffering but Amazon is cheaper). I started the Baby's Only a week ago now and haven't looked back (the unopened Kabrita remains on standby until week 3 and if everything is still great it will go back to Whole Foods).The first thing I noticed is that this formula smells good! No icky chemically smell. My baby is now eager to eat. The gas drops and gripe water are an extreme rarity. He is content and comfortable. The only drawback to this formula are so minor they do not require dropping a star. The formula does oxidize faster than other commercial formulas which means it turns brown and stains easier. Also my baby's poop hardly smells (this could be considered an advantage) so sometimes he goes way too long in a diaper I didn't realize was poopy so he gets diaper rash.It was never my intention to get expensive organic formula for my baby because we are a one income family on a tight budget. However this is cheaper than the small cans of Similac they sell at the big box stores and significantly cheaper than Similac Alimentum. It still breaks the bank but it's worth it for my baby.There are 2 things I'd like to address in my review that I haven't touched on yet. First is organic brown rice syrup is the first ingredient. In my research I found out that this is cause for concern because arsenic is naturally occurring in brown rice syrup. However a few years back Baby's Only responded to this concern and now filters it so that there are no detectable amounts of arsenic. You can read more about this on their website. This next thing is that this formula is marketed as toddler formula which is age 12-24 months. From my research it is my understanding that this is for 2 reasons, first is that to be marketed as infant formula it has to be tested and approved by the FDA, a lengthy and expensive process. The next reason and the reason Baby's Only states on it's website is because they support breastmilk as the only source of nutrition during the first year. They also acknowledge that this formula meets or exceeds all of the FDA requirement for baby formula.I'm so glad I finally found the right formula for my baby. It might not be right for your baby but if you've tried them all and nothing works try this one!!! It's only been a week so far but I'll keep Amazon updated 😄Update: This one is a keeper. Baby is so much happier. He's putting on weight and is healthy. I'm so glad that feeding time is no longer stressful.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nichole Wright",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHALK6IJ2WC34A5VCZFIWH6ATXGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGYFW5IJFLABI?ASIN=B00MHTGXN0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 21, 2022",
                "reviewTitle": "4.0 out of 5 stars Compare to Happy Baby",
                "reviewText": "I bought this to substitute for Happy Baby Organic Sensitive. First, this formula does not mix well, AT ALL. It was clumpy. Took forever and then was very foamy from trying to mix it. Secondly, I’m not sure of the taste because my son didn’t finish the bottle. He only drank half of it. I know this stuff is one of the best formula’s in the United States, buuuut. Like everything else, doesn’t work for everyone.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bobby",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 21, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "Good flavour, my son was very fussy with other formulas but seemed to enjoy this one",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Irina A",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 1, 2016",
                "reviewTitle": "Five Stars",
                "reviewText": "Thank you",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}