{
    "remaining_requests": 18259,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Puramino-Hypoallergenic-Formula-Powder-Allergies/dp/B01N1JLDU0",
    "body": {
        "name": "Enfamil PurAmino Hypoallergenic Infant Drink, for Severe Food Allergies, Omega-3 DHA, Iron, Immune Support, Powder Can, 14.1 Oz (Pack of 4)",
        "price": "$212.76$212.76 ($3.77$3.77 / Ounce) $190.37$190.37 ($3.38$3.38 / Ounce)",
        "originalPrice": "$239.96",
        "rawPrice": 212.76,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Puramino-Hypoallergenic-Formula-Powder-Allergies/dp/B01N1JLDU0",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CLB4VWTP"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51OuAxuCA-L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51FdWIV35TL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Sb6yXkn8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gPkuYHoVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41OcV2fAG9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518PELAj0mL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51S7tfq2NlL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/614hQHPb3eL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/614hQHPb3eL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Enfamil Store",
            "link": "https://www.amazon.com/stores/Enfamil/page/F0612249-5A0A-44FA-91E9-1D63F0EE81D3?ref_=ast_bln"
        },
        "brand": "Enfamil",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1118,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Tomorrow, February 16. Order within 3 hrs 41 mins",
            "FREE delivery Tuesday, February 20",
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Tomorrow, February 16. Order within 3 hrs 41 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SUITABLE FOR TUBE FEEDING: Puramino is appropriate for both oral and tube feeding",
            "WHY PURAMINO: PurAmino is an iron-fortified, hypoallergenic, amino acid-based infant formula for the dietary management of infants with severe cow’s milk protein allergy (CMA)",
            "SUITABLE FOR MANY DIETARY CONDITIONS: PurAmino is also suitable for other conditions that may require an elemental diet including - Eosinophilic esophagitis, short bowel syndrome, malabsorption, Protein maldigestion",
            "SOLE NUTRITIONAL SOURCE: PurAmino can be an infant's sole nutrition source through 6 months of age, and be a major supplemental nutrition source up to 2 years old",
            "EXPERT RECOMMENDED DHA: PurAmino has expert recommended DHA which provides brain-building nutrition",
            "HYPOALLERGENIC: 10 percent Amino-Acid based, iron-fortified formula, suitable for infants and toddlers with lactose intolerance",
            "TRUSTED BRAND: Enfamil is the Trusted Brand for Brain-building and Immune Support",
            "PEDIATRICIAN RECOMMENDED: Enfamil is the infant formula brand recommended by pediatricians"
        ],
        "description": "PurAmino is a hypoallergenic, iron fortified, amino acid based baby and toddler formula used for infants and toddlers with severe cow's milk protein allergies, and other food allergies. It also is suitable for conditions such as protein maldigestion, malabsorption/chronic diarrhea, short bowel syndrome and eosinophilic esophagitis. It contains omega 3 DHA and ARA, important fatty acid nutrients that provide brain support and eye development for your baby. PurAmino can provide a sole source of nutrition for infants up to age 6 months and provide a major source of nutrition for toddlers through 24 months of age, when indicated. Normally, in feeding infants, gradual introduction of solid foods after 4–6 months of age is an important developmental as well as nutritional step. In cases of severe and multiple food allergies or intolerances, PurAmino is sometimes continued as a milk substitute in the diet of children. This and similar supplemental use of PurAmino in the diet beyond 24 months of age may make a significant contribution to maintenance of good nutrition. PurAmino is created by the maker of Nutramigen—the #1 recommended brand* for managing infants who are allergic to cow’s milk protein‡. ‡By pediatricians who recommend a specific formula. *Enfamil is the #1 pediatrician recommended brand of Infant Formula - QuintilesIMS, using the ProVoice Survey fielded from October 1, 2016 to September 30, 2017.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Feeding",
                "link": "https://www.amazon.com/baby-feeding-highchair-bottle-bibs/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166777011"
            },
            {
                "name": "Baby Foods",
                "link": "https://www.amazon.com/Baby-Food-Formula-Pouches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16323111"
            },
            {
                "name": "Formula",
                "link": "https://www.amazon.com/Baby-Formula/b/ref=dp_bc_aui_C_4?ie=UTF8&node=16323121"
            },
            {
                "name": "Powder Baby Formula",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=21401508011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 8.31 x 8.31 x 4.5 inches; 3.5 Pounds"
            },
            {
                "name": "Manufacturer recommended age ‏",
                "value": "‎ 0 - 2 years"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 129023"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ June 1, 2013"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ MECV7 - pallet ordering"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B01N1JLDU0"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,194 in Baby (See Top 100 in Baby) #41 in Powder Baby Formula"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,118 ratings"
            },
            {
                "name": "Brand",
                "value": "Enfamil"
            },
            {
                "name": "Size",
                "value": "14.1 Ounce (Pack of 4)"
            },
            {
                "name": "Item Weight",
                "value": "3.5 Pounds"
            },
            {
                "name": "Allergen Information",
                "value": "Milk"
            },
            {
                "name": "Item Form",
                "value": "Powder"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Puramino Nutramigen Enfamil NeuroPro Gentlease Enfamil Simply Plant-Based Key Benefits 100% Amino-Acid based, iron-fortified formula, Suitable for infants with Severe Cow's Milk Protein and Food, Allergies and has Brain-Building DHA and Calcium to support strong bones Hypoallergenic Formula relief from colic due to cow's milk allergy and has Brain-Building DHA and immune support Relief from Fussiness, Crying, Gas & Spit-Up and has Brain Building DHA & MFGM Components, HuMO6* Gentle Immune Blend Plant-Based Soy Formula with Iron for Sensitive Tummies Brain Building DHA ✓ ✓ ✓ ✓ Immune Support Amino-acid based, Vitamin A, C, E, & Selenium LGG Probiotic, Extensively Hydrolyzed Proteins *2'-FL HMO, Vitamin C & E, Selenium, Partially Hydrolyzed Protein, and Reduced Lactose Vitamins A, C, E & Selenium For Cow's Milk Allergy ✓ ✓ For Severe Food Allergies ✓ Plant-based ✓ For fussiness, crying, gas & spit up ✓ Lactose free ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b645d2c9-3915-43c4-8e84-5fdc78561ee9.__CR0,0,2910,900_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0f5372c4-52c8-4069-b7b5-1f35b9e13b10.__CR0,0,2910,1800_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a51e4e6-d94b-470e-b443-bc36450f489e.__CR0,0,2910,1800_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5721925f-f540-4a4f-871d-885cd0124469.__CR0,0,2910,1800_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/548173bf-9bc3-43fd-9a0f-3dbab7b5963e.__CR0,0,1200,2400_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e80246ac-0bc1-47f9-b94e-845eb2141bba.__CR0,0,600,1200_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/310e54af-e307-4ccd-ab98-32c1012df562.__CR0,0,600,1200_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5beaf72f-7107-4a1a-a223-3f9ff2a672a3.__CR0,0,1200,2400_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Forgiven_RH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLVI4NLAZUYWCXODBFK6YSYBDEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJZRM028KLA2U?ASIN=B01N1JLDU0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2017",
                "reviewTitle": "5.0 out of 5 stars Worth every penny!",
                "reviewText": "Our now 3 month old is so sensitive to dairy that even Alimentum cases severe stomach upsets where she gets bloody diapers and just screams and cries all the time. Plus she hated the taste of that and the enfamil version of the same stuff. So the GI doctor told us to try an amino acid based formula and I decided to try Puramino.She has had some serious issues while breastfeeding too because she is sensitive to multiple proteins that I eat so she was also really underweight. The plan was to give her formula for a few weeks while I change my diet to avoid all of the allergens (dairy, soy, wheat, nuts, and eggs). We already knew dairy and soy would cause bloody diapers and upsets, but even after 5 weeks of avoiding those she still had an occasional diaper with blood in it, and she was still having a hard time sleeping and crying all the time. So the GI doctor recommended cutting all these things out of my diet and trying to breastfeed again, then figure out what else bothers her. So we got some Puramino formula to give her in the meantime.Seriously, this stuff is awesome! With every other formula we tried, she fought and cried and didn't like the taste so it was hard to get her to eat it. The first time she had Puramino, she drank it with no problems. And actually she drank so much of it that she gained a while pound in a week! That was a HUGE praise for us because she had been having such a hard time until then that for the first two months of her life we were in and out of doctor's offices and the ER, and nothing seemed to be helping her.For the first week she was not gassy, fussy, no reflux, spitting up, no bloody diapers, or anything. She smiled and played and slept; I mean she was just a totally different baby! After about a week she did start spitting up sometimes and she does sometimes get actual reflux, but she did (and does) while breastfeeding too.So I would recommend this stuff to anyone who has a baby with a sensitive tummy. It is definitely expensive, but it is worth it. And if it's a long-term solution, some insurance companies will help pay for it. This 4 pack on Amazon has been the cheapest way of buying it that we've found.We are back to breastfeeding now, but since she was eating so much more while I was giving her formula, I am still supplementing with Puramino when she is still hungry and we run out of breastmilk. I am SO thankful that this stuff even exists because we didn't know what else to do for our poor girl. But avoiding all of those allergens has also helped her tremendously. FINALLY, I have been able to nurse her without her tummy getting upset. And I have the Puramino to help with weight gain.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TiffanyTiffany",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV4U76XGHXA4RBBXSPEENTVH2YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HB3Q1EHFO6SF?ASIN=B01N1JLDU0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2019",
                "reviewTitle": "5.0 out of 5 stars This is a miracle formula!",
                "reviewText": "***UPDATE:Our daughter is now 15.5 months (dec. 2019) she was started on this Dec. 7, 2018. At 9 Months we were able to start mixing PurAmino with enfamil and by 12 months she was completely on enfamil. We started whole milk at 12.5 months and even now At 15 months she is now drinking whole milk with absolutely no issues. This formula is a miracle. It really is. It helped solved so many issues. Our daughter no longer has to see a pediatric GI doctor. She has been discharged from the clinic! She outgrew her reflux, milk and protein intolerance. We were able to take her off all of her meds for her stomach issues at 6-7 months old. This stuff is expensive and we often had to go between ordering at pharmacies and ordering on Amazon because prices would rise and lower. I am so grateful that my daughter is able to consume dairy and has no allergies.Under the direction of a doctor, if you’re recommended this, give it a go. Our daughter had issues with the taste and constipation at first so we tried other protein-formulas and ended back at this one. I would give this formula 10 stars ⭐️ If I could.————My daughter has sever reflux, milk allergy, a protein intolerance to where she can’t digest proteins, and trouble gaining weight.Our pediatric GI doctor recommended we try this first and he gave us a can to sample, he also told us about neonate if we wanted to try that. At first my daughter didn’t like PurAmino and would not eat much and had severe constipation.So we decided to try neocate, she projectile vomited EVERY time we gave it to her. So we tried neocate’s advanced formula with probiotics. She was a pooping machine and wouldn’t eat.After consulting with her GI, he asked us to try this again. So we did and voila! Baby slowly began eating more and her poops became more regular! She is gaining weight on this tremendously! So happy we tried it again!Baby is now happy after eating, no screaming or pain, and falls asleep easily. Her spit up has decreased.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/715WcRgvojL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "That One GuyThat One Guy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYGTLTHYYMBSJ3FNDVUEMJSALEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2H8E09ARFIE37?ASIN=B01N1JLDU0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Same as in store, better cost, convenient.",
                "reviewText": "My baby needs this formula due to some digestive issues. My local big box carries this formula for $60. Single cans on Amazon save me about $15 per can and them being shipped right to my door is a big bonus. Amazon limits to two cans per order but that’s plenty to last us for a week or so. The formula itself definitely helps with my baby’s issues and they are a lot less fussy throughout the day. The formula isn’t very thick, mixes well, and is easy to measure out with the included scoop (1 scoop per oz of water).",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ggzdqJn3L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "HC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2D2QZRDF27LD2PR4JCRRXQ7SJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1I15FCYIRB48J?ASIN=B01N1JLDU0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Expensive but a necessity for a baby allergic to milk",
                "reviewText": "We discovered our newborn had cow milk protein allergy. She started developing rashes around her face and body. At first, we fed her Nutramigen and the equivalent similac hypoallergenic formula, and let me tell you… they are not pleasant to the senses. That wasn’t why we stopped though, while the rashes went away, she had too many bowel movements to count. We then switched over to puramino, no bad taste and no bad smell. Bowel movements dwindled to normal numbers.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}