{
    "remaining_requests": 18243,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Pepticate-Formula-Hypoallergenic-Powdered-Prebiotics/dp/B0BSPB72QF",
    "body": {
        "name": "Pepticate Baby Formula, Hypoallergenic Powdered Infant Formula for Cow Milk Allergy, with Omega 3 DHA, ARA, Iron & Prebiotics, 14.1oz",
        "price": "$38.93$38.93 ($2.76$2.76 / Ounce) $34.83$34.83 ($2.47$2.47 / Ounce)",
        "originalPrice": "",
        "rawPrice": 38.93,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Pepticate-Formula-Hypoallergenic-Powdered-Prebiotics/dp/B0BSPB72QF",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41mYM Ya mL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41LYLYQuSqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uhjTJIqPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41X1qA XZML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41A5nRB8U3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JxFRWtozL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41yoIa40HXL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: NUTRICIA PEPTICATE",
            "link": "https://www.amazon.com/NUTRICIA-PEPTICATE/b/ref=bl_dp_s_web_96724333011?ie=UTF8&node=96724333011&field-lbr_brands_browse-bin=NUTRICIA+PEPTICATE"
        },
        "brand": "NUTRICIA PEPTICATE",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 64,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Tomorrow, February 16. Order within 6 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "HYPOALLERGENIC INFANT FORMULA: Pepticate is the leading extensively hydrolyzed infant formula (eHF) in Europe with over 30 years of experience in managing infants with cow milk allergy (CMA)",
            "COW MILK ALLERGY SYMPTOM MANAGEMENT: Clinically shown to be effective in the nutritional management of CMA. Helps to provide relief from symptoms of CMA, such as eczema and colic",
            "INSPIRED BY BREAST MILK: Pepticate is inspired by key components found in breast milk, including prebiotic oligosaccharides to support infant digestive health and immune system development, nucleotides to help support the immune system, and DHA and ARA to promote brain and eye development",
            "MADE IN EUROPE: Nutritionally complete, safe, and well tolerated formula sold in over 75 countries",
            "#1 EXTENSIVELY HYDROLYZED FORMULA (eHF) in Europe: Pepticate is the #1 eHF recommended by UK pediatricians (Most recommended brand on a 2022 survey of UK GPs, pediatricians, and dieticians: n =206)"
        ],
        "description": "Pepticate is the leading extensively hydrolyzed infant formula (eHF) in Europe with over 30 years of experience in managing infants with cow milk allergy (CMA). Pepticate is clinically shown to be effective in the nutritional management of cow milk allergy (CMA). Made in Europe. #1 EXTENSIVELY HYDROLYZED FORMULA (eHF) in Europe: Pepticate is the #1 eHF recommended by UK pediatricians",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Feeding",
                "link": "https://www.amazon.com/baby-feeding-highchair-bottle-bibs/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166777011"
            },
            {
                "name": "Baby Foods",
                "link": "https://www.amazon.com/Baby-Food-Formula-Pouches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16323111"
            },
            {
                "name": "Formula",
                "link": "https://www.amazon.com/Baby-Formula/b/ref=dp_bc_aui_C_4?ie=UTF8&node=16323121"
            },
            {
                "name": "Powder Baby Formula",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=21401508011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 4.8 x 4.61 x 4.06 inches; 14.11 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 192268_EA"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ February 21, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Nutricia"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0BSPB72QF"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ Netherlands"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,800 in Baby (See Top 100 in Baby) #36 in Powder Baby Formula"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 64 ratings"
            },
            {
                "name": "Brand",
                "value": "NUTRICIA PEPTICATE"
            },
            {
                "name": "Size",
                "value": "14.1 Ounce (Pack of 1)"
            },
            {
                "name": "Item Weight",
                "value": "400 Grams"
            },
            {
                "name": "Item Form",
                "value": "Powder"
            },
            {
                "name": "Age Range (Description)",
                "value": "Infant"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0be4efa6-736e-4deb-adda-edb65477868d.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/efaf62af-0873-4288-be98-aa05e7e7ff63.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0b65e58-0bb5-4c6e-ba11-bcbb9aaf8efc.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/69ebb26a-6beb-44a8-a034-5c48ba75b76d.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fa1b5824-4a1e-4bf5-996f-831c32866be2.__CR0,93,1920,594_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Katrina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOYIFPCFTCUU2KXEGTDQAPUPFXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RM3XQ0KT75EG?ASIN=B0BSPB72QF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Best Hypoallergenic Formula I could Find",
                "reviewText": "My daughter had difficulty latching right away and ended up not gaining any weight the first month after she was born. I continued to breastfeed but had to supplement and found at 6 weeks that she had 4 ties in her mouth, which we got lasered with a pediatric dentist. I’m continuing to triple feed (nurse, pump, bottle) in hopes of being able to breastfeed only but in the meantime I have a low supply and she needs more nutrition. Kendamil was recommended by my pediatrician, and I was really happy with it compared to any of the US formula options, because Europe has stricter regulations and therefore much better quality ingredients. My daughter did fine at first, for several weeks, and then she became noticeably fussy after every feeding and was inconsolable. I thought it was bad reflux. Then I started to wonder if she had an intolerance or allergy to the cow milk protein. Fortunately my diet is dairy free so the breastmilk I’m able to feed her is pure. She had also begun to have way more stools that were oddly very bright green with lots of mucus, and she had a lot of gas. I tried Kendamil Goat and she had the same symptoms. My only option was hypoallergenic so of course I tried Nutramigen. (My pediatrician recommended and it seemed to be the most popular). To my disbelief and complete disgust, I noticed the main ingredient is corn syrup solids, and it makes up almost 50% of the formula; It also contains soy oil. Terrible ingredients. I needed something right away that I could grab off a shelf so my daughter was fed, and she absolutely refused to eat it. I read from other reviewers that it smells like animal food, and it really does smell awful. She had looks of disgust as I tried to feed it to her and wouldn’t drink it. My husband ran to the store to find another option and bought Similac Allimentum. It also smelled nasty but it must have tasted slightly better. My daughter still made a face when I gave it to her but she drank it reluctantly. I did some research and found Pepticate. High quality ingredients compared to the rest, and the smell and taste is much better. With this one, my daughter didn’t make a face whatsoever and drank it happily. ALL her symptoms that I listed above resolved upon starting this hypoallergenic formula and she’s been a completely different baby- very happy and content & no crying after feeds anymore. Turns out she doesn’t have the cow milk protein allergy but she is obviously intolerant to it for the time being as her digestive system is immature. The hydrolyzed option is much better tolerated by her gut. I don’t know why more people don’t use this brand. It’s by far superior to the other hypoallergenic options.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Soy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKMIZCUT6MFN43VAOUM2EXPXJDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CLL0UK9KC057?ASIN=B0BSPB72QF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Baby loved it!",
                "reviewText": "My breast fed 2 month old seems to like this formula. I breast feed for the most part but it’s nice to have some formula on hand for days where my body isn’t producing enough milk..It doesn’t upset her tummy and doesn’t cause any allergic reactions like the previous formula. Definitely will be purchasing again.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alayna J.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDBLF2EDEYLXHXO6CIRVJYEAQ6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MVO1H7MQ445Z?ASIN=B0BSPB72QF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "4.0 out of 5 stars better alternative to nutramigen",
                "reviewText": "my baby needs hypoallergenic formula and we used to use nutramigen but it doesn’t mix well, has multiple recalls and smells disgusting. someone i know recommended Pepticate and my baby loves it and so do i. it smells much milder and has cleaner ingredients and is slightly cheaper. it’s still very expensive though but all hypoallergenic formula is. definitely recommend trying it!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PrimeAddict ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV37QCQZFCAM7OI3KNY2I5C2PDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LGK5DAOPDTR9?ASIN=B0BSPB72QF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2023",
                "reviewTitle": "5.0 out of 5 stars The Best Formula",
                "reviewText": "My baby was suffering and I was told to try this formula. This formula literally changed my baby overnight. She loves it! Only issue is that it’s hard to find. So if you don’t have it in your area don’t get your child started on it because Amazon limits the quantity.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mumma Fox",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFUGF7QX5W4NIJ5NJISSMNZIILA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TTH5W2NN3FQ1?ASIN=B0BSPB72QF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Great for cmpa",
                "reviewText": "My baby has cmpa and won’t take formula as he is exclusively breastfed by bottle.This is the only formula that he will take. He will only take it mixed into half breast milk half formula but again it’s the only one he will drink. And we have tried all the cmpa formulas going.It mixes well and doesn’t smell like dog food once made like others do.We use slightly cooled boiled water when making this formula up.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFO7G6LGP4QF7VICU4K5VTJKEQGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UYFR7CRUZ484?ASIN=B0BSPB72QF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Bought from manufacturer first",
                "reviewText": "This is the only formula my daughter will take. She was only breast fed for the first 9 months, however, my supply was drying up and I needed to give her something. She has a dairy allergy, and I have tried 3 other formulas before this one. She would not drink it. This one she loves. Yes it is on the higher side for price, but honestly worth it. Did buy from the manufacturer first then found I could buy on here. Just makes shipping easier. Cost is the same.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mama_x3Mama_x3",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELWQN5ALO4SNKDDGYXQOO5OAESQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMESASAWT1RHU?ASIN=B0BSPB72QF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 20, 2023",
                "reviewTitle": "4.0 out of 5 stars Good Alternative to US Brands",
                "reviewText": "Before even trying this on my 11 month old, I made sure to do a little research to be sure it would be ok to give him this and made sure I felt comfortable doing so and needless to say, I did.My son suffers from eczema which was originally thought to be due to CMA so I've had him on soy formula and while it helps, it doesn't completely alleviate it so I wanted to try a true hypoallergenic formula. I did slowly switch over and tried the whole can but decided to go back to his soy formula because it caused him severe diarrhea (which can be expected when switching formula) so I truly didn't give it to him long enough to see if it helped his eczema any further and since he's 11 months old and so close to being done with formula, I don't want him suffering with the diarrhea unnecessarily when we've already came this far with soy especially since his eczema is manageable with creams and prescription oil.The one thing I really liked about this formula is that you can make odd ounce sized bottles because it takes 1 scoop per ounce (the scoops are much smaller than what I'm used to with Enfamil). The soy formula I had/have him on gets clumpy and doesn't mix back in if you make a large batch and put it in the fridge, so I always eyed what I thought was closest to a half scoop to make him 9 oz bottles but this method of measurement does it 100% accurate to get the correct water to formula ratio (which is extremely important).The other thing I like is that you can go directly to the manufacturers' website and have a free sample shipped to you from right here in the US to try out before spending so much on a can to find out your baby doesn't tolerate it well (and the sample size can I got was the same size as this can).Overall my LO did tolerate this formula well (minus the diarrhea which again, can be completely normal). He didn't seem to have an upset stomach and his belly seemed as full as on his normal formula. It's definitely a good alternative if you're having a hard time finding your regular hypoallergenic formula. The price tag is a little steep however the scoops are probably 1/3 the size of the Nutramigen scoops so if you're comparing those 2, it might equal out. I attached photos for comparison between the Nutramigen and Pepticate scoops.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/616iI7Lkd3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+WlRYLqCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ZrV7utgBL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}