{
    "remaining_requests": 18136,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Colief-Infant-Drops/dp/B00F7KKCE2",
    "body": {
        "name": "Colief Infant Drops",
        "price": "$19.27",
        "originalPrice": "$20.43",
        "rawPrice": 19.27,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Colief-Infant-Drops/dp/B00F7KKCE2",
        "soldBy": {
            "sellerID": "A12ZT4ZURPEEJ7",
            "name": "Peter Pann",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A12ZT4ZURPEEJ7&asin=B00F7KKCE2&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "Only 16 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41N DHRwu2L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/410 -lLhWRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41trt fHfkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413nvnEMgdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21WGdehAsCL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Colief Store",
            "link": "https://www.amazon.com/stores/Colief/page/31124F83-CAFF-433A-BD96-E1AF9230609A?ref_=ast_bln"
        },
        "brand": "Colief",
        "merchantInfo": "Peter Pann",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 170,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35. Order within 13 hrs 59 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "If the baby shows no signs of improvement after a week, TLD can be ruled out as the cause, and other issues can then be investigated."
        ],
        "description": "Many adults experience irritating reactions after consuming milk and certain mile products. In adults, this called lactose intolerance. In babies, it's referred as Colic. Colic is defined as repeated episodes of excessive and inconsolable crying in a newborn baby who otherwise appears to be perfectly healthy. The condition affects up to 1 in 5 babies. As any parent with a distressed, crying baby knows, colic affects a whole household, and can be very frustrating and upsetting for all involved. What causes these symptoms? The technical name for this condition is transient lactase deficiency (TLD). TLD is a natural condition that is an ordinary part of the development of many babies research has found that TLD affects more than a third of babies with colic. A lack of lactase enzyme in the small intestine results in a baby's inability to fully digest the lactose found in milk and formula. The undigested lactose is instead broken down in the bowel, producing lactic acid and hydrogen gas. TLD does not put a baby's health at risk and will normally resolve itself after about 4 months, when sufficient lactase enzyme is naturally produced by the baby's system. Milk, dairy products, infant formula, and breast milk all contain a complex sugar called lactose. Lactase is the enzyme our bodies normally produce to break down lactose into the simpler sugars, glucose and galactose, so that we can absorb it. Some babies have immature digestive systems that have trouble breaking down the lactose found in breast milk and formula. This causes severe discomfort from bloating and gas, which is expressed through the distressed crying of colic. Colief Infant Drops contains an enzyme that is destroyed by heat. It works best in warm milk. Always follow the manufacturer's instructions when preparing your infant's formula. Do not add Colief Infant Drops to formula that is too hot or too cold. Colief Infant Dr",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Feeding",
                "link": "https://www.amazon.com/baby-feeding-highchair-bottle-bibs/b?ie=UTF8&node=166777011"
            },
            {
                "name": "Baby Foods",
                "link": "https://www.amazon.com/Baby-Food-Formula-Pouches/b?ie=UTF8&node=16323111"
            },
            {
                "name": "Formula",
                "link": "https://www.amazon.com/Baby-Formula/b?ie=UTF8&node=16323121"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "‎3 x 1.5 x 1.5 inches"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Target gender",
                "value": "‎Unisex"
            },
            {
                "name": "Additional product features",
                "value": "‎Clinically Proven"
            },
            {
                "name": "Number Of Items",
                "value": "‎1"
            },
            {
                "name": "Batteries required",
                "value": "‎No"
            },
            {
                "name": "Is portable",
                "value": "‎No"
            },
            {
                "name": "Item Weight",
                "value": "‎0.8 ounces"
            },
            {
                "name": "ASIN",
                "value": "B00F7KKCE2"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 170 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#35,408 in Baby (See Top 100 in Baby) #135 in Baby & Toddler Formula"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "DrExploreMore",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPNEY5DEQESZE25OMGOHOFEVZFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BHKTD05R8EWO?ASIN=B00F7KKCE2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 30, 2020",
                "reviewTitle": "5.0 out of 5 stars A lifesaver! Works amazing with European cow based formula!",
                "reviewText": "Firstly, I cannot attest to how this works with the fake filler heavy US based formulas. After realizing how the baby formula in the US is meant to “hook” the kid with the sugary goodness of corn syrup, I went in search of something better. I discovered that European formulas from the UK, Germany, and Holland have much healthier bases as I imported a variety of these to see what worked best. The goat’s milk formulas worked wonderfully, although they are more difficult to obtain and cost significantly more. Unfortunately my daughter reacted to the cow/bovine dairy based formula. In comes Colief!! By mixing 2 drops of this with 90mL of water and formula we had a wonderful fix. Our daughter was suddenly doing as well on the cow based as she had on the goat based. At 2 drops per serving/bottle, this is a much more affordable alternative to the various goat based formulas.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L. Leal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4WDPDD53JDM5AVRCEAEDMLV4ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSIMM76ATJBKQ?ASIN=B00F7KKCE2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 15, 2015",
                "reviewTitle": "5.0 out of 5 stars I wish someone told me about these drops earlier!",
                "reviewText": "These drops completely relieved my 6 month old of gas pain. I went to a GI specialist at Stanford and even they did not think my son's issue was due to lactose intolerance. But, in fact he was lactose intolerant. Don't always listen to doctors. Go with your mommy instinct. On a mommy board I saw a recommendation for these drops and it has seriously changed our lives. Our 6 month old son went from waking up 3-4 times per night with back arching gas pain to overnight sleeping peacefully with no gas pain. I couldn't believe how quickly it worked!! Yes, you have to put the drops in 30 minutes in advance of feeding your baby, which is a small price to pay for peaceful sleep. I warm up an 8 oz bottle and put 5 drops in it and swirl it. I feed my baby 30 min to up to 4 hours later and he is one happy gas free baby. Try it if your baby has painful gas. It was a life saver for us. The bottle of lactase drops does lose its potency after 2 weeks so beware. You'll have to buy a new bottle of drops every 2 weeks.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KCB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSDK5QTZ3OAQF6NQMXVU363DCGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8L4YKK69GDVQ?ASIN=B00F7KKCE2",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 9, 2020",
                "reviewTitle": "3.0 out of 5 stars Not easy to administer if nursing",
                "reviewText": "Takes a lot of work to administer if breastfeeding. Per the instructions, you are supposed to add 4 drops to a “few tablespoons” of expressed milk and then continue feeding. So the issue with that if you are nursing is that you have to let your baby cry a little while you go pump out some milk, then feed via bottle the 2 ounces (3 tablespoons = 2 ounces) and then continue nursing. This would be a lot easier if you use formula or pump exclusively. And then you could prepare in advance. I think it is too much work for nursing moms. And why does it have to sit in formula for 30 minutes but not expressed breast milk? Very confusing.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lori",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZMQNND3K4YVQAHCXXA3LX42MFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REB7M6P0CELCE?ASIN=B00F7KKCE2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 25, 2015",
                "reviewTitle": "4.0 out of 5 stars Four Stars",
                "reviewText": "Helpful",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fallon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGGXTM2MLNOBELNE6AHTZTYA7NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVAMXF6SZ1H14?ASIN=B00F7KKCE2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2021",
                "reviewTitle": "5.0 out of 5 stars Life Saver",
                "reviewText": "Our newborn started having major colic when we got her home from the hospital and my milk came in. We started with Gas Relief Drops and they just weren't cutting it. My husband found this product and we ordered it ASAP, desperate to get her tummy problems resolved. After the first bottle, her stomach began reacting normally again. We use a dose with ever feeding and her colic is completely gone. She sleeps solid again like she did in the hospital. I love that this is a natural product and it instantly started working. Be sure to read the instructions fully and timing is everything!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEED25FSHKZLONMYVO3675PRHXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27G3I6X952OUB?ASIN=B00F7KKCE2",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 6, 2022",
                "reviewTitle": "1.0 out of 5 stars Worst cries ever after giving the drops",
                "reviewText": "I gave the drops to my 6 weeks old and he started to have pain discomfort the whole day. He never cried for so long and so hurtful until these drops.Just stick to the gas drops or gripe water….",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCV3GYSZDAFU6ZAHJKCPWQ46AKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7603LAY2VHQL?ASIN=B00F7KKCE2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 11, 2017",
                "reviewTitle": "5.0 out of 5 stars Worked!",
                "reviewText": "We tried it with our 2 week old but were skeptical, plus the whole \"must be mixed 30 minutes in advance\" seemed kinda impossible. However, i had to write this review because it worked and it's doable. I had to start pumping milk, putting it in bottles in 1 feeding portions, adding the drops and refrigirating them. So at night i put a few bottles of milk on ice and bring them up into the bedroom before sleep. All i have to do is warm up a bottle when baby wakes up, which takes only a couple of minutes. Baby is so much calmer, gets better sleep, doesn't wake up or stay up crying and stretching and kicking his little legs. I was not happy about having to pump milk and losing the one on one time of breastfeeding, but when i saw how much better my son felt, it made it worth it. Hopefully i can wean him off it in a couple of months and go back to breastfeeding.Follow up: baby is now almost 5 months old. We used Colief for 1 month and were able to stop with no issues.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cassie Valente",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVQS3STXBURUHIESLBNZJQIQ6UA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CFIVGFWNHVIQ?ASIN=B00F7KKCE2",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 16, 2018",
                "reviewTitle": "2.0 out of 5 stars Not what I expected!",
                "reviewText": "From the minute it came, its not worth it. The package was opened, as well as the box the medicine came. It did still have the seal. So we tried it. However, it didnt. My son had colic & gas pains. & If anything, it made it all worse. Price is expensive for just a little bottle. & The bottle doesnt last long at all! & The directions are ridiculous. I had to search online for quite a while to figure out how to even use it. I def don't recommend. There is other, better products for the same price.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$19.27",
                "sellerName": "Usluga's Store",
                "sellerRating": "5"
            },
            {
                "price": "$23.96",
                "sellerName": "AR FIRST AID",
                "sellerRating": "4.5"
            },
            {
                "price": "$23.96",
                "sellerName": "DealonUS",
                "sellerRating": "4.5"
            }
        ]
    }
}