{
    "remaining_requests": 49232,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SAMSUNG-Chromebook-Computer-Touchscreen-Processor/dp/B088T2C912",
    "body": {
        "name": "SAMSUNG 13.3\" Galaxy Chromebook Laptop Computer w/ 256GB Storage, 8GB RAM, 4K AMOLED Touchscreen Display, HD Intel Core I-5 Processor, Ultra Slim, US Warranty, Fiesta Red",
        "price": "$612.00$570.00$628.00",
        "originalPrice": "$999.99",
        "rawPrice": 612.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SAMSUNG-Chromebook-Computer-Touchscreen-Processor/dp/B088T2C912",
        "soldBy": {
            "sellerID": "A1VVV3R3L3SMNQ",
            "name": "BESTDEAL(SN Recorded)",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1VVV3R3L3SMNQ&asin=B088T2C912&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "Only 10 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41fwxDiwECL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41hIfwZjurL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41bOIRWRfIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41j6-OobfRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41fFwbjeTNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41OFraJZRsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410CVDAfQdL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0ff42b9e-fc43-441e-89fc-29cb8c8da8f6/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d8c94113-3c1d-4a13-972f-e0f09d7cb1cc/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eb0d7a1e-3ffc-4f1e-b98e-ae5540e45f80/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1dt8IIt0yL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1dt8IIt0yL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the SAMSUNG Store",
            "link": "https://www.amazon.com/stores/Samsung%C2%AE/page/F50AFABA-4CDE-4A95-84D0-CA4C61819FEB?ref_=ast_bln"
        },
        "brand": "Samsung®",
        "merchantInfo": "Ships from and sold by GaLiMu Tech.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 669,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 14 - 16.",
            "Or fastest delivery Tuesday, February 13.",
            "FREE delivery February 14 - 16.",
            "Or fastest delivery Tuesday, February 13.",
            "FREE pickup Friday, February 16",
            "Or fastest pickup Wednesday, February 14. Order within 5 hrs 2 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Aspect Ratio:16:9",
            "Crystal clarity. Vivid color: Experience superior picture quality and fully expansive color, contrast and depth with the 4K AMOLED touchscreen display to take your work and play to the next level.",
            "Split-second productivity: Boot up in as fast as 6 seconds and hit the ground running. Get ample storage with 256GB SSD and work, play and multitask seamlessly.",
            "Stroke of genius: Take notes, sketch ideas and edit documents easily and accurately with the built-in pen that fits seamlessly into Galaxy Chromebook’s ultra-slim design.",
            "Speedy. Simple. Secure: Chrome OS is the speedy, simple and secure operating system that powers Chromebooks. It is designed to feel intuitive and helpful every step of the way. It comes with the Google Assistant which helps you multitask and control smart devices. Plus, with apps from the Google Play Store, you can get work done, watch your favorite shows or play your favorite games.",
            "A better way to Wi-Fi: Unlock network speeds up to 3x1 faster than previous generation Wi-Fi. Download music, movies and more in seconds backed by Intel’s high-performance wireless hardware."
        ],
        "description": "A high-definition 4K AMOLED display provides incredible clarity. With 100% Adobe RGB and 100% DCI-P3 support, you can edit videos to a professional standard. View in a rich range of colors, with true-to-life colors and black hues. Its ultra-slim 3.9mm bezel let you immerse yourself in visual splendor. It features a solid full-aluminum body with a thickness of 9,9 mm. Use Ambient EQ to automatically adjust the color temperature and brightness of your display to suit your surroundings. Not only does this function help reduce eye fatigue, but it also provides you with more realistic-looking images. An AMOLED display keeps colors intact and only reduces blue light. Now you can watch for longer, even at night, with reduced eye fatigue – meaning you can work or watch videos in darker settings without disrupting your sleep!",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computers & Tablets",
                "link": "https://www.amazon.com/Computers-Tablets/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13896617011"
            },
            {
                "name": "Laptops",
                "link": "https://www.amazon.com/Notebooks-Laptop-Computers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=565108"
            },
            {
                "name": "Traditional Laptops",
                "link": "https://www.amazon.com/Traditional-Laptop-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=13896615011"
            }
        ],
        "productInformation": [
            {
                "name": "Standing screen display size",
                "value": "‎13.3 Inches"
            },
            {
                "name": "Screen Resolution",
                "value": "‎3840 x 2160 pixels"
            },
            {
                "name": "Max Screen Resolution",
                "value": "‎3840 x 2160 Pixels"
            },
            {
                "name": "Processor",
                "value": "‎1.6 GHz core_i5_10210u"
            },
            {
                "name": "RAM",
                "value": "‎8 GB LPDDR3"
            },
            {
                "name": "Hard Drive",
                "value": "‎256 GB SSD"
            },
            {
                "name": "Graphics Coprocessor",
                "value": "‎Intel UHD Graphics"
            },
            {
                "name": "Chipset Brand",
                "value": "‎Intel"
            },
            {
                "name": "Card Description",
                "value": "‎Integrated"
            },
            {
                "name": "Graphics Card Ram Size",
                "value": "‎8 GB"
            },
            {
                "name": "Wireless Type",
                "value": "‎Bluetooth, 802.11ax"
            },
            {
                "name": "Number of USB 3.0 Ports",
                "value": "‎2"
            },
            {
                "name": "Average Battery Life (in hours)",
                "value": "‎8 Hours"
            },
            {
                "name": "Brand",
                "value": "SAMSUNG"
            },
            {
                "name": "Series",
                "value": "‎Galaxy Chromebook"
            },
            {
                "name": "Item model number",
                "value": "‎XE930QCA-K01US"
            },
            {
                "name": "Hardware Platform",
                "value": "‎Chrome"
            },
            {
                "name": "Operating System",
                "value": "Chrome OS"
            },
            {
                "name": "Item Weight",
                "value": "‎2.29 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎11.92 x 8 x 0.39 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎11.92 x 8 x 0.39 inches"
            },
            {
                "name": "Color",
                "value": "Fiesta Red"
            },
            {
                "name": "Processor Brand",
                "value": "‎Intel"
            },
            {
                "name": "Number of Processors",
                "value": "‎1"
            },
            {
                "name": "Computer Memory Type",
                "value": "‎DDR4 SDRAM"
            },
            {
                "name": "Flash Memory Size",
                "value": "‎8"
            },
            {
                "name": "Hard Drive Interface",
                "value": "‎Solid State"
            },
            {
                "name": "Optical Drive Type",
                "value": "‎No Optical Drive"
            },
            {
                "name": "Voltage",
                "value": "‎7.7 Volts (AC)"
            },
            {
                "name": "Batteries",
                "value": "‎1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "ASIN",
                "value": "B088T2C912"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 669 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,699 in Computers & Accessories (See Top 100 in Computers & Accessories) #629 in Traditional Laptop Computers"
            },
            {
                "name": "Date First Available",
                "value": "May 18, 2020"
            },
            {
                "name": "Model Name",
                "value": "Galaxy Chromebook"
            },
            {
                "name": "Screen Size",
                "value": "13.3 Inches"
            },
            {
                "name": "Hard Disk Size",
                "value": "256 GB"
            },
            {
                "name": "CPU Model",
                "value": "Core i5-10210U"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "8 GB"
            },
            {
                "name": "Special Feature",
                "value": "Support Stylus"
            },
            {
                "name": "Graphics Card Description",
                "value": "Integrated"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/42cd6ac1-8a5d-40c5-8354-851f98610ebf.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7c057cbf-10af-4891-a5d8-f519f07c80e9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8d066ff6-288b-43e8-acba-620bb11b57fc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/02c620b0-d414-4181-bdf1-180eb0df17f5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9ff230c0-3c77-4955-b5b4-693dba8a7e27.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tyler Ward",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOE2WAMMMTNTRXYSN4ZTJNGJD2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL8MJ04Y82YI8?ASIN=B088T2C912",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 4, 2021",
                "reviewTitle": "5.0 out of 5 stars Slim Sleek Beautiful Power Hungry Beast",
                "reviewText": "A good place to start would be that I got this chromebook at a discount ($749, down from $999). And my needs are mainly to run Citrix (through browser or Chrome app, either works) for work and to casually browse, read magazines/books or listen to Spotify. Not a \"Power User\" by any means, though not sure any Chrome OS user is.That being said, this is THE BEST CHROMEBOOK I'VE EVER USED, and it is more than perfect to suit my needs.Build: The thing is beautiful, a really premium feel to the materials, and the red is really classy and not too gaudy as I was a bit worried and almost went with the more drab grey option - I'm glad I didn't. The chrome ring around the outside is also a premium touch that looks great. It's the thinnest and lightest 2-in-1 laptop I've ever seen, and I know that I like to use 2-in-1s in tablet mode and this is the first time it actually feels comfortable and feasible to do that for more than a brief period of time. The 2.2lbs was a big draw for me when comparing this laptop to the Galaxy Chromebook 2, Asus C436, or the Acer Spin 713 - upon using it I am glad I took it into consideration. Other great things about the build are the relatively loud stereo speakers and the built-in stylus. Minor drawbacks would be the weak hinge that doesn't always hold the screen in place when moving the laptop if open (though for the most part it does the job) and the lack of ports (you just get 2 USB-C ports, which also function as charging ports, so if you're charging you only have 1...adapters easily solve this). Also the cameras are weak but I don't use those - if you're buying for camera quality only for some reason (Zoom?) then this isn't the one for you.Screen: The SCREEN is AMAZING. The OLED is top notch and better than any Chromebook I've ever seen, at full brightness the colors are insane. That being said, the high resolution and the brightness eat at the battery life a lot, so in most cases I've got brightness scaled way down and I don't really miss anything, it works fine. Touch works perfectly, the stylus allows for really detailed notes/drawings in Canva or other apps. One drawback might be the bezel placement, there are 3 super-thin outer bezels and one larger bottom bezel... in tablet mode that one larger bezel functions well as a \"handle\" of sorts, but the other sides can't be touched without accidentally hitting the screen and scrolling or clicking a link, etc. A very minor nuisance at most. Another minor issue is that the resolution is SO GOOD that when I run Citrix, the session almost appears blurry, but still workable - on high resolution windows machines Citrix has addressed this with DPI scaling, but they've yet to master this on the Chrome OS app or the Chrome web app. Not Samsung's issue, but still part of my experience with the machine so I thought it worth mentioning.Performance: This thing is a BEAST. There's arguably no need for an Intel i5 in a Chromebook, but here we are, and the thing is FAST. Scrolling is smooth and even with tons of tabs open I've never experienced lag when playing videos or games. With lots going on under the hood, and no fan, I've heard mention from others that the computer can get really hot under heavy loads - I've barely experienced this while using a decent amount of processing power, and would elaborate that when I did feel heat it was very minor and not unbearable by any means. I'm thinking unless you are gaming a lot or developing in linux or doing something really really processor heavy, you'll be fine. A small performance gripe in general is that Android apps don't always play well with Chrome OS and have re-sizing issues or some lag, but this is not a Samsung problem, more of a Google problem.Battery Life: Some people have called this the achilles heel of the laptop, but I don't have much issue. Again, I'm not a real gamer/developer/super user - I am Joe Basic using it for administrative work and browsing/music/reading. On an average day at like 70% brightness I can unplug at 8am and make it to about 3 or 4pm before having to plug back in while working in Citrix doing basic tasks on MS Access, Excel, etc - nothing intense but that's pretty much constant screentime for about 6-7 hours before it starts getting low and I've got to plug in. Obviously this is not great in comparison to 10+ hours at full brightness seen on other Chromebooks - but you are getting more than the average Chromebook here and this is a bit of a concession made on Samsung's part to provide the rest of the goods. Overall if you don't need to be away from a charger for more than 6 hours every day, you shouldn't have an issue.Should you buy it: If you have read this far and think your needs/usage are similar to mine and you want the sleek-est, coolest, thinnest chromebook out there, DEFINITELY BUY THIS (especially if on discount, which it frequently is between Amazon, Best Buy, and Samdsung's own site).",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jared Carlson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP6R6TWVMVRZSG6HAQVN6CM4OWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KYWV4ZKNIPOV?ASIN=B088T2C912",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2020",
                "reviewTitle": "5.0 out of 5 stars The Couch Laptop",
                "reviewText": "Early impressions - Impossibly thin. Android apps are surprisingly better than web app variants. Red is the laptop color I never knew I needed. The keyboard travel and \"thud\" is satisfying and the trackpad is Apple level.Like every other review, the battery is abysmal compared to any ultrabook in 2020 (3-4 hours max with comfortable brightness). However, this is the best home laptop you can get right now. The design is hard to appreciate until it's in your hands, but I have never seen a thinner device with an i5 chip. It gets warm without a fan but nothing uncomfortable. The pen performs better than the gen 1 Apple Pencil I'm coming off of. I can't say this is great for art, but you get access to Concepts in the Play store and Adobe Draw. I do wish Samsung Notes was an option given the Galaxy name, but here we are. Big, big fan of using my mobile only fantasy football app (Sleeper) on a bigger screen. Most Android apps I've installed are responsive which helps to avoid going fullscreen/forced to use the touchscreen in portrait.Connecting a Dualshock4 controller was effortless, didn't need to configure for Among Us either. Some games like Shadowfall will need some effort to work. No CoD Mobile support was a bummer, hopefully in an update.Complaints: The screen looks great, however no 4k support on most streaming options AND due to the OLED this screen is very dim by default. If you have it at 50% your eyes will be strained after an hour. 70% is comfortable, getting 4 hours average.If you're looking to continue your Android experience in laptop form, this is the way.",
                "reviewVotes": "64 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nersciple",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3RSOFBCIQA7S7PE2RS2AXT45ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QBWOENRR4R1P?ASIN=B088T2C912",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2022",
                "reviewTitle": "4.0 out of 5 stars Beautiful image poor battery.",
                "reviewText": "Bought this Chromebook because it was decently priced (under $600), didn't have a Celeron, was thin and wanted to try my hand at something that wasn't Windows based.Took a bit of time figuring out how to navigate and am kind of still learning but this laptop is very appealing for what I was wanting to use it for. It's the only Chromebook I know with a 4k resolution screen, not that I was wanting it for that, but the image quality looks stunning. The i-5 processor is fast enough to handle most any daily functions and the thin stylings of the laptop itself is very appealing. It comes with a stylus that's installed directly into the machine and works flawlessly. Audio isn't anything to brag about but does get plenty loud for most entertainment options. I normally use it to watch a sports game while playing board games with friends or watching Youtube videos to learn said board games. Convertible mode is exactly what you'd expect but was surprised the laptop doesn't get extremely hot when the screen is folded to block the air vents. Is small and light enough that it doesn't seem so burdensome but large enough that it doesn't feel like I'm typing on something meant for a child.My biggest issue though is the 4k screen. I can watch all forms of resolution on this laptop but have no options to force the resolution to something lower to help save on battery life and boy is the 4k screen a energy hog. My entire view point before buying this was that I knew the battery life wasn't that great but figured I'd just lower the resolution and get whatever I could out of the battery but was disappointed to find out that's impossible. Don't get me wrong the 4k screen is beyond beautiful but now I need to plan accordingly if I'll be out and about with this Chromebook, something I didn't really expect when purchasing the product.All in all I'm happy with this product and as long as the battery life isn't a complete deal breaker then I highly recommend.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 31, 2021",
                "reviewTitle": "Brilliant Chromebook",
                "reviewText": "This is a great Chromebook. The brilliant screen resolution, perfectly responsive touch screen and great keyboard all outweigh the shorter battery life than we have come to expect from our devices.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonathan StraußJonathan Strauß",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 13, 2021",
                "reviewTitle": "Tolles Chromebook mit nicht so guter Akkuleistung!",
                "reviewText": "Jahre lang das Samsung Galaxy Book benutzt. Aber das Windows Betriebssystem wird immer schwächer und bietet nicht wirklich viele Neuerungen. Deshalb habe ich mich für ein Chromebook entschieden. Und zwar das Samsung Galaxy Chromebook in Rot.Verarbeitung: Das Chromebook sieht super aus. Ist leicht, dünn und hochwertig verarbeitet. Mit integriertem S-Pen.Die rote Farbe leuchtet schön. Sieht Edel aus.Ausstattung. Das Gerät kommt mit Ladekabel (USA), man braucht einen Adapter für deutsche Steckdosen. Ersatzspitzen für den S-Pen. Kurze Anleitung.Display: 4K8 GB RAMSpeicherplatz: 256 GB. Kann durch eine Micro SD Karte noch erweitert werden.Sehr nützlich ist der Fingerprint Reader. Damit lässt sich das Gerät sehr schnell entsperren.Betriebssystem: Chrome OS. Ich selbst nutze Chrome OS Beta. Läuft rund ohne große Probleme.Batterie: Das ist das Problem bei diesem Gerät. Die Akkuleistung ist nicht gerade berauschend! Man kommt auf 4 bis maximal 8 Std. Je nachdem wie voft man es benutzt und was man alles eingenstellt hat. Ich kann mit der Batterieleistung leben. Nutze es nur Privat und nicht für den Job.Man kann es ganz aufklappen und dann den Tablet Modus nutzen. Ideal um mit dem Stift zu arbeiten. Fürs zeichnen ist der S-Pen nicht geeignet!Da es nur in Amerika erhältlich ist, kommt es ohne deutsche Tastatur aus. ẞ,Ö,Ä,Ü gibt es nicht.Fazit: Es wäre das Perfekte Chromebook wen die Akkuleistung besser wäre.Kann es aber trotzdem empfehlen. Für den Gelegenheits Chromebook User.Wer es für den Job braucht, sollte zu einem anderen Gerät greifen.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71WC-YbF8mL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61srlsLNqtL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on June 7, 2022",
                "reviewTitle": "Amazing screen and fit/finish",
                "reviewText": "Absolutely love this chromebook! Yes it has a sub-par battery and it's certainly not a workhorse. It's a leisure laptop, browsing/youtube/movies the screen is amazing, with included stylus and effortless touchscreen. The fit and finish is solid, the red colour is eye catching. I consistently get 4 hours plus with 70% brightness with a mix of browsing/youtube/movies.Also it is super light. Mine does get slightly warm under the chasis with 10+ tabs open etc or when playing high res video, but general browsing it's cool to touch underneath.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Agentia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 24, 2021",
                "reviewTitle": "Mit MS Remote Desktop und Parallel Access in allen Welten zu Hause.",
                "reviewText": "Akku Leistung ausreichend, könnte aber besser sein.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Derpus Maximus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on May 25, 2021",
                "reviewTitle": "Crappy OLED Screen",
                "reviewText": "Screen suffers from \"screen door\" effect. Do not purchase if you are buying mainly for the OLED screen. My Samsung Galaxy Tab S8.4 from 7 years ago has a better OLED screen than this.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$601.55",
                "sellerName": "Birch Tech",
                "sellerRating": "4"
            },
            {
                "price": "$618.00",
                "sellerName": "Cardinal Pro Electronics",
                "sellerRating": "3.5"
            },
            {
                "price": "$822.74",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}