{
    "remaining_requests": 49423,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/AMIAMO-1920x1080-Quad-Core-Processors-Lightweight/dp/B0CQLWJMSC",
    "body": {
        "name": "AMIAMO 16GB RAM Laptop Computer, 512GB SSD, FHD IPS 1920x1080 Screen, Intel Celeron Quad-Core N5095 Processors, Lightweight Laptop, Numeric Keypad, 2.4/5G WiFi, 2MP Webcam.",
        "price": "$679.99",
        "originalPrice": "",
        "rawPrice": 679.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/AMIAMO-1920x1080-Quad-Core-Processors-Lightweight/dp/B0CQLWJMSC",
        "soldBy": {
            "sellerID": "A4GGO47QNC6I0",
            "name": "AMIAMO Direct Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A4GGO47QNC6I0&asin=B0CQLWJMSC&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTZDGQX2"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $300 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ifWr55J L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/5183EbJXYOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51sBwA62OnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515pXmo1SbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tZsts7ZqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41uJucJI5-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pR4E mcTL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: AMIAMO",
            "link": "https://www.amazon.com/AMIAMO/b/ref=bl_dp_s_web_115929913011?ie=UTF8&node=115929913011&field-lbr_brands_browse-bin=AMIAMO"
        },
        "brand": "AMIAMO",
        "merchantInfo": "AMIAMO Direct Store",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 15,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Wednesday, February 14. Order within 15 hrs 38 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Immersive 15.6-Inch Full HD Display:Immerse yourself in stunning visuals on our expansive 15.6-inch Full HD display. Whether you're binge-watching your favorite shows, editing photos, or working on intricate designs, the vibrant colors and sharp details bring every moment to life. Elevate your viewing experience with a screen that captivates and inspires.",
            "Unrivaled Performance in a Portable Package:Elevate your computing experience with our high-performance laptop featuring the Intel N5095 quad-core processor. Designed to handle demanding tasks with ease, this powerhouse delivers exceptional speed and responsiveness. Whether you're multitasking, gaming, or creating content, the N5095 processor ensures a seamless and efficient performance that meets your every need.",
            "Slim Elegance, Limitless Mobility:Experience the epitome of sleek design and boundless portability with our laptop, measuring a mere 2cm in thickness and weighing just 1.65kg. Unveil a new era of elegance as you effortlessly carry this slim marvel wherever your day takes you. Make a statement with a device that perfectly blends style with functionality.",
            "Seamless Connectivity, Enduring Power:Stay connected and powered up with our high-speed laptop, boasting a remarkable 6-hour battery life. Equipped with a versatile Type C port, USB 3.0, a 3.5mm headphone jack, and TF card slots, this device ensures you're ready for anything. Experience the convenience of swift connectivity and extended productivity in one sleek package.",
            "Peace of Mind with a ONE-Year Limited Warranty:We stand behind the quality of our product with confidence, offering a one-year limited warranty for your peace of mind. Experience the reliability and durability of a device that's backed by a commitment to customer satisfaction. Buy with confidence, knowing that your investment is protected for an entire year."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computers & Tablets",
                "link": "https://www.amazon.com/Computers-Tablets/b?ie=UTF8&node=13896617011"
            },
            {
                "name": "Laptops",
                "link": "https://www.amazon.com/Notebooks-Laptop-Computers/b?ie=UTF8&node=565108"
            },
            {
                "name": "Traditional Laptops",
                "link": "https://www.amazon.com/Traditional-Laptop-Computers/b?ie=UTF8&node=13896615011"
            }
        ],
        "productInformation": [
            {
                "name": "Standing screen display size",
                "value": "‎15.6 Inches"
            },
            {
                "name": "Screen Resolution",
                "value": "‎1920 x 1080 pixels"
            },
            {
                "name": "Max Screen Resolution",
                "value": "‎1920 x 1080 Pixels"
            },
            {
                "name": "Processor",
                "value": "‎2.9 GHz celeron"
            },
            {
                "name": "RAM",
                "value": "‎DDR4"
            },
            {
                "name": "Hard Drive",
                "value": "‎512 GB SSD"
            },
            {
                "name": "Graphics Coprocessor",
                "value": "‎Intel"
            },
            {
                "name": "Chipset Brand",
                "value": "‎Intel"
            },
            {
                "name": "Card Description",
                "value": "‎Integrated"
            },
            {
                "name": "Number of USB 3.0 Ports",
                "value": "‎2"
            },
            {
                "name": "Average Battery Life (in hours)",
                "value": "‎5 Hours"
            },
            {
                "name": "Brand",
                "value": "AMIAMO"
            },
            {
                "name": "Series",
                "value": "‎AM1512"
            },
            {
                "name": "Item model number",
                "value": "‎AM1512"
            },
            {
                "name": "Operating System",
                "value": "11"
            },
            {
                "name": "Item Weight",
                "value": "‎5.02 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎13.98 x 8.98 x 0.79 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎13.98 x 8.98 x 0.79 inches"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Processor Brand",
                "value": "‎Intel"
            },
            {
                "name": "Number of Processors",
                "value": "‎4"
            },
            {
                "name": "Computer Memory Type",
                "value": "‎DDR4 SDRAM"
            },
            {
                "name": "Flash Memory Size",
                "value": "‎512 GB"
            },
            {
                "name": "Hard Drive Interface",
                "value": "‎USB 3.0"
            },
            {
                "name": "Optical Drive Type",
                "value": "‎No Optical Drive"
            },
            {
                "name": "Batteries",
                "value": "‎1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "ASIN",
                "value": "B0CQLWJMSC"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 15 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,328 in Computers & Accessories (See Top 100 in Computers & Accessories) #1,108 in Traditional Laptop Computers"
            },
            {
                "name": "Date First Available",
                "value": "November 21, 2023"
            },
            {
                "name": "Model Name",
                "value": "AM1512"
            },
            {
                "name": "Screen Size",
                "value": "15.6 Inches"
            },
            {
                "name": "Hard Disk Size",
                "value": "512 GB"
            },
            {
                "name": "CPU Model",
                "value": "Celeron"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "16 GB"
            },
            {
                "name": "Special Feature",
                "value": "Numeric Keypad"
            },
            {
                "name": "Graphics Card Description",
                "value": "Integrated"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/463a27a8-eedd-49ff-9749-0aebbd5a6022.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f8ea56d3-5320-4faf-a3e1-94025d2fa3eb.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/85f6fe5b-e1b6-497b-be30-0ce94bbf113f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6688c76-9e5a-4b25-98d1-8cf557af2326.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/159fd854-6ead-4e25-9a5a-f096c84fce05.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ff68959e-d63e-4860-8105-8d12670def62.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "RedXepher82RedXepher82",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6RFVIK2MSSR3PQTKQKAVK4HNRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OBI54I8MXYSZ?ASIN=B0CQLWJMSC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Laptop runs decently. Specs are pretty high for low end. bottle neck is the processor.",
                "reviewText": "The media could not be loaded. First thing I will say is that I did not attempt to open or upgrade the device. There is a slot on the bottom that you can unscrew and open but I am not entirely sure what is under the flap. Regardless, the current specifications on this laptop is really nice. The only thing I would say you would want to upgrade but cannot is the processor for sure. This does not do well during gaming. I was barely able to run minecraft on this and it was already low framerate and causing the laptop to really heat up. The laptop is just a 15.6 which is pretty standard nowadays. It is is bit thicker than ultrabooks and does not feel as solid as the ultrabook. The framing feels a bit on the cheaper side which makes me worried about what could happen to it if you drop it by accident. The material is pretty easy to get scratched up so expect it to get scratched if you put it in your bag. The device casing does make it relatively light weight. It does run on a a quad core celeron processor which is on the lower end but does a decent job with basic use. I do like that the ram is 12 gb rather than your standard 8 gb for most other lower end laptops. I am not sure why they just stuck with 12 GB but it is more than enough for what most users need I feel. I am able to handle most multitasking on this device. It can be a good day to day laptop. The battery life on this is okay. On a stress run it was able to last at most five hours on a full charge. The cooling system is not too noisy on low usage but it can be pretty loud if you happen to game a bit with this and push the processor. The vents can be clogged pretty easily as well. It is a bit hard to clean out so be aware of this if you happen to live in a pet home so be aware of that. I am not a fan of the charger as the plug is a thin round plug which can be a bit hard to replace in the future. It does have the power brick is on the end so it does take up the good amount of space if you happen to plug into a surge protector. Be aware that the power brick can get a bit warm during charging so do not put it under anything that retains heat like a blanket. When I booted up of the laptop, the laptop boots up within 15 seconds. It has a big 512 GB SSD which is pretty surprising considering the laptop price. I was expecting it only to have 256 gb. Based on the size, I am assuming it is an m2 drive but I am unsure what is the actual drive. I would say it is definitely not a 2.5 SSD. It has the standard setup for windows 11 and is pretty straight forward. There was not too bloatware. The laptop has max resolution at 1920 x 1080. This is a pretty standard laptop screen size. The screen brightness could be better but it is not terrible. It does not strain my eyes when I use it. I do like that it gives you two 3.0 USB port so you are not stuck with needing to buy an adapter to get more ports. There is also a type c (non thunderbolt) port but I wish it was the charging port to save on space and allow for docks to be used. The laptop can be pushed back for better viewing but it cannot be pushed back all the way. The hinges okay okay. I do not re but I feel like it could break pretty easily if you push it to far back. The wrist rest looks nice with the dark silver, I found it tends to fade over time. As for the keys, they are okay. The keys do feel a bit cheap but they are okay and will work as intended but I am unsure if the keys will fade over time. I could be easy to pop the keys off so be careful. The external casing of this surface is very easy to scratch (seems to be an issue with all this material) so I would recommend that you get a laptop case for it. It is sealed inside a nice bag. The trackpad runs pretty well, It is sensitive and feels smooth to move across. It also does not look like it will wear down easily which is good. There is a camera that will record at at least 720p but the camera feels like it is using the ipad 4 back camera. The microphone is okay but you can hear a bit of choppiness to voice. It does pick up some surrounding noise. It does have 3.5 port to plug in headphones and microphone device. Depending on how much you have open and how much you utilize the laptop capability, you could actually make this laptop last longer. The speaker system okay. Even at max it is not super loud and does not have any feedback from what I can tell. Again this is not a gaming laptop as it does not have a powerful card that allows you to game very well on this computer. The processor speed is decent and it works really well for say school work. There is an HDMI port so you are able to connect this to an external screen. I am unsure if there is a dock that is meant for this laptop. Overall this laptop does give you better specifications than other laptops. You get the same screen as other laptops. It runs pretty decent but it can run warm. Please make sure the vents are kept clear to optimize cooling The battery life is not bad on day to day use. It will last a college student most of the day. The specification is not bad at 12 GB ram and 512 gb SSD drive. The space is more than enough for what a student may need. You are also able to have multiscreen screen if you use type c. You can use an adapter for an additional screen but honestly I am not sure it will be well supported. I am not sure there is a dock that will work for it. I wish the laptop charger was type c and not the flimsy circular plug.",
                "reviewVotes": "41 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61PMrYWcg8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711RD7qW4FL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71bBWHITcGL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71uEel+KAcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71w4rcZzDSL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f9d84b36-98bb-419a-b8d0-719757cff733/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "CESARCESAR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5TNAK2SGYLN5XMCHYHQJSWR25Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2336R0HAC7WDX?ASIN=B0CQLWJMSC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent option",
                "reviewText": "The media could not be loaded. If you want a high-performance laptop with a design that checks all the right boxes, this is excellent option.First things first, that latest Celeron N505 processor is more than just decent, it’s pretty awesome. With a base clock speed of 2.9 Ghz, this thing can handle whatever you throw at it – 12GB RAM + 512GB ROM.Now, let's talk about the display – 1920*1080 high resolution screen on 15.6 inch display! Generously sized with good screen quality. Plus, the enhanced eye protection feature helps eye strain after prolonged use.Oh, and the keyboard! As someone with long fingers, typing on smaller keyboards has always been a struggle. But this laptop has large keyboard with optimal key spacing- no accidental keystrokes and total comfort. Keys make a light click, not loud just buttery soft. Also, the laptop is sorta lightweight (1.48KG) with ultra-thin case.This is a laptop worth every penny. Love it!",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71k9FV1EmLL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dd8a092d-00b0-4ca7-8b11-1a434f9016cc/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Daisy catDaisy cat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVQR7U4PJ7VTG36DQMRSIHK7O6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QEINJT7RRLAN?ASIN=B0CQLWJMSC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Solid value, great for basic tasks.",
                "reviewText": "This laptop truly shines in terms of value with its price point. While laptops often come with hefty price tags, this specific model does a great job in delivering exceptional quality without compromising on affordability. It comes with a 15.6-inch display which is bigger than many screens and provides a comfortable viewing experience, whether you're working, tackling school assignments, or simply browsing the web, it's a great laptop that can handle most tasks, even some light gaming.. Additionally, it comes pre-installed with Windows 11, so you don't have to worry about buying an operating system.The keyboard offers a comfortable typing experience, and the touchpad enables effortless navigation. The keypad on the laptop is also a nice feature, most smaller models do not include this, so it's a great choice if you do any work (personal or professional) that requires a lot of number entry.With a generous 512GB SSD hard drive, most users will find it to be plenty of storage capacity. The SSD drive provides quick performance, resulting in quick program launches and seamless browsing experiences. Booting up the computr and loading programs happen without noticeable delay.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51VIgOL4mjL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51iIl1IqUwL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Y69Bn8XnL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71yKLqYI-ZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenda mund",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTK5YK2SWB4SMALBL5OLKJ54XMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FX52I2328YX6?ASIN=B0CQLWJMSC",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "1.0 out of 5 stars Not working spots all over the screen",
                "reviewText": "The media could not be loaded. Won’t let me set up or take my Internet and use our spots all over the screen",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a6479d6a-8cd1-47d8-b72c-38ad18634350/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Jymme Kennon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRSCIIZ3U332E5VVULVOLK2TBSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDPGZRPJQGCDN?ASIN=B0CQLWJMSC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Loving this laptop",
                "reviewText": "This laptop is lightweight and very fast. The keys are easy to press and the keys are not super small so that is very helpful. I like that this laptop has the number keys on the side as well. The mouse works great. The additional USB ports on the sides are helpful. Setup was a breeze. If you are looking for a new laptop, you will not regret this purchase!",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie CampbellStephanie Campbell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELBBGGLPBVUIMKOWTO5NDNSEX4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QUIYM13XNIO2?ASIN=B0CQLWJMSC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 17, 2023",
                "reviewTitle": "5.0 out of 5 stars More than I expected.",
                "reviewText": "This computer is perfect for my needs. Zoom, emails, youtube,Netflix. Whatever it is you can do it on here. The screen is way bigger than expected. Like a mini TV.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71C70D7ZCHL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "#1",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVQZLLNZBFIZ54T3HZPNHB475LQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GLD5QFPZ3T40?ASIN=B0CQLWJMSC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars good price, delivered safe, works good",
                "reviewText": "does what is expected.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ParbhuParbhu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2ZHHL4GXDDMDJPCF3X3Z73A2BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OHUGB0JP2KBD?ASIN=B0CQLWJMSC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Not bad",
                "reviewText": "Its a nice budget laptop, it does the job and the specs are not pretty good. Will be giving my niece this laptop as she is starting school soon.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81NmFUq4JAL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}