{
    "remaining_requests": 49220,
    "original_status": 301,
    "pc_status": 200,
    "url": "https://www.amazon.com/RAD-Cycle-Products-Trainer/dp/B0CV4DVCNX",
    "body": {
        "name": "RAD Cycle Products Adjustable Bike Trainer Fitness Desk Portable Workstation Standing Desk",
        "price": "$129.95 ($0.18 / oz)",
        "originalPrice": "$139.95",
        "rawPrice": 129.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/RAD-Cycle-Products-Trainer/dp/B0CV4DVCNX",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CV4DVCNX"
        ],
        "asinVariationValues": [
            {
                "asin": "B07BQZY9RL",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$129.95",
                "variationImageURL": "https://m.media-amazon.com/images/I/41eG-BHcGBL._SS36_.jpg"
            },
            {
                "asin": "B0CV45PD5G",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$131.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31QxDrcbH8L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41eG-BHcGBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/410rL9gpkZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VhS2z3c4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KadKlCvLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/510 IRZ7I-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31KQaVf-p1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/318p fmx3XL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the RAD Cycle Products Store",
            "link": "https://www.amazon.com/stores/RADSportz/page/301EE9D1-D9FB-4BB1-8204-DCD8431EC13F?ref_=ast_bln"
        },
        "brand": "RADSportz",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2112,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 15 hrs 16 mins",
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 15 hrs 16 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "►ADJUSTABLE HEIGHT: Quickly raise and lower the tabletop from 33.5\" to 47\"",
            "►PORTABLE: Locking casters allow for secure positioning, and moving from the workout to the office.",
            "►NON-SLIP SURFACE: The desktop features a non-slip surface that features built in tablet and smart phone slots",
            "►VERSATILE: The tabletop includes holes for cable management",
            "►DURABLE: The steel construction of the frame will ensure that the RAD Cycle Products Adjustable Bike Trainer Fitness Desk Portable Workstation will hold up to years of use."
        ],
        "description": "The RAD Cycle Products Adjustable Bike Trainer Fitness Desk Portable Workstation will keep you on task with plenty of room to fit over a bike and use it as a fitness desk to keep your notebook or laptop, tablet or touchpads, smart phone and healthy drinks close at hand as you pedal on your indoor bike trainer. To keep your electronics from sliding around we have integrated a non-slip surface to keep your work, or entertainment safely in place. And not only is the RAD Cycle Products Portable Work Station handy during workouts, when the routine is over you can easily roll it into the office to be used as a convenient standing desk. With it's sturdy steel construction, the RAD Portable Fitness Desk is adjustable from 33.5 inches all the way up to 47 inches, and rolls on durable locking casters. Easy to assemble, this handy desk makes multi tasking a breeze. Time is money, and the RAD Cycle Products Adjustable Bike Trainer Fitness Desk Portable Workstation is money well spent.Make cycle fitness training productive and fun with the RAD Cycle Products Adjustable Bike Trainer Fitness Desk Portable Workstation. With a laptop or tablet, watch your favorite motovational videos or cycling apps while you put your bike trainer through it's paces. Then easily roll it into the office and use it as a standing desk. Why pay hundreds more for a seperate standing desk when you have the RAD Cycle Products Adjustable Bike Trainer Fitness Desk Portable Workstation?There is plenty of room to work on the 14\" x 28\" top, and two cup holders, so there is plenty of room to work and hydrate. Also for your convenience we have strategically molded two handles into the top to make moving the desk effortless.Featured on the dektop are two cup or bottle holders, slots for tablets, pads or smart phone as-well-as cord andcable management.Secure the desk in place with the convenient locking casters.Easy to assemble steel frame construction.Raise and lower the desktop from 33.5\" to 47\" and back again with two push buttons located on the table surface.ADJUSTABLE HEIGHT: Quickly raise and lower the tabletop from 33.5\" to 47\"PORTABLE: Locking casters allow for secure positioning, and moving from the workout to the office.NON-SLIP SURFACE: The desktop features a non-slip surfacethat features built in tablet and smart phone slotsVERSATILE: The tabletop includes holes for cable managementDURABLE: The steel construction of the frame will ensure that the RAD Cycle Products Adjustable Bike Trainer Fitness Desk Portable Workstation will hold up to years of use.",
        "breadCrumbs": [
            {
                "name": "Sports & Outdoors",
                "link": "https://www.amazon.com/sports-outdoors/b?ie=UTF8&node=3375251"
            },
            {
                "name": "Sports",
                "link": "https://www.amazon.com/Sports-Fitness/b?ie=UTF8&node=10971181011"
            },
            {
                "name": "Cycling",
                "link": "https://www.amazon.com/Cycling-Wheel-Sports-Outdoors/b?ie=UTF8&node=3403201"
            },
            {
                "name": "Bike Trainers & Accessories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=6389526011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "27.75 x 25 x 47 inches"
            },
            {
                "name": "Item Weight",
                "value": "12.7 Kilograms"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "Trademark GLB"
            },
            {
                "name": "ASIN",
                "value": "B07BQZY9RL"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "83-DT5086"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,112 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,546 in Sports & Outdoors (See Top 100 in Sports & Outdoors) #5 in Bike Trainers & Accessories"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Material",
                "value": "Alloy Steel"
            },
            {
                "name": "Brand",
                "value": "RAD Cycle Products"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "27.75 x 25 x 47 inches"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Adjustable Height Standing Desk with Wheels Easily stand, bike, or jog while you work or stream workout videos with the Exercise Desk by RAD Sportz. Featuring locking caster wheels, a smart worksurface with functional built-ins, and an adjustable height, this fitness desk is the perfect way to take your workout to the next level. Use this bike stand to keep up with your cycling training during the off-season for to incorporate exercise into your workday.",
                "media_link": []
            },
            {
                "media_text": "Adjustable Height Standing Desk with Wheels Easily stand, bike, or jog while you work or stream workout videos with the Exercise Desk by RAD Sportz. Featuring locking caster wheels, a smart worksurface with functional built-ins, and an adjustable height, this fitness desk is the perfect way to take your workout to the next level. Use this bike stand to keep up with your cycling training during the off-season for to incorporate exercise into your workday.",
                "media_link": []
            },
            {
                "media_text": "Smart Work Surface The top of the bike desk workstation features integrated handles, a non-slip work surface, 2 cupholders, and a slot for your tablet or smartphone.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ae0295ca-940e-4797-869f-a63ff4bf5ee7.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Locking Caster Wheels This stand up desk features locking wheels that make it easy to secure in place during your workout, then move around your home office or gym when you’re done.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/cadf556e-9a7f-4996-bec5-f6e5096aa932.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Adjustable Height The height of this mobile standing desk can be raised from 33.5 to 47-inches-tall with the push of a button, to create the perfect worksurface for any activity.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f2e8b4ea-3b59-4ed0-9441-79856bb8e36c.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/a3153cd8-e2a1-4e8f-90b6-1986d5e17b09.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ae0295ca-940e-4797-869f-a63ff4bf5ee7.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cadf556e-9a7f-4996-bec5-f6e5096aa932.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f2e8b4ea-3b59-4ed0-9441-79856bb8e36c.__CR0,0,300,300_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "E. MusteeE. Mustee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESOMUXOOHQJ5D6BV4LG7WQXPYOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QE9U1YPJ1686?ASIN=B07BQZY9RL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 7, 2020",
                "reviewTitle": "5.0 out of 5 stars Nice desk overall, makes pc gaming much more fun! [Review at ~4 days]",
                "reviewText": "I recently bought a trainer (wahoo Kickr Core) and had the idea of trying to play a few PC games while indoor cycling (spinning?), so I can be less lazy. I already had previous success with my Nintendo Switch (detached joycons make this easy), so I decided to give this a shot. This desk fits my small wireless keyboard and mouse pretty comfortably, is easy to use, and feels pretty sturdy. Plus room for all my other stuff (phones, water bottles, etc...)Assembly:Not bad, I have three left over nuts for some reason. Basically, assembly is just tightening a few nuts/bolts and this comes with the required tools. Was up in running in ~10-15 minutes.The worst part is the styrofoam used in the packaging, it's the cheap kind and there were large pieces that I had to break down to fit in the trash, and it created a mess of small particles all over my floor. Have a shop vac ready if you don't have a large trash can or otherwise plan on keeping the box around.Pros:- This really works, I can easily play PC games while cycling indoors. I tried out Halo: TMCC on PC (Reach co-op campaign w/ friend) and Minecraft, both were easily playable while my heart rate was ~150-160bpm. The desk is actually pretty comfortable (no sharp edges/bad materials to lay arms on). Easily some of the funnest gaming sessions I've had. - Cycling provides a lot of additional enjoyment to my games, this desk helps deliver that experience. - I wouldn't try this for any competitive gaming, just cooperative stuff on easier difficulties :S- Easy to raise/lower height. You can use this as a normal desk without a bike as well, it's just a little high at the lowest setting (raise your seat/use a bar stool). - You can also easily use this as a standing desk, I'm reasonably tall and this scales up to my standing level easily. I am currently typing this review while standing.- Cupholders! They fit my cycling bottles (that usually fit into the cages) perfectly- Stands for your devices: it easily fits my iPad Pro 12.9\", which is a pretty hefty tablet. There appears to be holes for some cable management as well.- I like the grippy materials on the surface of the desk, they make things sliding around less likely. If you plan to use a mouse, you will need a mousepad.- Seems like good value compared to the Wahoo desk, but tbh I never tried that one.Cons:- Bumping into the desk may knock a few things onto the ground if they aren't secured (computer mice). Just be careful if you're using this in a tight space like me.- The stryofoam. Ugh.- My USB-C cables wouldn't fit through the holes as the plastic surrounding the connector was too large, but my lightning cables do. Should be fixable with a dremel/drill if you are brave?Conclusion:Good value and versatile (usable while standing/sitting/spinning). None of the cons above are enough to detract a star IMO. I have only had the desk for ~4 days, and will update the review in case anything goes wrong (I plan on using it aggressively), but so far so good! I can see myself using this desk every day, and have so far.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61f7T6hlExL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonathan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGG5VLNWKOC7RCUWO5KBOVRGJTKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32B008DRGAUJ6?ASIN=B07BQZY9RL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome great value trainer desk",
                "reviewText": "works amazingly well, great quality desk for less than 1/2 of what the wahoo desk costs, easy assembly",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3YRR2FPRYQGGG4BDNJURPX47XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ONTREOQ2D8YK?ASIN=B07BQZY9RL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect to use with my Wahoo Core training cycle",
                "reviewText": "Easy to assemble, sturdy, plenty of room on platform for laptop or tablet plus phone and even a book if you want all at once. Water bottle holders on 2 sides. Adjustable up and down to suit your needs and the locking casters operate smoothly then lock in place. Great purchase for my purpose and an excellent price. If you wanted to use this as a portable, adjustable workstation it would work for that as well.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Qxt-gu3xL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71u0WEF3OSL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "smallmadness",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5HCZTSHFLX3X4KO7LXIAWOT22A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IYPWYVXTK3T8?ASIN=B07BQZY9RL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2022",
                "reviewTitle": "4.0 out of 5 stars Get wheel chocks",
                "reviewText": "Good: arrived quickly, came together easily (I'm am emphatically NOT mechanically inclined, so believe me when I say that if folks had a difficult time putting it together, that's almost assuredly user-error, no offence to them!). Sturdy! Works exactly as intended.Needs Improvement: the three-wheel (caster?) design is NOT super stable. Despite the wheel locks, if you use this, as I do so you can do work while you ride a smart bike (awesome), the entire desk will slide all over, which is annoying. There is nothing to be done about the wheel position (a tablet screen got smashed after it fell off this desk because the desk itself is so easy to tip. Since I hadn't put the protective cover back on the tablet, I won't blame the desk, but the tippiness is a factor to be aware of). A wheel (caster) at each corner would make this much more stable, so hopefully this manufacturer considers that and adds a 4th wheel to future iterations of this product.As for the wheels themselves, we got wheel chocks at the ye local hardware shoppe and voila! Desk sliding up as I ride is no longer an issue!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex SpadaforaAlex Spadafora",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGS4PDXO3RHFULIVOMOMAEABOTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GCHEWILAA986?ASIN=B07BQZY9RL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Really well built.",
                "reviewText": "Really well but. Good product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71BrPS743ZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "M SmithM Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCJF56NY2QDKHLZ65APMVJQBT4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLMWDRKU16FW?ASIN=B07BQZY9RL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2022",
                "reviewTitle": "5.0 out of 5 stars GREAT DESK for indoor training",
                "reviewText": "This is a GREAT substitute for the Wahoo desk. I was a little worried by some of the other reviews but thought I would take a chance. Needless to say, I won't be returning this. Here is why I gave it 5 stars:1. It is easy to assemble and the tools needed were included included.2. It is a quality product. From the steel base to the arms to the tray, it is solid.3. Good value. I haven't tried the Wahoo version but this does everything I need for one third the price.4. Features....the desk pad is soft and grippy, height is easily adjustable, 2 cup holders, tablet/phone stands, wheels lock",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/713b+6crMyL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7154qTQCufL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/716vD7pIHKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71L4DbsVc1L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71PaCZHCXFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71RK2475xRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71bkuOA6UcL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENQYAB6NNKA3OYLPG4MARHGKVTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAW0E0M29O5YR?ASIN=B07BQZY9RL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent table",
                "reviewText": "Awesome product. Exact same as the brand name, just cheaper",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandro Verastegui ruiz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 5, 2023",
                "reviewTitle": "Excelente calidad precio",
                "reviewText": "Muy buena calidad, me hubiera gustado que se doblara más ya que ocupa mucho espacio pero en general esta excelente!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Uomo Italiano",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 14, 2020",
                "reviewTitle": "Adjustable Cycling Training Table by RAD - Fantastic Product, Well Worth Price",
                "reviewText": "This table is perfect for indoor cycling training when using a smart trainer. It's height can be adjusted in seconds, so you can easily access the perfect height whether using different bikes or using a laptop, tablet, etc. Also, the wheels are a great feature since you can easily move the table while riding. Before I used the table I had thought that it was useless having the wheels, but during my first ride I immediately realized how useful they are. As you make adjustments in the saddle or change hand position on the handlebars, you can easily move the table back and forth to be at the right distance from your laptop or tablet. I think someone mentioned that this table is an imitation of the name brand, but it's still a very sturdy table and looks great. I bought this table from Amazon Warehouse and I suspect it was a return. This was an added bonus because I got a discount and the table came out of the box looking brand new. BTW, easy to assemble, took me about 10 -15 minutes moving at a snail's pace.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 21, 2021",
                "reviewTitle": "A 'Pain Cave' Mandatory Tool",
                "reviewText": "Got the bike smart trainer and spent all the bucks, don't buy another workstation - this is perfect! Top quality, half the branded price, excellent holders for ipad etc, non-slip top for bluetooth speaker etc, drink holders could be a bit deeper, but not a criticism. So easy to just walk in, get on the bike and get going. Very highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jimmy Ang",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on November 6, 2021",
                "reviewTitle": "Nice add on for home spinning",
                "reviewText": "A mnice and essential add on to home spinning set up.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Woodhead",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 14, 2024",
                "reviewTitle": "Cycling table",
                "reviewText": "It’s excellent!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}