{
    "remaining_requests": 20226,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Vanity-Fair-Everyday-400-Count/dp/B004E94O32",
    "body": {
        "name": "Vanity Fair Everyday, 400 Count",
        "price": "$20.48",
        "originalPrice": "$21.90",
        "rawPrice": 20.48,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Vanity-Fair-Everyday-400-Count/dp/B004E94O32",
        "soldBy": {
            "sellerID": "A2U1NK4W0SSDL",
            "name": "WHG Solutions",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2U1NK4W0SSDL&asin=B004E94O32&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07GTT17YL"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41IHoicGwEL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ldXBY6RLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tzOXMVuFL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Vanity Fair Store",
            "link": "https://www.amazon.com/stores/VanityFair%C2%AE/page/9429E2AD-EAC3-4041-A511-90F50DDDF8FA?ref_=ast_bln"
        },
        "brand": "VanityFair®",
        "merchantInfo": "J8 INDUSTRIES",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 3978,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20.",
            "Or fastest delivery Tomorrow, February 16. Order within 9 hrs 32 mins.",
            "FREE delivery February 23 - 27.",
            "Or fastest delivery February 22 - 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "2-Ply",
            "Paper Napkins",
            "Georgia Pacific"
        ],
        "description": "Add a Timeless Touch to any Meal The maker of Vanity Fair offers a variety of disposable items that add a special touch to any meal occasion. For Everyday or EntertainingSoft and strong, with a cloth-like texture, Vanity Fair premium paper napkins add a special touch to any meal or moment. From breakfast to dinner and every meal in between, our two-ply everyday napkins are just the right size. When entertaining guests, our three-ply Impressions dinner napkins are 50% larger than our everyday napkin. So, they're perfect for entertaining. No matter the moment, Vanity Fair can make it a little more special. Disposables that Dazzle Our collection of fine paper plates and bowls are brilliantly white, beautifully embossed and remarkably strong. Vanity Fair disposable dishware is perfect for everyday or entertaining. And because our elegant disposable dishware is soak-proof, they're the perfect dish for any meal or occasion. Everyday Ideas Everybody loves a good time and with these nifty tips you'll be sure to impress family and friends alike. Looking for something to do tonight. What about a prime-time dinner party that everyone will be talking about for weeks to come? We've got you covered.Post-exercise BrunchAh, exercise. It's tough to get moving but it's easier when there's a delicious, healthy meal to come home to. Get your family members together for a walk or a bike ride, then come home to a heart-warming and heart-healthy meal.Game NightTake the kids' digital devices away and get your board game on. Make the meal simple by grabbing Chinese takeout or pizza and let the games begin.Cinco de my HouseFor busy families, any meal together is reason to celebrate. Why not celebrate the fifth of any month with a Mexican food fiesta. Creating a smorgasbord of tasty south-of-the-border treats is always quick and simple.Breakfast at NightThe kitchen is the center of your home, so get the kids and get started on this simple and delicious meal. After all, waffles, pancakes and French toast taste great any time of day.Family FirstLooking to try something new? Before you serve it to dinner guests, practice on your family. You'll get to enjoy a family dinner together and get some opinions from your toughest critics.Teach Table SettingGet some inexpensive placemats and draw the outline of a fork, knife, spoon and napkin with a waterproof marker. It's a great way to teach your kids how to set the table.Game DayFor the kids' next soccer match, open up your playbook of good times and throw a tailgate party. Chips, dips, finger foods, sandwiches and Vanity Fair napkins. It's sure to be a winner.Entertaining IdeasWhether big or small, get-togethers are a time to celebrate with good times and good friends. And here's a few simple, yet sophisticated ideas to elevate the occasion even more.Summer Drink PartyStart with a signature drink. Serve them on a glass-top table with lights below to showcase your summer style and line your bar with Vanity Fair beverage napkins to keep slips and drips to a minimum. Don't forget to have some homemade iced tea or freshly squeezed lemonade on hand.Around the World Someday you'll take all your friends to Paris. While you're saving up, invite some of your most adventurous friends over and take them on a one-day fantasy trip with photos, a French film, language tapes, and perhaps, a quiche.Anniversary 101This anniversary, take your sweetie back to where the two of you began. Return to the place you met, recreate your first date, or do dinner and dancing to summon up where you spent your honeymoon.Day at the BeachBring the beach to your own backyard. Put on your flip flops, break out the suntan lotion and sip fruity drinks. Create a signature \"mock-tail\" for the under-21 crowd. You are never more than a few steps away from your own private beach – bring your own sandbox and kiddie pool to complete the scene.Tea TimePut a new twist on an English classic and take your next tea party to Russia. Make the brew strong, serve into delicate glasses from a pretty silver samovar, and offer elegant little cakes and candies on Vanity Fair napkins.A Hint of GlamShow off the china, get out the crystal and add a little sparkle to your party. It's all about glam, so dust off the china and don't forget the always-so-classic Vanity Fair napkins.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Paper & Plastic",
                "link": "https://www.amazon.com/Paper-Plastic-Household-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15342841"
            },
            {
                "name": "Disposable Napkins",
                "link": "https://www.amazon.com/Paper-Napkins/b/ref=dp_bc_aui_C_4?ie=UTF8&node=15347411"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 13 x 6 x 7 inches; 3.09 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 35926"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ November 24, 2010"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Vanity Fair"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B004E94O32"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#30,484 in Health & Household (See Top 100 in Health & Household) #76 in Disposable Napkins"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 3,978 ratings"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Size",
                "value": "400 Count (Pack of 1)"
            },
            {
                "name": "Material",
                "value": "Paper"
            },
            {
                "name": "Brand",
                "value": "Vanity Fair"
            },
            {
                "name": "Ply Rating",
                "value": "2-Ply"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "For everyday or entertaining. Soft and strong, with a cloth-like texture, Vanity Fair premium paper napkins add a special touch to any meal or moment. From breakfast to dinner and every meal in between, our two-ply Everyday napkins are just the right size. When entertaining guests, our three-ply Entertain dinner napkins are 50% larger than our Everyday napkin. So, they're perfect for entertaining. No matter the moment, Vanity Fair can make it a little more special.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/dbec14ed-4da3-406a-9da1-03afddeca238._CR0,0,480,480_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Everyday Ideas Everybody loves a good time and with these nifty tips you'll be sure to impress family and friends alike. Looking for something to do tonight. What about a prime-time dinner party that everyone will be talking about for weeks to come? We've got you covered. Post-exercise brunch Ah, exercise. It's tough to get moving but it's easier when there's a delicious, healthy meal to come home to. Get your family members together for a walk or a bike ride, then come home to a heart-warming and heart-healthy meal. Game night Take the kids' digital devices away and get your board game on. Make the meal simple by grabbing Chinese takeout or pizza and let the games begin. Game day For the kids' next soccer match, open up your playbook of good times and throw a tailgate party. Chips, dips, finger foods, sandwiches and Vanity Fair napkins. It's sure to be a winner.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/79f5c0fb-e122-4227-ad1e-2ea1137efebe._CR0,0,2000,2000_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Entertaining Ideas Whether big or small, get-togethers are a time to celebrate with good times and good friends. And here's a few simple, yet sophisticated ideas to elevate the occasion even more. Summer drink party Start with a signature drink. Serve them on a glass-top table with lights below to showcase your summer style and line your bar with Vanity Fair beverage napkins to keep slips and drips to a minimum. Don't forget to have some homemade iced tea or freshly squeezed lemonade on hand. Around the world Someday you'll take all your friends to Paris. While you're saving up, invite some of your most adventurous friends over and take them on a one-day fantasy trip with photos, a French film, language tapes, and perhaps, a quiche. A hint of glam Show off the china, get out the crystal and add a little sparkle to your party. It's all about glam, so dust off the china and don't forget the always-so-classic Vanity Fair napkins.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ce75c9cd-aaef-4a8d-9a21-b21f1c353d0d._CR0,0,1000,1000_PT0_SX300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/23c09269-c8c0-414a-ad38-e492c24debe2._CR0,25,1350,418_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dbec14ed-4da3-406a-9da1-03afddeca238._CR0,0,480,480_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/79f5c0fb-e122-4227-ad1e-2ea1137efebe._CR0,0,2000,2000_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ce75c9cd-aaef-4a8d-9a21-b21f1c353d0d._CR0,0,1000,1000_PT0_SX300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kayla",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDN27X65HAPFZK2GT3DX6BAM23Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PJR7GIZ79Z2X?ASIN=B004E94O32",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Durable, Soft, Pretty",
                "reviewText": "These napkins are my favorite. They are large in size, do not feel cheap, and they hold up with toddlers. For being a disposable, they are pretty, especially in comparison to other brands. These were the most affordable option as well. The 400 count comes in 4 separate packages of 100count each, which I really appreciate. It allows you to open a smaller quantity keeping the remaining fresh for later.We purchased for our toddlers' birthday party and have also used them for 2 more parties since then with enough left over for the next get together.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Constance T. Schulte",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVFWYYPUTV34I4YGQQO5G6TWI2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LCIGCVQE3RDC?ASIN=B004E94O32",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Great item",
                "reviewText": "Strong enough for messy faces yet soft as well. I use as tissue. They don’t fall apart like Bounty.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Love to shop",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AET76WSAMU5NAFN6XTEBGJGDXD3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WK09QY9BYWAL?ASIN=B004E94O32",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 25, 2016",
                "reviewTitle": "5.0 out of 5 stars Good everyday napkins",
                "reviewText": "Vanity Fair Everyday Napkins, 300 Count These napkins are very nice folded dinner napkins. I recently got married, and I actually used them for my wedding. They worked and held up fine for my special day. My wedding wasn't formal, but I still wanted a good napkin. I also use them for every day use. That's the great thing about them, they are functional in all situations. They look good enough for a special occasion, but are strong enough for regular days. They last a while because they are fairly thick and strong (especially compared to regular paper towels), so I don't need a ton of them for each meal. Usually one or two napkins will do even for messier foods. They have a nice cloth like texture, so they don't appear cheap if I have company, yet they are fairly economical to use. A package usually lasts me at least month. I am sure there are more sophisticated napkins on the market but for me and my family, we enjoy these napkins and will definitely purchase them again.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "H P Burstyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPXXQ2AFOTBTKE6GVARLCMUXFUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20S8L731XJEF4?ASIN=B004E94O32",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2023",
                "reviewTitle": "5.0 out of 5 stars They're paper napkins",
                "reviewText": "This is a classic brand of paper napkins. Inexpensive and reliable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan A Radtke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEADVCQOCXYBKSLH5XDGK5HFBSHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVQI0WJXIMALD?ASIN=B004E94O32",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Nice item",
                "reviewText": "Buy these napkins for work. Everyone seems to like them. They work well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tortuga",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEEVWZI2IDT3QU7RVORMSLBTYTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G0CA00IDHM86?ASIN=B004E94O32",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars We always use and love Vanity Fair!",
                "reviewText": "Very absorbent strong napkin",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Bell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDNVLAG7NK43SE6S54QDIUJHAWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDB23KCZ340UY?ASIN=B004E94O32",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Absorbs well, looks good for paper napkin",
                "reviewText": "We like this product for quality, looks, absorption. So glad we can conveniently order through Amazon",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GatorDO17",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUT2GCF5TIZDVYRT2IACBMJYSLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R352D14CP869YE?ASIN=B004E94O32",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 26, 2016",
                "reviewTitle": "5.0 out of 5 stars One Napkin Is Enough for an Entire Dinner of Chicken Wings!",
                "reviewText": "Vanity Fair napkins are by far my favorite napkins. They feel soft on your hands and face, yet are very thick and durable, and don't tear or crumble easily. They're larger than most other napkins I've seen, which allows them to last through even the messiest meals, as well as stay on your lap without falling on the floor like the smaller, flimsier napkins. They passed the ultimate test in my house: one napkin was enough to make it through an entire dinner of chicken wings without having to reach for a second napkin. :)These napkins are fairly pricey at my local stores (even Walmart) compared to other brands, so I was thrilled when I found them on Amazon recently on sale as a Prime Pantry item WITH a coupon!! I only bought one pack of the 300-count and am now kicking myself for not stocking up, although 300 napkins will last awhile in my house... I'll definitely be keeping an eye out for another deal on Amazon.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$15.49",
                "sellerName": "Baer Goods",
                "sellerRating": "4.5"
            },
            {
                "price": "$19.00",
                "sellerName": "A S G I",
                "sellerRating": "3.5"
            },
            {
                "price": "$19.97",
                "sellerName": "J8 INDUSTRIES",
                "sellerRating": "4"
            }
        ]
    }
}