{
    "remaining_requests": 20142,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Acrylic-Cocktail-Napkins-Holder-Modern/dp/B0CNQCVYDD",
    "body": {
        "name": "Acrylic Cocktail Napkins Holder Guest Clear Modern Design - Fancy Flat Counter Top Napkin Holder for Kitchen, Bathroom, Dinning Room Table – Flat Storage Tray Perfect for Disposable Paper Hand Towels",
        "price": "$16.96",
        "originalPrice": "",
        "rawPrice": 16.96,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Acrylic-Cocktail-Napkins-Holder-Modern/dp/B0CNQCVYDD",
        "soldBy": {
            "sellerID": "A3AOSMC0KPTB1U",
            "name": "Fete Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3AOSMC0KPTB1U&asin=B0CNQCVYDD&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41rz1uvgQWL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/418eBR7 VPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hu-WOfHLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QlobEXLsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gdOD4RLaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412einrgx L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51XEBupLr3L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Fete Store",
            "link": "https://www.amazon.com/stores/FETE/page/DC8E1102-8A9B-4EAC-B213-4CB0B383D8D4?ref_=ast_bln"
        },
        "brand": "FETE",
        "merchantInfo": "Fete Inc",
        "customerReview": "",
        "customerReviewCount": 0,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 16 hrs 52 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "ELEVATE YOUR TABLE SETTING: Introducing our acrylic cocktail napkins holder - a sleek, modern design that effortlessly combines functionality with style. This 5.8 x 5.8 x 2.8 inch clear napkin holder adds a touch of sophistication to your kitchen, bathroom, or dining room table. Elevate your entertaining game with this fancy flat counter top napkin holder that complements any decor.",
            "MODERN ACRYLIC ELEGANCE: Transform your space with the chic allure of our acrylic cocktail napkin holder. Crafted with precision, this acrylic napkin holder boasts a clear, contemporary design that seamlessly integrates into any setting. The perfect blend of form and function, it adds a dash of sophistication to your bar or dining area.",
            "ORGANIZE WITH STYLE: Experience the epitome of organization and style with our cocktail napkin holder for bar. Keep your cocktail napkins within easy reach, neatly arranged in this acrylic napkin holder. Its flat storage tray design not only maximizes space but also ensures your disposable paper hand towels are always accessible for your guests.",
            "VERSATILE AND PRACTICAL: These cocktail napkin holders are more than just a stylish accessory; they’re a versatile solution for your napkin storage needs. Ideal for both cocktail napkins and regular-sized napkin holders, this acrylic cocktail napkin holder is a versatile addition to your entertaining arsenal. Functional elegance meets practicality.",
            "FLAT NAPKIN HOLDER BRILLIANCE: Revolutionize your table setting with the acrylic napkin holder flat design. Embrace the contemporary aesthetic as this flat napkin holder for table becomes the focal point of your dining decor. Elevate your hosting experience with this acrylic cocktail napkin holder – where style meets functionality in a flawless blend."
        ],
        "description": "Elevate Your Space with Modern EleganceIntroducing our acrylic cocktail napkins holder – a clear modern design bringing sophistication to your home. This fancy flat counter-top napkin holder combines style and functionality, perfect for the kitchen, bathroom, or dining room table. The sleek acrylic napkin holder effortlessly enhances any setting with chic presence.Chic and Functional Bar AccentTransform your bar with our acrylic cocktail napkins holder – a clear statement piece modernizing your space. The flat storage tray, tailored for disposable paper hand towels, offers a convenient and elegant solution for your bar setup, catering to those who appreciate contemporary design and functional appeal.A Clear Blend of Style and OrganizationSeamlessly blending functionality with aesthetics, our acrylic cocktail napkins holder is a stylish accent for any occasion. The clear acrylic napkin holder presents disposable paper hand towels neatly, enhancing your space with its clear and modern design. Embrace the perfect fusion of form and function for a well-organized and stylish home.Sophistication for Every SettingDiscover sophistication with our acrylic cocktail napkins holder – a clear and modern addition suitable for various settings. Elevate your entertaining experience with this stylish napkin holder for tables, keeping disposable paper hand towels easily accessible and beautifully displayed. Add a touch of class to your space!Enhance your space with the acrylic cocktail napkins holder. Click add to cart now for modern elegance and functional style – a must-have for those who appreciate both form and function!",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Kitchen Utensils & Gadgets",
                "link": "https://www.amazon.com/tools-gadgets/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289754"
            },
            {
                "name": "Kitchen Accessories",
                "link": "https://www.amazon.com/Kitchen-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=16439891"
            },
            {
                "name": "Napkin Holders",
                "link": "https://www.amazon.com/Napkin-Holders/b/ref=dp_bc_aui_C_5?ie=UTF8&node=16439901"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "5.8 x 5.8 x 2.8 inches"
            },
            {
                "name": "Item Weight",
                "value": "15.2 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "Fete"
            },
            {
                "name": "ASIN",
                "value": "B0CNQCVYDD"
            },
            {
                "name": "Country of Origin",
                "value": "Switzerland"
            },
            {
                "name": "Item model number",
                "value": "F-CNH-5.8X5.8"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#39,019 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #96 in Napkin Holders"
            },
            {
                "name": "Date First Available",
                "value": "February 11, 2024"
            },
            {
                "name": "Color",
                "value": "Clear"
            },
            {
                "name": "Material",
                "value": "Acrylic"
            },
            {
                "name": "Brand",
                "value": "Fete"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [],
        "otherSellers": []
    }
}