{
    "remaining_requests": 20045,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Balloon-Washable-Polyester-Reusable-Decoration/dp/B0CT3JJRBN",
    "body": {
        "name": "Paris Stree Eiffel Tower Balloon Cloth Napkin Set of 6, Washable Polyester Dinner Napkin Washable Reusable Table Napkins with Hemmed Edges for Home Wedding Party Holiday Decoration 20 X 20 in",
        "price": "$20.99",
        "originalPrice": "",
        "rawPrice": 20.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Balloon-Washable-Polyester-Reusable-Decoration/dp/B0CT3JJRBN",
        "soldBy": {
            "sellerID": "A2AKXBI1PEBA2S",
            "name": "Momoyu",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2AKXBI1PEBA2S&asin=B0CT3JJRBN&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "Usually ships within 7 to 8 days",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51FYooUvbtL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51JbOGET1wL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BH3cLCeAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518yuXPwHFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ysh0VvKSL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the cfpolar Store",
            "link": "https://www.amazon.com/stores/cfpolar/page/ED764AB8-8D69-448A-A212-A710F89DE37A?ref_=ast_bln"
        },
        "brand": "cfpolar",
        "merchantInfo": "Momoyu",
        "customerReview": "",
        "customerReviewCount": 0,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$1.99 delivery March 5 - 11."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "DURABLE POLYESTER FABRIC: Our reusable cloth napkins are made from polyester, not only guarantees their durability and longevity but also provides a luxurious feel and exquisite look. The fibers are carefully selected and woven to create a soft and smooth texture, adding a touch of elegance to any dining setting. Whether you're hosting a formal dinner party or a casual family gathering, these cloth napkins will impress your guests with their fine craftsmanship and high-end appeal.",
            "SOFT & SMOOTH: With a thickness of 0.5mm, the delicate texture ensures a gentle touch against your skin, making them perfect for formal occasions and everyday use alike. Whether you're wiping your mouth or simply draping them over your lap, these napkins will elevate your dining experience with their exceptional softness. Their sumptuous feel will leave a lasting impression on your guests, making every mealtime a truly enjoyable and memorable affair.",
            "REUSABLE & ECO-FRIENDLY: Say goodbye to disposable napkins. These eco-friendly napkins help reduce waste and minimize the use of disposable paper napkins, making them an environmentally responsible choice. Each time you use these cloth napkins instead of disposable ones, you're taking a step towards a more sustainable and eco-friendly lifestyle. Join the movement to protect the environment, one meal at a time, with our reusable and washable cloth napkins.",
            "ELEGANT: Our cloth napkins add a touch of elegance and sophistication to any table setting. Whether it's a formal dinner party or a casual family gathering, these versatile and elegant napkins are sure to impress your guests.",
            "VERSATILE & STYLISH: Whether you're hosting a formal dinner party or simply enjoying a casual meal with family and friends, these cloth napkins add a touch of elegance and sophistication to any setting. Perfect for special occasions such as holiday parties, cocktail gatherings, weddings, catering events, buffets, baby showers, birthday parties, indoor or outdoor use, and more."
        ],
        "description": "Add a touch of elegance and sophistication to your dining experience with our Premium Cloth Napkins. Made from high-quality polyester fibers, these napkins are not only thick and durable but also incredibly soft and smooth to the touch. Say goodbye to disposable napkins and embrace eco-friendly and reusable options.Each pack includes six cloth napkins, each measuring 20x20 inches, providing ample coverage for your dining table. The neutral and classic design makes them suitable for various special occasions, including holiday parties, cocktail gatherings, weddings, catering events, buffets, baby showers, birthday parties, and more.The meticulous stitching ensures the durability of these napkins, making them suitable for long-term use. Easy to clean and maintain, they can be washed and used repeatedly, reducing waste and contributing to a sustainable lifestyle.Upgrade your dining experience and impress your guests with these elegant and versatile cloth napkins. Whether you're hosting a formal event or a casual family dinner, these napkins will add a touch of sophistication to your table setting. Use them to decorate your kitchen table or dining area, and create a warm and welcoming atmosphere for your guests.Enhance the overall ambiance of your dining occasions with our Premium Cloth Napkins. Make every meal special and memorable with these reusable and soft napkins, perfect for various special occasions and everyday use.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Kitchen & Table Linens",
                "link": "https://www.amazon.com/Kitchen-Table-Linens-Dining/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063916"
            },
            {
                "name": "Cloth Napkins",
                "link": "https://www.amazon.com/Cloth-Napkins/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3741981"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Multicolor"
            },
            {
                "name": "Material",
                "value": "Polyester"
            },
            {
                "name": "Brand",
                "value": "cfpolar"
            },
            {
                "name": "Shape",
                "value": "Square"
            },
            {
                "name": "Pattern",
                "value": "Cartoon"
            },
            {
                "name": "Number of Pieces",
                "value": "6"
            },
            {
                "name": "Size",
                "value": "20x20"
            },
            {
                "name": "Product Dimensions",
                "value": "20\"L x 20\"W"
            },
            {
                "name": "Manufacturer",
                "value": "cfpolar"
            },
            {
                "name": "ASIN",
                "value": "B0CT3JJRBN"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "cloth-napkins"
            },
            {
                "name": "Date First Available",
                "value": "January 23, 2024"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [],
        "otherSellers": []
    }
}