{
    "remaining_requests": 19923,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lsrtoss-Cloth-Napkins-Reusable-Independence/dp/B0CTMLGZ8T",
    "body": {
        "name": "Lsrtoss 4th of July Cloth Napkins Set of 4 Reusable Dinner Napkins, Blue Red Star Independence Day Cocktail Napkin Washable Table Napkins for Wedding/Holiday Party/Baby Shower 20\"x20\"",
        "price": "$17.17",
        "originalPrice": "",
        "rawPrice": 17.17,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lsrtoss-Cloth-Napkins-Reusable-Independence/dp/B0CTMLGZ8T",
        "soldBy": {
            "sellerID": "AUR9ZX0TCZ34",
            "name": "Seven Roses",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AUR9ZX0TCZ34&asin=B0CTMLGZ8T&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTM3JQBQ"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CTMLGZ8T",
                "variationName": "Size",
                "variationValue": "4 Pack",
                "price": "$17.17",
                "variationImageURL": ""
            },
            {
                "asin": "B0CTMKQHYD",
                "variationName": "Size",
                "variationValue": "6 Pack",
                "price": "$22.80",
                "variationImageURL": ""
            },
            {
                "asin": "B0CTMK7S56",
                "variationName": "Size",
                "variationValue": "8 Pack",
                "price": "$27.92",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "20",
        "stockDetail": "Usually ships within 9 to 10 days",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51PR15X0 YL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51jzResPw8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51W5g2foJVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517L4fBZLOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/510GcDHtIKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41p-NmzX7gL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Yp l8RloL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Lsrtoss",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=Lsrtoss"
        },
        "brand": "Lsrtoss",
        "merchantInfo": "Seven Roses",
        "customerReview": "",
        "customerReviewCount": 0,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$5 delivery March 12 - 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✿FABRIC NAPKINS: Cloth napkins are made of high-quality polyester material. The natural material makes the napkins have a strong skin-friendly feel, smooth to the touch, which will not pull or irritate your sensitive skin, and can be used by babies and children. High-density woven dinner napkin are durable and not easy to wear and tear, and the high-quality fabric makes the cocktail napkins reusable, economical and resource-saving, and can be used all year round.",
            "✿DECORATIVE NAPKINS: Dinner napkins cloth pack of 4, each 20x20 inches. Wedding napkins is printed with vivid and clear patterns, with bright colors, and the napkins bulk has a tightly bound design around it, which is not easy to take off the thread, and is both practical and decorative. You can fold the cloth napkin elegantly and place it in the center of the plate or fastened with a napkin ring to create a perfect shape that will impress your guests and enhance the dining experience.",
            "✿WIDELY USED: Beautiful dinner napkins can not only perfectly match the tableware, table runners, tablecloths and placemats on the table. Napkin are highly absorbent, so they can wipe up meal spills, or water from plates, glasses, cookware, and dry quickly. The soft and comfortable table napkins can also be placed on the lap or collars to avoid oil and water stains from splashing on your body and dirtying your clothes during meals, making napkins ideal for adults and children alike.",
            "✿HOLIDAY NAPKINS: Farmhouse napkins are perfect for formal business occasions or everyday home use, can be used as hotel napkins, wedding napkins for reception, restaurant napkins, banquet napkins, cocktail napkins, party napkins, dinner napkins, birthday napkins, baby shower napkins, bar napkins, engagement napkins and so on. You can also gift napkins to family and friends at Thanksgiving, Christmas, Halloween, Easter, St. Patrick's Day, Valentine's Day, fall party, housewarming and more.",
            "✿NAPKINS CLOTH WASHABLE: Reusable napkins can be washed in the washing machine and will not shrink, deform, fade or wrinkle after washing. Please wash with cold water during the cleaning process, which can remove stains more effectively and will not harm the fabric of the napkins cloth. Napkins bulk are breathable and can be dried naturally or at low temperature, without taking too much time to dry, and there is no pressure when using. Do not use bleach."
        ],
        "description": "Whether it's for formal occasions, party events or dining at home, our napkins can provide you and your family and friends with a great dining experience.✿Polyester Napkins- Cloth dinner napkins are soft and comfortable and feel smooth to the touch.- Holiday cocktail napkins has strong toughness and is not easy to tear.- Personalized napkins can withstand sunlight and are not easy to fade.✿Classic Edging Design- Cloth napkins bulk are carefully cut and flat.- Invisible stitching enhances the beauty of the holiday cloth napkins.- The line of the napkin is smooth, and fabric napkins is not easy to fall off the line.✿Main Feature1.Napkins for wedding reception quickly absorb water from cups, plates, and other utensils.2.You can place a table napkins cloth on your lap or on your chest to avoid getting splattered by mealtime greasy stains.3.Table cloth napkins acts as an insulator, allowing plates with hot food to be placed on the napkin.4.A napkin is essential when serving.✿Decoration & Storage1.Dinner napkins are an essential addition to the tabletop when dining and blend perfectly into any decor.2.Kitchen napkins can be laid flat on the plate.3.Napkins bulk can be folded and placed in the center of the plate.4.Use napkin rings to secure holiday napkins in your preferred shape.5.When not in use, funny cocktail napkins can be folded in the cabinet without taking up too much space and being less prone to creases.✿Multiple Applications1.Rustic napkins can provide decoration for indoor places such as kitchens, dining room, restaurants, hotels, cafes, bar, theme houses, holiday homes, etc.2.Dinner napkins cloth washable can also be suitable for outdoor birthday parties, weddings, banquets, barbecues, autumn themed parties and more.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Kitchen & Table Linens",
                "link": "https://www.amazon.com/Kitchen-Table-Linens-Dining/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063916"
            },
            {
                "name": "Cloth Napkins",
                "link": "https://www.amazon.com/Cloth-Napkins/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3741981"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Starssrs7914"
            },
            {
                "name": "Material",
                "value": "Polyester"
            },
            {
                "name": "Brand",
                "value": "Lsrtoss"
            },
            {
                "name": "Shape",
                "value": "Square"
            },
            {
                "name": "Pattern",
                "value": "StarsSRS7914"
            },
            {
                "name": "Number of Pieces",
                "value": "4"
            },
            {
                "name": "Size",
                "value": "4 Pack"
            },
            {
                "name": "Product Dimensions",
                "value": "20\"L x 20\"W"
            },
            {
                "name": "Item Weight",
                "value": "4.6 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "Lsrtoss"
            },
            {
                "name": "ASIN",
                "value": "B0CTMLGZ8T"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "Cloth Napkins"
            },
            {
                "name": "Date First Available",
                "value": "January 31, 2024"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [],
        "otherSellers": []
    }
}