{
    "remaining_requests": 40672,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Magtame-Magnetic-Braided-Charging-Original/dp/B0CQXFYC3C",
    "body": {
        "name": "Magtame USB C Cable, Magnetic Coiled USB A to USB C Cable for iPhone 15 Pro Max Plus, 3.3ft Nylon Braided Type C Fast Charging Cable for Samsung, for iPad, for MacBook,Original Design Patent Product",
        "price": "$19.99",
        "originalPrice": "",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Magtame-Cable-Magnetic-Charging-Device/dp/B0CTT9H1G6",
        "soldBy": {
            "sellerID": "AQ892Q9QNAQYU",
            "name": "Cool-Essential",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AQ892Q9QNAQYU&asin=B0CQXFYC3C&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTT9H1G6"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CQXFYC3C",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41UbI3gZSRL._SS36_.jpg"
            },
            {
                "asin": "B0CQXDZWTP",
                "variationName": "Color",
                "variationValue": "Silver-Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51awqQNZPiL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save 30%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41NCtrVnKiL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41wZqcj5WNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4183C c7QjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ixqcspfiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41W5sXKWs8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51WQ4a8as L.jpg",
            "https://m.media-amazon.com/images/I/61NTlPzsTdL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/490f03f4-0c67-42b5-92e9-4f911ecce7bb/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Magtame Store",
            "link": "https://www.amazon.com/stores/Magtame/page/C09361BE-6C38-41F9-B248-DEF75AAF4328?ref_=ast_bln"
        },
        "brand": "Magtame",
        "merchantInfo": "Cool-Essential",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 433,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 3 hrs 50 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Flexible & Retractable Design: The Magnetic Retractable USB-C cable provides inherent flexibility and stretchability. This allows for convenient extension without the excess length, making it an ideal solution for varying distances between the power source and your device.",
            "Tangle-free convenience: Enjoy a tidy and organized workspace without the frustration of unmanageable cables with this coiled USB-C cable that enhances both aesthetics and functionality.",
            "30W Fast Charging Support: Our USB-A to USB-C Cable ensures safe high-speed charging at 3A and delivers data syncing speeds of up to 480Mbps, which is 2X faster than the 2A version and charges USB-C Phone from 0% to 60% within 35 minutes.",
            "Durability & Safety: Our Type C cable features a robust nylon exterior, a resilient copper core with over 10,000 bend lifespan, and an impressive tensile strength of 66 lbs, ensuring longevity and resilience. Pet-friendly, it fearlessly withstands chewing.",
            "Wide Compatibility: Magtame USB C Cable is compatible with virtually all USB-C devices for Samsung Galaxy S23/S22/S21 etc, Motoro_la Moto g power/g stylus/G9 G8 G7, Z2/Z3/Z4X4,OnePlus 9 Pro/9 8T, Google Pixel 7 7 Pro 6, for iPhone 15/15 Pro Max and other usb c device.",
            "About Magtame: Setting the Pace for Innovation! Magtame, the trailblazer in embedded magnetic technology for charging cables, brings you a revolution in speed, convenience, and intelligence. Discover a groundbreaking approach to coiling your USB C cable and powering up your device."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Cables & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=23666438011"
            },
            {
                "name": "Cables & Interconnects",
                "link": "https://www.amazon.com/Cables-Interconnects-Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_5?ie=UTF8&node=172463"
            },
            {
                "name": "USB Cables",
                "link": "https://www.amazon.com/USB-Cables/b/ref=dp_bc_aui_C_6?ie=UTF8&node=464394"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 4.17 x 4.17 x 0.67 inches; 2.12 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ December 25, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Magtame Tech"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CQXFYC3C"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,780 in USB Cables"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 433 ratings"
            },
            {
                "name": "Brand",
                "value": "Magtame"
            },
            {
                "name": "Connector Type",
                "value": "USB Type C"
            },
            {
                "name": "Cable Type",
                "value": "type c"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            },
            {
                "name": "Special Feature",
                "value": "Fast Charging"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Hightlights of Magtame Magenetic Charging Cable: 1. Magical Revolutionary Embedded Magnetic Tech! 2. 3A(30W) Fast and Safe Charger! 3.Self-Winding Organization Design 4. Keep Your Space Tidy! 5. 48 Strands Nylon Braided! 6. Upgraded Aluminum Shell Desgin",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page 1 3A Fast Charging 2 480 Mbps Data Tranfer 3 Support Carplay 4 Widely Compatibility",
                "media_link": []
            },
            {
                "media_text": "Friendly & Hassle Free Support",
                "media_link": []
            },
            {
                "media_text": "Compatibility - Compatible with Galax-y S23/ S23+/ S23 Ultra,S22/ S22+/ S22 Ultra, S21/ S21+/ S21 Ultra, S20/ S20+/ S20 Ultra, Galax-y S10 S10e S10+ Plus 5G S8 S8+ S9 S9+ S8 Plus S9 Plus, Note 9 Note10 Note10+ Plus 5G Note 20, A12 A13 A51 A52 A53 A60 A70 A71 A72 A80 A90 - Compatible with G_oogle Pixel 7 6 6a 6 pro 5 5a 4 4a 3 2 XL, Nexus 6P - Compatible with G5 G6 G7 V60 V50 V40 V35 ThinQ V30S V30 V20 Stylo 4 5 6 Velvet - Compatible with Mo_to_G Stylus G8 G7 G9 power. - Compatible with Other USB C to USB C Devices. Important Notes: 1. This is a USBA to USBC cable (Not including USB A Adapter) 2. This USB C Charging Cable can not output Video.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6fbaf665-f8a4-4474-bd75-1655d5f9d2fa.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fd2d3323-3e3c-45ac-a3c1-b60471cf3b4c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6db95ddb-513c-45b8-b434-632eb445e46a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c9d482fe-81b0-4789-9715-3257197c121c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5834db0e-c173-4e1c-9505-758e658a3b71.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b6eb5b6-0113-4184-930c-6bc83e6a22f6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f485d593-2f15-43d1-9486-3d5158edc1d5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d72a4708-8ae6-4351-98e4-eebdb2a2476b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b3b9de84-7376-489f-8365-031c61e708e4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jollyroger Hobbies",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCYV7Q5GEA63D4HFO5SRTV7LFWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V5FI2RAI5KUK?ASIN=B0CQXFYC3C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Neat Charging cord!",
                "reviewText": "This is my first magnetic coil cable ever used.USB-C to USB-CListing says this is 3.3 (3'4\") feet. I measure from Tip to Tip at 3 Feet, 3 1/4 inches. From base connector to base connector (cord alone) I measure 3'1\". Use that info how you wish.Cord feels solid and well braided while still being flexible and not stiff.Color in pictures shows black with some silver checkered pattern. The picture shows a dark black with a mild light Silver. However what I received was a little different. It's the same color pattern/shape but the black is muted and the silver shows very bright. So the silver overpowers the black.Magnetic capability : I expected the cable to very strong magnetic wise and hard to use. However I was wrong, the magnetic properties in the cable are very muted. This cable does NOT go back into a coil if you just let go of it. It will only go back into a coil if you manually roll/coil it back up. I also found out a few curious things. The cable isn't magnetic or at least not strong on both sides. So I tried to coil it up one direction and it wouldn't hold its shape. I could feel the magnets working against each other. This make sense if you understand magnetic poles. So I reversed my coil and it went together much easier and stronger, so keep this in mind if you choose to get this item. The magnets also get stronger the more the cord is coiled, this is also understandable if you understand magnets.Charging: I only have a 20w Protocol Delivery (PD) charger on my desk and a 30w PD charger in my truck so I was not able to test this cable it its maximum rating of 60w. However at 20W on my desk it charged my Motorola Edge 2022 5G UW phone from 20% to full in just 30 minutes. I live in a fairly small town and it only takes me 10 minutes to get anywhere so I was about to get a 25% (approx.) charge in 10 minutes.In conclusion this cable has an excellent space saving design with the magnetic coil capability (as long as you understand its limitations). This enables to you to store the cables neatly when not in use. When using, the power delivery is very capable and able to handle power requirements of most chargers/devices. All in all this is a great little powerful cable!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MikeS_CTMikeS_CT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAM6QHDW5FCDE3Q4ZYXPWGFAVOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SIZKF9PUJSWI?ASIN=B0CQXFYC3C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars A reaaly cool product that works",
                "reviewText": "I have a ridiculous amount of devices in my house that require regular charging. The main ones are a Dell XPS 13 laptop, 2 Samsung tablets, 2 Pixel phones, and a Samsung phone.I have a charging station set up in my living room on a window ledge behind my couch. It features a small power tower with three or four chargers plugged into it at any given time with various cables attached. As you can imagine, it could get a little messy at times. When I saw this product, I thought it was a simple but ingenious way to incorporate a bit more neatness into the charging area. One of the biggest problem there is with cables getting tangled with each other or themselves.When the cable arrived, I tested it out immediately. My first impression was that it was a nice, sturdy braided cable that hit my sweet spot of not being too thick. It's strong enough, but still supple. The magnetic charge in the stable was strong enough to keep however much you wanted to keep rolled up, but not so strong that it interfered with the use of the cable. So far, so good.I've used it to power my laptop, which I often use on that couch. No problem at all there delivering the 45W needed. Then I tested it out on the tablets and phones. Everything charged at the fastest speeds, including the 2 Samsung tablets, which also require 45W to achieve maximum speed.In conclusion, this cable has done everything I needed it to do in the 2 weeks I've been using it. I obviously can't speak to how it will hold up in the long term, but it's sturdy enough that I feel fairly confident. If something comes up, I'll amend the review. For now, I can absolutely recommend this cable. Given how neat the magnetic part keeps everything, I would be eager to try it out in an even longer length than 3 feet.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/716wYZ5EpAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Z22Hjo6yL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric  DrummondEric  Drummond",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLTTWGAPOYVBNROCACJCYNQFPVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3P78BWWAN0KGF?ASIN=B0CQXFYC3C",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "4.0 out of 5 stars This is a really good charging cable with a cool special feature.",
                "reviewText": "All right today. What I have for everyone is my full review of the Magtame USB C Cable, Magnetic Coiled USB A to USB C Cable.Now what I decided to do for today's review. Is break it down into the positives and the negatives of these charging cables. Then I'm going to share my overall final thoughts as to how I feel about the cables and make an overall recommendation as to whether or not I would recommend that you pick these cables up. That being said, I hope everyone finds this review helpful and let's beginPositives:By far the biggest positive that I like about these cables is the magnetic coiling ability that they possess. So when they're not in use, they can easily be wrapped up or recoiled and stored for use at a later date. This is a big positive for me because it really helps reduce the clutter especially on my workspace at my desk and it is an easy integrated tool for cable management in regards to my charging cables.Another positive of these charging cables is the overall portability is top notch. As I said earlier, these cables because of the integrated magnets can be easily coiled for easy storage and cable management, but that also makes them extremely portable meaning that they can easily be stored in a bag or a backpack for easy use later on. So the overall portability is another great positive in my opinion.The last positive that I experienced with these charging cables. Would have to be the fact that they support true fast charging. So all of my primary devices like my Galaxy phones or my Galaxy tablets can actually charge at their fastest possible rate. And regards to a charging cable, in my opinion it really needs to be able to offer fast charging capabilities that along with the fact that these cables are made out of really nice, solid, sturdy braided material is another top notch positive in my overall opinion.Okay that covers all the positives that I experienced in my time with these charging cables. Now let's move on and dive into the negatives. Let's go!Negatives:By far, the biggest negative that I experienced with these charging cables is the overall length. Now these charging cables come in a standard 3 ft length. And for me that's just long enough to get the job done for what I need these charging cables to do. But there was certain instances where I wished the cables were longer and I wish they offered them with a standard 6 ft cable instead of a 3-ft cable.The last negative that I experienced with these charging cables would have to be the fact that they don't charge all of my devices at their fastest rate. Now these cables are advertised as being able to charge iPhones, Samsung products, iPads, Samsung tablets, pixels etc etc. But in my particular testing they did not end up charging my particular pixel device at its fastest possible rate and they actually took a long time to get my pixel device up to full. So although they did a great job charging up my iPhone's charging up my Galaxy devices, they did not do a good job charging up my pixels. So to me, the fact that these cables at least in one area did not perform as advertised is a negative in my opinion.All does it for the overall negatives that I experienced now? Let's move on to the final part of this review. Let's go!So all in all, how do I feel about these magnetic charging cables? Well I would have to say they are really good. That being said, what I recommend that you guys and gals go out there and pick up these charging cables? Well, if you're in the market for some really good high quality charging cables. You can't really go wrong with these in my opinion. Just as long as you're mindful of the negatives that I pointed out and they're not deal breakers for you, then yes I can recommend that you guys and gals go out there and pick these cables up. They should serve you well. Okay everyone. I think that about does it for today's review again. I hope everyone found the review helpful and I hope everyone is having a good day, evening and or night depending on the time and or your location when you're reading this review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71-HVuCDTQL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71LZAEloQmL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "BBD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Amazing concept and great quality cable that sticks to metal desks!",
                "reviewText": "I love this USB C cable!The build quality is really good - the connectors are all aluminum and I love the braided nylon shielding on the cable itself. The shape of the connectors is a bit different - kinda oblong with some edges - making it super easy to grip and plug/unplug. It feels smooth, unlike some nylon-coated cables which are coarse and will sandpaper other stuff in your backpack or bag. There is a hard plastic strain relief molded right into both connectors which should help the cable last a long time.This cable design is unique in that it has weak magnets built into the length of the cable. You can't see or physically feel them anywhere along the length of the cable, but the way the cable \"sticks\" to itself tells you that magnets are there. This might be the next big thing in cable management. If you have a metal desk I found that the magnets will also keep your cable glued nicely to the leg or riser beams of the desk. I was able to route my cable along a complex path and it stayed put so long as the weight of the connectors was supported on both ends. This is awesome!You can see from the picture how the cable stays in a nice, polite coil all by itself. This would normally be a game changer, however, the magnets are weak and with only a little coaxing the coil can be pulled apart. I'm worried that a bag full of these cables might be like herding cats, but who knows. The concept is very cool and I would love to see more cables like this on the market.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BBD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Amazing concept and great quality cable that sticks to metal desks!",
                "reviewText": "I love this USB C cable!The build quality is really good - the connectors are all aluminum and I love the braided nylon shielding on the cable itself. The shape of the connectors is a bit different - kinda oblong with some edges - making it super easy to grip and plug/unplug. It feels smooth, unlike some nylon-coated cables which are coarse and will sandpaper other stuff in your backpack or bag. There is a hard plastic strain relief molded right into both connectors which should help the cable last a long time.This cable design is unique in that it has weak magnets built into the length of the cable. You can't see or physically feel them anywhere along the length of the cable, but the way the cable \"sticks\" to itself tells you that magnets are there. This might be the next big thing in cable management. If you have a metal desk I found that the magnets will also keep your cable glued nicely to the leg or riser beams of the desk. I was able to route my cable along a complex path and it stayed put so long as the weight of the connectors was supported on both ends. This is awesome!You can see from the picture how the cable stays in a nice, polite coil all by itself. This would normally be a game changer, however, the magnets are weak and with only a little coaxing the coil can be pulled apart. I'm worried that a bag full of these cables might be like herding cats, but who knows. The concept is very cool and I would love to see more cables like this on the market.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "drutgatdrutgat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 29, 2024",
                "reviewTitle": "EXCELLENT Magtame Magnetic USB A to USB C Fast Charging Nylon Coiled Cable",
                "reviewText": "I am actually bowled over by how good this cable is - this is easily the best USB cable I have ever used.The excellent quality and functionality of this cable have made me re-think how much I will pay for something of this quality in the future. The moral of this story is that you get what you pay for.A winner all-round.I highly recommend this cable.PROS - WHAT I LIKED1. I was actually stunned (no exaggeration) by the speed at which this Magtame cable transferred 30 photos from my ‘phone to my laptop2. The quality and feel of the USB C and USB A port ‘holders’/surrounds is very impressive - they hold the cable very tight, and are solid (and reassuring) to hold3. the nylon cable is quite thick (especially in comparison to most other USB cables I have), and feels quite strong4. The magnetic coil feature of this cable is actually quite useful - sometimes you have to encourage it to coil a little smaller, but then the magnetism takes over, and it stays coiled, instead of spreading out all over the placeCONS - WHAT I DID NOT LIKE1. Great quality comes at a price",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71tkd9dZz8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61wHYOEQokL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71aomoDpbTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "BBDBBD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 27, 2024",
                "reviewTitle": "Amazing concept and great quality cable that sticks to metal desks!",
                "reviewText": "I love this USB C cable!The build quality is really good - the connectors are all aluminum and I love the braided nylon shielding on the cable itself. The shape of the connectors is a bit different - kinda oblong with some edges - making it super easy to grip and plug/unplug. It feels smooth, unlike some nylon-coated cables which are coarse and will sandpaper other stuff in your backpack or bag. There is a hard plastic strain relief molded right into both connectors which should help the cable last a long time.This cable design is unique in that it has weak magnets built into the length of the cable. You can't see or physically feel them anywhere along the length of the cable, but the way the cable \"sticks\" to itself tells you that magnets are there. This might be the next big thing in cable management. If you have a metal desk I found that the magnets will also keep your cable glued nicely to the leg or riser beams of the desk. I was able to route my cable along a complex path and it stayed put so long as the weight of the connectors was supported on both ends. This is awesome!You can see from the picture how the cable stays in a nice, polite coil all by itself. This would normally be a game changer, however, the magnets are weak and with only a little coaxing the coil can be pulled apart. I'm worried that a bag full of these cables might be like herding cats, but who knows. The concept is very cool and I would love to see more cables like this on the market.Recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71O5Gm8CZ8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandro SánchezAlejandro Sánchez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 10, 2024",
                "reviewTitle": "Quien no odia los cables revueltos...",
                "reviewText": "Lo compré y luego me di cuenta de que había una versión de 5A, pero bueno, para casi cualquier uso es suficiente.No es ni más ni menos que un cable macho-macho de USB tipo C. Salvo por el detalle, bastante chulo por cierto, de que se puede adherir a si mismo para enrollarse sin necesidad de usar sistema de sujeción.La calidad del cable se percibe buena y funciona con transmisión de datos sin problemas.Me habría gustado que incluyese un imantado más fuerte, pero no está mal.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/718iJexmxVL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}