{
    "remaining_requests": 43893,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/AMD-FX-8370-Processor-4300Mhz-FD8370FRHKBOX/dp/B00MUTWELC",
    "body": {
        "name": "AMD FD8370FRHKBOX FX-8370 Black Edition 8 Core CPU Processor AM3+ 4300Mhz 125W 16MB",
        "price": "$276.99",
        "originalPrice": "",
        "rawPrice": 276.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/AMD-FX-8370-Processor-4300Mhz-FD8370FRHKBOX/dp/B00MUTWELC",
        "soldBy": {
            "sellerID": "AJ1BUG50UXZKY",
            "name": "iT Hardware",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AJ1BUG50UXZKY&asin=B00MUTWELC&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B01EMQ00UM"
        ],
        "asinVariationValues": [
            {
                "asin": "B01798X7D2",
                "variationName": "Style",
                "variationValue": "FX-8370 with Wraith Cooler",
                "price": "$220.00",
                "variationImageURL": ""
            },
            {
                "asin": "B00MUTWELC",
                "variationName": "Style",
                "variationValue": "FX-8370 with stock fan",
                "price": "$276.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51fI4VaLoDL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41XZHWkqsYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51E7C2z2SqL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the AMD Store",
            "link": "https://www.amazon.com/stores/AdvancedMicroDevices/page/8D05F933-0F55-46A5-A940-3711A335A383?ref_=ast_bln"
        },
        "brand": "AdvancedMicroDevices",
        "merchantInfo": "Ships from and sold by PcPartDen.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 884,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$4.99 delivery February 16 - 22.",
            "FREE delivery February 28 - March 13."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "4300Mhz",
            "AM3+",
            "125W",
            "16MB"
        ],
        "description": "AMD FX-8370 Black Edition 8 Core CPU Processor AM3+ 4300Mhz 125W 16MB FD8370FRHKBOX.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "CPU Processors",
                "link": "https://www.amazon.com/CPU-Processors-Memory-Computer-Add-Ons/b/ref=dp_bc_aui_C_5?ie=UTF8&node=229189"
            }
        ],
        "productInformation": [
            {
                "name": "Processor",
                "value": "‎4.3 GHz amd_fx"
            },
            {
                "name": "Brand",
                "value": "AMD"
            },
            {
                "name": "Series",
                "value": "‎FBA_FD8370FRHKBOX"
            },
            {
                "name": "Item model number",
                "value": "‎FD8370FRHKBOX"
            },
            {
                "name": "Item Weight",
                "value": "‎15.2 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎23.35 x 16.14 x 5.91 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎23.35 x 16.14 x 5.91 inches"
            },
            {
                "name": "Processor Brand",
                "value": "‎AMD"
            },
            {
                "name": "Number of Processors",
                "value": "‎8"
            },
            {
                "name": "Computer Memory Type",
                "value": "‎DDR3 SDRAM"
            },
            {
                "name": "Manufacturer",
                "value": "‎AMD"
            },
            {
                "name": "ASIN",
                "value": "‎B00MUTWELC"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎September 1, 2014"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 884 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#521 in Computer CPU Processors"
            },
            {
                "name": "CPU Manufacturer",
                "value": "AMD"
            },
            {
                "name": "CPU Model",
                "value": "AMD FX"
            },
            {
                "name": "CPU Speed",
                "value": "4.3 GHz"
            },
            {
                "name": "CPU Socket",
                "value": "Socket AM3"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TickleSlip",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJWGR5OHYA75XJBOMYPWOBWMNSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22EM59T661B02?ASIN=B00MUTWELC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 18, 2015",
                "reviewTitle": "5.0 out of 5 stars Runs very well. Can have several processes open and still run CPU intensive games. OC's very well if that's your thing.",
                "reviewText": "I've always been an AMD CPU guy, with occasionally having used Intel CPU's here and there for particular purposes, but I always like to use AMD's for desktop builds. One, because let's be honest, AMD is cheaper by a longshot over their Intel competition. Two, because I know that my AMD CPU isn't going to melt at the first time the CPU gets \"too hot\". While it is well know that AMD CPU's do run hotter and they use more base power than Intel, it's made up for far in fact that AMD CPU's are better designed to handle multiple applications being run simultaneously and AMD CPU's were better built for 3D applications first.Having said that, the 8370 is based on the 9000 series architecture but at a lower wattage and lower overall speed. Granted, you can definitely overclock this particular CPU around 5GHz stable (only on liquid cooling), but why shorten the lifespan of your CPU when AMD offers CPU's that have base clock speeds of 5GHz out of the box (even if they're higher wattage). It should be noted that this particular CPU also holds the world speed record at over 8GHz (on a liquid nitrogen vapor system). I did play around with overclocking this chip a couple times and was able to get a stable 4.5GHz that while I was happy with, decided to not keep and put it back to stock clocks. For whatever particular reason, I got an 8370 that stock clocks at 4.1Ghz instead of the base 4.0, and I'm fine with that.Benchmarking....forget it. Benchmarks are so skewed that it's not even worth trying to \"match up\" to the competition on how well the chip does. 90% of the Benchmarks of the competitor chip (Intel) are overclock by 1Ghz or even saw some as high as 1.5Ghz over their base clock to get those higher scores. And, not that one would do it, but if you turn off the HT (Hyper Threading) of an Intel chip...it'll fall flat on its face. Intel needs HT in order to bring you the other \"cores\" in a virtual mode to bring you that performance. While Intel has since released \"true\" hexacore CPU's in these last few months, the price tag alone is enough to make those CPU's only worthwhile to true enthusiasts (those CPUs run around 1200 bucks to start). So what if your AMD doesn't benchmark as high as the false benchmarked Intel's on the market...it doesn't matter as long as you know that you can open 30 processes and still be able to do something without jittery screen, and still play your favorite CPU extensive game without bogging down the processor.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brayan Leonardo Méndez Molina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIATHOFJRSGFBY7FME6Z6FHDSJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DLZE6R6NXSQB?ASIN=B00MUTWELC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 5, 2015",
                "reviewTitle": "5.0 out of 5 stars Good CPU",
                "reviewText": "Hello everyone, I found this on a nice price and I got it, I tested it with a Hyper 212 EVO, I've got nice temperatures with that cooling system, I've seen temperatures between 40-60 °C, that's a nice interval of temperatures, taking into account that I live in a city with an average temperature of 30°C. I never used OEM cooling system and I can't say something about its performance.performance of this CPU has been good on a year of usage, I have gotten stuttering just a few times, playing games offers you a good performance and when you're rendering videos does it fine, I've done it recently and It doesn't take much time doing it.Price-performance relation is very nice, I've been using it with demanding games and programs and It has worked very well, I've been using it with Windows 10 Home Edition and this CPU has taken it well, I think it would work excellent on Linux distributions but I haven't tried yet.I felt very fine working with it ,I recommend this CPU for gaming, I can't be 100% sure about recommending it for video editing because I haven't ever done it until some days ago, have a nice day.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "marshmallow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEA7W44KTRME3YX5WPIIR4XTFAAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RQPV5YZQFE6S?ASIN=B00MUTWELC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2014",
                "reviewTitle": "5.0 out of 5 stars Holy crap this is fast",
                "reviewText": "I don't know why I decided to splurge but I ended up splurging a little and now I'm broke but have smooth framerates in games that use more CPU than GPU. I'm just stunned on how fast this thing is. 4ghz out of the box, and 4.3ghz OC with stock thermal fan. But that's not just one core, but EIGHT! Holy crap this is fast! It's a REAL SHAME that most of the cores are running idle because hardly anything supports 8 cores. But boy did it improve my gaming and it makes my oculus DK2 run smooth at 75hz. Skyrim does work smoothly at 120fps with an ASUS HD6950 (a monster of a card still to this day) but I have it set to 60fps for stability reasons. I'm looking forward to writing some programs that uses all 8 cores just for kicks and this truly is over kill. You COULD spend another $50 for the fastest AMD card on the market (that isn't $1000) but in my opinion, you should spend that $50 on a new game and enjoy this insane thing. Now the real question, does it outclass intel's processors? Yes and no. This is all up to you but some of what intel offers way outclass this processor but there's no game today or next year and perhaps the year after that will require that kind of performance. Those looking to benefit from those kind of processors are into CAD, or anything that needs to render (and actually supports that many cores). If you're debating between buying this card or the other one that's $30 cheaper (I think it was the FX-7800?), the performance difference is worth the $30 according to various reviews I found online. As a bonus I got a free game with this, but it comes as a steam code. You get to choose between 4 or 5 games, but it's only good til the promotion ends. If you get a rebate offer, don't forget about it!",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PRIME10",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMF3MO3OF6UVW4XAZO4UBZDUT3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MKEPIAA8F3EI?ASIN=B00MUTWELC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 10, 2018",
                "reviewTitle": "5.0 out of 5 stars This thing RIPS and is quieter than my IT guy when you ask him why we need admin rights to install forced windows updates",
                "reviewText": "Upgraded from an FX-4350 and it was practically a night and day difference. The reduction in white noise just from the installation of the wraith cooler was exciting enough, but the processing power on that sucker makes me smile just writing about it. Pour one out for the FX-series now that AMD's saviour is Ryzen (bought this around Easter and am just reviewing it now because I finally had a good pun) but if you are building a budget machine and don't care what computer nerds think of you, this is an amazing processor at a great price. I might buy another one just to keep on reserve, but I don't see how this setup (ASROCK 970a-g/3.1, AMD 1050 Ti, this processor, 1 TB PCIe M.2, 2 TB's in SSDs) won't last me for the next 10 years. I do some photo and video editing, little bit of CAD work, and a lot of felonious mopery on my computer and this processor seems so solid that I can't even fathom ever having to find another.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rommel Rios",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 7, 2018",
                "reviewTitle": "Buen micro, aunque calentón.",
                "reviewText": "Perfecto micro. Comprado para poder usar otros componentes y darle nueva vida a mi pc. La multitarea le saca todo su potencial, es calentón, pero le sirve muchísimo el disipador Wraith que trae, aunque hay que ser cuidadosos con el tamaño puesto que en placas base micro atx puede llegar a quedar sobre las memorias RAM o de plano no caber. Silencioso, aunque por la misma potencia siempre oirás el flujo de aire. Probado en juegos con una GTX1050 y siempre arriba de 60 FPS, entre 60 y 120 (a 1080p).",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michel Rathe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 12, 2018",
                "reviewTitle": "Upgrading from FX-4100 to FX-8370!",
                "reviewText": "Upgraded from a FX-4100 to this FX-8370 i received yesterday paired with a Nvidia GTX 1060 (i bought last week... my old one was an Asus HD 7770). Extremely satisfied...I never thought there would be such a difference in speed. Really happy to have made the change! i'm sure i'm ok for minimum 2 or 3 years without prob :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 13, 2018",
                "reviewTitle": "Works fine even on my ancient 7 y",
                "reviewText": "Works fine even on my ancient 7 y.o. Sabertooth 990FX R1.0 mobo (after BIOS upgrade, of course). Overclocks to 4.5 GHz, all cores, Prime95 8-thread stable for at least 1 day and keeps under 80C, even with the stock Wraith cooler (quite good as well but not great; not a waterblock or a 14 cm supercooler). No explicit voltage adjustments were applied (although did have to up the LLC setting to achieve full stability). Bottom line: well exceeded my expectations. Too bad it's not 2013 now, when it would have been plain spectacular.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jürgen L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 20, 2018",
                "reviewTitle": "Beste FX Vishera CPU, Wraith Lüfter macht andere Lüfter unnötig",
                "reviewText": "Hatte davor FX 8350. leider defekt. der FX 8370 zieht weniger Strom und wird unter Last weniger heiß wie der FX 8350. macht sich in Gehäusen, bei denen es thermisch eh kritisch war, sofort bemerkbar. der FX 8370 reicht locker für alle gängigen Desktop Anwendungen und mit der richtigen Grafikkarte auch für aktuelle Spiele. Der Wraith Cooler ist angenehm leise und sieht mit seinem Leuchten / den LED s sehr sehr schick aus. gibt eigentlich keinen Grund für extra Lüfter, außer man will übertakten.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Max",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 25, 2017",
                "reviewTitle": "Ottimo dissipatore ormai ad un prezzo basso",
                "reviewText": "Sono passato da un 6 core bulldozer quindi prima gen a questo 8 core, più per sfizio pensando che tanto le differenze non le avrei viste, mi sono dovuto ricredere, tempo di avvii,fps in game etc migliorati di parecchio, se volete fare la spesa e non volete assolutamente cambiare scheda madre potrebbe fare al caso vostro, il dissipatore non l'ho usato perché ne avevo uno mio, le temperature con il mio dissipatore non si sono alzate di molto, ma non ho fatto oveclock",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}