{
    "remaining_requests": 43936,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/AMD-Ryzen-3400G-8-Thread-Processor/dp/B07SXNDKNM",
    "body": {
        "name": "AMD Ryzen 5 3400G 4-core, 8-Thread Unlocked Desktop Processor with Radeon RX Graphics",
        "price": "$139.99",
        "originalPrice": "$149.00",
        "rawPrice": 139.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/AMD-Ryzen-3400G-8-Thread-Processor/dp/B07SXNDKNM",
        "soldBy": {
            "sellerID": "A2YYD0BY5061FQ",
            "name": "Sysmel",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2YYD0BY5061FQ&asin=B07SXNDKNM&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07Y5WGDH7"
        ],
        "asinVariationValues": [
            {
                "asin": "B07SXNDKNM",
                "variationName": "Style",
                "variationValue": "AMD Ryzen 5 3400G",
                "variationImageURL": null
            },
            {
                "asin": "B07Y35QB18",
                "variationName": "Style",
                "variationValue": "CPU + ASUS AM4 TUF Gaming X570-Plus (Wi-...",
                "variationImageURL": null
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31ofWCSAoBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31BYALiyxbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31YLnqI9EnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31J53AR5aNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sKiLWnvYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41yrEN84oOS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 lUxj-g5L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the AMD Store",
            "link": "https://www.amazon.com/stores/AdvancedMicroDevices/page/8D05F933-0F55-46A5-A940-3711A335A383?ref_=ast_bln"
        },
        "brand": "AdvancedMicroDevices",
        "merchantInfo": "Ships from and sold by LPI.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 6643,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 13 hrs 43 mins",
            "FREE delivery February 16 - 21."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Includes Radeon RX Vega 11, the world's most powerful graphics on a desktop processor, no expensive graphics card required",
            "Can deliver smooth high definition performance in the world's most popular games",
            "4 Cores and 8 processing threads, bundled with the powerful AMD Wraith Spire cooler",
            "4. 2 GHz max Boost, unlocked for overclocking, 6 MB Cache, DDR 2933 support",
            "For the advanced socket AM4 platform"
        ],
        "description": "AMD CPU YD3400C5FHBOX RYZEN 5 3400G 4C 8T 4200MHZ 6MB 65W AM4 RADEON RX VEGA11.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17923671011"
            },
            {
                "name": "CPU Processors",
                "link": "https://www.amazon.com/CPU-Processors-Memory-Computer-Add-Ons/b?ie=UTF8&node=229189"
            }
        ],
        "productInformation": [
            {
                "name": "Processor",
                "value": "‎4.2 GHz ryzen_5_3400g"
            },
            {
                "name": "Brand",
                "value": "AMD"
            },
            {
                "name": "Series",
                "value": "‎Ryzen 5"
            },
            {
                "name": "Item model number",
                "value": "‎Ryzen 5 3400G"
            },
            {
                "name": "Item Weight",
                "value": "‎1.12 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎1.57 x 1.57 x 0.24 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎1.57 x 1.57 x 0.24 inches"
            },
            {
                "name": "Processor Brand",
                "value": "‎AMD"
            },
            {
                "name": "Number of Processors",
                "value": "‎4"
            },
            {
                "name": "Batteries",
                "value": "‎1 A batteries required."
            },
            {
                "name": "Manufacturer",
                "value": "‎AMD"
            },
            {
                "name": "ASIN",
                "value": "‎B07SXNDKNM"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎July 1, 2019"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 6,643 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#213 in Computer CPU Processors"
            },
            {
                "name": "CPU Manufacturer",
                "value": "AMD"
            },
            {
                "name": "CPU Model",
                "value": "Ryzen 5 3400G"
            },
            {
                "name": "CPU Speed",
                "value": "4.2 GHz"
            },
            {
                "name": "CPU Socket",
                "value": "Socket AM4"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/dd5ad5e6-f4aa-4eb3-aef1-da33cce056e7.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ed5a60af-339b-4e60-8327-145368b0029b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b626e47f-4f40-4aad-b5b9-cb1989af95bc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/06a7f434-2489-4e7e-a8fa-b248393984bb.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1abc5cab-26ff-4dad-a1f0-c23e4ed9e03c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/296f7dec-99ff-42d0-965e-ca10968bc1b9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1b7aa0ee-a80e-47ff-bfe1-2fd7ad82625d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Just a Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKBM2BUAYAZXAF73OEORDGAWKKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KJ0WZO52V0HB?ASIN=B07SXNDKNM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 27, 2021",
                "reviewTitle": "5.0 out of 5 stars Value for Money - AMD Ryzen 5 3400G 4-core, 8-Thread, Unlocked CPU /w Radeon 11 RX Graphics",
                "reviewText": "Review of - AMD Ryzen 5 3400G 4-core, 8-Thread Unlocked Desktop Processor with Radeon RX Graphics-I am very satisfied with this AMD \"value\" APU, especially since its impossible to obtain graphics cards at MSRP right now.-I was very fortunately able to obtain this 3400G processor recently from amazon at MSRP pricing (sold by amazon, shipped by amazon). I suppose I was very lucky because all the stock in these sold out in about 30 minutes after I got an email notification. Then the site went back to absurd scalper pricing from 3rd parties (avoid those, boycott them).-I am using the 3400G for a \"home theater\" computer. At the MSRP price, paired with an Asus B450-F Gaming II mainboard that amazon also had at a great sale price, this CPU is working out well. Keep in mind however, that some BIOS CPU tuning is required. As a side note, I am using the Vetroo V5 air cooler. The Vetroo V5 has been holding idle tempts at 30C or so (CPU tuned to constant 4,000mhz clock speed), and rarely hitting 50C when pumping 2160p60 video from the web for smooth streaming playback. I'm not using this computer for gaming or video editing (such as with the Davinci Resolve editor). I am also using 32GBs of 3200mhz ADATA brand DRAM, with DOCP enabled. The AMD Ryzen 3400G's Vega 11 Graphics component reserves 2GB of RAM for dedicated graphics processing. With the CPU tuned to run at a constant 4,000mhz, the KODI home theater software application pumps steady, smooth, frame rate video.-My CPU/BIOS optimization experience: I discovered that, out the box, the Asus bios setup the AMD 3400G to constantly throttle its clock speed down to the 1700mhz range. As the 3400G kept throttling down, smooth HD video playback was impossible. However, once I used the Asus BIOS auto \"tweaker\" feature, and set the CPU to hold at a constant 4,000mhz CPU clock speed, I have been experiencing snappy \"home theater\" software performance. I also discovered that it is very necessary to update the Windows OS to the latest network/ethernet device driver and to add some obscure advanced network device driver settings configuration (see various youtube videos about these obscure ethernet driver tuning settings) in order to obtain smooth 1080p60, 1440p60, etc., internet video streaming performance.-Note also that, when connecting to a HDTV via HDMI, that 2160p60 is NOT possible unless the both the HDTV supports HDMI 2.1 for 2160p at 60hz refresh, as well as the MOBO in use. Based on my experience so far, 2160p (so called 4K), isn't that noticeably better beyond well smoothed, crisp, 1080p60 HDTV output anyway.-After the Asus MOBO BIOS tuning, and Windows OS network device driver updating noted above, I have been extremely happy that a $149.00 MSRP AMD CPU has more than enough processing power to provide an excellent home theater computer experience with the KODI home theater software application running my movie and music library (KODI takes a LOT of time to setup though).-The AMD Ryzen Vega 11 APU graphics included with the AMD Ryzen 3400G have been quite adequate for my \"home theater\" needs. I also recently purchased an AMD Ryzen 3200G, also available from amazon at MSRP from time to time. The graphics in the AMD Ryzen 3200G, which has more limited resolutions and refresh rates, are NOT at all as good as the 3400G graphics. The additional price for the AMD Ryzen 3400G over the 3200G is well worth it. However, for building office/business computers to run MSFT office and such, the $99 AMD Ryzen 3200G appears to provide more than enough processing power.-SYSTEM SETUP WITH THE AMD Ryzen 3400G- AMD Ryzen AMD 3400G- Asus ROG Strix B450-F Gaming II- Vetroo V5 CPU Air Cooler (Arctic brand NO rgb fans installed on it)- Montech Century 850W PSU- Fractal Design Meshify 2 Compact case (using the stock fans tuned with DC mode in BIOS)- (2) PNY XLR8 CS3030 500GB M.2 PCIe NVMe Gen3 x4 SSD) - system drive- - second matching drive for daily auto cloning backup with Macrium Reflect software- (2) Toshiba N300 8TB NAS HD for home theater media storage (RAID 1 / mirroring)- - 8TB total usable mirrored storage-----------------If you can get an AMD Ryzen AMD 3400G directly from amazon at MSRP, it is can excellent value CPU. Given the performance of the AMD 3000G line APUs, if and when the AMD 5000G APUs become available later this year, it seems like they are likely to provide an equally excellent value chip proposition. In years to come the anticipated AMD 6000G APUs, with even more upgraded RDNA2 graphics onboard, will hopefully provide ever more tantalizing value for money.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley Warren",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFT6TJXYFKZ6CBI365XBSL2AGEZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R48L4OYCDX5AH?ASIN=B07SXNDKNM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 15, 2020",
                "reviewTitle": "5.0 out of 5 stars Solid APU",
                "reviewText": "Paired this CPU with an Asrock B550 motherboard. I didn't know it at the time of purchase, but AMD says that the Picasso (12nm) APUs are not supported on the B550 chipset. I seem to have proven them wrong as the combo worked great right out of the box. So evidently the motherboard manufacturers enabled support for these CPUs into their boards.CPU is plenty fast for the application (a nephew's gaming computer), but I fully expect the need to upgrade to a discreet GPU at some point as he transitions from low-resource games into more modern titles, or if he were to upgrade to a much larger screen. Probably won't happen for 2-3 years; for the time being it plays Fortnite and all the other games he has at 1080P just fine.Single core performance matches that of my own system, a Ryzen 2700 overclocked to 4.0ghz on all cores. So that's pretty decent IMO. If you don't need the multi-threading prowess of a 6 or 8 core CPU, this is about as good as they come for the price.I briefly tried to overclock it just for grins and discovered quickly that it would take more time than I was prepared to spend. I enabled PBO (precision boost overdrive) and got an extra 200mhz to the boost clocks pretty effortlessly, but oddly my benchmark scores went down, and heat soared to 85C using the stock cooler. I likely could have made it work had I used manual voltage, but I lost interest as the CPU is plenty fast at its stock speeds.Without changing anything, under a Prime95 load the CPU would boost to about 4.1ghz single core, and 4.0ghz all-cores. If you added anything GPU intensive, the clocks went down drastically, often lower than the minimum 3.7ghz, and even the GPU clock would reduce lower than the stock 1400mhz. I suspect this is to keep it under the 65W thermal limit.So if I had to list a \"con\" of this CPU, it's that simultaneous GPU and CPU loading will result in lower clocks than what is advertised. But this combo of Prime95 CPU loading and 100% GPU loads will rarely or never occur in real life. Even a modern game title will never use 4 cores at 100% simultaneously. So this con could very well be a moot point.I could never get my RAM sticks to achieve anything greater than DDR4-3066 despite having Corsair 3200 modules. I tried installing a set of G.Skill DDR4-3600 and could get it up to DDR4-3400. Worth noting is that my Ryzen 2700 couldn't go past DDR4-3400 with the G.Skill modules either. So getting high RAM speeds is still going to be a challenge, just as it was with all the other Zen+ based processors.The iGPU in this chip needs all the RAM speed it can get, so be sure to choose the fastest RAM speed you can get for your budget. Just realize that this chip might not do rated speeds of the modules--> for example you might only get 3066 out of a 3200 stick. Or 3400 out of a 3600 stick. The integrated memory controller on the Zen+ is just hard on memory, no way around that.In the end I have a rock solid system that works great for its purpose. Awesome value in this CPU, would definitely buy it again.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jaivon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEMLA67Y4UJRQZB7GFEKGFZVRCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VR8YES6B8M2V?ASIN=B07SXNDKNM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Best CPU to use on a budget",
                "reviewText": "If you ever wanted to upgrade to the latest ryzen AM4 chip but dont ave the money now, this is where you start.. you will only notice problems when playing at max settings or if there are too many units on the field.It works great when editing videos too!Ryzen really works",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rogério Sebastião da Silva",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 19, 2023",
                "reviewTitle": "Bom de entrada",
                "reviewText": "Processador bom para processos e programas, mas para jogos nos tempos atuais dessa avaliação não é tão bom assim, deu um gargalo gigantesco em minha placa de vídeo RTX 3060 12gb.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. Logan K.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 4, 2021",
                "reviewTitle": "Fast and efficient, easy BIOS overclock to boost RAM performance",
                "reviewText": "Absolute go to for cost effective budget and no need for a GPU, able to perform all tasks including light CAD, simple video studio edit, word docs, browsing, and light gaming. System will be super quiet and no need for a aftermarket CPU cooler. One Comes inside the box, and capable of keeping cool for normal work loads.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anonimo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on October 17, 2023",
                "reviewTitle": "Buena relación calidad-precio",
                "reviewText": "Sin duda es lo que define a esta APU. La compré hace un par de años para montar un PC en el que no necesitaba tarjeta gráfica, pero los resultados son mejores de los esperados. Es capaz de mover juegos de hace pocos años con un rendimiento bastante aceptable. Para un uso medio es más que suficiente. Y ahorras una pasta en gráficas, vistos los precios.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 26, 2020",
                "reviewTitle": "Excelente procesador calidad precio que te permite ahorrar para después",
                "reviewText": "Mejor procesador calidad precioTe permite disfrutar casi todoEn una buena calidad y fluidezSentirás como una pc gamerY por lo mal que va ahora el stock de nuevas tecnologíasYo recomendaría este procesadorPara que no gastes en algo xY puedas tener una pc buena pasable por un tiempo hasta poder alguna gpu nuevaSe podría decir que es el que te permite ahorrar para despuésEn términos de rendimiento va muy bien para cualquier juegoLos más pesados siempre los correrá a min 30 fps en lo más bajo 720 pero nunca te dejará atrasLo recomiendo con 2 módulos de 2 x 8 gb en dual channel ya que esto incrementa el rendimiento de gran maneraPoner el xmp profile en el máximo que permiten que es el 2900Ya que si se pone másHay problemas y causa freezing en cargas pesadas como gamingUtilizado en pruebas de Linux y WindowsY es seguro con ambosRecordar poner el xmp profile a 2933 o habrá problemas",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Prathmesh holkar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 27, 2021",
                "reviewTitle": "Wrong price, should be 30k , it saves 15k for a graphics card",
                "reviewText": "This processor is gold, the best if you are a budget gamer, saves you almost 15k on a graphics card, will provide you with performance as good as the nvidia gtx1050 , you might not need a dedicated graphics card, and since its an APU, using graphics with it would be not a bad idea, but will put the excellent integerated graphics to no use.I am a video editor as well, so its decent, not the best for video editing, good on 1080p not 4k.If you are trying to do gaming and editing both, i would say go for it, no issues, will provide very fast encoding times for video editing, and a very decent fps for gaming, with no lags whatsoever in the game( tested with GTA 5, COD BLACK OPS 2, SNOW RUNNER)",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$160.00",
                "sellerName": "Maestro Technology LLC",
                "sellerRating": "3.5"
            }
        ]
    }
}