{
    "remaining_requests": 43913,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/AMD-Processor-Wraith-Cooler-YD1600BBAEBOX/dp/B06XNRQHG4",
    "body": {
        "name": "AMD Ryzen 5 1600 Processor with Wraith Spire Cooler (YD1600BBAEBOX)",
        "price": "$192.55$79.00",
        "originalPrice": "",
        "rawPrice": 192.55,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/AMD-Processor-Wraith-Cooler-YD1600BBAEBOX/dp/B06XNRQHG4",
        "soldBy": {
            "sellerID": "A3U70UX89N7ILJ",
            "name": "LK Products n Deals",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3U70UX89N7ILJ&asin=B06XNRQHG4&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B072FBN83F"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41yI vRADXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31yRyrlG7QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31P9ieiOlhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Q HlT0ZKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Q- Okua1L.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/710ZnC65RUL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/710ZnC65RUL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the AMD Store",
            "link": "https://www.amazon.com/stores/AdvancedMicroDevices/page/8D05F933-0F55-46A5-A940-3711A335A383?ref_=ast_bln"
        },
        "brand": "AdvancedMicroDevices",
        "merchantInfo": "Ships from and sold by Epower Solutions.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 4387,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 24 - 29",
            "Or fastest delivery February 24 - 27",
            "FREE delivery February 22 - 29."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Frequency: 3.6 ghz precision boost",
            "6 cores/12 threads unlocked",
            "Cache: 3 mb/19 mb (l2/l3)",
            "Socket type: Am4; Max Temps : 95°C; PCI Express Version : PCIe 3.0 x16",
            "Thermal solution: Wraith spire cooler; Base Clock:3.2GHz"
        ],
        "description": "95w cooler. Frequency: 3.6 ghz precision boost. 6 cores/12 threads unlocked. Cache: 3 mb/19 mb (l2/l3).",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "CPU Processors",
                "link": "https://www.amazon.com/CPU-Processors-Memory-Computer-Add-Ons/b/ref=dp_bc_aui_C_5?ie=UTF8&node=229189"
            }
        ],
        "productInformation": [
            {
                "name": "Processor",
                "value": "‎3.6 GHz amd_ryzen_5_1600"
            },
            {
                "name": "RAM",
                "value": "‎8 GB DDR4"
            },
            {
                "name": "Hard Drive",
                "value": "‎1 TB"
            },
            {
                "name": "Wireless Type",
                "value": "‎802.11b/n/ac"
            },
            {
                "name": "Brand",
                "value": "AMD"
            },
            {
                "name": "Item model number",
                "value": "‎YD1600BBAEBOX"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC"
            },
            {
                "name": "Operating System",
                "value": "‎Windows 10"
            },
            {
                "name": "Item Weight",
                "value": "‎1.6 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎1.6 x 0.3 x 1.6 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎1.6 x 0.3 x 1.6 inches"
            },
            {
                "name": "Color",
                "value": "‎silver"
            },
            {
                "name": "Processor Brand",
                "value": "‎AMD"
            },
            {
                "name": "Number of Processors",
                "value": "‎6"
            },
            {
                "name": "Computer Memory Type",
                "value": "‎DDR4 SDRAM"
            },
            {
                "name": "Hard Drive Interface",
                "value": "‎Serial ATA-600"
            },
            {
                "name": "Batteries",
                "value": "‎1 Lithium Ion batteries required."
            },
            {
                "name": "Manufacturer",
                "value": "‎AMD"
            },
            {
                "name": "Language",
                "value": "‎English, English, English, English, English"
            },
            {
                "name": "ASIN",
                "value": "‎B06XNRQHG4"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎March 23, 2017"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 4,387 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#275 in Computer CPU Processors"
            },
            {
                "name": "CPU Manufacturer",
                "value": "AMD"
            },
            {
                "name": "CPU Model",
                "value": "Ryzen 5 1600"
            },
            {
                "name": "CPU Speed",
                "value": "3.6 GHz"
            },
            {
                "name": "CPU Socket",
                "value": "Socket AM4"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Footnotes: 1. Overclocking AMD processors, including without limitation, altering clock frequencies / multipliers or memory timing / voltage, to operate beyond their stock specifications will void any applicable AMD product warranty, even when such overclocking is enabled via AMD hardware and/or software. This may also void warranties offered by the system manufacturer or retailer. Users assume all risks and liabilities that may arise out of overclocking AMD processors, including, without limitation, failure of or damage to hardware, reduced system performance and/or data loss, corruption or vulnerability. RZN-6. 2. AMD Ryzen VR Ready Premium processors are select AMD Ryzen processors that meet or exceed the Oculus Rift or HTC Vive recommended specifications for processors. Other hardware (including graphics cards) and system requirements recommended by Oculus Rift or HTC Vive should also be met in order to operate the applicable HMDs as intended. As VR technology, HMDs and other VR hardware and software evolve and/or become available, these criteria may change without notice. Check with your PC or system manufacturer to confirm VR capabilities. GD-11. *Video Encoding: Compared to the Ryzen 5 1600, the Core i5-7600 achieved 66% (Average of 372/954=63%, 791/1144=69%) the video encoding performance in Handbrake and 65% (171.4/263.0=65%) the performance in Adobe Premiere CC, for an average video encoding performance of 60% relative to the Ryzen 5 1600. Content Creation: Compared to the Ryzen 5 1600, the Core i5-7600 achieved 68% (1618.1/2371.9 =68%) the performance in POVRay, and 57% (651.8/1144.1=57%) the performance in Cinebench, for an average content creation performance of 63% relative to the Ryzen 5 1600. 1080p gaming: Compared to the Ryzen 5 1600, the Core i5-7600 achieved 102% the performance in The Division, 135% the performance in Alien: Isolation, 103% the performance in Battlefield 1, 104% the performance in Ashes of the Singularity, 92% the performance in Civilization 6, 103% the performance in Doom, 121% the performance in Deus Ex: Mankind Divided, 102% the performance in Overwatch, 105% the performance in Mafia 3, 94% the performance in F1 2016, and 105% the performance in Watch Dogs 2, and 118% the performance in Sniper Elite 4, for an average 1080p game performance of 107% relative to the Ryzen 5 1600. VR Performance: Both the Ryzen 5 1600 and Core i5-7600 dropped less than 1% of frames in the Price of Freedom, Serious Sam, and Raw Data game benchmark tests. RZN-57. ** This information represents the views of third parties at https://www.vortez.net/articles_pages/amd_ryzen_5_1400_1600_review,7.html for secure data encryption and VR performance. These third party results have not been verified by AMD. AMD has no obligation to update third party information and will under no circumstances be for any damages resulting from your reliance on this third party content. PCIe is a registered trademark of PCI-SIG Corporation. Other product names used in this publication are for identification purposes only and may be trademarks of their respective companies. 2017, Advanced Micro Devices, Inc., All rights reserved. AMD, and the AMD Arrow logo, Ryzen and combinations thereof, are trademarks of Advanced Micro Devices, Inc.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/997d7c6d-335e-4d5c-92c8-78d5b6a53991._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7a8ee2fb-db38-4601-971d-de3e2beefba0._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b9892748-ae72-4001-8e3b-ec1818c761fb._SR970,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jason Corn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENIZN2QJ6DLTIA62UOJGDPBCGXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OSU9EXOLG9LT?ASIN=B06XNRQHG4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 22, 2018",
                "reviewTitle": "5.0 out of 5 stars Best Budget CPU for Streamers",
                "reviewText": "In my very first desktop computer, I knew I wanted to game and have dual screens so that would mean a CPU with a good amount of cores with fast single core speeds. While these aren't insane single core speeds that Intel has, they do work perfectly. If you like streaming or recording your gameplay, the multiple amount of threads and their quick processing allow you to play games without performance drops. In fact, in all the time I've had this CPU (4 months), I've never had it go above 35% during gameplay, video compressing, or gaming and recording. It has only ever gone over 35% when I decided it would be funny to run 120+ Microsoft Edge tabs on three monitors(which crashed). The stock cooler is also insanely good. I've never had it make any noticeable noise, even doing a slight overclock.The design of the fan is decent, as I wish the AMD text amd logo would be facing upward so you can read it, instead it's placed sideways(but it's a small detail). The wiring is covered by braided plastic and it a decent length to reach most of your motherboard. The packaging is straightforward and the heatsink has preapplied thermal paste which gets mashed and spreads out past the CPU.Good things to note:Great multithreading speeds for multiple tasksOverclockableComes with a great fanSpecs and Settings:Gigabyte B350 Gaming 38GB RAMASUS GTX 1060DP and HDMI ports for 1920x1080 resolutions on both monitors",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Data Master",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV7WDGZNRPFJ7ZTD5TNAM5N5ZDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12TLMO0ABOQG9?ASIN=B06XNRQHG4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2017",
                "reviewTitle": "5.0 out of 5 stars Tons of Cores, tons of FPS, fast encoding, terrific crunching score, and all at a low cost",
                "reviewText": "AMD has done it again (finally!). I bought this processor to replace my i3 4130 which I was using as my primary processor. I have become quite the high performance demanding gamer in the past few years and needed a processor that would handle current rig setup as well as m future one. This chip fits the bill. For a low price of 210, I am able to game with high frame rates, encode 720 and 1080 video in less than an hour at decent quality, and can crunch with WCG grabbing tons of cobblestones and time points for a low wattage envelope of 65w. It comes with its own decent Wraith Spire cooler and is unlocked. Paired with a GTX 1050 mini and both being clocked at stock, I am able to get 60 FPS on most steam and blizzard titles pre 2017 and can go to max settings. I am also able to record gaming sessions without hiccup. Some Early access titles struggle, but I believe it is in the coding and drivers (again just a 1050), and not the 1600's fault. If you are looking to buy this processor and going with an Nvidia card, I recommend going 1060 or higher. The 1050 is definitely a bottleneck, but still holds up quite nicely paired with the 1600. I feel confident that this processor can withstand the test of time and when it finally is ready to retire, I will overclock it to bring new life.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEP67POWGFKC6Q4KEY3QZ7L66AZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJJ999I2FBK22?ASIN=B06XNRQHG4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 5, 2018",
                "reviewTitle": "5.0 out of 5 stars Nice performance, nice price on sale",
                "reviewText": "For 150 bucks, this processor is a nice upgrade from a Core2 Quad. It has 6 physical cores, but performs more like a CPU with 8-9 cores due to simultaneous multi-threading. Fantastic considering a $200 quad core i5 was my best upgrade option not too long ago. Moving from 4 cores/threads to another 4C/4T CPU would not have been near as satisfying as this. Keep in mind, many things will only run as fast as your fastest single core; and current Intel products take the prize there. So if you don't do much mega-tasking or video rendering/streaming/encoding, you might want to look at like a current i3 or even a hyper-threaded Pentium for a snappy system on a budget.For old-time comparison, the 1600 runs like a 4th-gen i7 (4770) if Intel had stuck a couple more cores on the die; or a hair better than a Xeon E5-1650. So maybe don't bother upgrading to this CPU if you already have an i7 less than 5 years old. Yes you can overclock this CPU, but not a huge amount. :-/ Runs games just fine for me, leaving my clunky old Radeon 7870 to be the bottleneck (or sometimes my 75Hz monitor).My 1600 keeps me happy for now, and I look forward to having some good upgrade options for my AM4 board down the road. One more thought: consider supporting the underdog AMD for the sake of competition against Intel. You really don't want Intel to blow them out of the water no matter what your fanboy senses are telling you, or we will all be stuck with expensive options in the future with limited performance increases each year. Have fun waving your fanboy flag then.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "talon7789",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 29, 2019",
                "reviewTitle": "Leagues better than my 8320!",
                "reviewText": "I got to this Ryzen 5 1600 processor from the AMD FX-8320. Double the threads, brand new chipset, new motherboard, new RAM. It was scary installing it, but the Windows 10 system didn't need a reinstall and I only had minor issues with the B350 motherboard having post errors until I reset the CMOS. Overall, this is a blazingly fast processor and has served me well with my 1070 for the past few months. I've never had an issue with FPS on games since I got it, and for that I'm both floored and grateful for the amazing price on this CPU! An amazing beginner's CPU, an intermediate CPU, or even for experts. I installed this with an AIO cooler and the stability skyrocketed with all my programs. This is honestly a mindbogglingly capable processor for $200.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francis Gabriel Gomes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 13, 2019",
                "reviewTitle": "Nice product, Reasonable price.",
                "reviewText": "Just upgraded to ryzen from previous fx series. Although it is from 1st generation but better than fx at least. Of course 2nd & 3rd generation ryzens are more efficient/powerful. However, it can be overclocked to 3.7ghz easily with a B450 motherboard, fast RAM and stock cooler, to get similar performance. Besides, this would be the cheapest 6 core 12 thread processor. When compared with price to performance (comparing to other ryzen processors from 1st generation) it is should be a logical choice. Go for it only if you already have or willing to buy a dedicated graphics card. Without a dedicated GPU your pc wont boot to display screen. If a dedicated graphics card is not in the list then opt for 2200g, 3200g, 2400g etc.........Update: No lag at all. No bottlenecks when gaming. Using a coolermaster hyper 212 instead of stock cooler. Now I can overclock even further (that doesnt mean stock cooler isnt efficient). Stock wraith cooler is great but I like to overclock and test the limits of this CPU. Hence using an aftermarket cooler. Temperature doesnt climb beyond 65 degrees when put under heavy load. Overall worth the money and effort.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "X-NerdX-Nerd",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 5, 2017",
                "reviewTitle": "Bueno Bonito Barato: Tiene el mejor costo para los equipo de alto desempeño",
                "reviewText": "Tiene el mejor costo para los equipo de alto desempeñoBUENO (comparación realizado en el 5 de octubre del 2017):- Sin Overclock (3.20GHz): está entre los 4% CPU más rápidos del mundo (Percentil 96, con CPU mark de 12643)- Con Overclock1 (3.77GHz, 3.0V): está entre los 2% CPU más rápidos del mundo (Percentil 98, con CPU mark de 13941)- Con Overclock2 (3.85GHz, 3.5V): está entre los 2% CPU más rápidos del mundo (Percentil 98, con CPU mark de 14200)- Trabaja con 12 procesos simultáneos (6 procesadores con 2 nucleos cada)- Bajo consumo de energía: Sin overclock (11W minimo; 73W máximo); Con overclock1 (17W mínimo; 105W máximo); Con Overclock2 (21W mínimo, 130W Máximo)BONITO, está diseñado con todas las tecnologías más modernas:- Soporta memoria DDR4: trae canales especializados para optimizar el acceso a las memorias DDR4- Soporta almacenamiento SSD NVMe nativo: trae canales especializados en PCIe para lograr máxima velocidad sin afectar el ancho de banda PCIe- Soporta optimización del consumo de energía por cada núcleo- Soporta realización de Overclock (incremeto de velocidad) en todos los modelos de la categoría RyzenBARATO, comparado con las opciones de la competencia (INTEL):- Por el mismo precio de lo que cuesta un procesador Intel generación 7, tienes un desempeño aproximadamente 40% mejor- Este procesador debe soportar varios años antes de tener que cambiarlo, esto es debido a que su desempeño está entre los 4% más rápidos del mundo (Percentil 94)- Puedes hacer Overclock sin tener que pagar más por una versión \"liberada para Overclock\"- No necesita comprar disipador para hacer Overclock. Ya viene con un disipador \"Wraith Spire\" que tiene buen rendimiento y calidad, pero no trae LED para hacerlo lucir más. Si llegas a comprar un disipador \"CoolerMaster H212 EVO\" solamente mejora la temperatura en 10 Grados Celsis, por lo que se recomienda comprar disipador con refrigeración líquida si vas a invertir en un disipadorCONTRAS:- No trae tarjeta de video integrada, por lo que tienes que comprar por separado una tarjeta de video a su gusto- Si tienes presupuesto ilimitado, el procesador Ryzen no es para ti. En su lugar están los procesadores Intel que tienen mejor desempeño por cada núcleo y consumen más energía elétrica para realizar el mismo trabajo. En el mes de octubre de 2017 está entrando en el mercado el procesador Intel generación 8 que requiere un nuveo tipo de zócalo y tiene desempeño entre 30% a 40% mejor que el Intel generación 7OTROS:- Funciona todas las aplicaciones sin problemas de compatibilidad. Nota: En el primer mes del lanzamiento del procesador Ryzen ocurrió problema de compatibilidad que fue solucionado con actualización en la BIOS de las tarjetas madre- Si ya cuentas con un disipador extra, recomiendo comprar la versión Ryzen 5 1600x (no trae disipador de calor) pero tiene posibilidad de realizar Overclock más alto- La versión Ryzen 5 1600 (6 núcleos) es aproximadamente 30% más rápida que la versión Ryzen 5 1500 (4 núcleos), por lo que si quieres ir por una versión \"más barata\" están los AMD con el mismo zócalo AM4: AMD generación 7 (Athon y A-series) que tienen tarjeta de video integradas- AMD garantiza un Overclock de mínimo de 3.6 GHz en el Ryzen 5 1600, y se puede lograr un valor mayor dependiendo de la suerte (Lotería del Silicone). Utilizando el disipador que viene con el procesador es bastante común que las personas consigan Overclock de 3.7 GHz. Utilizando disipador con refrigeración líquida, algunas personas logran Overclock arriba del 4.0 GHz- Para realizar Overclock se tiene que utilizar tarjeta madre con zócalo AM4 que tiene Chipset B350 ó X370, esto es debido a que el Chipset A320 no permite Overclock",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71B-EgkzlvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sergio Martín",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 27, 2018",
                "reviewTitle": "El mejor procesador calidad-precio",
                "reviewText": "Tras 4 meses de uso puedo decir que es perfecto, el mejor procesador relación calidad-precio. No se queda atrás en ningún aspecto, lo he usado para editar fotos en Photoshop y Lightroom, para editar video en Premiere y para jugar y es muy potente en todos los ámbitos con sus 6 núcleos y 12 hilos, nunca me ha dejado tirado en ningún sentido, puede con todo. Además otra cosa que me encanta de este procesador es la temperatura, generalmente si no estás haciendo nada, con el disipador que viene incluido se encuentra a unos 35-37 grados, a carga media (es decir, navegar por internet, usar Word, etcétera) no sube de los 45 grados y cuanda realizas un uso más intenso con programas de edición y videojuegos se queda a una temperatura de unos 60 grados, es muy pero que muy fresquito, no se calienta casi nada gracias a que el encapsulado viene soldado al silicio. La máxima temperatura que he conseguido lograr con el es de 67 grados con un test de estrés tras unos 15 minutos con el test, y de ahí no subía, y eso que esa situación es prácticamente imposible alcanzarla en una situación real, nunca le vamos a pedir tanto al procesador, por lo que nunca va a llegar a esa temperatura, que ya de por sí es muy baja, y más si la comparamos con las de los procesadores de Intel. Lo que me parece espectacular es que esa temperatura es con el disipador que viene incluido, chapó por el trabajo que ha hecho AMD con este procesador y este disipador. Es que si encima le pones un disipador algo mejor o refrigeración líquida ya alucinas. Además he tenido suerte y mi procesador venía de base a 3.4 gigahercios, cuando indica en Amazon y en el embalaje que viene a 3.2 así que además de tener más potencia tiene más mérito el tema de la temperatura.En resumen, no he tenido ningún problema con él (salvo el tema de las memorias RAM, ya que tengo unas memorias a 3866 megahercios y lo máximo que he sido capaz de ponerlas es a 3333 megahercios y eran bastante inestables, las tuve que bajar a 3200 para que fuesen estables, algo que, sin duda, tiene que trabajar AMD para la próxima generación de Ryzen), ha sido una compra muy acertada y estoy muy contento con este procesador, recomiendo su compra, yo lo volvería a comprar. Excelente trabajo de AMD",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sean F",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 11, 2018",
                "reviewTitle": "Great CPU at a great price",
                "reviewText": "Fantastic price to performance for this AMD Ryzen CPU. For around £150 you are getting 6 cores and 12 threads, which is useful for plenty of tasks including video editing,development and running virtual machines, as well as day-to-day work such as browsing the web or using office suites.It is fully compatible with pretty much all A320/B350/X370 boards straight out of the box without needing any BIOS updates, as it was one of the original Ryzen 5 chips, unlike the newer APUs (namely 2200G and 2400G) which may need a BIOS update first. Installation is fairly straightforward, just release the latch on the motherboard, carefully place the CPU into the socket, and line it up with the golden triangle so you get it in the correct way around. As it relies on the pins at the bottom, be careful when handling it so as to not damage any pins - hold it around the sides if possible.Once installed, it comes with the superb \"Wraith Spire\" cooler (included in the price), which does a good job of keeping the CPU at cool temperatures without the need for a third-party solution, and the thermal paste comes pre-applied. This is a little trickier to install depending on the motherboard, but it is 4 screws and if you cross (do one corner then the opposite) which ones you tighten, it is easier and prevents damage from putting too much pressure on one area. Once installed and plugged into the CPU fan header, it idles at around 33 degrees celcius on my machine (which is a good temperature for a stock cooler), however your own results may vary slightly. Even with lots of programs, including a game and a virtual machine running, it only reached 55 degrees celcius, so there will be some room for a mild overclock using this cooler, provided you are using a B350 or X370 chipset. It also runs quietly, you can barely hear the fans even when they are spinning fully.The performance of the processor itself is great, it'll match or beat most Intel i5 offerings (and even some i7 chips), which is excellent considering the noticeable price difference and the better stock cooler that AMD provides. For multi-core workloads (such as video editing) it works perfectly, and while the single-core performance isn't quite as good (this isn't really too much of an issue), once software can fully optimise all of the cores, it'll perform drastically better. It also handles gaming well, paired with even a 750Ti it can handle games such as Rocket League on High/Ultra settings at 70-100FPS, so paired with a better GPU will yield great results in even modern triple-A titles.Be sure to download the Ryzen Master software from AMD, where you can monitor the temperature accurately and adjust CPU settings, as well as the AMD Ryzen Chipset Drivers, which include a Windows power plan which is optimised for use with Ryzen CPUs.In conclusion, I couldn't be happier with this Ryzen 5 1600. Smashes competition in terms of price to performance, includes a great cooler and runs pretty much anything you can throw at it with ease. I would highly reccommend this processor.",
                "reviewVotes": "90 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}