{
    "remaining_requests": 43952,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Intel-i9-13900KF-Gaming-Desktop-Processor/dp/B0CSCRWFGZ",
    "body": {
        "name": "Intel Core i9-13900KF Gaming Desktop Processor 24 cores - Unlocked & GIGABYTE X670 AORUS Elite AX",
        "price": [
            "68 options from $419.90",
            "1 option from $789.15"
        ],
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Intel-i9-13900KF-Gaming-Desktop-Processor/dp/B0CSCRWFGZ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C1ZW39SV"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BCFM3CJ4",
                "variationName": "Style",
                "variationValue": "Processor",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CSCRWFGZ",
                "variationName": "Style",
                "variationValue": "Processor + X670 AORUS Elite AX",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "30",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/416p9HJferL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41 w4CJQY0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bxNtkzbzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61Np51dVIOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51eJvRzCdvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41N3jKN7ZYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41psEh8wiGL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Intel Store",
            "link": "https://www.amazon.com/stores/Intel/page/77AE997E-6B23-4898-9068-FC16CF3B77D9?ref_=ast_bln"
        },
        "brand": "Intel",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 348,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Product 1: Stream, create, and compete at the highest levels with industry leading features and the latest hybrid architecture",
            "Product 1: 24 cores (8 P-cores + 16 E-cores) and 32 threads",
            "Product 1: Up to 5.8 GHz unlocked. 36M Cache",
            "Product 1: Discrete graphics required",
            "Product 2: 5-Year Warranty",
            "Product 2: AMD AM5 Socket: Supports AMD Ryzen 7000 Series Processors",
            "Product 2: DDR5 Compatible: 4SMD DIMMs with ECC/Non-ECC Unbuffered Memory",
            "Product 2: Commanding Power Design: Direct 16 plus2 plus2 Phases Digital VRM Solution, 8-Layer 2X Copper PCB"
        ],
        "description": "Intel Core i9-13900KF Gaming Desktop Processor 24 cores (8 P-cores + 16 E-cores) - Unlocked13th Gen Intel Core i9-13900KF desktop processor, without processor graphics. Featuring Intel Adaptive Boost Technology, Intel Thermal Velocity Boost, Intel Turbo Boost Max Technology 3.0, and PCIe 5.0 & 4.0 support, DDR5 and DDR4 support, unlocked 13th Gen Intel Core i9 desktop processors are optimized for enthusiast gamers and serious creators and help deliver high performance. Discrete graphics required. Thermal solution NOT included in the box. Compatible with Intel 700 Series and Intel 600 Series Chipset based motherboards. 125W Processor Base Power. Chipset Compatibility: Find compatible motherboards by accessing the Intel® Product Compatibility Tool, click Desktop and Workstation Processors , and choose the processor to find available compatible motherboards and other related information.GIGABYTE X670 AORUS Elite AX (AM5/ LGA 1718/ AMD/ X670/ ATX/ 5 Year Warranty/ DDR5/ Quad M.2/ PCIe 5.0/ USB 3.2 Gen2X2 Type-C/AMD WiFi 6E/ 2.5GbE LAN/Q-Flash Plus/M.2 EZ-Latch/Gaming Motherboard)5-Year Warranty AMD AM5 Socket: Supports AMD Ryzen 7000 Series Processors DDR5 Compatible: 4*SMD DIMMs with ECC/Non-ECC Unbuffered Memory Commanding Power Design: Direct 16+2+2 Phases Digital VRM Solution, 8-Layer 2X Copper PCB Cutting-Edge Thermal Design: Advanced Thermal Design, M.2 Thermal Guard, Ultra Durable Armor Next Gen Connectivity: PCIe 5.0, Quad NVMe x4 M.2, USB-C, BT 5.2 M.2 EZ-Latch: M.2 Connectors with a Quick Release & Screwless Design Fast Networking: 2.5GbE LAN, AMD WiFi 6E 802.11ax Dynamic Audio: 8-Ch HD Audio, Audio Noise Guard, High-End Audio Capacitors Fine Tuning Features: RGB FUSION, Supports Addressable LED & RGB LED Strips, Smart Fan 6, Multi-key for Reset/RGB Switch/Direct to BIOS/Safe Mode, Q-Flash Plus - Update BIOS without installing CPU, Memory, and GPU. A new era is here. The X670 AORUS ELITE AX supports AM5 Processors and features and unparalleled performance. GIGABYTE X670 motherboards come with upgraded power design, high grade storage standards, and outstanding connectivity that enables you to optimize your performance.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1/000-0000000-8675309?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2/000-0000000-8675309?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3/000-0000000-8675309?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4/000-0000000-8675309?ie=UTF8&node=17923671011"
            },
            {
                "name": "CPU Processors",
                "link": "https://www.amazon.com/CPU-Processors-Memory-Computer-Add-Ons/b/ref=dp_bc_aui_C_5/000-0000000-8675309?ie=UTF8&node=229189"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "‎Intel"
            },
            {
                "name": "ASIN",
                "value": "‎B0CSCRWFGZ"
            },
            {
                "name": "Date First Available",
                "value": "‎January 15, 2024"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 348 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#589 in Computer CPU Processors"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Key Specs Processor base power: 125W Intel Smart Cache: 36MB Motherboard compatibility: 600 and 700 series Total CPU PCIe lanes: 20 Maximum Memory Speed: DDR5 5600, DDR4 3200 Unlocked & overclockable?(2): Yes Discrete graphics card req? Yes Intel Turbo Boost Max 3.0?: Yes",
                "media_link": []
            },
            {
                "media_text": "Key Features Game and multitask without interruption. 24 cores (8 P-cores + 16 E-cores).32 threads.Push your in-game settings without worrying about background tasks slowing you down.Up to 5.8 GHz Max Clock Speed.(1)Unlocked and overclockable.(2) Designed for the needs of today’s gamers. The latest version of performance hybrid architecture will push your gameplay beyond performance, giving you the power to do it all.Performance-cores unleashes the capability to optimize the latest games and gaming software.Efficient-cores provides multitasking power to work, play, and most importantly game together. Personalize your PC. Support for both DDR4 and DDR5 gives you control over your memory configuration.(4)Support for Thunderbolt 4 technology offers a simple and fast way to connect peripherals.Connect quickly and without interference with support for Intel Killer Wi-Fi 6/6E (Gig+).(5)Enhanced overclocking for both sets of cores allows you to customize your performance.(2) ·",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d0262fe8-d315-4be8-9110-9dc3de1269e4.__CR0,0,500,500_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6bef29c6-3b24-4371-8b55-b38ca53d05ff.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a3e290d0-d2bf-49ea-be47-ebfcc148036a.__CR0,0,1080,1080_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/711d281a-8a72-4cc3-be6b-4c6d91801c0b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d0262fe8-d315-4be8-9110-9dc3de1269e4.__CR0,0,500,500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6bef29c6-3b24-4371-8b55-b38ca53d05ff.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a3e290d0-d2bf-49ea-be47-ebfcc148036a.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e453738a-9f23-46e4-8c32-ad640497c08a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/56e987ca-d48f-48fc-a936-8b9915e3663d.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "chris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGV3GYRHNCR4CWA4FV7IVJWQDW4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CV17273FW4NV?ASIN=B0CSCRWFGZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Crazy Fast Processor",
                "reviewText": "The Intel Core i9-13900KF, the latest-gen gaming desktop processor, is nothing short of a powerhouse when it comes to delivering unparalleled performance for gamers and enthusiasts alike. With 24 cores (8 P-cores + 16 E-cores) and unlocked overclocking potential, it redefines what you can expect from a gaming processor.Performance (★★★★★): The Intel Core i9-13900KF is an absolute beast when it comes to performance. With its combination of P-cores for high single-threaded performance and E-cores for multi-threaded tasks, it effortlessly handles anything you throw at it. Whether you're gaming, streaming, or running resource-intensive applications, this processor delivers smooth and lag-free performance.Overclocking (★★★★★): If you're an overclocking enthusiast, this processor is a dream come true. Being unlocked, it provides you with the flexibility to push its limits further. With proper cooling and tweaking, you can extract even more performance, making it a top choice for those who love to fine-tune their system.Gaming (★★★★★): Gaming with the Intel Core i9-13900KF is a sublime experience. It excels in delivering high frame rates and low latency, ensuring you get the most out of your gaming sessions. It handles modern AAA titles with ease, and thanks to the E-cores, it can handle background tasks like streaming without breaking a sweat.Thermal Design (★★★★★): While this processor is a powerhouse, it's important to note that it can generate significant heat when pushed to its limits. To fully unleash its potential, investing in a high-quality cooling solution is essential. A well-cooled system will ensure the CPU operates at its peak performance without thermal throttling.Value for Money (★★★★☆): There's no denying that the Intel Core i9-13900KF comes with a premium price tag. However, for those who demand the absolute best in gaming and multitasking performance, it's worth every penny. It's an investment in a system that will remain relevant and powerful for years to come.Compatibility (★★★★☆): It's important to note that this processor requires a compatible LGA 1700 motherboard, which may necessitate a motherboard upgrade if you're coming from an older system. Additionally, it doesn't include integrated graphics, so a dedicated graphics card is a must.In conclusion, the Intel Core i9-13900KF is a game-changing gaming desktop processor that sets new standards in performance and overclocking capabilities. Its 24 cores, unlocked nature, and exceptional gaming prowess make it a top choice for gamers and enthusiasts who demand the best. While it comes at a premium price, the investment is justified by the unparalleled performance and future-proofing it offers. If you're looking to build the ultimate gaming rig, the Intel Core i9-13900KF should be at the top of your list.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Customer 2023",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2SCRCAFTZN23KPFQO7PY2FZAQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14N9OFWE9BI0M?ASIN=B0CSCRWFGZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Fast",
                "reviewText": "It's fast, and works better than my space heater for keeping the desk undersides warm. Too warm, really.UPS says the computer is using 575 watts during the CPU stress test, about 175 watts at idle. TPU is 253w ... so with the 80%+ PS inefficiency, 300w makes sense.When using the 3080 GPU with the i9 CPU ... well, the heat coming from the case is similar to a 1000w space heater, really. Now reconsidering my choice for only an 850w PS. 1000w would probably be a better idea for this beast.As for speed. That's relative. But I am coming from an i9-7900x, and this is 3x faster, and it feels 3x faster. Memory is slower, (4ch vs 2ch) -- so I had to use DDR5-6400 to get a similar memory bandwidth. Lost some latency, but the overall effect is the thing still seems plenty fast.I dislike the way the CPU case instantly jumps to 100c -- no thermal mass what-so-ever in the CPU case. Or I have a bad CPU without whatever filler Intel puts between the die and the case.In any case, Intel needs to allow for more thermal mass to reduce these thermal stresses of instantaneous temp changes. Has to be stressing the silicon and lead to more thermal stress failures.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Construction Tech.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5CE6HLFZPYXLJ6JQNBDJ7YAKIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16ZGWHCL44GSO?ASIN=B0CSCRWFGZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2023",
                "reviewTitle": "5.0 out of 5 stars I have no complaints",
                "reviewText": "Works like it should and I have no complaints. It is very fast and I love it so far.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patrick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVC2VIP5XVGXMLJEZOSC4OK75RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LKK2ZT8NS6VZ?ASIN=B0CSCRWFGZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Wow!",
                "reviewText": "Best investment I ever made when it comes to a gaming/streaming pc. I’m a pretty hardcore gamer and this cpu is the most amazing thing I’ve ever had when it comes to a high end build. I paired it with a rtx 4080 and needless to say this cpu doesn’t disappoint. Now, this review isn’t about pricing because we all know this cpu is expensive and honestly if you’re only gaming then maybe a 13600k would suffice. However, if you are streaming, photo editing, video editing etc…. Then this is the right cpu for you. I’m able to snap together YouTube videos in seconds NOT minutes or anywhere near it. I’m able to stream and game at the same time with less than a 10 fps loss while gaming and streaming on the highest quality settings. My wife loves it for photo editing bc everything is just perfect. Only downside is that it does run hot but you can get a good 240-360mm aio that will tame this cpu with ease. All the issues I use to have on the 10th gen platform are completely irradiated now that I own this cpu. I did go with the ddr5 and honestly for me it runs better than ddr4. Tech reviewers say otherwise but from personal experience ddr5 is the future NOW. Performance issues I use to have with ddr4 and weaker cpus are just gone now. I can do so much and this cpu doesn’t break a sweat. For instance, ddr4 for whatever reason sometimes wouldn’t work with xmp although it was advertised. I like to tinker so it wasn’t an issue BUT sometimes it’s just nice to do a single click and let it dial itself in and that’s what ddr5 has done for me. I’ve used several different sticks with this cpu and from all of them I went with Corsair vengeance. Honestly, this is the most bada$$ cpu I’ve ever owned or seen in a personal system of mine. If you have the money I couldn’t recommend it enough. Everybody has different needs and in my case I needed this cpu. It hasn’t disappointed. As for amd, if you want the bugs and issues go ahead and grab one of those cpus and tell me how that goes. This cpu can do everything and more. Hope this review helps anybody who is on the edge about getting this or something else.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "emmanuel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 16, 2024",
                "reviewTitle": "Perfect",
                "reviewText": "No issue.work well handle all task with ease. Smooth and stay cool with à big noctua dh15 at 46degree",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TOMAS JIMENEZ HERNANDEZ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 14, 2023",
                "reviewTitle": "Es bueno, cumple con las expectativas",
                "reviewText": "Es un procesador muy poderoso y se calienta por lo tanto vas a necesitar una buena refrigeración liquida así que no ahorres en la refrigeración de este procesador.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "I R ALGAR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 30, 2023",
                "reviewTitle": "thank you its great",
                "reviewText": "thank you its great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andy Chiem",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on August 1, 2023",
                "reviewTitle": "Amazing Performance",
                "reviewText": "The Intel Core i9-13900KF is an absolute beast! From the moment I upgraded to this 13th generation CPU, everything has been running very smoothly. My DaVinci Resolve playback on 4K is now smooth with zero choppiness or freezing, a remarkable improvement compared to my old setup. I'm blown away by its speed and performance, making it a game-changer for my work and entertainment. Highly recommend this powerhouse CPU for anyone seeking top-notch performance! 💻🔥",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shawn t",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 14, 2023",
                "reviewTitle": "I9 13900kf",
                "reviewText": "Well its alright, it doesn't have a bult in gpu. So , you will need a video card . It maybe easy to troubleshoot with a gpu built in. I think you would need at least a 1200 psu to get a full overclock . I have a 1000 watt psu but I was only able to get it to 5.5 . On full load it use's 900 watts of power. I can't over clock it to 5.6 gigahertz. I think I should of got the K version instead of the KF. Having said that, 24 cores pretty amazing. I will give a i9 13900kf a 5 star rating. I can play all my games at 1440p on ultra settings and get a 100fps with my rtx 3080 12gb . There is no stuttering or anything, everything is butter smooth.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}