{
    "remaining_requests": 43912,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/AMD-FD8350FRHKBOX-FX-8350-8-Core-Processor/dp/B009O7YUF6",
    "body": {
        "name": "AMD FD8350FRHKBOX FX-8350 FX-Series 8-Core Black Edition Processor",
        "price": "$188.02",
        "originalPrice": "",
        "rawPrice": 188.02,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/AMD-FD8350FRHKBOX-FX-8350-8-Core-Processor/dp/B009O7YUF6",
        "soldBy": {
            "sellerID": "AJ1BUG50UXZKY",
            "name": "iT Hardware",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AJ1BUG50UXZKY&asin=B009O7YUF6&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B017DYKCNA"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/511KbpvD7fL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41LRsZ4 QPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VFrVEYw1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51reiyPL dL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/83fb2f73-dd5e-52c8-9bb8-8e6fb756921c/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71KP2E70D4S.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/71KP2E70D4S.pdf"
        },
        "byLineInfo": {
            "name": "Visit the AMD Store",
            "link": "https://www.amazon.com/stores/AdvancedMicroDevices/page/8D05F933-0F55-46A5-A940-3711A335A383?ref_=ast_bln"
        },
        "brand": "AdvancedMicroDevices",
        "merchantInfo": "Ships from and sold by M&D Discounts.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 6583,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$6.34 delivery February 16 - 22.",
            "$4.65 delivery February 21 - 26.",
            "Or fastest delivery Wednesday, February 14. Order within 1 hr 39 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Platform: Desktop",
            "Frequency: 4.0/4.2ghz (base/overdrive)",
            "Cores: 8",
            "Cache: 8/8mb (l2/l3)",
            "Socket type: am3+",
            "Power wattage: 125w"
        ],
        "description": "AMD FX 8 Core Processor, Unlocked, Black Edition. AMD's next generation architecture takes 8 core processing to a new level. Get up to 24 percent better frame rates in some of the most demanding games, at stunning resolutions. Get faster audio encoding so you can enjoy your music sooner. Go up to 5.0 GHz with aggressive cooling solutions from AMD. What Is In The Box: CPU, Heat Sink and Fan(E3), Thermal Paste is already applied on the Heat Sink, FX Bezel Sticker, Certificate of Authenticity, Installation Instruction and a 3 Year Warranty and Instruction Manual",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "CPU Processors",
                "link": "https://www.amazon.com/CPU-Processors-Memory-Computer-Add-Ons/b/ref=dp_bc_aui_C_5?ie=UTF8&node=229189"
            }
        ],
        "productInformation": [
            {
                "name": "Processor",
                "value": "‎4 GHz amd_fx"
            },
            {
                "name": "Brand",
                "value": "AMD"
            },
            {
                "name": "Item model number",
                "value": "‎45646788"
            },
            {
                "name": "Item Weight",
                "value": "‎1.55 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎5.5 x 5 x 2.8 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎5.5 x 5 x 2.8 inches"
            },
            {
                "name": "Color",
                "value": "‎black"
            },
            {
                "name": "Processor Brand",
                "value": "‎AMD"
            },
            {
                "name": "Number of Processors",
                "value": "‎8"
            },
            {
                "name": "Computer Memory Type",
                "value": "‎DDR3 SDRAM"
            },
            {
                "name": "Department",
                "value": "‎cpu"
            },
            {
                "name": "Manufacturer",
                "value": "‎AMD"
            },
            {
                "name": "Language",
                "value": "‎English"
            },
            {
                "name": "ASIN",
                "value": "‎B009O7YUF6"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎October 23, 2012"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 6,583 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#195 in Computer CPU Processors"
            },
            {
                "name": "CPU Manufacturer",
                "value": "AMD"
            },
            {
                "name": "CPU Model",
                "value": "AMD FX"
            },
            {
                "name": "CPU Speed",
                "value": "4 GHz"
            },
            {
                "name": "CPU Socket",
                "value": "Socket AM3+"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "AMD FD8350FRHKBOX FX-8350 FX-Series 8-Core Black Edition Processor AMD FX 8-Core Processor, Unlocked, Black Edition. AMD's next-generation architecture takes 8-core processing to a new level. Get up to 24% better frame rates in some of the most demanding games, at stunning resolutions. Get faster audio encoding so you can enjoy your music sooner. Go up to 5.0 GHz with aggressive cooling solutions from AMD. What Is In The Box: CPU, Heat Sink and Fan(E3), Thermal Paste is already applied on the Heat Sink, FX Bezel Sticker. Features- 32nm Vishera 125W 8MB L3 Cache 4 x 2MB L2 Cache",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/9fa7003c-9e26-4a33-b657-26d8399d67e5._SR285,285_.jpg"
                ]
            },
            {
                "media_text": "AMD FX Processors unlock maximum, unrestrained processing performance for extreme responsiveness Maximum Performance - The industry's only 8-core desktop processor - Overclock with easy to use AMD Overdrive technology and AMD Catalyst Control Center software suites - Supreme power available from virtually every core configuration - also available in 6- and 4-core variants - Aggressive performance for mega-tasking and intensive applications like video editing and 3D modeling Innovative Architecture - The industry's first and only native 8-core desktop processor for unmatched multitasking and pure core performance with \"Bulldozer\" architecture - New 32 nanometer die shrink designed to reduce leakage for improved efficiency, increased clock rate headroom and improved thermals - Can deliver cores and performance you need without raising the power requirements HyperTransport Technology -One 16-bit link at up to 5600MT/s - Up to 8.0GB/s HyperTransport I/O bandwidth; Up to 16GB/s in HyperTransport Generation 3.0 mode - Up to 37GB/s total delivered processor-to-system bandwidth (HyperTransport bus + memory bus) AMD Virtualization (AMD-V) Technology with IOMMU - Silicon feature-set enhancements designed to improve the performance, reliability and security of existing and future virtualization environments by allowing virtualized applications with direct and rapid access to their allocated memory. - IOMMU is an extension to AMD64 architecture to support address translation and access protection on DMA transfers - Security for User Level application and Virtual Machine guest operating system - Address translation and access control",
                "media_link": []
            },
            {
                "media_text": "Transform your PC into a multimedia powerhouse Take your PC's megatasking abilities to extreme levels with the first native 8-core desktop processor built with dynamic, tuneable performance to handle multiple intensive apps without breaking a sweat. - Advanced 3D gaming - Complex 3D modeling - HD video editing",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/fb687075-c7ba-4af1-98d0-f34185b83e99._SR300,300_.png"
                ]
            },
            {
                "media_text": "Get more with the AMD FX Series Processor in your system Enjoy the highest clocks and the most cores you can get on a consumer desktop PC with the AMD FX Series Processor family, from the company behind proven high-performance processors in the PlayStation 4 and Xbox One gaming consoles, and Radeon graphics cards. Featuring a 220 Watt TDP, the AMD FX Series processors have special system requirements including a robust liquid cooling system.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/00572a45-7407-4adb-83ea-8156ec7704bc._SR285,285_.png"
                ]
            },
            {
                "media_text": "Piledriver microarchitecture Piledriver microarchitecture is the second generation of AMD Bulldozer microarchitecture. The internal core structure has been modified for higher frequencies even without any changes in the manufacturing process. Piledriver has a more precise branch predictor and a larger instruction window with ISA extensions FMA3 and F16C. The execution units acquired an enhanced scheduler and learned to process individual instructions faster, such as integer and floating-point division. And Piledriver microarchitecture delivers higher power efficiency compared with Bulldozer microarchitecture. Amazing instruction capabilities Like Bulldozer, Piledriver has some amazing instruction capabilities. Advanced Vector Extensions (AVX) increase parallelism tailored for scientific and 3D applications that use heavy floating point calculations. Floating Point Vector Multiply-Accumulate improves throughput and performance on many vector functions (integer and floating point). Advanced Encryption Standard noticeably increases performance on the latest encryption applications like TrueCrypt and benchmarks like PCMark. Integrated DRAM Controller with AMD Memory Optimizer Technology AMD FX Vishera Processor features a high-bandwidth, low-latency integrated memory controller that supports faster and low voltage memories and provides new Pre-Fetcher improvements and direct communications to each core in Dual-Core module (APIC registers in each core).",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/9fa7003c-9e26-4a33-b657-26d8399d67e5._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/fb687075-c7ba-4af1-98d0-f34185b83e99._SR300,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/mg/00572a45-7407-4adb-83ea-8156ec7704bc._SR285,285_.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Eddie B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEROB2Z4ZU7HADYCAFOQ5Y7IDPUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24WCTZQ9V9MZ6?ASIN=B009O7YUF6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 8, 2013",
                "reviewTitle": "5.0 out of 5 stars Overclockable monster (5Ghz!) that tears games and applications apart",
                "reviewText": "JUNE 12, 2013 UPDATEI've had this CPU for going on four months now. It's still rocking it! Runs the latest \"Metro Last Light\" with a breeze. TO fixing my heating issues I mention below, I have upgraded the fans on my radiator to the Corsair SP120 high performance fans. As of now I have this thing running at exactly 5018Mhz stable right now. Also over time I experimented with RAM. Believe it or not, decreasing my RAM speed actually gained me some FPS in all of my games (its running slightly below 1600Mhz now). I recommend doing FPS benchmarks if you are aiming for gaming with this. Also I wanted to add in my last Power Supply blew up on me. I am now using the gold rated Corsair HX750 that seems work better with this CPU overclocked in terms of heat/stability.Let me skip all the BS. This is a BEAST of a CPU! I've had an AMD Phenom II x6 1045t for the past year now. Although I loved the 1045t CPU, it simply wasn't the greatest for gaming. My stock speed was 3.9Ghz and I overclocked it to 4.5Ghz via the turbo, but with turbo on the Phenom II chips, only three cores would activate. I also was gifted recently an XSPC Raystorm rs360 liquid cooling kit and with that high end cooling I simply wanted the best overclockable chip out there.For about three month's I eyeballed this CPU up on various websites. I wanted it desperately, but I had a few issues and asked myself the following questions. Was it a big enough upgrade over the 1045t? Was it worth buying over the cheaper 8320 model? Lastly should I consider saving up for an intel system instead because of AMD's rocky future in the CPU world (reports say the excavator models are pushed back to 2014 at least)?I took the plunge - I ordered this CPU and could not be happier. The base speed of 4Ghz is awesome, it's nice to see something like that right out of the box. Furthermore the overclockability of this chip is absolutely astounding. You can overclocked it to the Moon assuming you have proper cooling. With the Raystorm rs360 I was able to get this chip to a stable 5Ghz, liquid cooling the CPU and the VRM's on my motherboard.Overclocking is nothing without performance though - how does the CPU perform? Excellent! I got a very noticeable framerate increase in all my games. Crysis 3 I can run completely maxed out with msaa on medium at 60fps (which some intel users can't even handle :o)Some minor pet peeves/issues with this CPU:1) If you're doing overclocking, you will absolutely need a custom cooler. This is a very power hungry, very hot CPU at overclocked speeds. This thing has scarily overheated on me a few times already, I've gotten this to a stable 5Ghz, although I can run it at speeds of up to 5.4Ghz it simply gets too hot at anything else. Although the stock cooler is actually impressive having copper on it, it's still not going to do the job. Here's what I recommend per the speeds you are trying to reach based on my own experience and from what I've read on the web:- Coolermaster Hyper 212 EVO or similar: 4.6Ghz- Closed loop cooler (such as the h100i): 4.8Ghz- Custom cooling kit: 5Ghz+- At least a 600w PSU for anything above (this thing consumes alot of power overclocked)2) AMD STILL SUCKS WITH HIGH SPEED RAM. If you're overclocking this thing even slightly, good luck getting the specified 1866Mhz RAM to work with it. I can only run mine at around 1700Mhz. I tried two modules at 8GB and four modules at 16GB. Could never get this to stably run 1866Mhz, even at stock CPU speeds. If you'r buying RAM stick with a 1600Mhz kit.Other than the power/heat issues and the RAM, this is a great CPU. I paid for a $200 CPU and it felt like I got what I paid for performance wise. Vs. Intel you will see alot of users complain that the \"per core\" performance isn't as good, and than an Intel i5 3550k will outperform this. Personally I don't give a crap. I'm not reverting my whole system over to Intel just because some silly benchmarks are slightly better. Besides the multi-threading of this CPU will blow away an i5, especially in DX11 games which do utilize all 8 cores.One more thing - vs the AMD 8320 I think this is a much better buy - $10-20 more and you're getting a CPU that's going to be much better in the overclocking department and the increased speeds are going to be much better in gaming. Overall definitely worth the money. Great CPU that will last years to come and AMD's future is rocky if you're waiting for the \"next\" best thing I think you should just go with this...My build:8350 @ 5Ghz, 1.5v core, 250Mhz bus speed, 20x CPU multiplierGigabyte 990FXA-UD3XSPC Raystorm rs360 water coolingPrimoflex tubing w/ deionized waterEnzotech wmst-81 VRM Water BlockG Skill Ares 1866Mhz (4x4) 16GB RAM (@ 1700Mhz)MSI Radeon Twin Frozr III 7950 overclockedCorsair Force 120GB SSDThermaltake 600W PSULG Blu Ray reader/writerNZXT Phantom Full Tower case (white)",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tarmgar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQHSTY7FG3M26YUQ5X2JFI2JIJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX5M7K7BSM868?ASIN=B009O7YUF6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 28, 2014",
                "reviewTitle": "5.0 out of 5 stars From Phenom II x4 965 BE to This.",
                "reviewText": "I decided to buy this CPU because my Phenom II x4 965 BE has aging architecure and it was starting to show in more modern games. Yes, it can still keep up FPS-wise, but stuttering is there, and that's annoying to a gamer. So, I got this. I had my 965 clocked to 3.8 pretty much its whole life. And the 8350 is clocked stock to 4.0. Night and day difference. Don't let the 200mhz clock difference fool you, if you have your 965 clocked to that (most everyone does), it's seriously night and day.Although the FPS is of course higher with the 8350, the stuttering is not there anymore. And it doesn't bog down. Heavy AI based game put strain on your CPU, and I love to play Men of War: Assault Squad. This CPU improved that drastically. Yes, the 965 can keep 60 FPS in games a lot, but with the 8350, there's hardly any of no dips in the fps at all. Diablo 3 is a prime example with max settings, this thing blazes through it.Now, with temperatures. I have this thing setup with a Cooler Master Hyper 212+ with 2 Cooler Master 120mm 2000rpm fans hooked up to the PSU to keep them at high speeds all the time. My idle is at 15-16c and video game load it's 30c. Compared to the 965 which ran at 34c idle and 45c under gaming load. Always keep in mind that AMBIENT TEMPERATURE is important to what your CPU temperature is going to be! I like to keep my room around 77F to get these temperatures. With the AC off and this CPU heating my room to 80 within an hour, temperatures rise to 25c idle and 34c under load. Although the FX CPUs run cooler, they get A LOT hotter than the Phenoms. They just spread the heat better to the Heatsink than the Phenoms did. Oh, and throw away the stock cooler. Save yourself the worry and get an aftermarket HSF setup with a push-pull if you can with your case or a water cooling setup. Extend the life of the CPU. Sorry for the long review, but anyways:Pros:-High stock clock and easily overclockable-Disperses heat very well through aftermarket Heatsink(never tried stock, too many reviews against it)-8 cores for super multitasking, yaaaaay!-Can easily play new games at 60fps at max settings when paired with a good GPU.-Very affordable for its performance it gives.-Got it for $179-Finally got something to replace my aging Phenom II x4 965 BE :D.Cons:-Still can't keep up with any of Intels high end CPUs-Will heat up a room in a jiffy with a case that moves a lot of air-Garbage stock HSF for gaming.-ZERO protecion for the pins on the CPU in the retail box. It actually worried me quite a bit. The CPU is just snapped into plastic holders. My other CPUs usually came with a type of foam for the pins to contact into just in case.My build:Cooler Master HAF X(Blue Edition) w/max fans.Seasonic SS-760XP2 760W, 80 PLUS PLATINUMASRock Fatal1ty 990FX KillerAMD FX-8350(at stock clock) w/ Cooler Master Hyper 212+ w/push-pullGigabyte Radeon HD 7970 OCADATA Gaming Series 8GB(motherboard specified clock)ASUS DRW-24F1ST CD DRIVEASUS VX238H Monitor @1080pLogitech G230 Stereo Gaming HeadsetLogitech G15 KeyboardLogitech M510 MouseMicrosoft Windows 7 Home Premium 64-bitSteelseries StarCraft II: Wings of Liberty Gaming Mousepad",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Oberlix",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 4, 2022",
                "reviewTitle": "Wem ein Intel zu teuer ist wird hier fündig. Nicht für Windows 11 geeignet.",
                "reviewText": "Ich habe diesen Prozessor nun seit 2015 in meinem PC am Start und denke, dass ich eine Bewertung auf Langzeiterfahrung verfassen kann.Kurzfassung für alle Eiligen: Der Prozessor macht auch heute noch Problemlos alle Spiele mit ohne Probleme. Wichtig: Windows 11 unterstützt diesen Prozessor nicht!Auch wenn ich nicht weiß was die im Hause Microsoft rauchen...Hier die ausführliche Fassung:Auch heute im Jahr 2022 macht der Prozessor ohne mühe auch die neusten Games ohne zu klagen auf höchsten Einstellungen mit.Im Spielbetrieb habe ich auch im Sommer unter Volllast keine höheren Temperaturen als 55 Grad gemessen. im Normalbetrieb 20-24 Grad.Diese Werte werden selbstreden nicht mit dem mitgelieferten Kühler erreicht.Wer diesen verbaut und ein Spiel unter Volllast fährt riskiert den Prozessor zu beschädigen, da eine Überhitzung vorprogramiert ist.Ich selbst habe 2015 einen Dark Rock TF verbaut und bin bis heute mehr als zufrieden mit dieser Lösung.Es gibt und gab immer den Glaubenskrieg zwischen Intel und AMD Fans hier meine Meinung:Ich hatte vorher auch immer nur Intel und dies war mein erster AMD Prozessor und ich kann als Ottonormalnutzer(Games, Filme, Streamen etc..) keine gravierenden Vor oder Nachteile feststellen.Würde mich also bei einem Neuaufbau des PCs bei entsprechendem Preis wieder für ein Produkt von AMD entscheiden. Wie gesagt ich hatte seit 2015 keine negativen Erlebnisse mit dem Prozessor.Ich denke AMD hängen mangelhafte Produkte aus ihrer Anfangszeit und dem entsprechenden Ruf bis heute nach. Vergleichbar mit Opel und dem Rost der 70er 80er Jahre.Wichtig wäre noch, dass Windows 11 diesen Prozessor nicht unterstützt!Auch wenn man sich freilich fragen darf, was im Hause Microsoft geraucht wird: Schaut euch gerne die Liste von unterstützten Prozessoren an: Da sind einige darunter, die weit weniger Leistung haben.Fazit: Wer kostengünstig einen leistungsfähigen Prozessor sucht und nicht sofort auf Windows 11 umsteigen möchte ist hier noch immer gut ufgehoben.Abschließend sei noch zum Thema Windows 11 gesagt: Hier muss auch keiner Panik haben, denn Microsoft sichert Updates für Windows 10 noch bis zum 14.10.2025 zu. Bis dahin kann man dann auch ruhig einen PC mit diesem Prozessor nutzen.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "anne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 5, 2020",
                "reviewTitle": "Amazing for it's time!",
                "reviewText": "You were one of the lucky ones to have bought this back when it was first released. In all honesty, this chip still run's today's games!But, DO NOT BUY OR upgrade now as ryzens & better are out.About the CPU?This CPU plays well in 1920x1080 GTX 1660 AMP todays video cards in games likeMonster Hunter World 60fps with about 70% CPU utilization at 4.2Ghz or higherThe Division 2GTFORoad RedemptionKilling floor 2FortniteResident evil 2 remakePretty much any game released yesterday with the right setup.My system specs other then videocard & cpu:RAM: ripjaws x2 16gb ram with ares x2 16gb ram XMP @ 1600mhzPSU: 750w CorsairHDD's x2MB Gigabyte 970 rev 2.#GPU's tested with this processor:GTX 960 AMP gddr5 & GTX 1660 AMP gddr6Some games are broken as they are older or are frame limited. Other games may work better on single core performance as well such as ARMA 3 & Escape from Tarkov. However. The AMD FX 8350 series still is one of the best chips on yesterdays market for the FX series. It also holds the highest OC online 8.1Ghz! Meaning, the RAM speeds & other components is whats actually slowing it down at this point. Since there is no DDR4 am3 socket MB, there is actually no telling how far this CPU could go.P.S. I do not recommend trying to overclock pass 6ghz at all lul. On the box, yes, it says you can achive 6ghz.WARNING:DO NOT USE or BUY WITH STOCK FAN! You will expierence so many issues from noise to BSOD to freezes, lockups, shutdowns. The Stock fan cooling is way too TINY for this power hungry CPU & it will slow it down performance wise & may cause damage over time due to lack of cooling. If you do use the STOCK fan, I recommend disabling Turbo Mode right away & keeping all cooling options enabled. Power options for windows, set CPU cooling policy to PASSIVE. & be sure its always on Balanced mode in power options. This will keep things better.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Subham BiswasSubham Biswas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on March 21, 2019",
                "reviewTitle": "Nice one",
                "reviewText": "Good Product....delivery was good...the packaging was good enough...got the original product...Now about the processor....its a very good budget processor....Octa-core with 4.2ghz stock clockspeed per core isn't a matter of joke..besides that, this processor supports overclocking upto 5.0 Ghz.....don't know about new games..but slightly old games like...COD , Arkham knight etc...even new game PUBG run smoothly in this system with a decent graphics card....I love FX-8350..",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71oDNqAxy-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zqVzAfu8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roberto S",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 10, 2017",
                "reviewTitle": "Recomendado",
                "reviewText": "Si cuentan con una tarjeta compatible con este CPU es una excelente opción, ya esta a un precio muy accesible unos $2500 y verán que en juegos es la opción recomendada en muchos casos, si van a comprar también la tarjeta madre recomiendo mejor un Ryzen ya que es generación nueva aunque este modelo les dará buen procesamiento para juegos y otras tareas pesadas.En juegos en conjunto de una GTX1060 me da 60FPS a 1080p en cualquier juego claro en algunos casos ajustando los gráficos un poco pero prácticamente todo en alto y la otra utilidad que me da es convertir vídeos en handbrake para verlos en la TV o PS4 cuando no son compatibles, donde usualmente tarda lo mismo que dura el vídeo a 1080p con buena calidad convirtiendo o 720p con calidad un poco mas reducida tarda un tercio de lo que dura el vídeo y no llega a más de 50ºC con un CM Hyper 212 EVO.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesús AJesús A",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 28, 2019",
                "reviewTitle": "Increible procesador de 8 núcleos",
                "reviewText": "Después de mirar muchos procesadores, y ver que los intel se iban mucho de precio, busque en AMD , y tras mucho buscar, me decante para un procesador tope de gama de hace unos años, y a que ahora tiene un increible precio, por lo que decidi comprarlo, y es que es realmente muy potente, va super fluido.Lo monte junto a una gráfica rx570 gaming, y la verdad es que mueve todos los juegos en ultra sin despeinarse ni cuellos de botella, dado a sus 8 núcleos, y si le haces overclock seguramente tenga más potencia pero realmente no la he necesitado, ya que va muy bien. Sin duda una buena opción actualmente dado su calidad-precio.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51XPK8BvqeL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71eP8PRY+XL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71InmqAD0ZL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$188.02",
                "sellerName": "iT Hardware",
                "sellerRating": "4"
            }
        ]
    }
}