{
    "remaining_requests": 43968,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/AMD-FD8320FRHKBOX-FX-8320-8-Core-Processor/dp/B009O7YU56",
    "body": {
        "name": "AMD FD8320FRHKBOX FX-8320 FX-Series 8-Core Black Edition Processor",
        "price": "$74.97",
        "originalPrice": "",
        "rawPrice": 74.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/AMD-FD8320FRHKBOX-FX-8320-8-Core-Processor/dp/B009O7YU56",
        "soldBy": {
            "sellerID": "A2NRFYV2GRESNF",
            "name": "PcPartDen",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2NRFYV2GRESNF"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B017DYMMKG"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Only 2 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/4141nU-POBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41d9buOjGiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41GgF-ETDuL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71KP2E70D4S.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A19idlzd3tL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the AMD Store",
            "link": "https://www.amazon.com/stores/AdvancedMicroDevices/page/8D05F933-0F55-46A5-A940-3711A335A383?ref_=ast_bln"
        },
        "brand": "AdvancedMicroDevices",
        "merchantInfo": "PcPartDen",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2017,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 28 - March 13."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Supreme power available from virtually every Core configuration",
            "Aggressive performance for mega-tasking and intensive applications like video editing and 3D modeling",
            "Native desktop Processor for unmatched multitasking and pure Core performance with \"bulldozer\" architecture",
            "32 nanometer die shrink designed to reduce leakage for improved efficiency, Increased Clock rate headroom and better thermals",
            "Delivers more Cores and more performance without raising the power requirements",
            "Frequency: 3.5/4.0 ghz (base/overdrive)",
            "Cores: 8",
            "Cache: 8/8mb (l2/l3)",
            "Socket type: am3+",
            "Power wattage: 125w"
        ],
        "description": "AMD FX-8320 Eight-Core Processor 3.5GHz Socket AM3+, Retail",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17923671011"
            },
            {
                "name": "CPU Processors",
                "link": "https://www.amazon.com/CPU-Processors-Memory-Computer-Add-Ons/b?ie=UTF8&node=229189"
            }
        ],
        "productInformation": [
            {
                "name": "Processor",
                "value": "‎3.5 GHz amd_fx"
            },
            {
                "name": "RAM",
                "value": "‎8 GB SO-DIMM DDR3"
            },
            {
                "name": "Hard Drive",
                "value": "‎1 TB"
            },
            {
                "name": "Brand",
                "value": "AMD"
            },
            {
                "name": "Series",
                "value": "‎AMD FX 8320"
            },
            {
                "name": "Item model number",
                "value": "‎FD8320FRHKBOX"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC"
            },
            {
                "name": "Operating System",
                "value": "‎Windows 8 Pro"
            },
            {
                "name": "Item Weight",
                "value": "‎8.8 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎5.5 x 5 x 2.8 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎5.5 x 5 x 2.8 inches"
            },
            {
                "name": "Color",
                "value": "‎black with blue neon"
            },
            {
                "name": "Processor Brand",
                "value": "‎AMD"
            },
            {
                "name": "Number of Processors",
                "value": "‎8"
            },
            {
                "name": "Computer Memory Type",
                "value": "‎DDR3 SDRAM"
            },
            {
                "name": "Hard Drive Interface",
                "value": "‎Serial ATA"
            },
            {
                "name": "Power Source",
                "value": "‎DC"
            },
            {
                "name": "Voltage",
                "value": "‎120 Volts"
            },
            {
                "name": "Department",
                "value": "‎cpu"
            },
            {
                "name": "Manufacturer",
                "value": "‎AMD"
            },
            {
                "name": "Language",
                "value": "‎English"
            },
            {
                "name": "ASIN",
                "value": "‎B009O7YU56"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎October 23, 2012"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,017 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#144 in Computer CPU Processors"
            },
            {
                "name": "CPU Manufacturer",
                "value": "AMD"
            },
            {
                "name": "CPU Model",
                "value": "AMD FX"
            },
            {
                "name": "CPU Speed",
                "value": "3.5 GHz"
            },
            {
                "name": "CPU Socket",
                "value": "Socket AM3+"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "RustyMike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRSEPBVDOGSBUTOBKO6UXYK224Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11DXSLTDUOIX5?ASIN=B009O7YU56",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2013",
                "reviewTitle": "5.0 out of 5 stars Incredible CPU!!! Overclocks like a champ! + Dynamic frequency calibration.",
                "reviewText": "Best CPU I've ever put in a PC! So fast! This has some very nice features, too, all of which are pretty self-explanatory. However, let me tell you about \"TURBO\" since there isn't much info readily available, and it's one of the main draws to this particular line of CPUs...TURBO: This is a 3.5Ghz CPU... it runs at 3.5Ghz stock setting. TURBO can be enabled via your motherboard's BIOS. The options are AUTO and DISABLED. When Disabled, your CPU will consistently run at 3.5Ghz frequency... period. When Turbo is enabled, your CPU's frequency is dynamically controlled based on the system's requirements.Under a minimal workload (browsing the web, listening to music, running office software, etc) the CPU will auto-adjust to a lower frequency. For example, 3.0 - 3.4, etc... You don't have to manually adjust anything, it just does it by itself, and it maintains system stability when doing so. Now... say you're running a next-gen game, transferring a boat-load of files from one HDD to another, or rendering a video or animation... Then Turbo will increase your CPU's frequency up to 4.0Ghz!! Automatically, no need to manually overclock it.However, whatever the frequency is set to (ie 3.5 - 4.0+ etc) will be a \"Target Frequency\". In other words, the base frequency that other multipliers and ratios are based off of. So if you overclock it, then Turbo will still dynamically control your CPU frequency, but it will make it's adjustments based on the new target frequency. From what I've seen, Turbo tends to work within a 1Ghz range. For example: at stock (3.5) the frequency will fluctuate between 3.0 and 4.0... Overclocked to 4.0, the range tends to be between 3.5 - 4.5... If you want to overclock, but you're concerned about stability (no reason for concern that I've seen so far) then just manually overclock it in the bios and turn off Turbo. Otherwise, the dynamic control over CPU power is a fantastic and efficient feature well worth leaving on no matter what your intentions are for this CPU.HEAVY LOAD TEST: Moving on to performance... I like to break my CPU in by attempting to put it under the \"worst-case-scenario-load\". This is a combination of everything I may have to be switching between on any given job if I'm suddenly under a tight deadline and need to power through a creative media project... >> While transferring 300Gb of data from one drive to another, and changing ownership of 8 separate folders (containing several hundred Gb of data each), I watched a 1080p HD video in fullscreen, browsed the web, played music, ran Photoshop CS6 editing a 600ppi PSD doc with about 40+ layers, ran Maya 2013 rendering a complex scene and animation at 4K resolution with mental ray lighting and shadows, ran After Effects CS6 compositing a 1080p animation with visual effects, ran Premiere CS6 editing a 1080p video as well, ran Animate 2 (essentially Flash) animating a 30sec 1080p animation (720 frames/images), ran Audacity editing a 2min audio file with 16 tracks, AND... I was still able to start up Assassin's Creed IV and play! Sort of... It wasn't the best frame rate, and I had to turn AA and physX off, but still... wow! The only reason I started up AC-IV was because I couldn't think of anything else to do to try to crash the system. Hahaha. That's even before I overclocked it!OVERCLOCKING & TEMPS: This CPU is essentially an under-clocked 8350. AMD also makes their CPUs with O.C. in mind, so there is plenty of voltage headroom at stock settings, enough to O.C. this baby to 4.0Ghz out of the box without touching anything but the frequency! Mind you, this should only even be attempted with an after-market cooling solution (Top of the line CPU Cooler or Liquid Cooling), because it will run a bit hot under a full load. However... like others have mentioned in various forums... I actually got better, more consistent temps *after* overclocking the CPU to 4.0Ghz... Prior to O.C. my idle temps would sit around 12 degrees and erratically spike to 22, 27, etc...That said... Overclocked to 4.0Ghz with a Cooler Master Hyper 212 EVO, my idle temps are between 12-20 degrees depending on the shift in ambient room temp (most commonly it stays around 18 degrees). At full load (100%) on all 8 cores for 30-minutes (using Prime95 stress tester) the temp never went above 44 degrees. *Max temp is somewhere around 67 degrees I believe). No errors either, so the system is stable enough. I haven't had time to run a 12-24 hour stress test yet, but everyone I've talked to, and all the users posting in overclock forums report that 4.0Ghz is very stable on this CPU, and most are pushing it further. One guy capped his out at 4.7Ghz in a liquid-cooled system! I'll update my review after I've had a chance to run a full 24-hour stress test, but as of now I have had absolutely no issues whatsoever.FINAL THOUGHTS: Look no further. This is the best CPU in the \"bang for your buck\" category. Seriously. What else do you need to know other than the overwhelming joy of getting a 8-core 4.0Ghz CPU for the price of a 3.5Ghz CPU!?!? It's a no-brainer. If you can read a motherboard manual to find out how to get into your BIOS settings, then you can figure out the one setting to change the frequency to 4.0Ghz... the rest is done for you. No need to mess with voltages or anything else. Save. Reboot. Enjoy! :)*** P.S. Don't read any reviews from people who say \"This CPU is quiet\"... CPUs are SILENT!!! It's a Chip!... I can only assume they are talking about the stock cooler, but who knows. ((shrug))",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. F. Hindy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTRLPO6Q7FNLBNB5SQSDPLC6I3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LEYZ5U3O93C7?ASIN=B009O7YU56",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 9, 2014",
                "reviewTitle": "5.0 out of 5 stars It works as well as I expected it to",
                "reviewText": "I bought this to put in a budget build that was replacing an ASUS G75VW laptop (that contains a 3610QM ivy bridge i7). Based on the benchmarks I expected this to perform more or less the same once it averaged out (slightly better in multitasking, slightly worse in 2D graphics and single-core performance).As expected, that's exactly how this acted.Pros1. For $160, this processor is really good. Many websites put it (and its big brother the 8350) as the best price-to-performance CPUs out there right now. I can see why.2. If you overclock to 4.0GHz (which can be done on air but it's recommended to get a better CPU cooler) it has (more or less) the same benchmarks as the more expensive 8350.3. I've seen no outstanding problems doing day to day. I've rendered videos in Premiere Pro, images in Photoshop, played games on Steam (I know that's mostly video card but still), browsed the web, watched videos, listened to music, and all sorts of other activities. This CPU has performed all of those tasks amicably. As well or better than the 3610QM i7 in my laptop.Cons1. 2D graphics and single core performance are just a bit lower than I'd like. It got beat by an i7 laptop chip from 2 years ago in both of those categories which isn't promising but so far I haven't seen any noticeable declines in performance so that's good news.2. The air cooler on this thing isn't very good. It keeps the CPU cool (idles at 35C) but it sounds like a vacuum with a rock in it. It's not the worst sound ever but compared to the smooth whir of the other fans in the case and GPU, the AMD CPU cooler is definitely subpar.Overall, this processor is amazing for how little it costs. AMDs these days are made for budget builders and it's a niche they absolutely own. If you're going for a budget build, you can't beat these.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabriele",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 6, 2018",
                "reviewTitle": "Decisamente ottimo, rapporto qualità/prezzo top",
                "reviewText": "Semplicemente perfetto, spedizione Amazon prime top, Montato su MSI 970 gaming Motherboard. Overclock a 4,3 Ghz (1.424 v) è molto veloce ma non come un i5-7th gen, lo tengo a 22-25 °C (a riposo) con questo ottimo dissipatore https://www.amazon.it/Enermax-Ets-T40-W-Ventola-Nero-Grigio/dp/B00D697L0Y con un max di 35-40 °C durante l'utilizzo di programmi pesanti o games (la ventole dissipatore/case sono settate al 50% rispetto al Max) da considerare anche che siamo in estate!!. Il tutto necessita di un case ben ventilato, ventole anteriori e posteriori, e che l'alimentatore sia posizionato nella parte bassa del case (nel mio si trova nella parte alta perché è di taglia inferiore al mid-tower case) quindi mi va a scaldare tutto il case. Non ho scelto di utilizzare il dissipatore già compreso perché leggendo le recensioni ho capito che sarebbe stato un processore stufa (più la temperatura è alta e più i componenti tendono a degradarsi velocemente) e basandomi anche sulla mia esperienza con il dissipatore dell' Amd A6. Non spingetelo oltre i 4,3-4,5 Ghz (a meno che non sappiate settare bene i voltaggi) perché mi è andato in sicurezza e ho resettato il bios con il connettore a due pin (reset motherboard pins). Applicate solo la dimensione di un chicco di riso per la pasta termica, altrimenti vi scola sui bordi del processore e dovete pulire prima di usarlo. Adesso devo solo vedere quanto mi durerà, ma probabilmente parecchi anni con questo dissipatore. Ormai è quasi un mese che lo uso e va benissmo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dice",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 14, 2016",
                "reviewTitle": "This device is a bit old by today's standards, but it puts out.",
                "reviewText": "This CPU is a bit old by today's standards, but it puts out.•The performance to price ratio is excellent.•I've had no issues playing modern games (e.g., GTA V, Witcher 3, Fallout 4, etc) with this CPU. -Paired with a R9 380, 8 GB of ram.•No issues with light photo/video editing.•I was worried about installing the chip to the board, but there is only one right way to put the chip in, due to how the pins are aligned. It will drop in with gravity if it's aligned, then you snap it in with the arm.Negative•There is no such thing as \"future proofing\" but I do have some concerns about the ability to be play next-gen.• Some reviews indicated that this CPU came in a metal box, mine did not.•I still have the stock cooler, but I'm nearing the threshold vis-a-vis heat.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mysterio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 23, 2015",
                "reviewTitle": "Muy buen rendimiento a muy buen precio",
                "reviewText": "Este procesador AMD es una excelente alternativa para aquellos que no tengan un presupuesto tan amplio, corre a 3.5 GHZ y alcanza los 4.0 GHZ; con una buena tarjeta gráfica te da un gran rendimiento en juegos, es muy bueno para diseño y producción de videos, a diferencia de su hermano mayor el FX 8350 este llega a tener solo un 10% menos de rendimiento, pero por el precio que maneja es una buena alternativa que permite ahorrar a la vez, en el uso diario llega a tener un rendimiento similar a un procesador Intel Core i5 de tercera generación (i5 3570K).Puntos a favor:* Muy buena relacion precio-rendimiento* Rendimiento similar en juegos a Intel a un precio considerablemente menor* Buena capacidad de overclocking (bajo su riesgo)Puntos en contra:* Alto consumo energetico (125W)",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Placeholder",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 23, 2016",
                "reviewTitle": "Edited after 6 month use of the processor",
                "reviewText": "Edited 11/02/2017 tested Very Good processor good enough. I have worked for approx 7 month with this processor and it is the best processor I have worked onVery fast, satisfying, smooth, forget my previous review, but some good box, pkg may be provided by AMD. The sticker also provided by AMD to my registered address as per my request of sticker. From Head qtr they have instructed to India to provide me sticker.The below is my purchase time reviewThe sticker of AMD LOGO was not there waiting for resolution from supplier reviewed after watching unboxing video on you tube and got noticed that I haven't received the processor logo sticker Received today the item, the packing was very poor, an item worth Rs more than 11000 Indian Rupees was shipped in a very cheap card board box, the packing was so cheap, the processor was shaking inside, so bad packing.The company AMD PROCESSOR PACKING as shown on photo also very cheap very very poor, they are going to loot India. The quality will be checked after preparation of my desktop system.Waiting for the motherboard ram, hard disk etc.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sand",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 1, 2015",
                "reviewTitle": "Simplement excellent !",
                "reviewText": "Très bon processeur couplé à une carte mère 990FXA-UD3 et un AIO Nepton 280L. Overclocké très facilement à 4,8GHz pour 1,48v et à cette fréquence ne bride pas mon Crossfire de R9 280. A acheter les yeux fermés donc !Cependant, je ne comprendrai jamais pourquoi la famille des AMD Bulldozer aura été aussi mal reçu étant donné qu' ils sont très abordables et performants, même à l' heure actuelle en taches multithreadées un FX8xxx ou 9xxx est nettement devant un Core i5 (y compris le 6600k sorti 3ans plus tard et 2x plus chère..) dans la plus part des benchmarks et tient même tête à certains i7 (notamment 3770k ou 4770k en fonction des tests) pour un tarif 2,5x moins élevé. Reste les jeux ou les FX sont \"mauvais\" parait-il ... MAIS largement suffisants pour obtenir du 60Fps constant dans la plus part des titres actuels. Peut être faut-il être réaliste et se demander si les FX sont mauvais en jeu à cause de leur \"mauvaise\" architecture ou à cause d' une optimisation de la part des éditeurs de jeux actuels qui tendrait vers les processeurs Intel qui domine avec 80% de part du marché (et oui, qui voudrait faire du profit en vendant un jeu orienté vers 20% du marché ?)",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}