{
    "remaining_requests": 35000,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/imarku-3-Piece-Non-Stick-Cast-Skillet/dp/B0BJCY1VPZ",
    "body": {
        "name": "imarku Non Stick Frying Pans - 8&10&12 Inch Cast Iron Skillets Professional Cast Iron Pan Dishwasher Safe Nonstick Frying Pan Set, Detachable Handle",
        "price": "$99.99",
        "originalPrice": "$129.99",
        "rawPrice": 99.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/imarku-3-Piece-Non-Stick-Cast-Skillet/dp/B0BJCY1VPZ",
        "soldBy": {
            "sellerID": "A3UGV0UC6GOKKF",
            "name": "imarku Official Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3UGV0UC6GOKKF&asin=B0BJCY1VPZ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CVGRMZ21"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BJCY1VPZ",
                "variationName": "Size",
                "variationValue": "8*10*12 inches",
                "price": "$99.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CG9HV4CZ",
                "variationName": "Size",
                "variationValue": "10*12 Inches",
                "price": "$169.98",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ZeGMHPdBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41AdxhMr20L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513LMDt8yNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5127jWIH30L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Qc3rnQpgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51IV9KP3bhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51mh8PtdUNL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the imarku Store",
            "link": "https://www.amazon.com/stores/imarku/page/6CFD9621-C8D8-47AB-951B-1010C39E5757?ref_=ast_bln"
        },
        "brand": "imarku",
        "merchantInfo": "imarku Official Store",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 405,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 6 hrs 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "PROFESSIONAL FRYING PAN SET: imarku 3-Piece non stick frying pans have a non-stick honeycomb cooking surface that ensures that the oil droplets are locked in the honeycomb. Cast iron skillets are characterized by strong heat storage capacity and uniform heating. It can quickly cook ingredients and preserve the original nutrition",
            "NON-STICK COOKING SURFACE: Whitford double-layer water-based non-stick coating, this nonstick pans can easily fry and fry food without sticking to the bottom, which can minimize the use of oil, and the kitchen is clean and less oily. This nonstick frying pan set can also help reduce fat intake, which meets the needs of modern people to pursue low-fat and low-calorie",
            "DETACHABLE WOODEN HANDLE: The detachable handle is made of high-quality acacia wood raw material. The handles are easy to install and remove, and not easy to rust and break. Ergonomic design provides a safe and firm grip, which is comfortable to hold, stylish and beautiful, heat-resistant, and anti-scalding",
            "PERFECT COMBINATION OF DURABILITY AND LIGHTNESS: The thick bottom and thin wall design of the cast iron skillet set reduces the bulkiness of traditional cast iron pans, bringing you an easy way to enjoy your cooking time. It also gets rid of all the shortcomings of traditional non stick skillets, is scratch-resistant and rust-resistant, and is not easy to deform.",
            "HIGH COMPATIBILITY: The skillet set is suitable for deep-fried, light-pressure cooking, steaming, boiling, decocting, grilling, and stirring. work on all cooktops including Halogen Stoves, Gas, Ceramic, and Electric Stove",
            "BUY WITH CONFIDENCE: We provide a free return within 3 months and a free exchange within 1 year. If you encounter any problems while using our products, please feel free to contact us, we will be happy to help you. Exquisitely packaged in a High-end gift box, professional frying pan set is perfect for holiday gifts"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Cookware",
                "link": "https://www.amazon.com/cookware/b?ie=UTF8&node=289814"
            },
            {
                "name": "Pots & Pans",
                "link": "https://www.amazon.com/b?ie=UTF8&node=19343857011"
            },
            {
                "name": "Skillets",
                "link": "https://www.amazon.com/Skillets-Cookware-Baking-Kitchen-Dining/b?ie=UTF8&node=289829"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "imarku"
            },
            {
                "name": "Material",
                "value": "Cast Iron"
            },
            {
                "name": "Special Feature",
                "value": "Non Stick"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Capacity",
                "value": "5 Quarts"
            },
            {
                "name": "Compatible Devices",
                "value": "Gas, Electric Coil"
            },
            {
                "name": "Product Care Instructions",
                "value": "Daily Maintenance: After cleaning the skillet - Wipe with kitchen paper to keep the inside of the skillet dry - Apply a little oil to the skillet - Drying"
            },
            {
                "name": "Maximum Temperature",
                "value": "500 Degrees Fahrenheit"
            },
            {
                "name": "Handle Material",
                "value": "Wood"
            },
            {
                "name": "Item Weight",
                "value": "10 pounds"
            },
            {
                "name": "Number of Pieces",
                "value": "3"
            },
            {
                "name": "Is Oven Safe",
                "value": "Yes"
            },
            {
                "name": "Model Name",
                "value": "I-PS0243"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Product Dimensions",
                "value": "6 x 8 x 1 inches"
            },
            {
                "name": "Manufacturer",
                "value": "imarku"
            },
            {
                "name": "ASIN",
                "value": "B0BJCY1VPZ"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "I-PS0243"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 405 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#25,442 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #173 in Skillets"
            },
            {
                "name": "Date First Available",
                "value": "October 17, 2022"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Suitable handle for this frying pan Handle for 10/12 inch Add to Cart Handle for 8 inch Add to Cart Handle for 10/12 inch Add to Cart Handle for 8 inch Add to Cart Handle for 10/12 inch Add to Cart Handle for 8 inch Add to Cart Customer Reviews — — 4.7 out of 5 stars 322 — — — Price $19.99$19.99 $16.99$16.99 $19.99$19.99 $16.99$16.99 $19.99$19.99 $16.99$16.99 Suitable size 10/12 inch 8 inch 10/12 inch 8 inch 10/12 inch 8 inch Color Purple Purple Green Green Grey Grey Material Bakelite Bakelite Bakelite Bakelite Bakelite Bakelite Hangable ✔ ✔ ✔ ✔ ✔ ✔ Length 8.9inch 8.3inch 8.9inch 8.3inch 8.9inch 8.3inch",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/10d6194f-db8e-4bad-823e-c27556604dd1.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b6501a26-1cf8-4707-ad8f-9a16e3909bfd.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d352e93f-833a-4a81-ba91-e95d8b00d752.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/45857f44-1217-4303-9f04-40a62fbe3f4b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a49fbc77-ed51-4580-ac85-845204632f3d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4db406c2-84db-4a0e-b2f7-18ea0916b12f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fb01d4f1-fc6a-4cf4-aa1b-978228642587.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/480825f9-3149-4a62-b0e4-b84ef4075b8c.__CR111,0,1778,2000_PT0_SX200_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a0bf93e9-5bb9-4a2c-9599-c652263cd391.__CR111,0,1778,2000_PT0_SX200_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2faeb407-112b-4a8a-9aa2-b45468b86eca.__CR111,0,1778,2000_PT0_SX200_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/45a0b17b-40a0-4948-8535-da847bd7db2a.__CR111,0,1778,2000_PT0_SX200_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/949aff25-a58b-4016-8c62-c2604838dd7b.__CR111,0,1778,2000_PT0_SX200_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dff2d7e1-8235-44a1-a263-412e3cc78272.__CR111,0,1778,2000_PT0_SX200_V1___.jpeg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stormy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFA5NO5JCGXGM2ZWB6BOROYCW55Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HVEGYK45N9II?ASIN=B0BJCY1VPZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars The BEST non-stick I've used in my life, and I've tried them all!",
                "reviewText": "These are seriously the best non-stick pans I have ever used, with nothing that even remotely compares. They basically have all of the pros of true non-stick (like ceramic) and seasoned cast iron, without the cons. I love how non-stick ceramic pots and pans are, but even following the care instructions to a \"T\" (handwash only, only use silicon utensils, etc.), they end up scratching horribly and with time, things begin sticking. I feel like the only solution is to replace them about every 1 - 2 years, which feels wasteful and expensive to me.I love the idea of cast iron and being non-toxic, but the reality can be a pain. They require a lot of re-seasoning to maintain their non-stick coating, are incredibly heavy, bulky, and if you cook anything fishy or acidic in them, they need a good washing and re-seasoning after. I work full-time and have young kids and while I love cooking, I just don't have time or energy for the upkeep of cast iron.Then I randomly stumbled across these. They had excellent reviews and really intrigued me. I've owned them for a couple of months now and cannot be more in love with them. I scoured all of the questions/ answers and reviews and couldn't quite sort out if they need to be seasoned. Apparently they don't. They use a cast-iron non-stick coating, according to the literature these come with. They do recommend using non-abrasive utensils and cleaning methods, although after weeks of heavy heavy use, these don't seem to scratch. Granted, I'm not using metal or anything just in case, but still, my ceramic ones began scratching almost immediately.If you can believe it, these are even more non-stick than quality ceramic pans that cost three 4 times as much. Seriously absolutely nothing sticks to these. I flipped a really cheesy quesadilla poorly the other day, and a bunch of the cheese spilled out. Even with a thick layer of shredded cheese and some chicken, it just glided around the pan. I later did it on purpose because who doesn't love fried cheese? No oil or anything, and once it was properly fried on the bottom, it released no problem. The little bumps on the bottom of the pan also seem to really help with even temperature distribution. Everything I cook is cooked perfectly and evenly. There don't seem to be hotspots with these pans like there have been with every other type of pan I've used. The texture on the bottom also creates a fun sear on things, with a bunch of little round circles.These seem to heat up more quiclky than cast iron, but maintain steady heat even better than cast iron. You don't need to heat these pans as hot as other pans, at least in my experience. They heat very quickly and while I used to use \"high\" on my stovetop frequently to get a good sear, even on my cast iron, with these they can burn things on high. It's a bit of a learning curve, but for whatever reason, these heat up more quickly and evenly than any other pan I've used, so babysit your food when you're first using these to sort out the best cooking temperatures.Cleanup is so easy too. Per the care guidelines, I don't introduce extreme temperature differences, so let these pans cool for at least 15 minutes after use, and seriously running it quickly under water releases everything. Unlike traditional cast iron that rusts, I can leave these wet after and they air dry, with no rusting. They don't seem to hold onto grease, but just in case, I do use a little soap and a non-stick safe cleaning pad and rinse well after. They don't seem to hold onto stinky smells like fish either. These are much less porous than regular cast-iron. While heavy-duty, these are also significantly lighter than traditional cast iron too. My thin, weak wrists don't feel like they'll be dislocated moving these particular pots around.Finally, I do like that the handles are removable, but likely won't use that feature often. It's not that they're difficult to remove, but it does take a few steps and removing a screw (and hoping I don't lose it!) to do so. I've removed the handles a couple of times when moving something from the stovetop to the oven, but prefer to leave the handles alone. I also wish they had lids, but it's not the end of the world that they don't. My skillet lids from a different set mostly work with these, so I can make it work on the rare occasions I need a lid. Tomato-based items don't seem to impact these either like they did my traditional cast iron.All in all, get these pans! Whether your a novice in the kitchen or highly experienced, you will love this set! All of these sizes seem to work well for our family of 4 (plus frequent company).",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "abhildo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFHADVAU2GAHZEE53VXO5GZ7XMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UG9MENMKJ6WM?ASIN=B0BJCY1VPZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Nonstick Cast Iron Frying Pan Set!",
                "reviewText": "The three different sizes (8 inch, 10 inch, and 12 inch) are incredibly versatile and cover all my cooking needs. The nonstick coating works like a charm, allowing me to cook with minimal oil and making cleanup a breeze.The best part is the removable handle, which adds a whole new level of convenience. I can use these pans both on the stove-top and in the oven, thanks to the easily detachable handle. It's a very convenient feature that saves space and makes storage a lot more straightforward.The cast iron construction ensures even heat distribution, making for perfectly cooked meals every time. I appreciate the durability of the pans, as they feel robust and built to last.I've used these pans for frying, sautéing, baking, and more, and they've exceeded my expectations in every aspect. This set is a real game-changer in my kitchen, and I can confidently say it's worth every penny.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JPS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWMA4AVOBSM7PN6LCEHKPVJR2SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29HCGTK2APZ69?ASIN=B0BJCY1VPZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent Cast Iron Pans",
                "reviewText": "I've always sworn by cooking with Cast Iron. these pans are excellent yet not too heavy like traditional Cast Iron is. They come pre-seasoned, have excellent heat distribution, non-stick and super easy clean up. I'd highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Khanh NguyenKhanh Nguyen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUZDLAJHVXG3DQE4O63RV5MT3KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LESGAKZAXS9X?ASIN=B0BJCY1VPZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars My favorite pans set",
                "reviewText": "The media could not be loaded. I've been using my new pans for 15 days, and I'm absolutely loving it! Yes, they're a bit heavy, but that's a small price to pay for their durability and quality. The non-stick surface is a dream - no scratches at all, even with daily use. The different sizes are perfect for everything from small breakfasts to large dinners, and the detachable handle is such a smart feature. Cleaning is easy (they're dishwasher safe, but I prefer hand washing to preserve the non-stick). Overall, this skillet set is a fantastic addition to my kitchen, and I highly recommend it to anyone looking for high-quality, long- lasting cookware.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61+DaYqb5JL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71IqR-hEKyL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9d0d98aa-f858-40b2-8064-2a539aa6c701/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Min",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOLHJTTSCM5IMDF7TDRCRXCJKHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U3EQK8PN64LU?ASIN=B0BJCY1VPZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Great value for the price!",
                "reviewText": "I have been looking for replacement of my teflon-coating non-stick frying pan for some time. Every once a while, I have to replace the old one since the coating becomes ugly after some use but non-stickiness is really convenient for most of my cooking, I don't want to go back to the stainless steel which is a PITA. Cast iron is obviously the best replacement but I am always concerned about the seasoning, how to care for it, and particularly the weight as well as the fact the handle is also iron (too hot during cooking). Until I found this product. It is more lightweight than traditional ones, still heavy but much easier to handle thanks to the wooden handle. The coating and pattern at the bottom not just look nice, but it is really making the cooking enjoyable. Close to my old one, still need a bit oil during the cooking but I am completely satisfied. The pan looks super sturdy, the thickiness make it retain the heat well and cook the food evenly. Cleaning is easy. This has literally become my go to pan on a daily basis. Overall I feel this is great value for the price considering the set contains three!",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Hill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBOJTBT4TZPR72DLIECIDWFXQ7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JG6VIW96OEKX?ASIN=B0BJCY1VPZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars So far I am impressed",
                "reviewText": "I am nothing more than a home cook, but these pans have been very nice. They are heavy, handles can be removed, easy to clean and seem to be very durable and stick free. For the price I think they are worth it. I may purchase another set.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNKFNGUBQ5EUPYZG5IVKRZLSS5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39WFB58RYGWMS?ASIN=B0BJCY1VPZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Best nonstick pans I’ve ever had",
                "reviewText": "These are by far the best non stick pans we’ve ever owned. Very well made. They are cast iron so have some weight but that is what makes them cook so well. It’s the best of both worlds! Even cooking and everything slides out. Beautiful looking as well. The wooden handles are the cherry on top.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIQAPNZMRNVAKKN63TNIS7ZYJUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGHZ6DMZ88WGE?ASIN=B0BJCY1VPZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars I have replaced my nonstick pan with these!",
                "reviewText": "Easy to clean and great heat distribution. I was happy to find an Amazon deal and saved a lot of $$$. Non-stick pans that are long lasting and of good quality are extremely expensive. The fact that these are cast iron will, hopefully, make them a part of my kitchen for years to come.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$179.99",
                "sellerName": "NewKitchen",
                "sellerRating": "5"
            }
        ]
    }
}