{
    "remaining_requests": 34834,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/AVACRAFT-Stainless-Induction-Compatible-Skillet/dp/B07QFC2YXC",
    "body": {
        "name": "AVACRAFT 18/10 12 Inch Stainless Steel Frying Pan with Lid, Side Spouts, Induction Pan, Versatile Stainless Steel Skillet, Fry Pan in our Pots and Pans (Stainless Steel, 12 Inch)",
        "price": "$65.25",
        "originalPrice": "",
        "rawPrice": 65.25,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/AVACRAFT-Stainless-Induction-Compatible-Skillet/dp/B07QFC2YXC",
        "soldBy": {
            "sellerID": "ATA0Z8W2MD8W5",
            "name": "AVACRAFT",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ATA0Z8W2MD8W5&asin=B07QFC2YXC&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07RSC34HP"
        ],
        "asinVariationValues": [
            {
                "asin": "B07F6DLM8L",
                "variationName": "Size",
                "variationValue": "8 Inch Stainless Steel",
                "price": "$55.50",
                "variationImageURL": ""
            },
            {
                "asin": "B07QHD8H66",
                "variationName": "Size",
                "variationValue": "8 Inch Tri-Ply Stainless Steel",
                "price": "$60.50",
                "variationImageURL": ""
            },
            {
                "asin": "B07F6DG3N1",
                "variationName": "Size",
                "variationValue": "10 Inch Stainless Steel",
                "price": "$60.50",
                "variationImageURL": ""
            },
            {
                "asin": "B07QB9HR9L",
                "variationName": "Size",
                "variationValue": "10 Inch Tri-Ply Stainless Steel",
                "price": "$79.50",
                "variationImageURL": ""
            },
            {
                "asin": "B07QFC2YXC",
                "variationName": "Size",
                "variationValue": "12 Inch Stainless Steel",
                "price": "$65.25",
                "variationImageURL": ""
            },
            {
                "asin": "B07QD7ZP58",
                "variationName": "Size",
                "variationValue": "12 Inch Tri-Ply Stainless Steel",
                "price": "$75.00",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41cwPJi6B6L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41JGR9k-1tL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41RpCdio0IL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51duhjMH3 L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511aAg16eZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61K0A1KsEBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417P-JC-D3L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the AVACRAFT Store",
            "link": "https://www.amazon.com/stores/AVACRAFT/page/37896566-5C45-41E3-A356-D2363B82BD08?ref_=ast_bln"
        },
        "brand": "AVACRAFT",
        "merchantInfo": "AVACRAFT",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2781,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery February 18 - 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "18/10 Stainless Steel Fry Pan: Multiclad base 12 inch frying pan with strong clear glass lid. Cooking pan with special matte finish inside to prevent ugly scratches. Everything pan steel pan with mirror finish outside for beautiful look. Stainless steel pan made with 3 layers. The best rated stainless steel frying pan with lid. Stainless steel pan with lid and spouts on both sides.",
            "Heavy Duty Frying Pan: Heavy Duty Frying Pan: Multi-Ply bonded construction for base of the pan eliminate heat spots and spread heat evenly. Stainless steel skillet with strong handle designed to stay cool. Use as stainless steel saute pan, skillet pan. Stainless steel pans in 3 different sizes 8inch, 10 inch, 12 inch from small pan to extra large frying pan",
            "Induction Compatible: Versatile. Induction pan, Gas, Electric Ceramic, Halogen cooktop compatible. Everything pan. High quality frying pan in stainless steel.",
            "Easy Cleaning and Durable: High Quality 18/10 food grade stainless steel frying pan resistant to rust, stain, corrosion, crack. Dishwasher safe. Healthier than non-stick frying pan. Best Fry Pan in the market. Best steel pot over large nonstick frying pan or small frying pan nonstick. Best Fry Pan in the market!",
            "Best Gift: The best gift for family, friends and loved ones as housewarming gift, wedding gift, birthday gift, gift for chef, thanksgiving gift, Christmas gift, New Year gift. Best addition to kitchen pots and pans set stainless steel. AVACRAFT is woman owned small business. Lifetime guarantee for the product bought from AVACRAFT."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Cookware",
                "link": "https://www.amazon.com/cookware/b?ie=UTF8&node=289814"
            },
            {
                "name": "Pots & Pans",
                "link": "https://www.amazon.com/b?ie=UTF8&node=19343857011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "AVACRAFT"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Special Feature",
                "value": "Gas Stovetop Compatible, Electric Stovetop Compatible, Induction Stovetop Compatible"
            },
            {
                "name": "Capacity",
                "value": "3 Quarts"
            },
            {
                "name": "Compatible Devices",
                "value": "Smooth Surface Induction, Gas, Electric Coil"
            },
            {
                "name": "Product Care Instructions",
                "value": "Dishwasher Safe"
            },
            {
                "name": "Maximum Temperature",
                "value": "500 Degrees Fahrenheit"
            },
            {
                "name": "Handle Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Item Weight",
                "value": "5 pounds"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Is Oven Safe",
                "value": "Yes"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "No"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Product Dimensions",
                "value": "20.5 x 11.8 x 2.36 inches"
            },
            {
                "name": "ASIN",
                "value": "B07QFC2YXC"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,781 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#15,630 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #374 in Pots & Pans"
            },
            {
                "name": "Date First Available",
                "value": "April 4, 2019"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "TRUST AVACRAFT, TRUST QUALITY! Ideal Kitchen Cookware to cook all kinds of food. AVACRAFT's stainless steel frying pan is Five-layer high precision bonding ensures even heat distribution without any hot spots. Our pots and pans have highly conductive aluminum core encapsulated by pure stainless steel layers provides professional commercial restaurant performance!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/150afcf8-1372-4d15-906e-5ad46c81852c.__CR0,0,2000,1237_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "High quality 18/10 stainless steel, highly resistant to stain, rust, corrosion while maintaining the shine and looks. Best Steel Pan. Convenient, Designed To Use With Gas, Electric Ceramic, Induction Cook Tops! These cooking pans are designed not too heavy and not too light for easy lifting.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8da62fe0-7f0f-44b5-b89a-a028bd688bc3.__CR0,0,2000,619_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "High quality 18/10 stainless steel, highly resistant to stain, rust, corrosion while maintaining the shine and looks. Best Steel Pan. No more ugly scratches, special matte finish inside the pan prevents scratches caused. Convenient, Designed To Use With Gas, Electric Ceramic, Induction Cook Tops! These cooking pans are designed not too heavy and not too light for easy lifting.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a9ed9aae-a461-48f6-8e24-7494369dc52b.__CR0,0,2000,1237_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Best Gift: Best Stainless steel skillet gift for family, friends and loved ones for Thanksgiving, Christmas and New Year. Looks Great: The 18/10 shiny steel along with lid add great looks to your kitchen! Buy all these 3 sizes and to make it best frying pan set to give as wedding gift.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/157ec7f5-4a17-49c6-93bf-ba6f322a5e96.__CR0,0,2000,619_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Multipurpose Pan for preparing eggs, omelettes. Sloping sides with pour spouts. Best Saute pan for vegetables, browning potatoes, searing steaks, chicken, fish or chops. Easy pans for cooking. Use it as stir-fry pans. Designed with survey, feedback and study of latest trends. Check out our stainless steel cookware sets!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03a1aea2-9d9c-48eb-bedb-12588c7b3993.__CR0,0,2000,1237_PT0_SX970_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/150afcf8-1372-4d15-906e-5ad46c81852c.__CR0,0,2000,1237_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8da62fe0-7f0f-44b5-b89a-a028bd688bc3.__CR0,0,2000,619_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a9ed9aae-a461-48f6-8e24-7494369dc52b.__CR0,0,2000,1237_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/157ec7f5-4a17-49c6-93bf-ba6f322a5e96.__CR0,0,2000,619_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03a1aea2-9d9c-48eb-bedb-12588c7b3993.__CR0,0,2000,1237_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Greg P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV5GJMIYH3OARROJVRCIDNIMCWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18I9LKJSG7DR9?ASIN=B07QFC2YXC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2022",
                "reviewTitle": "5.0 out of 5 stars Excellent frying pan, it sold me on this vendor.",
                "reviewText": "This review is for the 10\" full body tri-ply pan and lid.First off, this is a stainless steel frying pan. It acts like other stainless steel frying pans. If you don't know what temperatures to use it at with your oil of choice and run it too hot, the oil will undergo polymerization and will become a brownish layer. As with most such things when dealing with stainless steel or cast iron, it may be fixed fairly painlessly. Oven cleaner and barkeepers friend will safely guide you back to like new appearance. As with cast iron, some chefs will purposely build up this polymerized layer of oil since it acts as seasoning much as with cast iron cookware. This is unlike nonstick coatings which will degrade and begin flaking over time. My 85 year old mother managed to wear out a stainless steel frying pan with 60 years of use but most likely you won't. This contrasts with non-stick cookware which needs to be periodically replaced.First impressions. The pan arrived apparently missing the use and care pamphlet. Or I missed it in the packaging. What emerged from the packaging was a gorgeous pan. It has a lovely mirror polish exterior and a somewhat matte interior. Heft in my hand was fantastic. Solid, and plainly durable though lighter than might be expected due to the aluminum. The lid fit nicely, tight enough to do its job.So, how does this work? My previous experience with stainless was with solid stainless steel. Heating times were longer than with lighter pans which is to be expected. Even while heated, the glass lid seemed to function well to keep the heat contained. The surface of the glass maintained a lower temperature than the pan. The handle remained cool even with half hour cook times.My first experiment was, of course, an omlette, exactly what shouldn't be done. I made sure to melt some cheese on to the pans surface along with sticking some eggs on. The pan cleaned well for a stainless, a few minutes soak in some water and a scrub with Scotch-Brite scrubbing sponge and it was good as new. I next made a cheesesteak in the pan with lots of molten American cheese. Once again, a little soaking plus a scrub sponge and it was good as new. I've been using it at every opportunity now for 2 weeks trying to vary the use from in oven fritattas to searing meats. The surface is getting somewhat cloudy now but nothing that wouldn't disappear immediately with some barkeepers friend.My purpose in ordering this pan was to evaluate it. I currently have anodized non-stick pans which are not compatible with the induction cook top that I plan on upgrading to. I wanted to see if this line was suitable to be the replacement for my current pans. What attracted me to this lineup was the solid reviews and the inclusion of lids for the 8 and 10 inch frying pans. Frying pans are the work horses for me and lids are important. After evaluating this pan, I am sold and will be making further purchases.",
                "reviewVotes": "63 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jonna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDMM65VZRLDCHQDPHEIWWNDLJIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4HC098MTI3B2?ASIN=B07QFC2YXC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2019",
                "reviewTitle": "5.0 out of 5 stars Quality, Price, Use- FABULOUS!",
                "reviewText": "Quality, price and use - fabulous!I purchased the Avacraft pot with side pour perforated spout and clear lid and loved it!I cook 2 to 3 times A DAY , very heavy use of cookware. I own pieces of T-fal ltd. (love but chachachiiiing!) , a Weaverware fry pan ( I do not recommend! ) and other various Brand Name stainless steel cookware I just can't recommend due to price or other issues.I needed replacements for the everyday \"recommended\" ceramic cookware I purchased a year ago that did not hold up. I did not want to spent $200+ dollars on one pan, or purchase something I'd have to replace next year. I googled tons of info and purchased one Avacraft pot first to test. I am super happy with this cookware!**If a cook is not familiar with cooking on stainless steel I would highly recommend googling info on stainless cookware use.**Most of the 1 and 2 star reviews I see are because the cook wasn't familiar with stainless steel use.The 3 items I purchased separately, a pot, pan and wok style multi purpose pot, are all NONSTICK when heated on med-low first then food is added. I have made omelets, soups and pasta sauce (acidic). Easy to clean. Stay cool handles. If heat/food \"discolor\" pan rub with vinager. I do not put pans or knives in dishwasher but these are dishwasher safe. I did make a frittata in the oven and it came out perfect, it did not stick. *Use cookware correctly. Heat first THEN add food.* Light weight. Easy clean up. See thru lids (love!!!) Stay cool handles ( I'll mention it again because lesson learned). A level base which sat flat on gas cook top even after multiple uses, no warping. Even heat distribution, no obvious hot spots . My gas range does not distribute gas evenly so a pans ability to distribute heat is important to me. I compared my Avacraft sauce pan(pot) to my Tfal sauce pan (pot) and it was very similar in heat distribution when comparing bubbles/temp distribution with a thermometer in clear water.Cooked well on low simmer for extended time without over heating as some cookware does. It kept an even temperature and did not continue to absorb heat and and over heat then scorch sauce on low temp, fabulous benefit! Yes, I've had pans that did that. I liked the 1st pot I ordered so much I purchased a fry pan with lid, and later the multi-use wok style pot. I recommend this brand for multi-use, ease of use, quality and price. Lightweight, cool handles, oven safe (350' was my experience), even heat distribution, dishwasher safe and for a quality vs. price, totally worth it!!!",
                "reviewVotes": "161 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGOXAZYCWXZD33G6HMO7JK65V2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HMEP5XKIAGKZ?ASIN=B07QFC2YXC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Love it",
                "reviewText": "I’ve been using cast iron for 10 years and just wanted to try something different that wasn’t toxic. It came today and was great making a huge omelet. Love the quality, depth of the pan, great lid, no hot pad needed for either handle, and the ease of cleaning it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wanda from Ohio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZS3H7NCZSUS3FTADWEC2WL5DBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29R601W2TGLVI?ASIN=B07QFC2YXC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2021",
                "reviewTitle": "4.0 out of 5 stars A nice pan",
                "reviewText": "This is a nice, quality pan for the most part. Looks good, is weighty, feels good in your hand and cooks well. I've used it twice now. Cooked four over easy eggs, and tonight made two pork chops. I let the pan warm up, added my EVOO and let it come to temperature before adding food to the pan. The food cooks nicely and does not stick. It's easy to control the pan temperature because it has the heavy 3 ply bottom. The lid fits well. I see only one flaw that I assume is a manufacturing flaw (not a design flaw) that could possibly be remedied. The bottom of the inside of the pan has a slightly raised center. I was a little disappointed when I noticed that upon putting my eggs in the pan but honestly it didn't effect the outcome as much as I thought it might and of course was not a factor when cooking the chops. I would definitely recommend you give this pan a try. I think it's a really nice, quality pan for the price. I wanted a second pan this size ,with a lid, that did not have a non-stick coating. They are not easy to find, especially one of any quality.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tracie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDGWMSJTGZJUXXG6FS5FVOMHGIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1852KBQOEOF5N?ASIN=B07QFC2YXC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Good quality pan and lid",
                "reviewText": "This is a really nice, sturdy, good quality pan and glass lid.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adolfo Martinez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 3, 2024",
                "reviewTitle": "No siempre se consiguen",
                "reviewText": "En casa estamos retirando los antiadherentes sintéticos y los utensilios de aluminio. Esta sartén, ademas de tener las dimensiones que buscábamos en acero inoxidable, viene con tapa de vidrio. No es tan fácil conseguir esta combinación de ventajas, y no se pega!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tara",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 22, 2023",
                "reviewTitle": "Polished MIrror Clean",
                "reviewText": "On first use this pan oxidized and showed a bluish tinge from water mineral deposits. I thought it had discoloured and was ruined. Then I tried a squirt of Dawn dishwasher detergent and a cap of pickling vinegar 7% and cleaned with a soft dishcloth and rinsed in hot water. The pan came out sparkling clean just like first day it was new. I absolutely love this pan now because it works well on my glass cooktop. Now that I know how to clean it, that just adds to the love.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 26, 2023",
                "reviewTitle": "Amplio y funcional",
                "reviewText": "De buen material y cumple si lo sabes manejar con las temperaturas no se le pega la comida.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Osvaldo Revilla",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 11, 2022",
                "reviewTitle": "Excelente alternativa para no usar teflón",
                "reviewText": "Muy buena calidad del sartén , acabados de primera calidad, conforme lo hemos estado usando se requiere menos grasa para cocinar. El único inconveniente quizá es su peso ya que al tratar de vaciar su contenido se debe usar fuerza de las dos maños para evitar accidentes. En general muy recomendable y justo por el precio pagado el valor que entrega",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "odevoted",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on April 23, 2022",
                "reviewTitle": "Very good quality pan and easy to maintain when you know how to",
                "reviewText": "This is a very good product.I have been cooking a lot in cast iron but wanted to also have something as good but easier to clean.This stainless steel pan is very good quality.The Cover is super helpful when making sauces or cooking.I like this so much that I got one for each of our homes.After cooking something that leaves marks, just add some warm water and reheat in the pan.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}