{
    "remaining_requests": 34790,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/USA-Pan-Five-Ply-Stainless-Skillet/dp/B00KOVG6F8",
    "body": {
        "name": "USA Pan 5-Ply Stainless Steel Chef Skillet, 7-Inch",
        "price": "$40.01$36.52$40.01",
        "originalPrice": "$40.01",
        "rawPrice": 40.01,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/USA-Pan-Five-Ply-Stainless-Skillet/dp/B00KOVG6F8",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BZFBCT5B"
        ],
        "asinVariationValues": [
            {
                "asin": "B00KOVG6F8",
                "variationName": "Size",
                "variationValue": "7-Inch Skillet",
                "price": "$40.01",
                "variationImageURL": ""
            },
            {
                "asin": "B00EZR32E0",
                "variationName": "Size",
                "variationValue": "8-Inch Skillet",
                "price": "$79.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31U0tCWRHRL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/410SuDUAFcL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the USA Pan Store",
            "link": "https://www.amazon.com/stores/USAPan/page/D6278A43-59AD-4BF4-BB78-57B42EAC7436?ref_=ast_bln"
        },
        "brand": "USAPan",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 148,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 4 hrs 27 mins",
            "FREE delivery Sunday, February 18. Order within 4 hrs 57 mins",
            "FREE pickup Sunday, February 18",
            "Or fastest pickup Tomorrow, February 14. Order within 4 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "USA Pan Five-Ply Clad Stainless Steel 7 Inch Chef's Skillet",
            "Induction Capable 5-Ply Clad Stainless Steel;5 layers of metal for durability and heat conductivity",
            "American craftmanship exemplifies premium quality and high performance",
            "Healthy waterless and greaseless cooking;induction capable and safe on gas, electric, ceramic glass, and halogen",
            "USA Pan is a Bundy family company which has proudly manufactured high quality bakeware and provided jobs in the USA for over 60 years"
        ],
        "description": "The USA Pan 7-Inch Gourmet Chef Skillet is 5-ply clad stainless steel premium cookware that lets home chefs cook food the way it should be -- rich with flavor and packed with nutrients. Our 7-inch small skillet is a true 5-ply clad stainless steel, meaning 5 layers of metal for durability and optimal heat conductivity. USA Pan cookware can also be used on cooking surfaces such as gas, electric, ceramic glass, and halogen. USA Pan cookware is designed with healthy cooking in mind, our skillets feature a unique vapor cover design seal that enables waterless-greaseless cooking. Waterless-greaseless cooking is possible because a vapor seal is created around the cover (does not come with cover, but works with any universal cover for 7-inch skillet) and heat is distributed evenly across the bottom and up the sides of the cookware. This process cooks food in its own natural liquids for nutritious, flavor-filled meals. The craftsmanship of the USA Pan Chef skillet and saute exemplifies the premium quality and high performance that has made USA Pan the predominant leader in the commercial baking industry. Each individual pan is hand polished to a mirror shine, providing a stunningly vibrant appearance in the kitchen and on the table. Made in the USA from globally sourced materials, our cookware is dishwasher and oven safe. USA Pan is a Bundy family company which has proudly manufactured high quality bakeware and provided jobs in the USA for over 60 years.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Cookware",
                "link": "https://www.amazon.com/cookware/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289814"
            },
            {
                "name": "Pots & Pans",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=19343857011"
            },
            {
                "name": "Skillets",
                "link": "https://www.amazon.com/Skillets-Cookware-Baking-Kitchen-Dining/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289829"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "USA Pan"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Special Feature",
                "value": "Induction Stovetop Compatible"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Capacity",
                "value": "7 Cubic Inches"
            },
            {
                "name": "Compatible Devices",
                "value": "Smooth Surface Induction, Gas, Electric Coil"
            },
            {
                "name": "Product Care Instructions",
                "value": "Oven and Dishwasher safe"
            },
            {
                "name": "Handle Material",
                "value": "Stainless"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Is Oven Safe",
                "value": "Yes"
            },
            {
                "name": "Model Name",
                "value": "Cookware"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "No"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Product Dimensions",
                "value": "13.75 x 7 x 2 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.3 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "USA Pan"
            },
            {
                "name": "ASIN",
                "value": "B00KOVG6F8"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "1521CW"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 148 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#162,531 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #707 in Skillets"
            },
            {
                "name": "Date First Available",
                "value": "May 30, 2014"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bird Mama",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELAGBHYDF7GUHFF5G45AHNATACA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28UU0G6KDE5F0?ASIN=B00KOVG6F8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect size for 1-2 person household",
                "reviewText": "This pan is great for sauteing veggies, sauces, and preparing eggs. The sides are slightly curved so whatever you're cooking stays where the heat is. It is a bit more expensive but well worth it for the quality, cooking outcome, and ease of cleaning.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kurt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJTBAJ7TAHSEQDKQFYW7QBPJVMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTLO002WDUZJ1?ASIN=B00KOVG6F8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 9, 2014",
                "reviewTitle": "5.0 out of 5 stars Well worth the price!",
                "reviewText": "We got the 8inch USA Pan Stainless Steel Chef Skillet. Normally I wouldn't buy such as expensive piece of cookware but it turned out to be well worth the money! I am by no means a chef, but maybe with this skillet there’s hope! The pan is wide enough and deep enough for a one-pan dish without worry of overflowing. The pan is super shiny, even after a couple of washes and a burnt sauce incident (again, not a chef). Although it is heavier than it looks, it is quite sturdy and well made. I’ve only had it for a couple of days now, but made quite a few meals already. We have an electric stove top that’s infamous for not heating our pans evenly, burning some parts and not heating others at all. That was not the case at all with this skillet! We made pancakes in it and they turned out wonderfully golden brown and not half-cooked like with our other pans. My fiancé accidently cooked some vegetables in a sauce a little too long that wound up burning quite badly. I wasn’t too happy that she almost ruined our brand-new and quite frankly, expensive pan. After a quick soak though, it was as good as new! Not a speck of burnt residue or discoloration at all! I was amazed. After scorching a chicken dish, my fiancé and I learned that we do not need to use as high heat as with our other pans, which is nice. Like I said, the pan is heavier than it looks and quite deep for a pan of its size. We got adventurous and used it to try our hand at frying (this time shrimp tempura), which was catastrophic with other pans. Because the skillet is so deep, we were able to fit enough oil and shrimp without spattering and making a mess. The oil stayed at a constant temperature and they turned out wonderfully. After mastering the temperature difference (you’d be surprised), we also used less oil and butter because nothing stuck and so much healthier for us. The pan is still as shiny as when we first got it, after all of our mishaps. We just soaked it in warm water with some soap for a while and most of it came off under the running water! We didn’t even need to use a scrubby sponge (which I don’t recommend on any pan, reason we are buying a new one). I do wish for the price we paid, that it did have a lid, but they are sold separately unless you buy the whole entire set. (Which may wind up on our wedding registry though). If the rest of the set is as well made as this skillet I would definitely highly recommend the entire set. Overall, I can’t say enough awesome things about the USA Pan. It was the first USA Pan we’ve ever bought and it’s safe to say we’ll definitely buy some more in the future!",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kasi623Kasi623",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIT6UMDQ7SDADRWYPN5NYKYDVGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NVTHKMG1B074?ASIN=B00KOVG6F8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2023",
                "reviewTitle": "4.0 out of 5 stars Great little pan, but not heavy enough",
                "reviewText": "The media could not be loaded. I love the size of this little pan and it cleans up easily and nicely. The only negative is that either the pan needs to be heavier or the handle needs to be slightly lighter because the pan tips even with food in it. I still like it and use it, but I have to be sure to move ingredients away from the handle side if I don’t want it to tip on the burner or counter.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71lq-Uhd7GL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/84a6ad1a-fa0d-4bcd-b4d6-89bb3ac367f7/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "J. MorenoJ. Moreno",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH75CQ2RNES36PQEPH6WISJCPS4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT70AGQDKE4L7?ASIN=B00KOVG6F8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 21, 2015",
                "reviewTitle": "5.0 out of 5 stars Best pan I've owned so far!",
                "reviewText": "Hello all, I have purchased this pan less than a week ago and received it Friday (7/17/15). This is my first stainless steel pan. I decided to purchase this particular pan because:1) Price ($30?!?! What?!)2) 5 ply (Again, what?! For only $30??)3) Made in U.S.A4) I needed something small for eggs!In the past, I have tried cooking with non-stick pans and Lodge cast iron pans and with both I have failed miserably. I know what you're thinking, how did I fail to cook on cast iron?! Well, everything just burned on the pan for me despite proper care. When I purchased this pan I found it interesting that similar pans by competitors cost nearly 3 times as much and they might not even be made in the U.S.A!Since this is my first stainless steel pan, I looked up \"how to cook with stainless steel\" and most of the websites I read expressed to use the water droplet test to find out when the pan is ready. You'll know when you pan is at the right heat when you place some droplets of water in the pan, they come together and form a \"ball\" and just moves around the pan without evaporating. This is when you know when your pan is ready for butter/oil! (Thanks paleoleap.com!) Once I found the right temperature (about 3.2-3.4 on my electric stove) I made some delicious eggs. I even made scrambled eggs the way I like them for the first time in my life. I have never been able to make scrambled eggs on any other pan. When I was done, the pan came out fairly clean, I just had to wipe it down with soap, water and my sponge.One of the other reviewers wrote that it takes a minute or two to release the food. I didn't understand what that meant, but after cooking on it for a couple times, I know what it means for the pan to \"release the food.\" It does take a minute or two for the egg to become free to be turned. I made the mistake of using a metal spatula at first and it did scratch the pan slightly, but not so badly that the pan became ugly. I ended up purchasing Epicurean Gourmet Series Utensils, Medium Turner, Natural/Black Nylon to compliment the pan (it's also made in the USA!!) and it has done a wonderful job thus far.To summarize, this a low cost, high quality pan that cooks great food. I highly recommend this pan to anyone who wants the quality of All Clad, but at a reduced cost!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71oJ4WS9dmL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Storybook Kitten",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSE4K6RZSCZEBQOZIRC3U7AFNDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RY1AE0CRP4G5G?ASIN=B00KOVG6F8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2022",
                "reviewTitle": "5.0 out of 5 stars Very nice quality pan.",
                "reviewText": "I really like this pan. I made pasta with shrimps and food did not stick. The toasted bits on the pan were nicely toasted and added to the flavor of the food. Nice size for one or two people servings. It's perfectly heavy and very solid. Cleaning is a breeze. I only wish I had an option to buy a lid for it. This is a 9\" inch pan.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "music lover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPR7TPGGH52MHQA2VEFHFVP3WWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39PJJ8GRREAHE?ASIN=B00KOVG6F8",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2023",
                "reviewTitle": "1.0 out of 5 stars Poorly balanced, not a flat bottom, tips over, hard to clean",
                "reviewText": "Don't understand all the great reviews for this pan. It's a nice shape and size, but everything else is extremely disappointing. Bottom is not flat and the handle tips the pan over whether there is something in it or not, so it wobbles on the burner. The bottom is higher in the center, which is easy to see when you put a little water in a dry pan and watch it make a donut pool around the dry center.I have nothing but stainless cookware and know how to cook in these pans, but after one simple saute, the inside finish of this was ruined: no shine, rough areas on the sides, a lot of effort with gentle, non-scratch cloths, but could never get it clean. A complete waste of money.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cephun",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKKL35BB3W4GXQNPMV5ZDGFCLSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JDQLCXRCFDU1?ASIN=B00KOVG6F8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome pan!",
                "reviewText": "This has become my egg pan. With a little bit of coconut oil, I flip eggs like a master. I wish they made bigger ones for other uses! It's super easy to clean, and is sturdy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Omar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 31, 2018",
                "reviewTitle": "Muy buen producto",
                "reviewText": "Excelente, y de muy buen tamaño! Apezar de ser el pequeño..",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "somenath chattopadhyay",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 14, 2018",
                "reviewTitle": "Fantastic",
                "reviewText": "Very good pan, as described. I am satisfied.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on February 13, 2023",
                "reviewTitle": "Very nice pan",
                "reviewText": "So well designed , and high quality finish. Thank you",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PuckerFactor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 26, 2021",
                "reviewTitle": "Great deep Skillet",
                "reviewText": "I love this skillet...it's actually 9\" in diameter. I got this for less than a third of the price it usually goes for. I don't know why it dropped to that low price and then went way up but these are not cheap in the USA. The regular price in Australian dollars is equal the US retail price, ...so I guess I lucked out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katy Z",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 4, 2016",
                "reviewTitle": "Good quality",
                "reviewText": "Very nice Pan. Good quality. Note: top of pan is 7\" in diameter, bottom is smaller.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}