{
    "remaining_requests": 34793,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/TECHEF-Collection-8-Nonstick-Frying/dp/B00SPUDQBC",
    "body": {
        "name": "TECHEF - Art Pan Collection, 8-in Nonstick Frying Pan, Made in Korea (Frying Pan 8-in)",
        "price": "$24.99",
        "originalPrice": "$29.99",
        "rawPrice": 24.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/TECHEF-Collection-8-Nonstick-Frying/dp/B00SPUDQBC",
        "soldBy": {
            "sellerID": "A1HFC1ET0XECZB",
            "name": "CookKing USA",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1HFC1ET0XECZB&asin=B00SPUDQBC&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B06XS9WH95"
        ],
        "asinVariationValues": [
            {
                "asin": "B014BFT3SE",
                "variationName": "Size",
                "variationValue": "2-quart",
                "price": "$38.99",
                "variationImageURL": ""
            },
            {
                "asin": "B014BFT3ZC",
                "variationName": "Size",
                "variationValue": "3.7 quart",
                "price": "$46.99",
                "variationImageURL": ""
            },
            {
                "asin": "B00SPUDQBC",
                "variationName": "Size",
                "variationValue": "8 inches (20cm)",
                "price": "$24.99",
                "variationImageURL": ""
            },
            {
                "asin": "B00X2U8XOU",
                "variationName": "Size",
                "variationValue": "9.4 inches (24 cm)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B091MH4R5Y",
                "variationName": "Size",
                "variationValue": "Frying Pan 10-in",
                "price": "$33.10",
                "variationImageURL": ""
            },
            {
                "asin": "B01N15PSCM",
                "variationName": "Size",
                "variationValue": "12 inches",
                "price": "$38.99",
                "variationImageURL": ""
            },
            {
                "asin": "B08KSDH52Y",
                "variationName": "Size",
                "variationValue": "12\" Chef Pan",
                "price": "$46.79",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31aB71-pn3L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41YA6fRJbhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41paBja-AzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vHTrirCyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51is V0Ej L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lU-wQ0t5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51x48KLpzjL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the TECHEF Store",
            "link": "https://www.amazon.com/stores/TECHEF/page/95F10803-5440-45A0-819D-9F013FBC843D?ref_=ast_bln"
        },
        "brand": "TECHEF",
        "merchantInfo": "CookKing USA",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 811,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Built for Performance: Forged heavy-gauge aluminum (commercial-grade 3004) construction distributes heat evenly and prevents hot spots",
            "Exceptional Design: An extra-tall, sloped sidewall provides more cooking surface and makes food easier to toss. Rivet-free interior surfaces prevent food buildup.",
            "Long Life Nonstick: New Safe PFOA Free Teflon with new, proprietary, and patented scratch resistance technology - No PFOA, No Cadmium, No Lead",
            "Print Design Technology: 5-layer reinforced nonstick coating provides more durable, longer-lasting performance and aesthetic pleasure",
            "Induction-Ready Heavy-Duty Forged Base: Ensures no warping/wobbling and works with all stoves such as electric, gas, and ceramic stoves, including induction",
            "Heat-resistant soft touch handle for a comfortable grip that makes for convenient handling",
            "Oven/Dishwasher Safe: Oven safe up to 350ºF and dishwasher safe for easy cleaning",
            "The ultimate kitchen workhorse: Ideal for pan frying, stir frying, grilling, frying eggs, baking, omelets, and so much more.",
            "The pattern on the bottom of the frying pan helps to cook better and healthier food with just the right amount of oil, every time",
            "Made in Korea - Delivers outstanding performance and exceptional quality"
        ],
        "description": "Art Pan Collection Cooking healthy food for a healthy family easy, fun, and environmentally safe Drawing upon more than 30 years of cookware design and manufacturing experience, we’ve developed our exclusive collections of professional-quality nonstick cookware to give exceptional performance and style. A forged thick aluminum construction No PFOA, No Cadmium, No Lead Oven safe at up to 350°F (450°F for Everyday Pan & Saute Pan) Dishwasher Safe Made in Korea",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Cookware",
                "link": "https://www.amazon.com/cookware/b?ie=UTF8&node=289814"
            },
            {
                "name": "Pots & Pans",
                "link": "https://www.amazon.com/b?ie=UTF8&node=19343857011"
            },
            {
                "name": "Sauté Pans",
                "link": "https://www.amazon.com/Saute-Pans/b?ie=UTF8&node=289828"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "TECHEF"
            },
            {
                "name": "Material",
                "value": "Aluminum"
            },
            {
                "name": "Special Feature",
                "value": "Non Stick"
            },
            {
                "name": "Color",
                "value": "Purple"
            },
            {
                "name": "Capacity",
                "value": "8 Inches"
            },
            {
                "name": "Compatible Devices",
                "value": "Smooth Surface Induction, Gas, Electric Coil"
            },
            {
                "name": "Product Care Instructions",
                "value": "Dishwasher Safe"
            },
            {
                "name": "Maximum Temperature",
                "value": "450 Degrees Fahrenheit"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Is Oven Safe",
                "value": "Yes"
            },
            {
                "name": "Model Name",
                "value": "Art Collection"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Product Dimensions",
                "value": "12 x 8 x 2.3 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.634 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "TECHEF"
            },
            {
                "name": "ASIN",
                "value": "B00SPUDQBC"
            },
            {
                "name": "Country of Origin",
                "value": "Korea, Republic of"
            },
            {
                "name": "Item model number",
                "value": "APIHF20"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 811 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#93,430 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #162 in Sauté Pans #454 in Woks & Stir-Fry Pans"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "January 25, 2015"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Art Pan Collection deliver outstanding performance and exceptional quality while providing safety for healthy cooking with new PFOA Free non-stick coating. 8\", 9.4\", 12\" Frying Pan 12\" Stir-Fry Pan / Wok 12\" Everyday Pan with Lid 3.7 Qt Soup Pot with Lid 2 Qt Soup Pot with Lid 5 Qt Saute Pan Art Pan Collection Cooking healthy food for a healthy family easy, fun, and environmentally safe Drawing upon more than 30 years of cookware design and manufacturing experience, we’ve developed our exclusive collections of professional-quality nonstick cookware to give exceptional performance and style. A forged thick aluminum construction No PFOA, No Cadmium, No Lead Oven safe at up to 350°F (450°F for Everyday Pan & Saute Pan) Dishwasher Safe Made in Korea",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/6edd65f0-fa42-4676-b377-cf7b4cf13c0e.__CR0,0,600,800_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Coated 5 Times with Safe New Teflon Coating TeChef cookware is designed with a 5 layer nonstick coating using Teflon Select nonstick made without PFOA. Most other cookware offered by other manufacturers is composed of only a 3 layer nonstick coating (primer, mid-coat and top-coat). Induction-Ready Heavy-Base In contrast to cookware with a uniform thickness, TeChef incorporates a forged aluminum material with thin walls and a 3.5 millimeter thick heavy bottom. This patented design helps spread the heat evenly across the bottom of the pan and all the way up the sides. Teflon Print Design Technology The pattern on the pan helps in cooking better and healthier food with the right amount of oil. The uniquely designed and decorated cookware incorporates Teflon Print Design technology - an innovative and safe method for applying color and prints without the use of harmful external paints. Last Longer than Ceramic Cookware and Are Better for Earth 1 pan coated with Teflon Platinum nonstick delivers the same level of nonstick performance as 7 ceramic pans.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/bfaf37ec-375d-4ed2-ba14-884e73e4c957.__CR0,0,1500,1500_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/48f31703-2fd4-474e-8604-107e778c87b3.__CR503,599,1176,1176_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/6f0f771e-8119-4ac2-8b12-95614e8833c4.__CR0,0,2760,2760_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/60986bdf-8bae-45a0-a9f4-82ce6ac685ef.__CR0,0,917,917_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "12 IN STIR FRY PAN 12 IN EVERYDAY PAN 5 QT SAUTE PAN 3.7 QT SOUP POT 2 QT SUKIYAKI POT 12 IN FRYING PAN",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/0f57ef5f-06fe-4102-ae88-0b5760cda3a8.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/6edd65f0-fa42-4676-b377-cf7b4cf13c0e.__CR0,0,600,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/bfaf37ec-375d-4ed2-ba14-884e73e4c957.__CR0,0,1500,1500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/48f31703-2fd4-474e-8604-107e778c87b3.__CR503,599,1176,1176_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/6f0f771e-8119-4ac2-8b12-95614e8833c4.__CR0,0,2760,2760_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/60986bdf-8bae-45a0-a9f4-82ce6ac685ef.__CR0,0,917,917_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/011a8ed2-7ff7-47a6-ad75-b0228a650715.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/713dd32c-5bc3-4362-bb34-efeebd13d639.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/784f1a8c-9470-4f58-b2c2-ef3dcf1ab12b.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/c0139f45-6392-4132-a651-560b07270a8f.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/fe70364a-eb20-4f8b-b30d-23486fb766a9.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/93258644-c670-4f08-8216-16cb25d4fe6d.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/95bec973-77a1-4152-badf-f866e80a3085.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Richard A. Nanian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTI7G2BUCRJ32U7VL4YWSOWMYNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GXO2Z4OOSDD3?ASIN=B00SPUDQBC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 29, 2014",
                "reviewTitle": "5.0 out of 5 stars The Purple People Pleaser",
                "reviewText": "I've been using the pan regularly for about three weeks, and these are my observations so far. I will update the review if anything changes. All comments here reflect using it with gas, so I cannot speak to the complaints some people have about the pan's performance on an induction range. Full disclosure: the company offers a $5 coupon if you review its products, but you get the coupon whether the review is positive or negative. To quote their literature: \"We don't solicit a positive review. Your honest and unbiased opinion regarding this product would be greatly appreciated.\"First, I should note that the picture on this page is somewhat misleading: the purple color covers almost the entire pan surface inside and the sides of the pan outside. The picture shows a bronze color on the inner sides of the pan, but this is inaccurate.Size and shape: The pan is generously sized, a true 11 inches inside measurement at the lip, with -- more importantly -- a flat surface just a hair under 9 inches across. This makes it useful for most sautéing and pan-frying purposes. If I were making just one or two eggs, I would use a smaller pan, and when I cook fried chicken or steaks, I use cast-iron. I also have a large wok for stir-frying. But this size pan is the most broadly useful. The angle of the sides is perfect: a shallower angle would reduce the cooking surface, while a steeper one makes smoothly tossing the contents one-handed (as you see chefs doing on TV) impossible.Non-stick performance: Generally excellent. I've had slicker non-stick pans, but now we find out they were carcinogenic. Nothing sticks badly to this pan. That doesn't mean you can just wipe it out with a paper towel, but I've never found that a selling point. A soft sponge, a little dish-soap, a few times around the pan inside and out -- voila, it's clean. What's particularly nice is that the non-stick coating covers the outer sides of the pan as well, so any drips that run down the side and cook on come off easily. The pan does have a small gap in the non-stick coating around the inner rim, but so far that has not caused any significant problems. The base is a shiny metal that I imagine something would stick to if a sauce overflowed the side, but a little Bon Ami or Bar Keepers Friend (ugh, that missing apostrophe bothers me) will take care of that. I do not put my pans or knives in the dishwasher. Putting non-stick pans in the dishwasher is completely unnecessary and will quickly destroy them. Also, I always let the pan cool most of the way before washing it: pouring cold water into a blazing hot pan will cause rapid contraction of the metal, which can damage any non-stick coating or even warp a pan.Cooking performance: The pan heats evenly. The shiny metal base I mentioned contains an aluminum core that distributes heat beautifully, and I believe the core also extends up the sides, which is helpful if you want to sear something like a scallop by holding it in silicon-tipped tongs and pressing it to the side of the pan. Having that aluminum core also means the pan retains heat well: the temperature in a thin pan drops dramatically as soon as you add food to it. Eggs turn out nicely with just a tiny amount of assistance (a small amount of butter or oil, or some Canola spray). I never try to cook eggs in a completely dry pan. Finally, the advantage of a non-stick surface that's not quite as non-stick as the carcinogenic kind is that it will give you a bit of a sear. This is not the pan I would usually cook burgers or steaks in, but I experimented with burgers and various vegetables, and the pan gave them a decent amount of caramelization. Hurrah for the Maillard reaction.Other points: The pan does not have internal rivets; the handle is held on with a tension screw. Some people hate that, while others love it. I think that for a non-stick pan it makes sense. Internal rivets are more secure in the long-term, but they create little crevices you must scrub around in order to get out any bits of food or sauce. That's fine for my Cuisinart stainless steel set, which is nearly indestructible, but on a non-stick pan, the scrubbing required to get the groove around the rivets clean will take off the non-stick coating prematurely. Indeed, that is what happened to my last non-stick pan (the 10\" Stone Earth Pan by Ozeri): within six months or so, the coating was coming off the rivets. I also found my prior pan disappointing because the enamel outside stained and the surface began losing its non-stick properties within a few months of purchase.The TeChef pan is oven-safe up to a reasonable temperature -- certainly high enough for when you want to sear something and then finish it in the oven. I wouldn't try to pan-roast a spatchcocked chicken at 500 degrees in this pan, but that's not what I have this pan for. (The instructions are more specific about the pan's limits, but I don't have them at hand.)Aesthetically, the purple is attractive, if you care about that sort of thing. I hang my pots from a rack, meaning they are always visible, so having an attractive pan is a plus. The little design in the center tells you how much oil you are using and how many calories that means you are adding to your food. I didn't need that, but I have to say it's a good reminder. Adding a bit of fat improves the cooking process and the result in several ways, but adding three times as much doesn't bring any advantages, and meanwhile your sautéed asparagus have become less healthy than you told yourself they are.One funny note: when the pan starts to cool, it usually gives off one small \"ping.\" The first few times I used it, I'd finish cooking and be eating when suddenly I'd hear this soft metallic note. I'd wonder if something fell or dripped into it. But then I realized it's just the pan itself, that something must be contracting as it cools.You can spend more than $100 on a non-stick pan of this size, and personally I doubt it will perform better or last longer. Of course, I don't expect a non-stick pan to last as long as my stainless pans, but if this pan performs this well for two years, I will consider it a bargain.Update (September 2015):I will be replacing this pan soon. I've used it steadily -- not every day, but most days -- and it is still an attractive pan. The surface looks virtually the same as when I bought it, except that the little design in the center has darkened, whether because it has partially worn off or because the lightly colored graphic has absorbed color from food I can't say.However, the non-stick performance has diminished. For eight or nine months, the pan performed like new. Then in the spring I started to notice just a little sticking. While not serious, I had to be use more oil, butter, or non-stick spray to achieve the same results. This trend continued, and by August the pan could not honestly be called non-stick anymore. The excellent heat distribution means it's still a useful pan, but I don't even try to use it for eggs or fish now. The last time I tried to use it for scrambled eggs, I ended up scrubbing about a third of the eggs off the pan. Indeed, my Cuisinart stainless does a much better job with eggs now than this pan does when using the same amount of butter.I see that I said, \"if this pan performs this well for two years, I will consider it a bargain.\" Well, that was probably too much to hope for. It performed like new for nine months and reasonably well for a year. Given the price, I still consider it an excellent value. For that reason, and because I bought the glass lid from TeChef that fits it -- a great vented lid, incidentally, because of the design, which allows you to stand it up on the counter, which keeps it handy and prevents it from dripping wherever you set it -- I will probably buy the same pan again. The dream of a truly durable non-stick pan remains elusive, but at least we aren't trading health for convenience.",
                "reviewVotes": "91 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul W. May",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEMMFVCVRMAVXZ34G2BUGXX5XCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20K78AW10KSDK?ASIN=B00SPUDQBC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Best pan I've had!",
                "reviewText": "I LOVE the Techchef purple pans! They seem so durable and clean so easily!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ShSh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEI7LBH2V3ITAKRSWYPC7TNAR5KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB6QOT73K2UC8?ASIN=B00SPUDQBC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars I love it!",
                "reviewText": "Not my first TECHEF frying pan, and it certainly won’t be my last. I only used it once and I completely fell in love with it, the same way I fell in love with my TECHEF Tamagoyaki (Japanese Omelette) frying pan. I only used this frying pan once, but I instantly knew that it was good because it’s non-stick (as advertised) and it’s heavy. Note that it is a little deeper than your typical frying pan, but it’s not a bad thing as you can fit more in it, especially if you’re the type to reheat food on the stovetop instead of a microwave, which is what I do. I highly recommend it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71bJeVEkDVL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juan Rivera",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGM47SEZ2RPT5HPL4UQS7DQ4D4MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21JIWSG7DR4VR?ASIN=B00SPUDQBC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2015",
                "reviewTitle": "5.0 out of 5 stars SAFE NO PFOA AND another great pan from techef",
                "reviewText": "The media could not be loaded. I got it a few days ago only used this pan twice and I am also giving it five stars right off the bat. The design and features on this pan are excellent. I like that they even put a little design in the middle of the pan showing you the amount of oil to use. This frying pan is attractive and it was very well thought out. the pan has some nice weight to it well-balanced. I initially started off with the Techef stir fry wok pan and that also did excellent right out the box . I am in the process of ordering the 8 inch frying pan, 12 inch frying pan, omelette pan and all the lids that go to all the pans.When you know you got something that's built solid, attractive and reliable you go for the rest and I believe the price is set right under $170 for 5 top notch pans and 4 uniquely designed lids. These pans are one of the best pans I have used yet. I have tried a few sets of nonstick pans and none were as solid or work as well as the Techef right out the box. My only complaint is that they don't have pots to go with the pans. Techef can you work on that please.Important note and info:This item does not contain the possible cancer causing PFOA in which the teflon brand had. Dupont no longer uses PFOA in the teflon brand.Update 3/9/17The 4 pans one soup pot I own from Tchef are two years old and used regularly. I keep wondering... When will the non-stick fail? The pans still working like new. Two years with a non-stick surface pan is dam good. Usually I will have to get new non-stick pans within a year. These pans still look great even after the beating My wife, daughter and I give it. All of us cooking almost daily in one or two of the pans.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/284e4e40-1694-48b8-a833-f45f01e6acde/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "KrankyKoot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOSJKBT7BU2N5GXH4XM2FURWX7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JVAQW5WIO6HS?ASIN=B00SPUDQBC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2016",
                "reviewTitle": "4.0 out of 5 stars Great cooking value",
                "reviewText": "This is example of a top quality product at a reasonable price from a reliable company. The pan is well weighted and looks great. Unfortunately we are unable to fully report on its cooking capabilities because of its limitations on a Samsung Induction range. Others have said it does not work on a Samsung Induction range which is not entirely true. It did work on the back burners of our range but took a long time to heat up and required a bit more heat than the cheap 8\" pans we are used to. The bottom is MOSTLY magnetic which is why users of other brand Induction ranges rave about it. But the center portion of the base is not magnetic and I suspect Samsung safety sensors are rejecting it because of this. So the one star off should be for Samsung.After using cheap (and not so cheap name brand) 8\" Teflon pans that last a year before starting to stick we really wanted to use this pan. We e-mailed TeChef customer service to see if there might be a solution and to our surprise they responded in less than a day. After explaining our issue in detail they apologized for our inconvenience, thanked us for the information and gave us a link to Amazon returns. We will be looking to this company for other cooking needs in the future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thaly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 2, 2018",
                "reviewTitle": "Holy Grail!",
                "reviewText": "Hace unos meses me cambié a un cast iron, amo cocinar en el pero el cuidado que se le tiene que dar es demasiado y quería un sartén que pudiera usar diario y fuera fácil de lavar.Este sartén superó mis expectativas, tengo 2 semanas usándolo diario hasta 3 veces al día y todo parece indicar que va a durar! No se le pega nada y el color morado no es escandaloso. Estoy pensando adquirí otro.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mackenzie Westie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 18, 2017",
                "reviewTitle": "Good quaulity, beautiful presentation",
                "reviewText": "Quality of the soup pot is better than most other products in similar price range. I bought both 2Q and 3,7Q sizes.It is on the small side, that makes it perfect for smaller meals. I have a gas range, so far there has been no discoloration on the side. It may sound strange, but the pot is beautiful to look at, so I used it as a serving vessel as well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. G. E. Downs",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 21, 2016",
                "reviewTitle": "slow in leaving a review - well tested now & ...",
                "reviewText": "slow in leaving a review - well tested now & would recomend this pan as well as the dealer - has thus far held up well to my abusive use",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doris",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 29, 2016",
                "reviewTitle": "Fortement recommandée!",
                "reviewText": "Le meilleur achat que j'ai fait! Les poêlons The Chef sont une merveille à utiliser. Un soupçon d'huile et rien ne colle. Les viandes grillent et restent juteuses. Je n'en revenais pas! Avec le couvercle assorti, les légumes cuisent dans très peu de liquide et les plats braisés sont délicieux!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ed Vel h",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 8, 2020",
                "reviewTitle": "Gran sarten",
                "reviewText": "lo compre en un precio muy bueno en una manita y hasta ahora no se le pega nada con el cuidado que necesitan sera duradero ya varios meses con el",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}