{
    "remaining_requests": 34818,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cooks-Standard-10-5-Inch-Multi-Ply-Stainless/dp/B01ATZE4K2",
    "body": {
        "name": "Cooks Standard Multi-Ply Clad Stainless Steel Saute Pan 10.5 Inch, 4 Quart Deep Frying Pan Skillet with Lid, Induction Cookware, Stay-Cool Handle",
        "price": "$46.63",
        "originalPrice": "$51.82",
        "rawPrice": 46.63,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cooks-Standard-Multi-Ply-Stainless-Steel-5-Quart/dp/B01C3RJHDI",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B01C3RJHDI"
        ],
        "asinVariationValues": [
            {
                "asin": "B082G55NQD",
                "variationName": "Style",
                "variationValue": "3.5 Quart",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B01ATZE4K2",
                "variationName": "Style",
                "variationValue": "4 Quart",
                "price": "$46.63",
                "variationImageURL": ""
            },
            {
                "asin": "B00421AYK4",
                "variationName": "Style",
                "variationValue": "5 Quart",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "90",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41lx70Qk-YL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/414gZpJRAhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FU61OlGoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418fKRrM9HL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UwddTc96L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61m3i8M7 EL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Cooks Standard Store",
            "link": "https://www.amazon.com/stores/CooksStandard/page/44C5415A-2CD8-4281-9C52-75B8D5FB391B?ref_=ast_bln"
        },
        "brand": "CooksStandard",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 503,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 5 hrs 2 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Good Heat Conduction】Made of Multi-Ply Clad stainless steel with an aluminum core throughout for even and quick heat distribution. Secure-fitting stainless-steel lids trap in heat and moisture.",
            "【Practical Design】Stainless steel inside and out for durability and appearance and easy cleaning; Flat base and flared sides for pouring.",
            "【Stay-Cool Handle】Solid stainless-steel riveted handles offer durability and stay-cool during cooking with air-flow technology, comfortable for a secure grip.",
            "【Multi-Purpose Sauté Pan】Large size 10.5 inch is multi-purpose and holds temperature for boiling, frying, steaming, and more.",
            "【Compatible with All Stovetops】Induction compatible; works on: gas, electric, glass, ceramic, halogen, etc. Oven safe up to 500°F. Dishwasher safe."
        ],
        "description": "The Cooks Standard 10.5-Inch/4 Quart Multi-Ply Clad Deep Saute Pan with Lid, Stainless Steel has multi-ply construction with 2 layers of stainless steel and an aluminum core along base and walls. Stainless steel is durable, looks great, and cleans easily. Aluminum core for even/quick heat distribution and prevents hot spots. Stainless steel lid keeps heat and moisture in for flavor. Straight sides and flat surface can hold a large amount. Riveted handle and helper handle stay cool and are comfortable to hold. Tapered lip for drip-free pouring. Long and wide size for multipurpose function. Induction compatible. Works on gas, electric, glass, ceramic, halogen, etc. Oven safe to 500F. Dishwasher safe.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Cookware",
                "link": "https://www.amazon.com/cookware/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289814"
            },
            {
                "name": "Pots & Pans",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=19343857011"
            },
            {
                "name": "Sauté Pans",
                "link": "https://www.amazon.com/Saute-Pans/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289828"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Cooks Standard"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Special Feature",
                "value": "Induction Stovetop Compatible"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Capacity",
                "value": "4 Quarts"
            },
            {
                "name": "Compatible Devices",
                "value": "Smooth Surface Induction"
            },
            {
                "name": "Product Care Instructions",
                "value": "Dishwasher Safe"
            },
            {
                "name": "Maximum Temperature",
                "value": "500 Degrees Fahrenheit"
            },
            {
                "name": "Handle Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Item Weight",
                "value": "5 pounds"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Is Oven Safe",
                "value": "Yes"
            },
            {
                "name": "Model Name",
                "value": "Multi-Ply Clad"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Product Dimensions",
                "value": "20 x 10.25 x 3 inches"
            },
            {
                "name": "Manufacturer",
                "value": "Cooks Standard"
            },
            {
                "name": "ASIN",
                "value": "B01ATZE4K2"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "02460"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 503 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#71,084 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #89 in Sauté Pans"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "January 19, 2016"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "10-Piece Multi-Ply Clad Stainless Steel Cookware Set Classic 10-Piece Stainless Steel Cookware Set 10-Piece Multi-Ply Clad Stainless Steel Cookware Set with Fry Pan 7-Piece Tri-Ply Clad Stainless Steel Cookware Set 12-Piece Multi-Ply Clad Stainless Steel Cookware Set 8-Piece Nonstick Hard Anodized Cookware Se Brand Cooks Standard Cooks Standard Cooks Standard Cook N Home Cooks Standard Cooks Standard Item model number NC-00210 02631 NC-00235 02644 NC-00232 02709 Size 10-Piece 10-Piece 10-Piece 7-Piece 12-Piece 8-Piece color Silver Silver Silver Silver Silver Black Material Type Stainless Steel 18-10 Stainless Steel 18-10 Stainless Steel 18-10 Stainless Steel 18-10 Stainless Steel 18-10 Aluminum Construction Tri-ply Clad Bottom Impact bonding aluminum disc Tri-ply Clad Tri-ply Clad Tri-ply Clad Hard Anodized Handle Cast Stainless Steel Cast Stainless Steel Cast Stainless Steel Stainless Steel Cast Stainless Steel Stainless Steel Hollow Dishwasher Safe ✓ ✓ ✓ ✓ ✓ ✓ Induction Compatible ✓ ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9fa27e85-b11a-4705-a908-bc38ed1f4faf.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c42b0e4a-f932-4fe1-a318-ff7497912776.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c12cd8c9-7705-451c-8095-da3a741d4bfd.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4c5561aa-79d6-4f88-9486-33f6156bb3f1.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7099cc18-a389-4c27-b77c-7ca7a449afce.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fca0ffae-2f31-41d6-8bd9-913d9d827d15.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d18ef2ab-a263-43db-a8df-297e5512f364.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1fb94020-2b71-4f44-a3f5-677aea4a4bd2.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7ffe442-6ee7-4b18-8a99-cef4ca5b338b.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/08f8b8c9-b978-40c8-adff-97885a7f3a45.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Foodie1",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6LJK6F4KYTDD2NVL4JD5W6BX3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNWV14QNMKZ3K?ASIN=B01ATZE4K2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2013",
                "reviewTitle": "5.0 out of 5 stars Same quality as Le Creuset, better design than All-Clad!",
                "reviewText": "This review is for: Cooks Standard Multi-Ply Clad Stainless-Steel​ 5-Quart 11-Inch Covered Deep Saute Pan.VALUE. I've been wanting a set of tri-ply stainless cookware and never understood the premium people were willing to pay for All-Clad. I was really glad to find this brand - I got the 10-piece set and this deep pan - it was cheaper at the time to buy it separately, than to buy the bigger set that includes it. The sets are a fantastic value, the separate items are a bit more pricey, though. I also ended up ordering the 13\" \"wok\" (chef's pan with dome lid) - it might not be a true wok, but it's a great risotto vessel!CONSTRUCTION/QUALITY. Anyway, these are so well made. And attention to detail is excellent - these are done by smart people. I also have a couple of tri-ply Le Creuset sauce pots and Cooks Standard is every bit as good, though I prefer Cooks Standard shapes of handles, design.DESIGN. Ergonomic handles. I never liked All-Clad skillet handles - skinny and painful. These pans have comfy handles. Every pan and pot in these sets has a FLARED RIM - very important for drip-free pouring. I won't even buy stainless pots/pans without the feature anymore, regardless of the value. The finish is brilliant - I thought they were photo shopped until I received them :) The interior is matte (brushed), which is also good. All the handles - pots, pans and lids (except the steamer basket lid) have the air-flow \"stay cool\" design - very helpful and they also look stylish. The rivets are all stainless, at least on the inside. Even some brand-name cookware have aluminum rivets, which are strong enough, but aluminum will eventually grey (oxidize).PERFORMANCE is excellent. To be sure, that's just physics, it's not like stainless steel is some proprietary material - laws of physics apply across all the brands given the same thickness/construction (these work better than the cheaper thin stainless with thick metal bottom). If your foods are sticking, then it's your technique, not the cookware. But if you use proper technique, you can sear meats and even fry eggs with no sticking. Most other foods (vegetation) cooks without sticking even without regard to technique (but I still like to preheat). Yes, the technique is quite different from teflon/nonstick, but it's worth it. I am not afraid of well-made nonstick cookware (i.e. anodized), but got tired of them wearing out after a couple of years. And you can't put anodized into the dishwasher. Also, the multi-clad cookware is not terribly heavy - just slightly heavier than all-aluminum.CLEANUP. I told myself that I wouldn't baby this set, so I wash them in the dishwasher just about every time - no issues, it stays brilliant. I haven't needed it, but Barkeeper's Friend will help with removing tougher stains, like if you overbake something in the oven. I once used it to restore an old copper-clad skillet and it removed all the gunk. Normally I just pour boiling water into them while still hot (as if deglazing) and scrape with wooden spatula or let it sit about 10 minutes for the extra tough stuff. After that EVERYTHING comes off.INDUCTION cooktops. Yes, it works.BOTTOM LINE: don't buy into the hype of where it's made geographically. These are fantastic on their own, but even better for the money.P.S. It looks like Cooks Standard also released \"5 ply\" cookware, but I don't like their look (handles) as much as these. I have a \"5-ply\" Mauviel roasting pan, but I always thought that's a gimmick - as long as you have a conductive sandwiched core, you're good to go, regardless of how many layers.",
                "reviewVotes": "95 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bubba Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZGMVASK6NGLEK7SHP3Q3QOYJFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNQECOH6CMOQJ?ASIN=B01ATZE4K2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2015",
                "reviewTitle": "5.0 out of 5 stars Metal thickness, weight, size",
                "reviewText": "Weight 3 pounds 12.6 ouncesHeight = 3 inchesDiameter of top rim = 11 5/8 inchesDiameter of flat bottom surface = 10 inchesWall thickness = 2.4 mmBottom thickness = 3.5 mmThis is a very nice pan. Its it a bit heavy if just lifting with the long handle but with the second helper handle it is quite easy to move around. Size is nice for a family meal or when you are planning to make enough for leftovers but lets face it, this is a pretty serious pan. The finish and construction is very good and complements the rest of the multi-ply stainless set very well.I have the 10 piece set which is very nice but just didn't have enough room in the 10 inch pan. This one is quite a step up in size. The other pans in the series are \"traditional\" shaped with tapered sides and sound bigger than they actually are. For example, the 10 inch pan is 10 inches at the top but only really gives you about 7 inches of cooking room. This 11 inch pan actually gives about 10 inches of cooking room because the side walls are straight and not flared. Causually, the 11 inch pan doesn't sound much bigger than the 10 inch pan but in reality it provides 2x the cooking area. This 11 inch pan has more cooking room than the 12 inch pan.Simple clean-up and even cooking accross the entire pan. I was kinda surprised about that given the large bottom size of this pan. I think that may be the result of the fairlry thick base on this one.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nathan Frith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGG4YUKJBZC3ATNZM4EZS322ICA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E40TNUTCZD90?ASIN=B01ATZE4K2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2014",
                "reviewTitle": "5.0 out of 5 stars Excellent bargain!",
                "reviewText": "The Cooks Standard Multi-Ply Clad Stainless-Steel 5-Quart 11-Inch Covered Deep Saute Pan is of excellent quality. The solid stainless handles are securely riveted to the surprisingly heavy duty multi-ply shell. The lid is solid as well, though only single-ply stainless, but still well-made and fits the pan well. After several weeks of use (we got this at Christmas), the pan's finish has held up well, just be sure to get some steel wool (SOS pads work well) and some Bar Keeper's Friend. The BKF is seriously magic stuff and will keep your pan looking great. Whatever you do, DO NOT use Scotch-Brite, or anything else more abrasive than steel wool. You'll ruin the smooth surface and make it more prone to sticking.If your used to non-stick, you'll need to use lower heat with this pan, and pre-heating the oil and pan before adding your food will help keep sticking to a minimum. Bottom line though, you will get some sticking, but as long as you don't burn it, it cleans up easily. Stubborn deposits can be softened up by adding some water to the pan after cooking and putting it on low heat for a few minutes. Deglazing with wine, broth or water during cooking will also help, provided the recipe allows for it.I am sure that All-Clad pans are great, but if you, like me, wish to retain as much of your hard-earned cash as possible, you can't go wrong with Cooks Standard.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dewey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 20, 2020",
                "reviewTitle": "Long-term Review: Great sauté pan that has withstood the test of time",
                "reviewText": "I purchased this product several years ago and have cooked extensively with it on a gas range during that time. I've prepped and cooked dried beans, chickpeas. Made 1 pan pasta, osso buco, braised fish, confit, pork chops, mustard chicken, anything! It handles everything that I throw at it without any problems.The pan is large enougha and has high enough sides that I use it, along with my trusty le Creuset, as my go to cooking vessel.I have also purchased the sauce pot and love it as well. Have put both through the dishwasher when I'm feeling lazy.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pako",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 17, 2019",
                "reviewTitle": "Exelente calidad",
                "reviewText": "Exelente calidad",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angie M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Good quality and Versatile",
                "reviewText": "There's so much you can do with this pan. It's nice and deep so can be used for soups etc. but I use it a lot for frying large steaks or stir fries and a whole lot more. It's a much more affordable option than some of the other brands, and I don't think there is any real difference. I have an All Clad smaller regular frying pan with lid and it doesn't stand out as being any better than this one. I would buy it again or even as a gift.It needs a good scrub with a stainless steel powdered cleaner after every few uses to make it shine like new again, nothing like baking soda or anything else has been able to get all the marks off of them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M K Meep",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 19, 2017",
                "reviewTitle": "Want a pan with relative high sides vs a fry pan? This is a serious budget contender.",
                "reviewText": "The pan arrived in great condition in the manufactures box and the pans bottom was perfectly flat. You could easily use this as a main pan for meals for 3-5 people. Look at videos on temporary seasoning of stainless steel cookware if you want to use it in place of a non stick pan. Using those techniques I even fried eggs as a test with little issue.Pros: Really excelled at making a one pot fish stew, braising chicken thighs and did a very good job of searing last nights strip loin steaks. I've only cooked with it for 6 meals, but so far I am impressed with this 5 quart pans performance at this price point. Fairly large surface area for browning and sautéing so your food doesn't get crowded and steam instead. Lid does an adequate covering job. Handles stayed pretty cool too and were comfortable compared to some other brands pans that cost multiples of this pans price.Cons: Laser engraving on the lid screams budget cookware and a bit of play on the lid is present. Not the thickest metal so as you get to very high temps you have a bigger difference between where the heat is and overall pan temp. A little oil or melted butter and time will help even out those temps. Would have liked a 6 qt size with even higher walls so I could replace my smaller wok too.Conclusion: One of the best sauté pans on amazon at this price point.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter Skelton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 6, 2017",
                "reviewTitle": "Worth every penny.",
                "reviewText": "Exceeded expectations. Great quality; which suggests it will last a lifetime.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}