{
    "remaining_requests": 34776,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ozeri-Ceramic-NEP-Free-German-Made-Coating/dp/B005470CB6",
    "body": {
        "name": "Ozeri Green Ceramic Frying Pan 100% PTFE, PFC, APEO, GenX, NMP and NEP-Free German-Made Coating, 8-Inch",
        "price": "$20.93$20.93",
        "originalPrice": "$29.99",
        "rawPrice": 20.93,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ozeri-Ceramic-NEP-Free-German-Made-Coating/dp/B005470CB6",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B007YZ7CYQ"
        ],
        "asinVariationValues": [
            {
                "asin": "B005470CB6",
                "variationName": "Size",
                "variationValue": "8-Inch",
                "price": "$20.93",
                "variationImageURL": ""
            },
            {
                "asin": "B004CSXMP6",
                "variationName": "Size",
                "variationValue": "10-Inch",
                "price": "$29.95",
                "variationImageURL": ""
            },
            {
                "asin": "B005473FMO",
                "variationName": "Size",
                "variationValue": "12-Inch",
                "price": "$33.80",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "18",
        "stockDetail": "Only 18 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31EQOy2ii5L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41sDBcGUG L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21QiRqX53pL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YJUHtU0fL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QVNPIHrJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91oeCh1oNBL.png"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ozeri Store",
            "link": "https://www.amazon.com/stores/Ozeri/page/4D36A8A8-761E-4CA9-902F-15EC4CF9F97D?ref_=ast_bln"
        },
        "brand": "Ozeri",
        "merchantInfo": "",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 3763,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 5 hrs 55 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Thursday, February 15. Order within 5 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Utilizes a ceramic non-stick coating from Germany that is 100% free of PTFE, Perfluorinated Chemicals (PFCs), APEO, GenX, NMP and NEP.",
            "Innovative honeycomb textured cooking surface delivers enhanced heat distribution.",
            "Scratch-resistant ceramic coating does not release harmful fumes or toxins at extreme temperatures.",
            "Made of a durable heavy-gauge aluminum core, with no heavy trace metals",
            "Boasts a comfortable heat-resistant silicon coated handle and a magnetized base for induction stoves."
        ],
        "description": "Utilizing pure ceramic as a coating, the Green Ceramic Pan by Ozeri achieves non-stick perfection while remaining absolutely free of PTFE and GenX chemicals (APEO, PFBS, PFOS, PFOA). Conventional pans sometimes achieve their non-stick performance through a waxy synthetic coating of PTFE (PolyTetraFluoroEthylene), which under extreme temperatures begins to decompose and release fumes that can be harmful to humans and pets. Additionally, PTFE is often made with the aid of per- and polyfluoroalykyl chemicals, also known as PFCs (PFBS, PFAS, PFOS, PFOA), which the EPA has cited as potential carcinogens, and APEO (Alkylphenol ethoxylates), which are under restricted use in Germany due to environmental concerns and toxicity in the food chain. With the Green Ceramic Pan's ceramic coating, no harmful toxic substances are ever released into the environment, even under extreme temperatures. The Green Ceramic Pan utilizes an inert, 100% ceramic coating, and applied using a water based Sol Gel Technique that is also free of the lesser known but potentially harmful chemicals NMP and NEP. This version of the Green Ceramic Pan features a honeycomb ceramic cooking surface designed to create small air pockets under food for optimized heat distribution. Coating by Weilburger, Germany. Pan assembled in China.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Cookware",
                "link": "https://www.amazon.com/cookware/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289814"
            },
            {
                "name": "Pots & Pans",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=19343857011"
            },
            {
                "name": "Woks & Stir-Fry Pans",
                "link": "https://www.amazon.com/Woks-Stir-Fry-Pans/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289834"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Ozeri"
            },
            {
                "name": "Material",
                "value": "Ceramic"
            },
            {
                "name": "Special Feature",
                "value": "Non Stick, Gas Stovetop Compatible, Electric Stovetop Compatible, Induction Stovetop Compatible"
            },
            {
                "name": "Color",
                "value": "Green"
            },
            {
                "name": "Capacity",
                "value": "2 Quarts"
            },
            {
                "name": "Compatible Devices",
                "value": "Smooth Surface Induction"
            },
            {
                "name": "Product Care Instructions",
                "value": "Oven Safe"
            },
            {
                "name": "Handle Material",
                "value": "Silicone"
            },
            {
                "name": "Item Weight",
                "value": "1.6 pounds"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Is Oven Safe",
                "value": "No"
            },
            {
                "name": "Model Name",
                "value": "Green Ceramic Frying Pan by Ozeri"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "No"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Cooking"
            },
            {
                "name": "Product Dimensions",
                "value": "14.5 x 8 x 2 inches"
            },
            {
                "name": "Manufacturer",
                "value": "Ozeri Kitchen"
            },
            {
                "name": "ASIN",
                "value": "B005470CB6"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "ZP1-20"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 3,763 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#40,552 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #115 in Woks & Stir-Fry Pans"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "June 3, 2011"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Green Ceramic Frying Pan by Ozeri, with Smooth Ceramic Non-Stick Coating (100% PTFE and PFOA Free) Free of PTFE and GenX fluorinated chemicals Unlike other ceramic cookware brands, the Ozeri Green Ceramic Pan utilizes an ultra-safe ceramic coating inspired by nature which is 100% free of PTFE and GenX fluorinated chemicals (APEO, PFBS, PFOS, PFOA). Ceramic Non-Stick Delivers unprecedented non-stick performance without releasing harmful fumes or toxins at high temperatures. Features a scratch-resistant 100 percent ceramic coating that is super easy to clean. Aluminum Core Made out of durable heavy-gauge die-cast aluminum with no heavy metals or harmful chemicals. Bakelight Handle Boasts a comfortable heat-resistant Bakelight handle, and a magnetized induction stove safe base for rapid heat transfer.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/14a40130-ee4f-4266-a772-c4eae37a99a7.__CR0,0,544,544_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/497ccd16-7101-4e7b-8686-8c498d476166.__CR0,0,544,544_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5d717725-f68b-4f27-93a9-c71d54ef91bc.__CR0,0,544,544_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cc5660fd-26d3-492e-874b-68f75491b481.__CR0,0,544,544_PT0_SX220_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d09be0df-50c7-4e9b-be8c-a4914947206f.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/14a40130-ee4f-4266-a772-c4eae37a99a7.__CR0,0,544,544_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/497ccd16-7101-4e7b-8686-8c498d476166.__CR0,0,544,544_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5d717725-f68b-4f27-93a9-c71d54ef91bc.__CR0,0,544,544_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cc5660fd-26d3-492e-874b-68f75491b481.__CR0,0,544,544_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3da78863-46b7-42ef-ab0b-bf42b8dacb68.__CR0,0,1940,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "AbbeAbbe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY7XKS6UCDFXO7P7FUML47RJDRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P7D38MGEFDBR?ASIN=B005470CB6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 20, 2019",
                "reviewTitle": "5.0 out of 5 stars A reliable skillet with PTFE-free non-stick coating requiring consistent care",
                "reviewText": ".[ SEE UPDATES BELOW ]. With the oldest of our children interested in cooking some foods on her own, and her omelets preference, I decided to get her a frying-pan with anti-stick coating. My primary concern was steering clear of skillets coated with PTFE (a polymer known as Teflon), and not necessarily a long durability (particularly at this price range). It has been long known that PTFE undergoes degradation after some time at temperatures above 360 °F [200 °C]. Its extent and rate increase as the temperature rises, and this pyrolysis yields toxic fumes and a sublimate; such temperatures can be reached while cooking with a domestic stove at high heat. Depending on the concentration and exposure, PTFE fumes from an overheated pan may be a health risk to humans, and even be lethal to birds and other small animals; the best studied health effect of such toxic fumes is a flu-like syndrome (\"polymer fume fever\"), but more severe ones can occur, such as pulmonary edema and pneumonitis.Teens cannot be relied upon avoiding overheated pans and using good air exhaustion when cooking, so I got this non-PTFE frying-pan despite critical reviews about the durability of the coating. Sprayed plastic coatings have a thickness just larger than the 0.0015\" diameter of the average human skin cell, so it is illusory to expect a long useful life for them; even careful cleaning is likely to remove it bit by bit. SOURCE Ozeri is a brand name of Commonpath LLC (CA) and the coating is produced by Weilburger Coatings GmbH (Germany). The final product is assembled in China by an unidentified company, likely to be Zheijang Neoflam Inc., a cookware manufacturing operation of Neoflam Inc., headquartered in South Korea with subsidiaries in the US and Germany. In the past (but no longer now) the Ozeri website stated that the product centers were in the US, Germany, and Korea (see comment in amzn.to/2xXKSug), so it is possible Ozeri is simply a Neoflam product. SPECS This ZP1-20, 8-inch Green Earth Frying Pan has a textured surface cooking bottom and a Greblon ceramic non-stick coating. The frying-pan is made out of a heavy-gauge, die-cast aluminum -- likely commercially pure 1100 aluminum as the distributor claims the pan has no heavy or trace metals like lead or cadmium. It also has a ferromagnetic induction base since magnets stick to it. This base is not completely flat : it slightly curves inwards towards the center, as shown by red arrows in one of my figures. A concave base --recommended by the German Standard DIN 44904, provided the air gap is not too large or the metal base too thin-- is not a defect. When heated up it expands more in the center than in the periphery, making the pan to sit flush with the heat surface for an efficient use of heat (provided the heat-source size is similar to the pan's base size). Unlike the Bakelite handle of the smooth-surface pan model, the handle of this pan is coated with silicone (and not \"silicon\"), whose elastomers are generally resistant to temperatures as high as about 570 °F [300 °C]. The Product Information section of this webpage says the weight of the pan weighs 1.6 lbs, but the one we got only weighs 1.4 lbs [640 g]. For comparison purposes, that is between one-third to one-half the weight of similarly sized cast-iron skillets. It comes with a flower shaped, felt-like protector for the surface of the pan when stored with other items on top of it. COATING Weilburger produces several different Greblon coatings for houseware products, and those for cookware are identified by an initial letter C. At the time of this writing, most of them contain PTFE (CR, C2, C3 and their variants) and only two are PTFE-free (CK1, CK2). Instead of using the C-identifiers, whose properties are given in the Weilburger website, Ozeri uses names like Stonehenge for C3, and CERAM (later CERAMIC) for CK2. Neither this webpage nor the Ozeri website currently specify this skillet's coating -- it is CK2 (see my other figure). The difference between CK1 and CK2 is the number of sprayed coats. Both receive a primer coat with 30 to 40 μm of dry-film thickness, but CK2 receives an extra coat of 5 to 10 µm thickness. In the Weilburger's testing (British Standard 7069 abrasive pad test), CK2 has a better abrasion resistance than CK1. The resistance of CK2 is better than that of plain C3, and is as good as that of C3 reinforced with ceramic (C3+), so it is reasonable to expect that this pan's coating compares well with (Greblon) PTFE-coated pans in terms of abrasion. On the other hand, CK1 and CK2 have less non-stick capability than C3 in the Weilburger's testing. USER GUIDE The guide contains useful information on the handling and care of the skillet as well as on its limited lifetime warranty. The latter is only for personal and not commercial use, and requires the prepaid freight for returning a defective skillet. It is written in eight languages (English, Chinese, German, French, Japanese, Portuguese, Spanish, and Korean). I cannot judge the clarity of the Chinese and Korean texts, but in the other languages the concepts are well expressed, but for the funny mistranslation of water hardness (i.e., the amount of dissolved calcium and magnesium in the water) into \"water scarcity\" in the Spanish text. RATING We tested the frying-pan by cooking sticky foods (e.g., scrambled eggs, omelets, scallops, salmon, and fried rice), and in these initial tests we encountered no problems during cooking or when cleaning the skillet according to the user guide. Since we got this skillet a short time ago it is early days for degradation of the coating to develop, if that were to happen at all in our case. At any rate, even if it indeed happened after, say, a year or so, I'd consider that an acceptable outcome, as it is balanced by the pan's lifetime warranty and the absence of PTFE-fumes risk. __ UPDATE October 2019 -- Over the last 4 months the skillet has been used intensively and, to unending primogenital horror and drama, once (if not more times before that) someone cleaned it with a scouring pad. Despite that, the non-stick surface looks good and works well. __ UPDATE October 2022 -- The skillet has been in use now for more than 3 years, without any major issues. Its surface is not as pristine as it originally was but that is to be expected, particularly when often used by a teen. The pan ended up being stored with others, often on top of one another, and the felt-like surface protector included with the pan has surely contributed to the long life of this product with an excellent design. Upgraded to a deserved 5-star rating. --",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/513o-bXe41L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61BNoTflHML.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPGMM4HLN6SOVF2F35XOFGMOD2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1R2GILKWO9ZRH?ASIN=B005470CB6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2011",
                "reviewTitle": "5.0 out of 5 stars 8\" Green Earth Saute Pan",
                "reviewText": "Ordered this saute pan on August 18, 2011, received it August 27, 2011, 9 days via regular U.S. Mail ground free ship. I used this pan today first time. I washed it with soap and water before using. Cooked a pancake in it using only minimal oil, about a quarter teaspoon. The pancake will stay put like it is sticking, but it is just forming a crust then it just slides around the pan freely.Later in the day I browned some home-fries/potatoes, onions, peppers, garlic, then a Tilapia fillet. The fish browned good, everything cooked well, and easy to flip food in the pan. I imagine flipping eggs will work a lot easier with this pan w/o a spatula.I tried frying a egg on low-med. heat, with no oil or spray. I needed a spatula to nudge the egg from its position, then I flipped it, the yolk broke, and I had to use a silicone spatula to get it out of the pan. The egg at this point was dried out, as expected. So a little oil/spray is recommended for flipping eggs.The pan has a thick flat bottom, so it will stay put or level, and doubt if it will warp. The inside bottom of the pan has tiny octagon type imprints. Looks like it was pressed into the metal, but very slippery surface. The tiny octagon imprints showed on the bottom of the pancake when I flipped it over, like tiny octagon grill marks, pretty neat.Although more money than other Teflon coated pans, I was concerned about the potential health concerns with the Teflon coatings. The Teflon also tends to lift, degrade, chips off into food, after a while and the food starts sticking. Then you have a good pan that food sticks to? This pan is ceramic coated, which emits no harmful fumes or other toxic substances, which is a good thing.I've only had it one day, so time will tell how the ceramic coating holds up? But my first use and impression is that it is a quality pan that will last, if used properly. Low/Med. heat, hand wash or wipe with paper towel. Oven safe to 480 degrees, silicone handle, good saute pan, worth the extra money, I like it.Update: Nov. 3, 2012. After using this pan for over a year now, I notice that those octagon indents on the inside of the pan cause food to stick after awhile. Food just gets cooked into the little octagon indents. Whether you use the fiber scouring side of the sponge or the sponge side. It appears to be clean when you are washing it, but as soon as it dries you can see small amounts of food carbon like residue in the octagon indentures. And its back to washing again, but it is hard to get the carbon residue out of those indents.If you want to flip eggs with this pan, I would suggest getting a different pan that has a smooth inside the pan surface. There are saute pans with the same ceramic coating, that have a smooth inside surface.The coating on the inside is starting to discolor somewhat and food sticks in the discolored areas more each time I use it, so back to square one?This is a good pan, but those indents cause cooked food carbon like residue to eventually stick and build up in those indents. One of the pics show what looks like a smooth surface inside the pan. But if you look at the pic with the packaging still on it you will see the octagon indents I am referring too. That's the type of pan you get. I presume when they use the term \"Textured\", they are referring to the small indents on the cooking surface.So if you are into egg flipping, I would say find a pan with a smooth inside surface.Bon Appetito, BillApril 7, 2014 Update: Ozeri actually has both a smooth interior and textured saute pans. I put my Ozeri pan back in the box when it started sticking to the point it needed replacement. Because I couldn't use it anymore I decided to throw it in the trash barrel. But I gave Ozeri customer service I try, before throwing it in the dumpster. I explained my scenario to them and they sent me a new pan, with a prepaid return ship label, to return the old sticking pan. So at least if the coating does fail, Ozeri will replace the defective pan. Which is a good thing. So thank you Ozeri for honoring your guarantee. Appreciate it.Bill.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marco nijhof",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on February 16, 2022",
                "reviewTitle": "scratched already after 2 days just by being in the cupboard",
                "reviewText": "I have had good experience with those pans in general ,they are safe, but i have to say, they are extremly sensitive . I keep all my pans in a drawer with their protection. The pan got scratched still after 5 days. That is not acceptable!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jb.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 7, 2020",
                "reviewTitle": "Gran producto, vale lo que cuesta",
                "reviewText": "Me encanta, es un sartén grande (12 pulgadas) , un poco pesado pero lógico por el tamaño, con una excelente distribución del calor aún en estufas con quemador pequeño. No se pegan los alimentos, su asa es larga y muy confortable y segura. Para mi lo mas importante era encontrar un sartén que tuviera el espacio suficiente para asar por ejemplo 3 pechugas o 3 pescados al mismo tiempo y que la cocción fuera uniforme y lo cumple al 100%. Además se calienta rapidísimo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on June 6, 2021",
                "reviewTitle": "Ça colle",
                "reviewText": "Après plusieurs utilisations très déçue ça colle trop même avec de la matière grasse",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrsgochay",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 30, 2017",
                "reviewTitle": "Ozeri is making me a better cook!",
                "reviewText": "Shortly after purchasing this item, I received an e-mail from Ozeri, asking me to review their product. I have waited about 2 months to do so because I didn't want to give a review based on one or two uses. Now that I've used the pan several times, I feel ready to give my review.My first impression was of the overall look and feel of this pan. It has a good weight to it, less heft than an iron skillet, but so much more than the other ceramic pans I have owned. It's a solidly built little pan too. The handle is firm--doesn't shift at all. I purchased the lid as well. It fits the pan perfectly and is also solidly built. Clearly the good people at Ozeri care about quality.Now on to performance which I find to be outstanding. It heats evenly. Because I didn't need to worry about toxic fumes (as from Teflon pans) I can allow the pan to heat up before adding the oil or butter. It heats quickly and evenly. Less butter or oil needed--a plus for those of us trying to eat more healthily.Usually a non-stick pan isn't the best choice for browning food--a chicken breast, for example. The Ozeri pan, however, does a wonderful job of searing even though the chicken breast isn't \"bonded\" to the pan. Well browned without over-cooking is now possible.I bought this small (8\") pan for eggs. It is the perfect size for an omelette. I get a little thrill when I can slide the omelette onto the plate perfectly. My omelettes are looking quite appetizing with this pan! Pretty amazing! I do believe Ozeri is making me a better cook,Cleanup is a breeze too. A little dish soap and a cloth is all that is needed. I am using only silicon spatulas or wooden spoons. No metal.Ozeri provides a felt insert with their pans in case they need to be stacked. At this point I'm just storing this with the lid on, but who knows, I might go crazy and buy everything they make. I did just buy the 10\" wok. Can't wait to try it!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Davide",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 5, 2018",
                "reviewTitle": "Prodotto ottimo e di qualità superiore",
                "reviewText": "Premetto che ho fatto una lunga ricerca sulla padella più \"sana\" (titanio, vetroceramica etc..), e che l'ho usata per un po', prima di esprimere il mio parere. All'inizio non ero particolarmente convinto, sia perchè ho letto commenti negativi, sia perchè ho visto che era made in china..Dopo svariati utilizzi posso dare le 5 stelle piene, in quanto pur essendo fatto in Cina si vede subito che ha una qualità superiore: il manico in silicone è una comodità incredibile, il fondo è spesso e perfettamente antiaderente, pur essendo (motivo per cui l'ho scelta) sicura al 100%, in quanto prodotta con ceramica totalmente atossica (che a quanto ho capito viene mandata dalla germania, e in Cina viene solo assemblata). Insomma, il fatto che venga dalla China è una scelta discutibile, ma rende il prezzo accessibile e più che meritato. Ovviamente vanno adoperate le minime accortezze per poterla sfruttare appieno, ma faccio uso e abuso di padelle in ferro, per cui sono abituato ad aver cura dei miei attrezzi in cucina (soprattutto per garantire cibo sano ai miei figli). Molto soddisfatto anche della misura, quella da 26 è la giusta via di mezzo che ti consente di saltare verdura cotta per 2-3 persone, ma al contempo adeguata anche per una frittatina di cipolle al volo.. Consigliatissima!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}