{
    "remaining_requests": 34846,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Red-Copper-BulbHead-Non-Stick-Resistant/dp/B01CRBQ1JI",
    "body": {
        "name": "Red Copper 10 inch Pan by BulbHead Ceramic Copper Infused Non-Stick Fry Pan Skillet Scratch Resistant Without PFOA and PTFE Heat Resistant From Stove To Oven Up To 500 Degrees",
        "price": "$19.99",
        "originalPrice": "",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Red-Copper-BulbHead-Non-Stick-Resistant/dp/B01CRBQ1JI",
        "soldBy": {
            "sellerID": "A313TAOOW7I8GZ",
            "name": "BulbHead The Home Of Bright Ideas",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A313TAOOW7I8GZ&asin=B01CRBQ1JI&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B074Q3SL7V"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41 T9od4NkL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31qqINOi5QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41m4aLcf51L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oGMmXOoqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-QBztZTSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513F9J7b1xL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61q0PROj3tL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71rcwsUPAPL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1xoF6s-9JS.pdf"
        },
        "byLineInfo": {
            "name": "Brand: BulbHead",
            "link": "https://www.amazon.com/BulbHead/b/ref=bl_dp_s_web_119065373011?ie=UTF8&node=119065373011&field-lbr_brands_browse-bin=BulbHead"
        },
        "brand": "BulbHead",
        "merchantInfo": "BulbHead The Home Of Bright Ideas",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 3245,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 22 - 27."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Copper-infused 10\" fry pan includes a high-heat-resistant, PFOA and PTFE-free, scratch-resistant ceramic coating that will not peel, chip, or flake",
            "Naturally non-stick ceramic surface allows you fry up your favorite breakfast meats, eggs, veggies, and more; aluminum cooking rings ensure even heat for no hot spots",
            "Transitions from stovetop to ovens up to 500 degrees Fahrenheit for meal versatility; brown chicken or chops, sear steak, and finish in the oven",
            "Hand wash pan; not dishwasher safe",
            "Season pan with vegetable oil before use (see User Manual) and use soft utensils to prevent from scratching"
        ],
        "description": "This Red Copper copper-infused ceramic 10\" fry pan will be your go-to pan for frying, browning, searing, and more. The stay-cool handle makes it easy to move from stove to table (oven mitt recommended if using Red Copper pan in the oven) and will quickly become your favorite go-to pan. Many brands with non-stick coatings can be unsafe or do not live up to their scratch-resistant promises, but Red Copper ceramic non-scratch coating is free of PFOA and PTFE's, and will not flake or peel. Red Copper cookware includes a sturdy copper-infused aluminum construction which makes it a reliable addition to your cabinets.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Cookware",
                "link": "https://www.amazon.com/cookware/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289814"
            },
            {
                "name": "Pots & Pans",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=19343857011"
            },
            {
                "name": "Skillets",
                "link": "https://www.amazon.com/Skillets-Cookware-Baking-Kitchen-Dining/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289829"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "BulbHead"
            },
            {
                "name": "Material",
                "value": "Copper"
            },
            {
                "name": "Special Feature",
                "value": "Gas Stovetop Compatible, Electric Stovetop Compatible"
            },
            {
                "name": "Color",
                "value": "Red"
            },
            {
                "name": "Capacity",
                "value": "5 Quarts"
            },
            {
                "name": "Compatible Devices",
                "value": "Gas"
            },
            {
                "name": "Product Care Instructions",
                "value": "Hand Wash Only"
            },
            {
                "name": "Maximum Temperature",
                "value": "500 Degrees Fahrenheit"
            },
            {
                "name": "Handle Material",
                "value": "Ceramic"
            },
            {
                "name": "Item Weight",
                "value": "1.5 pounds"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Is Oven Safe",
                "value": "Yes"
            },
            {
                "name": "Model Name",
                "value": "Red Copper"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Product Dimensions",
                "value": "17.11 x 10.12 x 2.37 inches"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Red Copper"
            },
            {
                "name": "ASIN",
                "value": "B01CRBQ1JI"
            },
            {
                "name": "Item model number",
                "value": "10687"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 3,245 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#20,829 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #151 in Skillets"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "March 9, 2016"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Cookware That Brings Out the Chef in You Are you turned off from cooking because your frying pan failed? Fall in love with cooking again when you use the Red Copper 10” Round Fry Pan and Red Copper 12” Round Fry Pan with helper handle. These fry pans are the perfect size everyday skillet. Sauté your savory veggies, sear a steak, or bake scrumptious cinnamon buns. The Red Copper round frying pans are nonstick for easy cleanup. This 2-piece set is a great way to jumpstart your cookware collection. Includes one 10-inch round frying pan and one 12-inch round frying pan. Lids not included. Get cooking with Red Copper, endorsed by author, Cathy Mitchell. Start your Red Copper collection with the 10-piece or 5-piece set, or build slowly by adding from the wide range of pots and pans, bakeware, and specialty cookware, like the 5 Minute Chef and Flipwich.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/bc3afd00-a505-4f08-ac73-6442680f6e4e._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Copper-Infused Ceramic The 10” & 12” pans have a strong copper-infused ceramic coating that creates a non-stick and scratch-resistant cooking surface. Your food won’t stick and cause scratching to the ceramic coating. When seasoned per package directions, your food will slide right out of the pan! No scrapping, no scratching needed. Little to no oil, butter, or grease is needed while cooking, so you to cook healthier home cooked meals. The ceramic nonstick coating is bonded to aluminum that evenly distributes heat. Your food will cook evenly and more efficiently, avoiding hot spots. An initial seasoning to the pan is required prior to use. Instructions included. Occasional seasoning may be required for maintenance and optimal performance.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/2fdddf26-6712-4e5c-b168-4eabf45c56d2._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Oven Safe The Red Copper 10” & 12” Round Fry Pan set is oven safe up to 500-degrees Fahrenheit, allowing you to transition from stovetop to oven in one pan. Sear a steak on your stovetop, then bake to your desired degree of doneness – all from the same pan. Sturdy helper handle on 12” pan makes transporting your pan a cinch! Less cook time, less mess. The metal handles on the cookware may become hot, so always exercise caution when using. Easy to Clean Thanks to the non-stick coating, there’s no scrapping or scrubbing. Red Copper cookware is easy to clean. For light cooking, you can just wipe the surface with a cloth. Although the Red Copper cookware in this set is dishwasher safe, hand washing with a mild detergent and warm water is recommended. Using abrasive cleaners can harm your Red Copper cookware, so we don’t recommend it. Safe, Non-Toxic Coating Have peace of mind while cooking. Red Copper cookware does not contain any PFOAs or PTFEs. These chemicals are normally added to nonstick cookware, but begin to disintegrate at high heats. The coating can flake off into food and become ingested. When you use Red Copper, you can cook with confidence. These chemicals are not added to Red Copper’s nonstick surface.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7f86319c-8997-4917-b557-2e85d30b5f05._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e30f19e7-0922-4ec3-ab8c-405908ba6927._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/11254f4d-15d2-4c62-9b1d-3cca56a19dba._SL300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/fb77242d-9e73-4479-bcf6-41af848964a9._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bc3afd00-a505-4f08-ac73-6442680f6e4e._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2fdddf26-6712-4e5c-b168-4eabf45c56d2._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7f86319c-8997-4917-b557-2e85d30b5f05._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e30f19e7-0922-4ec3-ab8c-405908ba6927._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/11254f4d-15d2-4c62-9b1d-3cca56a19dba._SL300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEA3W7UMR4LY564M2UUNIUHD5U2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PU433XRPM103?ASIN=B01CRBQ1JI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 1, 2018",
                "reviewTitle": "5.0 out of 5 stars FINALLY, a nontoxic, nonstick pan that REALLY WORKS!!!",
                "reviewText": "***UPDATE 10/18***I've now been using both the 10\" and 12\" version of this pan several times per week for six months or more. I saw many negative reviews where people didn't use any oil or butter in the pan first and were unhappy with the results. While I found the same thing, simply adding a little butter or Smart Balance to cover the bottom of the pan results in an excellent non-stick experience. Just this morning I cooked three sunny side up eggs and they slid out of the pan without a spatula. So, while it may me disappointing that the pan doesn't work well with no oil or butter, the fact that it does work extremely well with it still puts these pans light years ahead of the many other non-stick pans I've used and thrown out. DON'T LET THE NEGATIVE REVIEWS DISSUADE YOU -- IF YOU SEASON THE PAN PROPERLY (as per the instructions) AND USE A LITTLE BUTTER OR OIL THESE PANS ARE OUTSTANDING.****************As most people I started out with teflon pans years ago. They eventually lost their nonstick properties, so I searched for healthier options without toxic chemicals to replace them. First I tried pans from Ozeri, which I felt better about for health reasons, but as with most \"nonstick\" pans they quickly lost their nonstick properties. Next I tried pans from Denmark after a good experience with them at a summer rental a few years back, but that yielded basically the same result. At this point I'd pretty much lost hope that any of these healthier nonstick pans would continue to work after a few months. Finally I decided to use my Consumer Reports subscription to see if they had anything worth trying. Duh! I was surprised to see that Red Copper pans were highly rated so I gave them a shot. FINALLY, a nontoxic, nonstick pan that ACTUALLY WORKS!!!I've had the 10- and 12-inch sizes for several months under fairly heavy use so this seemed like a long enough time to write a worthwhile review -- but I WILL UPDATE if these pans end up disappointing down the road. First, I strictly followed the directions and seasoned both pans before using them (none of the other pans required or specified this step and I wonder if it would've helped at all). I don't know how important this step is, but given my positive results I'll just say MAKE SURE YOU DO THIS FIRST BEFORE USING THE PAN. Also, the directions state that if the pans do start to lose their nonstick properties, just repeat this seasoning procedure. This actually gives me some hope that these pans might actually continue to work down the line. At first I was disappointed because the second batch of scrambled eggs I made -- right after the first batch without adding any more oil or butter -- started to stick pretty badly. Out of habit, for the first batch I used a little Smart Balance (the regular stuff, not the light version that doesn't melt well -- by the way I NEVER use real butter anymore as this tastes just like butter but MUCH healthier -- TRY IT!) so the next batch I added a little Smart Balance before cooking the eggs and, YIPPEE!!!!!! Although I'm just slightly disappointed that I can't just cook without adding anything to the pan first, adding a little Smart Balance is a small price to pay to have a truly nonstick experience. Seriously, eggs just slide right out of the pan. Even sunny side up eggs, with maybe just a little bit of coaxing with a spatula, literally slide right onto the plate. AMAZING!!! I don't add anything when cooking stuff like hamburger meat for tacos and the pan works great without any significant sticking. BTW, I kept the plastic covers the pans came in so I can stack them without risking damaging the nonstick surface, and I do NOT use any metal utensils while cooking with these pans in the hope of prolonging their nonstick life.So, what I like about the pans (other than the excellent nontoxic and nonstick properties) are that they seem well built, and the bottoms of the pans are actually pretty flat. Ozeri pans were not flat and oil or butter would collect around the outside of the pan and away from the center. Argh! Despite the handle being metal it somehow remains relatively cool as long as you grab it more toward the end, and it's great that the pans can be used in the oven if necessary.All this goodness notwithstanding, there are some things I wish were a little better. Despite being well built the pans are still relatively light weight, and with not much in them the weight of the handle is enough to tip the pan toward it if you put it down quickly or carelessly. And the pans seem relatively shallow, which means they don't hold as much and also make flipping food a little more difficult than a deeper pan. The most annoying thing though is that my standard lids will not lock into place on these pans. This seems like a cheap trick to incentivize customers to buy Red Copper lids. I just continue to use my lids as they do sit on top of the pan, but they will slide off if they're pushed or the pan is tilted. Despite these not insignificant negatives, I'm GLADLY living with them because they are so far outweighed by having a healthy nonstick pan that actually works.So in the end, while they're not perfect (name me something that is), overall I'm thrilled with these pans and most likely will be buying more. Very highly recommended!",
                "reviewVotes": "132 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark Fairchild",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEX4ZOWECSM27P37LJLGLHP42TOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFELW93T5QG5O?ASIN=B01CRBQ1JI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Pan Reasonable Price",
                "reviewText": "I gauge my pans by how easily I can cook scrambled eggs- It's no stick and cleans up easily. I've used more expensive pans and eventually they all lose \"nonstick\"- get some scuffing in the bottom. These are priced so that you can just replace them. I use my pans daily- clean very easily- Quality pan and longlastingI can't comment on how long they last with dishwasher cleaning- I hand wash my pans",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Meghan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXSRJISPBPOUF32X4PLPHSNUJIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQJ9PBEEZOG7B?ASIN=B01CRBQ1JI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 27, 2022",
                "reviewTitle": "5.0 out of 5 stars Best pan in my house!",
                "reviewText": "let me start off by saying I love this pan so much! It is the best pan to make my omelets in since they slip right out once they are done cooking. The clean up is super easy as the only place I need to scrub is the metal circles inside the pan that hold the handle.I had this pan for many years and it finally became a little less nonstick so I ordered another one. It is definitely worth the price for having it last so many years. Also, make sure you don't use the spray cans on this pan as I found it left a sticky residue which was what ultimately led me to needed a new one. Now I only use butter, a splash of oil, or just some water when cooking and it always turns out perfect without any stick.I never use metal utensils on this pan, I have plenty of plastic or silicone spatulas so there is no point in taking the risk of ruining the pan. To wrap this all up, it really is a great pan and if you take care of it then it should last you a very long time. Hope this helps!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel Griscom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHANNMS3MOPSTUFZRYO6TVHFZRHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RX4JPR7F7UQ0?ASIN=B01CRBQ1JI",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 4, 2018",
                "reviewTitle": "4.0 out of 5 stars Nice pan, but uncomfortable handle",
                "reviewText": "I bought this to replace the last in a series of classic Teflon non-stick pan. After seasoning, it's incredibly slick, and food just wipes off. Very cool. There are two problems, though:- The handle, which is stamped metal, is pretty uncomfortable, especially when you're flipping something. I understand that not using plastic allows it to be oven-safe, but a tubular metal handle would be a big improvement.- Although it seems very slick, fried eggs just will NOT slide in the pan. You can easily lift them off with a spatula, but try and just flip them and no dice: they stay where they are. So, I now have to dirty a spatula every time I fry some eggs. (Again, the pan itself seems extremely slick; it's just something about the surface which resists sliding by eggs.)I miss flipping my eggs. I'll see how long the pan lasts, but unless it's for a good three or four years I'll probably switch back to Teflon.Edit: after a week of breakfasts, eggs now slide just fine, and I'm back to flipping. I guess the factory-recommended seasoning doesn't do enough; perhaps more time in the oven, or repeating, would be better, or perhaps you just need to fry a series of eggs. The handle hasn't improved over time, though; it's still uncomfortable.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lorraine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCYF42GHISI532JTEDGVOUTZDEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKYUL83URCSBG?ASIN=B01CRBQ1JI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars great to cook food",
                "reviewText": "Bought before 10 yrs. ago ,my son cooking needed additional pan",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RENEE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVFIDAOCXKWPJFPSXW5FUR4GT2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19SNK7W1KMR0I?ASIN=B01CRBQ1JI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars A favorite",
                "reviewText": "I love red copper products. This skillet is perfect for almost any dish via stovetop or the oven. It’s a “staple” in my home.👍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "barbara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDZR2LSF6QL4AP4JIX6RH2EDCMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MLLNFLWREKL9?ASIN=B01CRBQ1JI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Very good quality.",
                "reviewText": "I had this pan in a larger size and I love it.It is simple to use and clean.I was trying to find this smaller size and couldn’t find it anywhere.I am so glad I found it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 4, 2019",
                "reviewTitle": "Sticker on pan. Lol wut?",
                "reviewText": "Haven't actually used it yet, just put it in the oven to season. I'm a tab bit confused that out of all the plastic packaging that surrounds this pan, you put the paper SKU sticker on the pan itself. Now I have a half-removed paper sticker on fire in my oven.One month review:This is a savage pan! Never use a metal spatula and it will last a long time. It works incredibly well for eggs and nothing sticks to it. I originally bought this for protection from my GFs AK47 but after reading the reviews it seems it WILL NOT block bullets of the .762 variety. I knew that this price range it would likely only block 9mm but to my surprise it will block anything up to a .45. Of course, your experience may vary.Be safe, God bless.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lucy25",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 15, 2019",
                "reviewTitle": "Awesome Pan",
                "reviewText": "Bought one of these to replace a teflon coated pan. It's great! Bought another one as a gift. Would buy again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "raisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 29, 2018",
                "reviewTitle": "Amazing",
                "reviewText": "I have been using it for about 2 weeks now, It is great! Nothing sticks to it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 24, 2019",
                "reviewTitle": "Works great for the first 3 months and year and a half",
                "reviewText": "A not a full year in and everything is sticking now1year and half later even with butter/margarine it's sticking",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jules",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 15, 2019",
                "reviewTitle": "Delighted with product",
                "reviewText": "I was surprised how lightweight this pan is. Great for the elderly. The non stick is amazing. I will only buy these in future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}