{
    "remaining_requests": 34953,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lodge-Skillet-Pre-Seasoned-Skillet-Silicone/dp/B00G2XGC88",
    "body": {
        "name": "Lodge Cast Iron Skillet with Red Silicone Hot Handle Holder, 12-inch",
        "price": "$29.90",
        "originalPrice": "$50.00",
        "rawPrice": 29.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lodge-Skillet-Pre-Seasoned-Skillet-Silicone/dp/B00G2XGC88",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31NVGNHumwL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21KGRKOe7HL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41KszhipRsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51W 3crkUeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YMxaqrRgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YAhD1yCkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/712Aty2XvHL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Lodge Store",
            "link": "https://www.amazon.com/stores/Lodge/page/8CDF8DDD-A601-44CD-B8E7-BD01D910704A?ref_=ast_bln"
        },
        "brand": "Lodge",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 18311,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 6 hrs 19 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "One Lodge Pre-Seasoned 12 Inch Cast Iron Skillet with Handle Holder",
            "Assist handle for better control",
            "Unparalleled heat retention and even heating",
            "Pre-seasoned with 100% natural vegetable oil",
            "Use to sear, sauté, bake, broil, braise, fry, or grill",
            "Use in the oven, on the stove, on the grill, or over a campfire",
            "Great for induction cooktops",
            "Silicone handle holder is dishwasher safe and protects hands from heat up to 500° F",
            "Included Components: Lodge Cast-Iron Skillet L10Sk3Ashh41B"
        ],
        "description": "The Lodge 12 Inch Cast Iron Skillet will be your go-to skillet for years to come. Featuring an assist handle for great control and an easy-grip handle for lifting or hanging storage when not in use, it provides excellent heat distribution and retention for consistent, even cooking. It offers an abundance of possibilities. Use to sear, sauté, bake, broil, braise, fry, or grill. This skillet is safe to use in the oven, on the stove or grill, and over a campfire. The Lodge Cast Iron Skillet is brutally tough for decades of cooking and comes pre-seasoned for an easy-release finish that improves with use. Includes one Lodge 12 Inch Cast Iron Skillet and one Silicon Handle Holder. Made in America. Care instructions for cast iron: 1. Wash with warm water. Add a mild soap, if desired. 2. Dry thoroughly with a lint-free cloth or paper towel. 3. Oil the surface of the pan with a very light layer of cooking oil while warm. Hang or store the cookware in a dry place.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Cookware",
                "link": "https://www.amazon.com/cookware/b?ie=UTF8&node=289814"
            },
            {
                "name": "Pots & Pans",
                "link": "https://www.amazon.com/b?ie=UTF8&node=19343857011"
            },
            {
                "name": "Skillets",
                "link": "https://www.amazon.com/Skillets-Cookware-Baking-Kitchen-Dining/b?ie=UTF8&node=289829"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Lodge"
            },
            {
                "name": "Material",
                "value": "Cast Iron"
            },
            {
                "name": "Special Feature",
                "value": "Induction Stovetop Compatible"
            },
            {
                "name": "Color",
                "value": "Red Silicone"
            },
            {
                "name": "Capacity",
                "value": "1 Pounds"
            },
            {
                "name": "Compatible Devices",
                "value": "Smooth Surface Induction"
            },
            {
                "name": "Product Care Instructions",
                "value": "Dishwasher Safe"
            },
            {
                "name": "Maximum Temperature",
                "value": "260 Degrees Celsius"
            },
            {
                "name": "Handle Material",
                "value": "Silicone"
            },
            {
                "name": "Item Weight",
                "value": "7.5 pounds"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Is Oven Safe",
                "value": "Yes"
            },
            {
                "name": "Model Name",
                "value": "L10SK3ASHH41B"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Product Dimensions",
                "value": "18 x 12.56 x 2.25 inches"
            },
            {
                "name": "Manufacturer",
                "value": "Lodge"
            },
            {
                "name": "ASIN",
                "value": "B00G2XGC88"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "Miniature Skillet"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 18,311 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#669 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #5 in Skillets"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 1, 2013"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Seasoned Cast Iron Skillet with Silicone Pot Holder An improvement on the original: the Lodge Cast Iron Skillet, featuring an assist handle. This will be your go-to pan for generations to come. The Lodge Silicone Hot Handle Holders keep your hands safe without compromising style. Product at a Glance: The right tool to sear, sauté, bake, broil, braise, fryBrutally tough for decades of cookingSeasoned for a natural, easy-release finish that improves with useUnparalleled in heat retention and even heatingAt home in the oven, on the stove, on the grill or over the campfireSilicone handle holder protects hands from heat up to 500° FSilicone handle holder is dishwasher safe. No direct flame",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/91e3127b-9e6c-4001-9728-8aad30b254a4._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "Why Buy Lodge Cast Iron As the only full line of American-made cast iron cookware, Lodge boasts quality that has been unmatched for over a century. Even heating, a natural easy-release finish, versatility and durability are the hallmarks of our great cookware. We don't just make cast iron; we make heirlooms that bring people together for generations.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/772cd656-1749-4b2a-a6bd-3f0446573fa6._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "About Lodge Cast Iron Founded in 1896, the Lodge family has been making high quality cookware and accessories for over a century. Lodge Cast Iron operates two foundries on the banks of the Tennessee River in the small town of South Pittsburg, Tennessee; a town Lodge is proud to call home. The company is built on family values, American history, and high quality cookware. All Lodge seasoned cast iron and carbon steel cookware is proudly made in the USA, meaning you’ll get craftsmanship that has been passed down through generations.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/30f16e66-ab24-4bcf-aea0-ee4ee71f40fb._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "Cooking And Caring For Your Lodge Seasoned Cast Iron Caring for your cast iron doesn’t have to be complicated. Lodge cookware comes already seasoned and ready to use, so you can make your family's favorite recipes right away. You can use it on any heat source, from the stove top to the campfire (just not the microwave!). The more you use it, the better the seasoning will get. Wash cast iron by hand with mild soap or none at all.Dry promptly and thoroughly with a lint-free cloth or paper towel.Rub with a very light layer of vegetable oil, preferably while the cookware is still warm.Hang or store cookware in a dry place.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/66d46ac1-9de2-4739-b09e-14518034baf9._CR0,0,300,300_PT0_SX300__."
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/c8eb0389-707a-40cc-aff4-18b03a5784ad._CR0,0,971,300_PT0_SX970__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/91e3127b-9e6c-4001-9728-8aad30b254a4._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/772cd656-1749-4b2a-a6bd-3f0446573fa6._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/30f16e66-ab24-4bcf-aea0-ee4ee71f40fb._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/66d46ac1-9de2-4739-b09e-14518034baf9._CR0,0,300,300_PT0_SX300__."
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Elizabeth J. Spears",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNGW6QDZIZXPCNC5AP7DBWTQJPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KUT03UWCOHF?ASIN=B00G2XGC88",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Great skillet, really big.",
                "reviewText": "I like that this is a good sturdy cast iron skillet. It is really big and holds a whole meal. It can be put in the oven as well. What I don't like is that is SO heavy (well, what did I expect?) and I have to use both hands to hold it. It does have the lip on the opposite end of the handle to help with picking it up. While it was \"preseasoned,\" food stuck to it. I had to season it myself over a period of time. The trick is to keep using it and keep adding lard and heating it up and then letting it always have some grease in it. It takes time to get it where its really stick-free.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandro M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJD22LGTNY5Z37J2A2QCIWWKZLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38MHZFK4HHUX1?ASIN=B00G2XGC88",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 12, 2022",
                "reviewTitle": "5.0 out of 5 stars Great pan!",
                "reviewText": "I love this pan so much! I can't believe I spent so many years of my life without a cast iron pan. Fact is, I just never understood how easy these are to cook with and maintain. Yes, you have to season it. Yes, that takes a little getting used to at first. No, it's not hard and really doesn't take much time to maintain. It's much easier than I thought it would be, and I love the way my food comes out!Once properly seasoned, this pan is as non-stick as any other pan I've ever used. I did the initial seasoning in my gas grill. That way you don't fill your kitchen with smoke. You can certainly use a regular oven if you don't have a grill. Give it a good 2-3 seasonings before using it to cook. There are plenty of articles and videos online explaining how to season a cast iron pan.As for the cooking, if you haven't used cast iron, you don't know what you're missing. The heat distribution and retention are amazing. For best results, make sure to pre-heat to your desired temp for several minutes before adding oil or food. Cooking with oil also helps maintain the non-stick surface, so the surface improves the more you use the pan. I've used this for steaks, fried/scrambled eggs, bacon, arepas, and shepherd's pie. I find myself looking for more recipes I can use it for. I haven't tried using it on my gas grill yet, but I'm eager to try. This thing makes me want to cook more!I like the 12-in size, though many people may prefer the 10.25-in version. I can prepare a NY Strip and a Fillet in this pan at the same time, with room to spare for a butter baste. It's a bit large for a 3-egg scramble, but still works well.The one down-side is the weight. You're not likely to flip an omelet with this puppy, unless you have very strong wrists. Of course, that's not specific to this brand - it's a cast iron thing. Maybe the 10.25-in version would be easier to handle for some purposes. That said, this pan feels like it's going to last for generations to come.Oh, and if it seems like I'm being sponsored by Lodge, please know that I'm not. I'm just a regular guy sharing his thoughts about a product I truly enjoy using. Happy cooking!",
                "reviewVotes": "65 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Аmazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAT6UHM5PVTMUXMO64UEECEAZZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ECT6W2ULSKGI?ASIN=B00G2XGC88",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Lodge Cast Iron Fry Pan",
                "reviewText": "I’m in love with this pan. I fry EVERYTHING in it & it pleases me to know that you’re also gaining some health benefits from frying in a cast iron pan, because iron gets put into your food. Cooks everything so even & the pan acquires more flavor with the different foods that you fry. Also love the little silicone handle cover. 💯 % recommend the “Lodge” cast iron pan.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anonymous",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKNLESHYK72ZYUBFZEOZM47GCZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIY1SOD6SCS5E?ASIN=B00G2XGC88",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Impressive quality",
                "reviewText": "This was a gift for my partner. He loves it!It has very impressive quality. It cooks evenly, even on an old electric stovetop. This thing could survive a bomb.My partner also has a stand alone induction top. It doesn’t not seem to work well with that. The cast iron take forever to heat on induction and seem to only get hot in the very center.The cast iron is so heavy it’s challenge to lift / pour food out of. This would not be a good fit for someone older / with mobility concerns.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KnownasjimKnownasjim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6P2PQHY2QCQ2CFRRXH23ELPM3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RX9LBXQVBUV2?ASIN=B00G2XGC88",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars The skillet I always wanted!",
                "reviewText": "Well my skillet and glass lid arrived today in two different deliveries. I almost immediately tried cooking some bacon just to test it out. I put the bacon in the pan and let it heat to medium. According to what I had read online, that would let the bacon render, prevent curling, and make sure it wouldn’t stick. When it was time to flip the strips over, I learned that they were pretty much adhered to the pan. I had to scrape it up in little bits.Refusing to be defeated by a pan, I carefully cleaned it with hot water and scrubbed to get off all the stuck bits. Then, I followed the directions to do the stove top seasoning method two times. Once it was cooled all the way, I decided on a major test. I cooked four more strips of center-cut bacon, two over easy eggs, and a kimchi pancake for supper. NOTHING stuck! Everything came out of the pan looking like it had been prepared for a magazine photo article. I waited for the pan to cool down completely, took it to the sink, and rinsed it with hot water. Then, I wiped it dry with a paper towel before giving it a rub down with a nearly non-existent coat of canola oil. It is now sitting on the stove waiting for my next adventure.I am 100% satisfied with this skillet so far. I do caution other buyers to just pretend it is not “pre-seasoned” and season it. These are the instructions I followed:Seasoning your cast iron skillet on the stovetop is a simple process that builds up a protective layer of polymerized oil, making it naturally non-stick and preventing rust. Here's a quick guide:What you'll need:Your cast iron skilletHigh smoke point oil like canola, grapeseed, or avocado oilPaper towelsTongs (optional)Steps:Wash and dry your skillet. Scrub away any food residue with warm water and dish soap. Rinse thoroughly and dry completely with paper towels or heat it on the stovetop over low heat for a few minutes to evaporate any remaining moisture.Heat the skillet over medium heat. Let it get nice and hot for about 5 minutes.Pour in a thin layer of oil. About 1 tablespoon should be enough for a 12-inch skillet. Tilt the pan to coat the bottom and sides evenly.Wipe out the excess oil. Use a paper towel to spread the oil around the pan in a thin, even layer. You don't want any pooling oil.Heat the oil until it smokes. This takes about 2-3 minutes. Keep an eye on it and adjust the heat if necessary to avoid burning the oil.Turn off the heat and let the pan cool. The oil will polymerize as it cools, creating the seasoned layer.Repeat steps 3-6 two or three more times. Each layer builds upon the previous one, creating a stronger and more durable seasoning.Wipe away any excess oil and store your skillet. Once the pan is cool, use a paper towel to wipe away any remaining oil. Store your skillet in a dry place.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71xt74oFZTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sun",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 10, 2018",
                "reviewTitle": "Expensive but well finished product.",
                "reviewText": "Expensive, but a beautifully finished product. Shipping costs are exhorbitant. Heavier than expected, pre-seasoned, effort required to clean. Belied the negative reports by some users; glad to have received a good piece. Silicone handle is somewhat loose.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna Littlewood",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on July 3, 2023",
                "reviewTitle": "Good so far",
                "reviewText": "I’m very happy with this cast iron pan. The silicon handle cover is great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Agnes Gomes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 11, 2020",
                "reviewTitle": "Great product",
                "reviewText": "Great product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "N312",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on March 1, 2022",
                "reviewTitle": "Interesting!",
                "reviewText": "New user to cast iron skillet and honestly it's been interesting thus far. It's true that you need to put effort in seasoning the skillet and even after each use it's good to one-season. But with all the helpful info on the web you'll get used to the process once you start.One thing I love about the skillet is the sear I get on meats and the fact that I can put it straight in the oven. Bought the 12\" which looks and feels big BUT sufficient space to cook for the family.Lovin it so far: )",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sudheer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 23, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "wonderful product....",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}