{
    "remaining_requests": 35034,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lodge-Skillet-Pre-Seasoned-Ready-Stove/dp/B00006JSUA",
    "body": {
        "name": "Lodge 10.25 Inch Cast Iron Pre-Seasoned Skillet – Signature Teardrop Handle - Use in the Oven, on the Stove, on the Grill, or Over a Campfire, Black",
        "price": [
            "11 options from $8.97"
        ],
        "originalPrice": "$34.25",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Lodge-Skillet-Pre-Seasoned-Ready-Stove/dp/B00006JSUA",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C8Z3WYYT"
        ],
        "asinVariationValues": [
            {
                "asin": "B000LXA9YI",
                "variationName": "Size",
                "variationValue": "3.5 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00063RWT8",
                "variationName": "Size",
                "variationValue": "6.5 Inch",
                "price": "$9.50",
                "variationImageURL": ""
            },
            {
                "asin": "B00008GKDG",
                "variationName": "Size",
                "variationValue": "8 Inch",
                "price": "$14.90",
                "variationImageURL": ""
            },
            {
                "asin": "B00063RWTS",
                "variationName": "Size",
                "variationValue": "9 Inch",
                "price": "$26.98",
                "variationImageURL": ""
            },
            {
                "asin": "B00006JSUA",
                "variationName": "Size",
                "variationValue": "10.25 Inch",
                "price": "$19.90",
                "variationImageURL": ""
            },
            {
                "asin": "B00006JSUC",
                "variationName": "Size",
                "variationValue": "13.25 Inch",
                "price": "$39.90",
                "variationImageURL": ""
            },
            {
                "asin": "B00063RWUM",
                "variationName": "Size",
                "variationValue": "15 Inch",
                "price": "$49.90",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31rHhvaji7L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41nsbdbryAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31KnlgBX4yL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oczaL0TyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418XD2VNv8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Pr3n-uSSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/712Aty2XvHL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Lodge Store",
            "link": "https://www.amazon.com/stores/Lodge/page/8CDF8DDD-A601-44CD-B8E7-BD01D910704A?ref_=ast_bln"
        },
        "brand": "Lodge",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 109331,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 6 hrs 31 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "YOUR NEW GO-TO PAN: Lodge cast iron cookware is the perfect kitchen tool for beginners, home cooks and chefs. Cast iron can handle any kitchen cooktop, oven, grill and open flame. Crafted in America with iron and oil, its naturally seasoned cooking surface creates an easy-release and improves with use.",
            "SEASONED COOKWARE: Seasoning is simply oil baked into the iron, giving it a natural, easy-release finish and helps prevent your pan from rusting. Lodge pre-seasons all cast iron cookware with 100% natural vegetable oil; no synthetic coatings or chemicals. The more you use Lodge the better the seasoning will get!",
            "RUST? DON’T PANIC! IT’S NOT BROKEN: When your pan arrives you may notice a spot that looks like rust. It’s simply oil that has not fully carbonized. With regular use and care the spot will disappear. If you do notice rust simply scour the affected area with steel wool, rinse, dry and rub with vegetable oil.",
            "COOKING VERSATILITY: Our skillets have unparalleled heat retention that gives you edge-to-edge even cooking every time you use your skillet. Cast iron cookware is slow to heat up but retains heat longer which makes cast iron ideal for pan-frying and roasting. These delicious moments are cast to last.",
            "FAMILY-OWNED. Lodge is more than just a business; it’s a family. The Lodge family founded the company in 1896, and they still own it today. From environmental responsibility to community development, their heads and hearts are rooted in America. Lodge products are made in the USA with non-toxic, PFOA & PTFE free material."
        ],
        "description": "Product Description What makes this the classic American skillet? Made in the USA for more than 125 years, it's been a staple in kitchens around the world. Crafted in America with iron and oil, its naturally seasoned cooking surface is ready to help you turn your meals into delicious, shareable moments. Cast to last! Seasoned and ready to use. Hailed as an essential kitchen tool by the country's leading chefs and publications, the Lodge 10.25 Inch Cast Iron Skillet has been crafted to cook memorable meals for generations. It offers an abundance of possibilities. Care instructions for cast iron: 1. Wash with warm water. Add a mild soap, if desired. 2. Dry thoroughly with a lint-free cloth or paper towel. 3. Oil the surface of the pan with a very light layer of cooking oil while warm. Hang or store the cookware in a dry place. Amazon.com The American-based company Lodge has been fine-tuning its construction of rugged, cast-iron cookware for more than a century. No other metal is as long-lasting and works as well for spreading and retaining heat evenly during cooking. Lodge's Logic line of cookware comes factory pre-seasoned with the company's vegetable oil formula, and is ready to use right out of the box. After cooking, simply scrub the cast iron with a stiff brush and hot water, no soap, and dry immediately. Breakfast in particular somehow tastes extra hearty when cooked in a heavy cast-iron skillet. Cast iron loves a campfire, a stovetop, or an oven, and can slow-cook foods without scorching and sear meat at higher temperatures. A good all-purpose size at 10-1/4 inches in diameter and 2 inches deep, this skillet can fry up eggs, pancakes, steaks, chicken, hamburgers, and can bake desserts and casseroles as well. A helper handle aids in lifting, and the looped primary handle allows hanging. Two side spouts pour off grease or juice. Even though the pan comes pre-seasoned, applying a little vegetable oil before use helps prevent food from sticking. Whether used in a kitchen or camp, this virtually indestructible pan should last for generations and is covered by a lifetime warranty. --Ann Bieri Brand Story By Lodge See more",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Cookware",
                "link": "https://www.amazon.com/cookware/b?ie=UTF8&node=289814"
            },
            {
                "name": "Pots & Pans",
                "link": "https://www.amazon.com/b?ie=UTF8&node=19343857011"
            },
            {
                "name": "Skillets",
                "link": "https://www.amazon.com/Skillets-Cookware-Baking-Kitchen-Dining/b?ie=UTF8&node=289829"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Lodge"
            },
            {
                "name": "Material",
                "value": "cast-iron"
            },
            {
                "name": "Special Feature",
                "value": "Induction Stovetop Compatible"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Capacity",
                "value": "10.25 Cubic Inches"
            },
            {
                "name": "Compatible Devices",
                "value": "Smooth Surface Induction, Gas, Electric Coil"
            },
            {
                "name": "Product Care Instructions",
                "value": "Hand Wash Only"
            },
            {
                "name": "Maximum Temperature",
                "value": "500 Degrees Fahrenheit"
            },
            {
                "name": "Handle Material",
                "value": "Cast Iron"
            },
            {
                "name": "Item Weight",
                "value": "5.35 pounds"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Is Oven Safe",
                "value": "Yes"
            },
            {
                "name": "Model Name",
                "value": "Miniature Skillet"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "No"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Use in the oven, on the stove, on the grill, or over a campfire"
            },
            {
                "name": "Product Dimensions",
                "value": "16.12 x 10.68 x 2 inches"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Lodge"
            },
            {
                "name": "ASIN",
                "value": "B00006JSUA"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "L8SK3PLT"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 109,331 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #1 in Skillets"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "September 27, 2007"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Lodge Cast Iron Skillet An improvement on the original: the Lodge Cast Iron Skillet, featuring an assist handle. This will be your go-to pan for generations to come. Product at a Glance: The right tool to sear, sauté, bake, broil, braise, fry Brutally tough for decades of cooking Seasoned for a natural, easy-release finish that improves with use Unparalleled in heat retention and even heating At home in the oven, on the stove, on the grill or over the campfire",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/2149dfec-1946-43e6-b855-6f3606551221._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "Why Buy Lodge Cast Iron As the only full line of American-made cast iron cookware, Lodge boasts quality that has been unmatched for over a century. Even heating, a natural easy-release finish, versatility and durability are the hallmarks of our great cookware. We don't just make cast iron; we make heirlooms that bring people together for generations.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/73984f38-8cba-4757-bc1d-5df351eb36c3._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "About Lodge Cast Iron Founded in 1896, the Lodge family has been making high quality cookware and accessories for over a century. Lodge Cast Iron operates two foundries on the banks of the Tennessee River in the small town of South Pittsburg, Tennessee; a town Lodge is proud to call home. The company is built on family values, American history, and high quality cookware. All Lodge seasoned cast iron and carbon steel cookware is proudly made in the USA, meaning you’ll get craftsmanship that has been passed down through generations.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4f38c31f-a872-4428-a73a-23374a89f6dd._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "Cooking And Caring For Your Lodge Seasoned Cast Iron Caring for your cast iron doesn’t have to be complicated. Lodge cookware comes already seasoned and ready to use, so you can make your family's favorite recipes right away. You can use it on any heat source, from the stove top to the campfire (just not the microwave!). The more you use it, the better the seasoning will get. Wash cast iron by hand with mild soap or none at all. Dry promptly and thoroughly with a lint-free cloth or paper towel. Rub with a very light layer of vegetable oil, preferably while the cookware is still warm. Hang or store cookware in a dry place.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/599f98f7-4f9b-47bf-a75d-8fc6d1f3f02d._CR0,0,300,300_PT0_SX300__."
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/538ca0ba-5aa0-4a98-bb99-268e571bcfb8._CR0,0,971,300_PT0_SX970__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2149dfec-1946-43e6-b855-6f3606551221._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/73984f38-8cba-4757-bc1d-5df351eb36c3._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4f38c31f-a872-4428-a73a-23374a89f6dd._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/599f98f7-4f9b-47bf-a75d-8fc6d1f3f02d._CR0,0,300,300_PT0_SX300__."
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joe Bob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZWQ7UR65YATLTBNDOVVNGS5CDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLHJ8NCVZM4W6?ASIN=B00006JSUA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2007",
                "reviewTitle": "5.0 out of 5 stars Timeless classic for the modern kitchen",
                "reviewText": "Sorry for the long review - for the short review, count the stars!I'm a bit of a purist. I always season my cast iron - new, or used (hey, I don't know WHAT someone else used that old piece of cast iron for - maybe cleaning auto parts). I sand it down to bare metal, starting with about an 80 grit and finishing with 200.Then I season. The end result is a glossy black mirror that puts Teflon to shame. There are two mistakes people make when seasoning - not hot enough, not long enough. These mistakes give the same result - a sticky brown coating that is definitely not non-stick, and the first time they bring any real heat to the pan, clouds of smoke that they neither expected or wanted. I see several complaints here that are completely due to not knowing this.But there were a few pieces I needed (yes, needed, cast iron isn't about want, it's a need), and this was one of them, so I thought I'd give the Lodge pre-seasoning a try. Ordered last Friday, received this Friday - free shipping, yay!The first thing I noticed was the bumpy coating. The inside is actually rougher than the outside, and my hand was itching for the sandpaper, but that would have defeated the experiment. This time, I was going to give the Lodge pre-seasoning a chance before I broke out the sandpaper. So I scrubbed the pan out with a plastic brush and a little soapy water, rinsed well, put it on a medium burner, and waited. Cast iron tip number one - give it a little time. Then give it a little more time. Cast iron conducts heat much more slowly than aluminum, so you have to have a little patience.Then I threw in a pat of butter, and brought out the natural enemy of badly seasoned cast iron - the egg. And, sure enough, it stuck - but not badly, just in the middle. A bit of spatula work and I actually got a passable over-medium egg. Hmmm. But still not good enough. So I cleaned up the pan, and broke out the lard.I have only one justification for using lard. I don't remember Grandma using refined hand-pressed organic flax oil, or purified extra-virgin olive oil made by real virgins. Nope, it was pretty much animal fat in her iron. A scoop of bacon grease from the mason jar beside the stove and she was ready to cook anything. Grandaddy wouldn't eat a piece of meat that had less than a half-inch of fat around it. \"Tastes like a dry old shoe.\", he'd declare if it was too lean. In the end, I'm sure their diet killed them, but they ate well in the meantime. Grandaddy was cut down at the tender age of 96, and Grandma lasted till 98. Eat what you want folks - in the end, it's pretty much up to your genetics.So I warmed up my new pieces, and smeared a very thin layer of lard all over them - use your fingers. Towels, especially paper towels, will shed lint, and lint in your seasoning coat doesn't help things at all. Besides, it's kinda fun.Here's cast iron tip number two - season at the highest temp you think you'll ever cook at - or higher. If you don't, you won't get the full non-stick thing, and the first time you bring it up to that temp you'll get clouds of smoke from the unfinished seasoning. I put my pieces in a cold oven, and set the temp for an hour at 500 degrees (F, not C). Yeah, I know, Lodge says 350. Lodge doesn't want panicked support calls from people whose house is full of smoke. Crank the heat up.You have two choices here. You can put a fan in the kitchen window and blow smoke out of your house like the battleship Bismarck under attack by the Royal Navy, or invest in an oxygen mask. You will get smoke. You will get lots of smoke, especially if you're doing several pieces at once, like I just did. This is a good thing - that's smoke that won't be jumping out to surprise you the first time you try to cook with any real heat. The goal is to heat until you don't get smoke, and in my experience, 500 degrees for an hour does that pretty well.Let the pieces cool in the closed oven. Then re-grease and repeat. And repeat again. And don't glop the fat on. Just enough to coat. More thin layers are better than fewer gloppy layers. I managed four layers last night without my neighbors calling the fire department.Seems like a lot of work? Look at it this way. It's a lifetime commitment. Treat your iron well, and it will love you right back like you've never been loved before. And this is pretty much a one-time deal, unless you do something silly.The end result of my all-night smoking up the kitchen exercise? Dry, absolutely no stickiness, black as a coal mine at midnight and shiny - but still bumpy - could it possibly work with that rough surface?I put the skillet back on a medium burner, put a pat of butter on and tossed in a couple of eggs. After the whites had set a little, I nudged them with a spatula, and they scooted across the pan. I'll be... it works. My wife came back from the store and wanted scrambled eggs. If there's anything that cast iron likes less than fried eggs, it's scrambled. But it was the same thing all over again. No stick. No cleanup. Just a quick hot water rinse with a brush in case something got left on the pan (I couldn't see anything, but hey), then I put it on a med-hi burner till dry, put a thin coat of lard on the pan and waited until I saw smoke for a minute. Let cool and hang up. Done.So. do I like the bumpy texture of the Lodge pre-season? Nope. Does it work? Yes, and contrary to my misgivings, it works very well. My wife pointed out that even some Teflon cookware has textured patterns in it. The Lodge pre-season isn't a perfect surface out of the box - but it does give you a big head-start. After a night's work, my iron is ready to face anything, and you just can't beat that.Lodge makes a great product. For the quality, durability, and versatility, you can't beat Lodge cast iron. Plus, it's made in America. I like that. If you've never experienced cast iron cooking, you've just been cheating yourself. Plus, the price, for a piece of lifetime cookware, is insanely cheap.And my sandpaper is still on the tool shelf.",
                "reviewVotes": "4,770 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXUJ2V25YHXH6OZDHFCWOJ6LC3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29EGUEGPG6L0B?ASIN=B00006JSUA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Fantastic Cast Iron Skillet",
                "reviewText": "I absolutely love my Lodge 15 Inch Cast Iron Skillet! This skillet has become an indispensable part of my kitchen arsenal, and I can't recommend it highly enough.First and foremost, the size of this skillet is fantastic. It's perfect for cooking large meals or for when you have a crowd to feed. Whether I'm searing a couple of steaks, roasting vegetables, or making a big batch of paella, this skillet can handle it all with ease.The cast iron construction is top-notch. It heats up evenly and retains heat exceptionally well, which means I get consistent cooking results every time. Whether I'm using it on the stovetop, in the oven, or over an open flame, this skillet delivers fantastic performance.One of the things I love most about cast iron cookware is its durability, and the Lodge 15 Inch Cast Iron Skillet is no exception. With proper care, it will last a lifetime and more. It has become a family heirloom that I can pass down to future generations.The pre-seasoning on this skillet is excellent. It provides a non-stick surface that improves with each use, and I find that I need very little oil or fat when cooking. Plus, the more I use it, the better it gets!Cleanup is a breeze. I simply wipe it clean with a paper towel, and if necessary, I give it a quick rinse and a gentle scrub with a brush. The low-maintenance aspect of cast iron is a huge plus for me.Overall, the Lodge 15 Inch Cast Iron Skillet is a kitchen workhorse that I can't imagine being without. Its versatility, durability, and exceptional cooking performance make it a must-have for any serious home cook or chef. It's a 5-star addition to my kitchen, and I couldn't be happier with it!",
                "reviewVotes": "72 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lesley B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQTF3TIURIXZUBD5RQ7PPTLPQTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTAQOP966Q6UR?ASIN=B00006JSUA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars where have you been all my life?",
                "reviewText": "If you're the type to throw pans in the dishwasher, stop reading this and just don't buy cast iron. ... Still with me? Good. Like so many others, I've listened to the hype and wasted so much money on non-stick pans that don't brown and never last long, even with hand-washing and using plastic utensils. Now I understand that cast iron is the best, most durable non-stick there is and it's not hard to maintain it. Lodge is well made and inexpensive and although it comes pre-seasoned, it's not non-stick, yet. You'll want to lightly clean it then smear fat or crisco (I used duck fat but bacon fat is good too) and wipe the excess with a paper towel. Then place it in an oven that's preheated as hot as it gets (500F if you can) for 10-15 minutes (an hour is fine but overkill). Put your fan on b/c it will stink. Repeat this now and then after cooking, especially the first few times, and these repeats can be high flame stove-top, not oven, if you prefer. Don't bother with the handle or outside unless rusty - this is really about the inside. After a few times, it will be soooo smooth! If you don't season it after cleaning, at least dry it on the stove for a few minutes so it doesn't rust. If you thought about sanding to get it smooth, DON'T as that will make the seasoning NOT stick to the pan and you'll ruin it. It actually needs those tiny bumps for the seasoning to stick and you'll forget those bumps ever existed very quickly once the seasoning builds. As far as extras go: get the silicone handle (don't bake with it), get the plastic scraper (no need for the chain mail if you keep it well seasoned), and it's ok to use a bit of palmolive or similar & water to clean if especially dirty but then be sure to dry well and/or season after.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Oman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2024",
                "reviewTitle": "Perfect size",
                "reviewText": "Have a larger one and thought that the smaller size would be useful. Great quality and good value.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WOLVERINEWOLVERINE",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 14, 2023",
                "reviewTitle": "Perfect cast iron skillets!",
                "reviewText": "The media could not be loaded. You an never go wrong with a good solid cast iron pan. They last for years and years if taken care of properly. I was sick of that non-stick garbage. I have an older, bigger cast iron skillet that also that I bought used 20 years ago. I wanted a smaller one to go with it. It's nice and heavy, which I like, some other people might find it hard to hold with one hand. It heats up well and very evenly. When prepped and seasoned properly even eggs don't stick in the bottom. I always use butter or olive oil to wipe and prep for next use. Cooking with a cast iron skillet is not the same as cooking with a non-stick pan. I use less heat and always have the pan prepped with butter or olive oil. After I finish cooking I never use soap to clean the pan a little water and scrub pad dry and then spread a little olive oil around in the pan to have it ready for next time. I would definitely buy another one of these. I've been using it every day and tossed my non-stick junk in the trash. The prep and cleaning of a cast iron skillet might require a bit more time but in the end you're not baking chemicals into your food from whatever sort of coating they put on those other pans to make them non-stick.If you want to season your skillets you can go to the Lodge website, they have a guide and tips on how to season even though these come preseasoned you can always do your own. I seasoned both of my Lodge skillets the smaller 6-1/2\" in the video shows me cooking an egg for the first time after seasoning to show how well cast iron can be compared to non-stick and even better since there are no chemicals potentially getting into your food.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71i+ZIfTs4L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Wp9ow4aXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81eC39ZvDrL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81UdAbNmEYL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/D1p9 VNx2UL.mp4"
                }
            },
            {
                "reviewerName": "Fer Villalobos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 30, 2023",
                "reviewTitle": "El secreto está en saber usarlo.",
                "reviewText": "Excelente calidad, puro hierro. Muy pesado eso sí, hasta me lastimé la muñeca, pero es lo que los hace duraderos.Con un buen tratamiento y cuidado es un sartén para toda la vida. Después de un tiempo el curtido del sartén mejora y cada vez será más fácil cocinar en él. Simplemente hay que hacer lo siguiente:Una vez lo recibas tienes que lavarlo muy bien, con agua tibia y jabón (esa será la única vez que utilices jabón sobre él). Nunca dejes el sartén secándose en reposo porque hará que se oxide, es mejor retirarle tú mismo la humedad con algún paño seco o mejor aún, ponerlo al fuego nuevamente hasta que toda la humedad se evapore.Antes de guardarlo coloca un par de gotas de aceite de oliva, semilla de uva o aguacate (sólo un poco, no queremos que se enrancie ) y distribúyelo bien sobre todas las superficies del sartén, esto evitará que se genere oxido mientras está almacenado.Para su limpieza utiliza una fibra limpia sin detergente, en todo caso un poco de sal para lo que se queda pegado, siempre lávalo mientras sigue caliente y con agua también caliente, evita generar el choque térmico enfriándolo en el chorro de agua fría, esto hará que arruines la capa antiadherente que naturalmente se genera con el tiempo.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marie J.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 3, 2023",
                "reviewTitle": "Una sartén con espíritu guerrero",
                "reviewText": "Está muy bien hecha la sartén. Pesada eso sí. La uso especialmente para carnes o huevo. Calienta lento pero mantiene el calor y una vez curada cocina todo de forma uniforme y rápido. No se deben lavar y hay que limpiarlas y aceitarlas continuamente.A pesar de que lleva trabajo extra el cuidado, recomiendo tener una. Dura toda la vida",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sylvia ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 18, 2022",
                "reviewTitle": "Ícone da cozinha americana e de quem quer cozinhar bem!!",
                "reviewText": "Produto excelente!!! Era o que eu procurava há tempos!!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}