{
    "remaining_requests": 22888,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Feather-Double-Edge-Shaving-Razor/dp/B003YJ70NY",
    "body": {
        "name": "Feather Popular Double Edge Safety Razor",
        "price": "$20.95$20.95 ($20.95$20.95 / Count) $19.90$19.90 ($19.90$19.90 / Count)",
        "originalPrice": "",
        "rawPrice": 20.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Feather-Double-Edge-Shaving-Razor/dp/B003YJ70NY",
        "soldBy": {
            "sellerID": "A316G987QF1YAG",
            "name": "SBT Supply",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A316G987QF1YAG&asin=B003YJ70NY&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "12",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31tcED8pXeL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41PK6i1Z2kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LpzXQnK9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412K24oyHsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51iDx4BQwkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41IkgWUvVYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411nP1ynhNL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Feather Store",
            "link": "https://www.amazon.com/stores/Feather/page/1FD41240-7164-471E-83F6-7704E7F558D8?ref_=ast_bln"
        },
        "brand": "Feather",
        "merchantInfo": "SBT Supply",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2708,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35. Order within 23 hrs 44 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Double Edge Razor; Eco Friendly And Economical Razor; Created For A Modern Experience Of A Traditional Wet Shave; Safety Razor Featuring Complete Control Of A Close And Irritation Free Shave; Compatible With All Skin And Hair Types",
            "Stainless Steel Blade And Plastic Handle; Lightweight And Comfortable Handle; Enables A Secure Grip; Disposable Stainless Steel Blades; Enable A Smooth Shave; Resists Heat And Other Impurities",
            "Butterfly Head Opening; Easily Change And Replace Blades Safely With A Simple Twisting Mechanism On The Razor Handle; Provides A No Touch System Of Disposing Of Used Blades And Inserting New Ones",
            "Safe And Wet Shave; Delivers Traditional And Close Shave That Is Superior To Multi Blade Shaves; With Innovative And Safe Technology Presented By Feather",
            "Specifications; Black Handle Is Four Point Zero Five Inches; Weighs Thirty Four Grams; Includes Two Hi Stainless Razor Blades; Compatible With Feather Artist Club Pro Super And Pro Soft Guard Blades"
        ],
        "description": "The feather double-edge safety razor is a efficient butterfly opening safety razor that combines affordability with performance. Carefully designed for easy handling and superior grip, and built with quality materials including stainless steel. The butterfly loading mechanism is highly practical when loading or cleaning the razor. A perfect shaving instrument, in the feather tradition of high quality shaving instruments. It uses any modern double-edge blade.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b?ie=UTF8&node=3778591"
            },
            {
                "name": "Men's",
                "link": "https://www.amazon.com/Mens-Shaving-Hair-Removal-Products/b?ie=UTF8&node=13271079011"
            },
            {
                "name": "Razors & Blades",
                "link": "https://www.amazon.com/Mens-Shaving-Razors-Blades/b?ie=UTF8&node=13271080011"
            },
            {
                "name": "Safety Razors",
                "link": "https://www.amazon.com/Mens-Safety-Shaving-Razors/b?ie=UTF8&node=13271088011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3 x 3 x 7 inches; 3.2 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ F1-25-900"
            },
            {
                "name": "Department ‏",
                "value": "‎ Men"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 735533258931"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Derby International LLC, dba KANAR"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B003YJ70NY"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#106,477 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #89 in Men's Safety Shaving Razors"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,708 ratings"
            },
            {
                "name": "Brand",
                "value": "Feather"
            },
            {
                "name": "Number of Blades",
                "value": "1"
            },
            {
                "name": "Unit Count",
                "value": "1 Count"
            },
            {
                "name": "Skin Type",
                "value": "Sensitive"
            },
            {
                "name": "Number of Items",
                "value": "1"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Feather Double Edge Razor Feather razor design is to maximize the performance of its blades. The design takes into account the metal composition of the blade, how it is grind and honed to determine the precise exposure the blade must have to give a smooth and comfortable shave. A blend of artistry and technology makes this razor the best choice when shaving with the Feather blade.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a677aef3-5e71-4da3-8893-1b5d708aa595._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Features and Benefits Medium exposure Head of razor is designed to exposure the blade to shave medium to sensitive skin. Butterfly opening Twisting the metal ring at the top of the razor handle opens the razor head to expose the blade for replacement. Easy to replace blades Blades is held securely by the metal post. Replacement Blades Blades are available in 5 and 10 blade dispensers.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d5fb8f8e-1688-41da-a367-165a4c81c8b7._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/8bac4942-a9fe-47fa-ba12-b61c11b35ff1._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/09cbe3cf-5022-4622-81e8-a139aeaf5777._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/88ea519f-e994-4932-85a0-24d412796e3e._SL220__.jpg"
                ]
            },
            {
                "media_text": "High quality producer of shaving razors and blades Feather has been producing quality razor blades for over 85 years and has incorporated the latest blade and metal technology to make one of the finest blades in the world. Renowned for their consistent high quality in razor cutting tools in the beauty and barber industry as well in the medical surgical instruments you can be assured this product meets their high quality standards to perform and provide the results you are looking to achieve. The handle and blade designed to work together as one unit. Prepare to be amazed.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e9f862b9-35ea-4d4a-9bc4-4b57ae8edb45._SR300,300_.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/a677aef3-5e71-4da3-8893-1b5d708aa595._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d5fb8f8e-1688-41da-a367-165a4c81c8b7._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8bac4942-a9fe-47fa-ba12-b61c11b35ff1._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/09cbe3cf-5022-4622-81e8-a139aeaf5777._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/88ea519f-e994-4932-85a0-24d412796e3e._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e9f862b9-35ea-4d4a-9bc4-4b57ae8edb45._SR300,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Eskape from PA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFQT4WBH7VGNQY6SXZM7QU3RDGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WU2BZHV1Q36U?ASIN=B003YJ70NY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2013",
                "reviewTitle": "5.0 out of 5 stars Open Source Shaving",
                "reviewText": "I have shaved with an electric shaver/razor and have tried several types of \"cartridge\" multi-blade razors, including recent 5 blade contraptions that to me were uncomfortable to shave with. The companies that make these cartridge razors increase the price for every new blade they add. It seems at some point the quality of the shave became less important and the sales of ever more expensive cartridges became the goal.And they are all different, having various parts that snap together that are not compatible(between different razors). Sometimes looking at the cartridges I wondered whether they were designed to fail prematurely, spacing between the blades in some is limited and/or some plastic part would cause hair to become jammed in the crevice between the blades making the cartridge difficult to use, causing discomfort to my skin, and just failing to shave properly - result would be a need to replace the cartridge after a few uses. The price of cartridges did not go down when I used them regularly. I tried both store brand and \"name\" brand cartridge razors.During the Summer of 2011 I decided to give electric shaving a new try after using a Braun shaver/razor for some time with disappointing results about a decade ago. I bought a \"cheap\" Norelco 7310XL and used that together with Afta Pre-Electric lotion until recently. It gave good results, but frequently left me with razor burn on my neck(even after using the lotion).Electric shaving in my opinion has its strengths. The Norelco shaver/razor uses long lasting blades that are replaced after 6-12 months. This helps reduce waste and cost. The bottles of lotion lasted me several months and are recyclable. If the shaver/razor is well made and lasts a long time overall waste is reduced. That can't be said for \"disposable\" razors that just fill up landfills, cartridge razors are only slightly less wasteful. I was looking for a shaving product that produces low amounts of waste, produces good results as far as shave quality, and would be relatively cheap(affordable).I decided to give Double Edge Safety razors a try together with \"wet\" shaving. This was all new to me, my grandfather used to shave this way. My father still has an old DE razor he received as a gift, with an old blade(which is like 20 years old) he virtually never uses. I wanted a newer one with a long handle. I decided to try this Feather razor with a Van Der Hagen brush, bowl, and soap kit.My initial cost was around $30. Which was slightly more than the cost of replacing the blades on the Norelco shaver/razor. I did not want to spend a lot of money for something that I was not sure I would use for a very long time. I really did not want to buy a more expensive Parker, Merkur, or Edwin Jagger (etc.) razor so I went with the more affordable Feather. It likely has a lower price because it has more plastic parts(than other DE razors), which will likely reduce the razor's service life. Although the moving parts appear to be made of metal(from the outside).I was not really expecting much in shave quality, after all, I thought to myself, this is an \"older generation\" of shaving technology.The Feather razor arrived packaged with 2 Feather Hi-Stainless blades, which seem to have a reputation for being the \"sharpest DE blade\". Many claim that the Feather blades are almost dangerous for beginners. I did not experience anything life threatening with these blades.This razor is a \"butterfly\" design/type. Meaning the \"head\" opens up(into 2 identical metal pieces) through internal machinery, which is moved by a rotating mechanism on the upper part of the handle. The head is not removed like on certain (more basic) 3 piece razor designs. This makes replacing the blade a much simpler task. There is a metal \"retainer\"(best way to describe it) that holds the blade in place and divides the head into 2 distinct sides.The handle is mostly plastic with a good grip surface which prevents you from dropping the razor. The connection point between the head and handle is also made of plastic.I did a few practice strokes on the neck with an un-even amount of shaving soap lather. After several shaving sessions I came to the conclusion that the Feather blade just seemed wrong for my skin(dry and easily irritated) and hair type. It left me with mild razor burn that went away after a few minutes, but made shaving my beard area somewhat uncomfortable. On my 3rd or 4th shaving session I tried a Wilkinson Sword blade, this too felt uncomfortable, plus I cut myself more often than I had with the Feather blade.I next moved to an Astra blade, which did not cause me as much discomfort around my beard area although I was left with some cuts. After I started using a glycerin based soap the shaving experience improved significantly. I still use the Astra blades(they work well with the glycerin soap, lasting up to 6 shaving sessions per blade), being much cheaper than Feather blades I do expect to run into some \"bad apples\" while using them, which I won't feel bad about replacing instantly because they are cheaper(especially when compared to cartridges).I developed my own shaving regimen for this razor. The neck area receives 3 passes(2 up and 1 down), the sideburns 2 passes(1 up and 1 down), mustache 2.5 passes(1 down, 1 across, and some spots receive half of an upward pass), the most tricky beard area receives 3-5 passes(1 down, several across and up). I rotate the razor to use both sides of the blade. This regimen leaves me with smooth skin for up to a day.One thing to note. It now takes me about 30 minutes to shave properly. I don't do it in the morning, I shave in the evening before going to sleep(it helps to take a shower beforehand to soften the hairs and skin before shaving). This gives me the maximum amount of time to shave, because if you rush with DE razors you are more likely to cut yourself and leave behind some stubble.The best part of Double Edge razors is that you do not feel like you are forced to conform to some Monopoly. You choose the blade you want to use, you choose the cream or soap you want to use, you choose the razor you want to use. What it could be called is \"open source\" shaving, like with computer software. I minimize the waste I produce - all I need to throw away are shaving soap packages(mostly paper) and used blades. I also purchased a Wilkinson Sword DE razor as an auxiliary razor.I recommend the Feather Double Edge razor to beginners, but the Feather blades are not for me.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LaneP",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDNXPC3ROBKJETUPBU7EIMZFNKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UQ0S9Y9RWEX4?ASIN=B003YJ70NY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2015",
                "reviewTitle": "5.0 out of 5 stars I am now a former cartridge blade user",
                "reviewText": "I first used a DE razor as an adolescent in the 70's but soon the proliferation of disposables and the development of cartridge razors made them obsolete. As the decades went by I went from cartridge blades featuring 2 blades to 3 blades to the ridiculous and over priced 5 blade models, all the while paying ever increasing prices for those designs, up to the tune of $5 a blade. Then I had begun evaluating the expense of these \"miracle\" cartridge shavers and decided to try the DE shaving system once again, if not for merely nostalgia then to pay only ~.35 cents a blade versus five bucks.My first attempts failed miserably. I ended up with a satisfactory shave on the face, but on the throat and below the jaw I found shaving with a DE razor more akin to losing a battle with a sword wielding Ninja. I went back to cartridges for some years after, deciding \"nostalgia\" shaving technology was best left in the past where it originated.After hearing a co-worker talk about his satisfaction with DE's and more research on the 'net, I decided to attempt this \"new-old\" shaving system once more. Realizing my past failures, I knew I needed to do something different. My skin is not super-sensitive, but not sheet leather either. What had I done wrong before? I soon began to find the answers.The problem I realized, is that cartridge razors teach you to shave \"incorrectly\". Due to the fact they are essentially a blade or set of blades that are set into a box at a 30-40 degree angle or so (that's my guess), you are forced to place the shaving implement flat against your face for them to work. Couple that with their tendency to accumulate junk between the blades and you must increase pressure to maintain sufficient blade-skin contact. They do work adequately when employed as their design dictates, but the technique they force you to use is disastrous if transferred to a DE razor.I purchased this Feather model DE and wasn't particularly impressed with it out of the box. Though well made in appearance, it was predominantly plastic. Aren't DE razors supposed to be metal and super heavy? The handle of about 4 inches appealed to me though. I knew with use of razors with stubby 3 inch handles I did not have the degree of control (unbalanced to me) I needed. I loaded a brand new Feather DE razor blade in it and vowed the next morning I would shave with it, but in doing so throw out the window everything the cartridge razor system had taught me. I knew I would have to \"re-learn\" how to shave to make this system work.For one, the plastic construction actually works for me much better than the purported benefits of the heavy weight metal models by increasing my control of the unit. What I discovered was that the additional handle length acted less as a gripping surface and more of a counter balance to the weight of the blade bearing head as I held the razor primarily between thumb, index and middle fingers. I decided I preferred the butterfly opening top instead of the removable cap some designs sport.Use a good shave cream. This is as personalized a choice as any, but a good quality shave cream is essential. Quality shave cream is a crucial friction reducer as the blade glides over skin. I prefer a canned cream such as Barbasol Aloe. Avoid the gimmicky, razor clogging gels.Blade angle. I maintained as well as possible a blade-to-skin angle of approximately 40-ish degrees, maybe slightly less.NO PRESSURE. I repeat, none. Cartridge razors encourage the application of pressure to maintain blade-skin contact and this is a bad habit cartridge blade users often carry over to their first efforts with a DE razor. There is no need to apply pressure with a DE razor. The blade is there, not inset below a box frame, so it does its work without requiring any pressure to efficiently slice your stubble.Short, even strokes. With box cartridge razors I had developed the bad habit of dragging the razor from ear to chin in one continuous stroke. Do not do this with a DE razor. Gradually work your way down (or up) in short, light strokes, maintaining and adjusting your blade angle as appropriate.Second passes. Never make a second pass (such as against the grain) without re-applying shave cream to that area. Another bad habit I had developed with cartridge razors I found I needed to break in order to succeed with a DE razor.Whenever possible, stretch skin flat and taught. When this is more difficult to do (around the throat in particular), make your strokes even MORE light and short. This technique alone will reduce or eliminate the vast majority of nicks and abrasions.Take your time! If you don't have the time, wait until you do to practice. Though once you have committed your technique to memory it will become second nature, avoid the initial temptation to treat DE shaving like it's a 2 minute and done cartridge razor shaving session.When choosing a DE system, expect to have to buy a few different brands of razors, blades and creams before you hit on the combo that works best for you. I did, and I stopped looking after buying this Feather and the Feather blades.I am now done with cartridge razors. Some may find the transition is easy, others will not, but no doubt when used correctly they are a highly efficient and extremely cost effective alternative to the \"miracle\" super duper, twisting, rotating, vibrating, pivoting razor marketing gimmicks pitched to shavers around the world at a substantial expense to your shaving budget.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 10, 2023",
                "reviewTitle": "good investment for me",
                "reviewText": "The blade and razor do not take up as much space as most disposable ones. It takes a bit very little bit for me. The shave is faster and cleaner than most others i have used. In the long of it less costly than other methods i have used including electric as even those blades need replacing after some amount of use. No cords to bother with and near no waste.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "marco",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 1, 2024",
                "reviewTitle": "Preis/Leistung passt",
                "reviewText": "Rein optisch ist diese Rasierhobel ja nicht sehr ansprechend. Der Plastikgriff und der Rasierkopf wirken nicht wirklich hochwertig. Irgendwie macht er einen ziemlich klapprigen Eindruck.Bei einem Preis von unter 20€ werde ich da aber Mal ein Auge zudrücken.Dafür hat mich das Rasierergebniss aber überzeugt. Ich hab diesen Rasierhobel mit einer Perma-Sharp Rasierklingen getestet und bin sehr zufrieden.Die Rasur ist sehr gründlich und wenn man die Spannung der Klinge richtig eingestellt hat, fühlt es sich sehr sicher an.Ich werde diesen Rasierhobel noch mit meinen favorisieren Klingen (Astra Superior Platinum) testen und die Rezension dann ggf. anpassen. Die beiliegenden Feather Hi-Stainless Rasierklingen werde ich natürlich auch noch ausprobieren.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "I",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 16, 2023",
                "reviewTitle": "très bon produit.",
                "reviewText": "très bon produit.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Santiago",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 27, 2021",
                "reviewTitle": "Muy buen artículo",
                "reviewText": "Un buen rastrillo, el material del mango es de plástico, una ventaja es que casi no pesa nada debido al material, el cabezal para poner la navaja es de mariposa que se abre al girar y se cierra del mismo modo. La cuchilla queda bien, da un buen rasurado aunque eso ya dependeria del filo de la cuchilla, incluye unas cuchillas feather que cortan bien. Como desventaja podría poner que no luce tan de lujo como otros rastrillos que son totalmente metálicos, pero en relación a su precio está excelente, cumple bien su función y es un plástico duro-resistente, es mucho mas liviano que los metálicos, excelente para personas mayores.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monty",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on October 2, 2023",
                "reviewTitle": "Economico e perfetto",
                "reviewText": "Utile per tagli massimo di tre gg, plastica credo anche scarsa, lama ben fissa e tagli preciso. Consiglio per trasferte visto il prezzo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}