{
    "remaining_requests": 22929,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Astra-Platinum-Double-Safety-Blades/dp/B001QY8QXM",
    "body": {
        "name": "Astra Platinum Double Edge Safety Razor Blades,100 Count (Pack of 1)",
        "price": "$8.64$8.64 ($0.09$0.09 / Count) $8.21$8.21 ($0.08$0.08 / Count)",
        "originalPrice": "$9.99",
        "rawPrice": 8.64,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Astra-Platinum-Double-Safety-Blades/dp/B001QY8QXM",
        "soldBy": {
            "sellerID": "A1RSNR3DXUHW3R",
            "name": "BVS SHOP",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1RSNR3DXUHW3R&asin=B001QY8QXM&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B082KRFV4K"
        ],
        "asinVariationValues": [
            {
                "asin": "B001QY8QXM",
                "variationName": "Size",
                "variationValue": "100 Count (Pack of 1)",
                "price": "$8.64",
                "variationImageURL": ""
            },
            {
                "asin": "B07K1VLRHR",
                "variationName": "Size",
                "variationValue": "100 Count (Pack of 5)",
                "price": "$36.40",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41KPdOFKPeL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31msri6BW1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PIJcoSeNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31iWZcNri3L.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: ASTRA",
            "link": "https://www.amazon.com/ASTRA/b/ref=bl_dp_s_web_21436368011?ie=UTF8&node=21436368011&field-lbr_brands_browse-bin=ASTRA"
        },
        "brand": "ASTRA",
        "merchantInfo": "BVS SHOP",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 49444,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 22 hrs 51 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 22 hrs 51 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Model Number: ASTRA01",
            "Country Of Origin: India",
            "Item Package Weight: 6.0 oz",
            "Item Package Dimension: 8.0\" L x 1.5\" W x 8.0\" H"
        ],
        "description": "ASTRA stainless double edge blades fit all double edge razors. ASTRA blades are made from the highest quality steel. Each ASTRA blade provides unsurpassed quality, smoothness and durability for a long lasting, smooth shave.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3778591"
            },
            {
                "name": "Men's",
                "link": "https://www.amazon.com/Mens-Shaving-Hair-Removal-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13271079011"
            },
            {
                "name": "Razors & Blades",
                "link": "https://www.amazon.com/Mens-Shaving-Razors-Blades/b/ref=dp_bc_aui_C_4?ie=UTF8&node=13271080011"
            },
            {
                "name": "Razor Blades & Cartridges",
                "link": "https://www.amazon.com/Mens-Replacement-Razor-Blade-Cartridges-Refills/b/ref=dp_bc_aui_C_5?ie=UTF8&node=13271084011"
            },
            {
                "name": "Cartridges",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_6?ie=UTF8&node=120828361011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 8 x 1.5 x 8 inches; 0.96 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ ASTRA01"
            },
            {
                "name": "Department ‏",
                "value": "‎ Men"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 883887205580 622200155726"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Gillette"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B001QY8QXM"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,492 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #12 in Men's Razor Blade Cartridges"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 49,444 ratings"
            },
            {
                "name": "Brand",
                "value": "ASTRA"
            },
            {
                "name": "Number of Blades",
                "value": "100"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Shaving"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Skin Type",
                "value": "All"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kenneth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVJCJYLL54H6TPIBIPC7IQPGWAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H5NB9Q4S9LIC?ASIN=B001QY8QXM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2018",
                "reviewTitle": "5.0 out of 5 stars Sharpness + Longevity + Smoothness = Perfection (for me)",
                "reviewText": "Astra Superior Platinum is a formerly Czech brand now manufactured in St. Petersburg Russia by Gillette-owned Petersburg Products International. (Edit: They're now manufactured in India, but worry not because I can tell you the new blades shave every bit as good as the old ones.) It's one of those blades you wouldn't give a second look due to more popular and/or \"respected\" brands such as Feather or Personna, but the fact of the matter is this is one of the absolute best values to be had in wet shaving at around a dime per blade. I ordered my 100 count box from Super Safety Razors and am pleased to say they're the genuine article as well as newer manufacture. Each blade is secured to its single wax paper envelope with two centrally placed wax dots that aren't nearly as sloppy as what you'd commonly see on a Gillette Silver Blue. Each retail carton contains 20 tucks of 5 blades each, with a perforated slot near the bottom which can be torn out if so desired for easier dispensing.Just to give you some context, I have the dreaded combination of a very coarse beard with sensitive skin, so multiple passes are risking a lot of irritation and ingrown hairs. I first used these in a Merkur 34C and found them to be less tuggy with a more consistent sharpness than GSBs, but they unfortunately did not make the HD a more efficient shaver for me. I've since switched to a Parker 87R with a bit more blade exposure, and that, I feel, is what brought out the best qualities of these blades. I can consistently achieve two pass DFS's (or Damn Fine Shaves) with the Astra SP and the Parker with virtually no irritation whatsoever. They slice through my heavy/coarse beard with ease and plenty of audible feedback, and I can get about three, maybe four shaves from them before I feel like they're not cutting as well as they did when new. Of course, YMMV based on your facial hair type and shaving techniques. I highly, highly recommend pairing them with a razor that has more blade exposure to get the most out of them, however. (Edit, 4/25/18: Many shaves later, I'm still swearing by these blades. Remember when I said they have a consistent sharpness? That's what keeps me coming back to Astra SP. I LIKE that these blades start out at a decent sharpness which SLOWLY and predictably changes over time without requiring you to modify your technique. No break-in period like GSB or Pol Silver, just smooth, consistent shave after shave without any surprises, and you'll know when it's time to replace the blade long before it feels like a dull steak knife; alum blocks never lie.)The only caution I have to offer is that while these blades seem to be the perfect trifecta of sharpness, longevity, and smoothness, that smoothness can and will lull you into a false sense of security if you're not careful, as I learned much to my dismay. I rushed through one of my shaves one day and got rewarded for my impatience with some painful nicks and weepers that made me yelp loudly. Make no mistake: These blades are wickedly sharp, and it's not unheard of for them to be referred to as a poor man's Feather on various shaving forums.At the risk of sounding like a fanboy, I pretty much consider these my grail blade. They work exceptionally well for me and give me comfortable, consistent and EFFICIENT shaves with minimal irritation in my Parker TTO. My advice to you would be to get a smaller pack of these to try out, see if they work well for you, and then spring for the 100 count pack. You won't save as much in the short term, but if they end up not being what you expected, you won't have a bunch of razor blades to give away or throw out. Then again, I'll happily accept any unwanted blades still sealed in their original cartons/tucks and dispose of them for you free of charge. Just pay shipping and handling! :P",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carmin Frisard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHG4VFMLNL6WS3V745DYZUKUN6OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G8NN72CT3F4V?ASIN=B001QY8QXM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars A Tried and Trusted Companion for Shaving",
                "reviewText": "My husband has used the razor blades since he started shaving 10+ years ago.Quality and Durability:One of the most notable qualities of Astra Platinum blades is their exceptional build quality. They work so well and for a very long time. We do not have to buy blades often at all because so many come in one pack.Sharpness and Precision:Astra Platinum blades excel in delivering a close and precise shave, thanks to their sharp edges and precision-engineered design. My husband has thick hair that he has tried to use other razors for, but nothing has gotten him a clean shave like these.Value for Money:One of the most appealing aspects of Astra Platinum blades is their excellent value for money. Each pack comes with a generous supply of blades, which can last for an extended period, often up to a year depending on usage frequency. This makes them a cost-effective option for individuals seeking high-quality shaving performance without breaking the bank. Additionally, the longevity of these blades further enhances their value proposition, making them a wise investment for long-term use.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFL6B7IZD4I3KROE24W3BVK6BZGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R670JQ91EXU9A?ASIN=B001QY8QXM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 30, 2013",
                "reviewTitle": "5.0 out of 5 stars Sharp but not too sharp, very comfortable shaves",
                "reviewText": "TL;DR — These are my go-to blades for great, close shaves at an unbeatable price.Here is my review of the blades I've tried. There are a lot of sampler packs on Amazon, but after doing some research I chose to order around 30 each of just a few different blades to try, avoiding all of the lesser-quality \"filler\". I'll compare here and there to Mach-3 blades since that's what I previously used before switching to electric, and now this.First off, Derby is what came with my razor. These you can practically rake across your face any way you see fit. They aren't very sharp, on par with a Mach-3 that's been used a few times. Shaving requires more strokes which leads to more irritation, especially on the neck. That said, I'd say these are a good blade if you're super worried about cutting yourself, because it's practically impossible. But even beginners might want to look elsewhere as these blades kind of ruin the \"shaving experience\". Don't be disappointed if you just bought this razor and have only tried these blades! Keep reading...I ordered a 100-pack of Astra SP Platinum (that's Astra Superior Premium Platinum, not the regular stainless) since it's under ten bucks at the time of this writing. These are great. Beginners, start here. They're sharp enough that you don't have to press the razor against your skin—which you shouldn't have to! You're supposed to let the weight of your razor do the work as you guide it along your face in short strokes. So naturally, these are sharper than Mach-3 blades, but if you do press a little, you probably won't nick yourself. I love these blades because for me, they're comfortable enough for everyday use and provide good, close shaves at a very inexpensive price. Easy on my neck with care. My go-to blade. Great for beginners and pros alike, and eligible for Subscribe & Save!Wilkinson Sword Classic seem to be great blades for people who have their technique down pretty well. Compared to Astra SP Platinum, they are sharper. They provided the best shave of the lot, but I did nick myself here and there on my neck and below my chin the first time around. Do not push these blades against your skin. It doesn't take much mastery to use these, and they're worth working up to. Downside: more than twice the price of Astra SP Platinum. I'll keep some of these around for days when I want the closest shave possible, or I just feel like something different. If you're new to traditional shaving or think Mach-3 blades are sharp, maybe don't start here, but definitely try them out.Feather \"New Hi Stainless\" Platinum Coated blades are exactly what the reviews say: sharp. My first shave I got a good amount of nicks, but my second I had almost none. I adapted well, and you have to; each brand is a little different and the best require good technique, but some are more forgiving than others. These are negligibly sharper than the Wilkinson Sword Classic but they aren't forgiving at all and I didn't achieve any better of a shave. They're incredibly sharp compared to a Mach-3 blade. At 2x the price of the aforementioned and more than 3x the price of Astra SP Platinum, I won't be keeping these on hand, but your mileage may vary. If you only want the sharpest blade around, this is it. Fun fact: these come ten to a pack instead of five.In conclusion, I'm sticking with Astra SP Platinum for regular use and Wilkinson Sword Classic when I'm up for something sharper. I shave every other day, and either is priced reasonably enough that if I want, I can use each side of a blade just once for a fresh edge every shave. That's about a 100-pack every year, so do the maths on price. Of course, both brands last much longer than this if you're looking for even better value.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Al dawson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Geat blades awesome price",
                "reviewText": "liked that i still got 500 blades of russia stock",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ariel W",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 9, 2023",
                "reviewTitle": "Astra Premium Platinum Double Edge Razor Blades - 100 Blades for a Smooth and Precise Shave! 🪒✨",
                "reviewText": "Astra Superior Premium Platinum Double Edge Razor Blades are a staple in the wet shaving community, known for their exceptional quality and sharpness. This pack of 100 blades ensures you have a long-lasting supply for countless comfortable and precise shaves.Pros:1. **Superior Quality**: Astra blades are renowned for their consistent quality. They are manufactured with precision, ensuring each blade meets high standards.2. **Platinum Coating**: The platinum coating on these blades enhances their sharpness, durability, and longevity.3. **Smooth Shaves**: These blades provide an incredibly smooth and close shave, making them suitable for all skin types.4. **Versatility**: Astra blades are compatible with a wide range of double edge safety razors, making them a versatile choice for wet shavers.5. **Excellent Value**: This pack of 100 blades offers excellent value for money. You won't need to worry about buying replacements for a long time.Cons:1. **Blade Sharpness**: While Astra blades are known for their sharpness, some users may find them a bit too sharp, especially if they have sensitive skin. It may take a few shaves to get used to them.In summary, Astra Superior Premium Platinum Double Edge Razor Blades are a trusted choice for wet shavers seeking a consistently sharp, smooth, and comfortable shave. Whether you're new to wet shaving or a seasoned pro, these blades are a reliable and cost-effective option.Considering their quality, performance, and value, I confidently rate the Astra Superior Premium Platinum Double Edge Razor Blades with a perfect five stars. They are a go-to choice for those who demand precision and excellence in their shaving routine.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samuel Cordeiro de Oliveira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 17, 2021",
                "reviewTitle": "ELOGIO",
                "reviewText": "Gostei da suavidade do barbear. O conjunto barbeador e lâmina é muito harmonioso. Foi uma excelente compra.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOSE E.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 8, 2021",
                "reviewTitle": "Melhor Lâmina de Barbear que já usei",
                "reviewText": "A Lâmina Astra é a melhor que já usei. Sou barbeiro há 18 anos, e a experiência que estou tendo a partir de ​02/08/2021 é muito positiva. Já usei as lâminas Super Barba, Lord, Lamix, Wilkson, Bic, e Feather, respectivamente, em ordem de afiação e qualidade. Mas nenhuma dessas chega a qualidade da Lâmina de barbear Astra. A Lâmina Astra corta macio igual manteiga. Corte muito leve. Estou 100% satisfeito.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "marion ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 5, 2024",
                "reviewTitle": "Plus rien à prouver 👍",
                "reviewText": "Très bonnes lames que j’ai eu dans les premiers échantillons de test sérieux. Je fais du rasage féminin, seules les parties intimes ne sont pas assez bien coupées au raz selon moi mais j’ai conscience d’en demander beaucoup. Je viens donc (c’est ballot 😱😱😱zuteuuu) de prendre un ensemble de rasage de plus. Sur le rasoir le plus secure je vais lui enfiler des feathers et ce sera réglé 😈😈si c’est vraiment mieux que les Bolzano ça doit faire pleurer d’émotion 🤧je garde Astra vertes pour les jambes et aisselles. Convient parfaitement d’autant plus avec un bon savon traditionnel monté en mousse au blaireau. De belles choses à faire pour ne plus se charcuter et en prime, une peau magnifique et élastique.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.64",
                "sellerName": "PF Global Shop",
                "sellerRating": "5"
            },
            {
                "price": "$8.64",
                "sellerName": "Razor Blades Club.",
                "sellerRating": "5"
            },
            {
                "price": "$8.64",
                "sellerName": "SBNKOCA LLC",
                "sellerRating": "5"
            }
        ]
    }
}