{
    "remaining_requests": 22967,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Premium-Safety-Razor-Model-LP1822L/dp/B004N77JVY",
    "body": {
        "name": "Premium Safety Razor Model LP1822L aka L6",
        "price": "$6.42$6.42 ($6.42$6.42 / count) $6.10$6.10 ($6.10$6.10 / count)",
        "originalPrice": "",
        "rawPrice": 6.42,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Premium-Safety-Razor-Model-LP1822L/dp/B004N77JVY",
        "soldBy": {
            "sellerID": "AJ0EALKQF5AF4",
            "name": "Cosmic Marketplace",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AJ0EALKQF5AF4&asin=B004N77JVY&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07W6768V3"
        ],
        "asinVariationValues": [
            {
                "asin": "B004N77JVY",
                "variationName": "Color",
                "variationValue": "As shown in the image",
                "price": "$6.43",
                "variationImageURL": "https://m.media-amazon.com/images/I/51croCC7yPL._SS36_.jpg"
            },
            {
                "asin": "B07FN8CX9Q",
                "variationName": "Color",
                "variationValue": "S 625-1",
                "price": "$6.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41N7nc3C1ML._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51croCC7yPL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: LORD",
            "link": "https://www.amazon.com/LORD/b/ref=bl_dp_s_web_6153188011?ie=UTF8&node=6153188011&field-lbr_brands_browse-bin=LORD"
        },
        "brand": "LORD",
        "merchantInfo": "Cosmic Marketplace",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 975,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 17 hrs 29 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "3-Piece model that unscrews and allows to put blade inside",
            "Very Gentle to shave with, reducing razor burn and irritation",
            "Longer handle which benefits those with bigger hands",
            "Chrome Plated head & Aluminium handle. 4.33 inch (110 mm) Long, Weight 1.7 oz. (48gr)",
            "High quality Genuine LORD razor"
        ],
        "description": "Lord Premium Safety Razor Model LP1822L Merkur like Head This Razor offers the ultimate in double edged affordability and lightweight construction. Comes with 1 LORD Platinum Blade Authentic LORD Razor made in Egypt by LORD Company. 4.33 inch (110 mm) Long, Weight 1.7 oz. (48gr) 2011 Production Brand new model.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b?ie=UTF8&node=3778591"
            },
            {
                "name": "Men's",
                "link": "https://www.amazon.com/Mens-Shaving-Hair-Removal-Products/b?ie=UTF8&node=13271079011"
            },
            {
                "name": "Razors & Blades",
                "link": "https://www.amazon.com/Mens-Shaving-Razors-Blades/b?ie=UTF8&node=13271080011"
            },
            {
                "name": "Safety Razors",
                "link": "https://www.amazon.com/Mens-Safety-Shaving-Razors/b?ie=UTF8&node=13271088011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 4.8 x 2.8 x 0.5 inches; 1.76 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ LRDDBLRZR"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 885469921086"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ LORD RAZORS"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B004N77JVY"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#72,308 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #53 in Men's Safety Shaving Razors"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 975 ratings"
            },
            {
                "name": "Brand",
                "value": "LORD RAZORS"
            },
            {
                "name": "Number of Blades",
                "value": "1"
            },
            {
                "name": "Unit Count",
                "value": "1 count"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Handle Material",
                "value": "Aluminium"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SRT7777777",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPP6QOIA3YHKF5IRUJO5R4TAGFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11Y5Z4N1O1KAI?ASIN=B004N77JVY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent For The Price",
                "reviewText": "I've been using DE razors now for about five years so I'm not a beginner. I shave both my face and head just about daily. I got this razor specifically for those rare occasions I shave in the shower and I wanted something cheap and lighter in weight for that purpose. This is a medium weight no-frills, simple razor. I paired it with what I already knew were good blades for me in other razors, namely Shark and Asco Stainless Steel blades. All three pairings have given me good results. The handle on this sticks to me hand surprisingly well when my hand is wet. Overall I'm very happy with the quality and performance of this razor. I'd say it's pretty mild, probably a 3-4 with 1 being super mild and 10 being super aggressive. I wouldn't want this as my only razor but it works well for my specific purpose with a good close shave with minimal irritation. For $7 you can't beat this razor.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3I4SISLD3GBHFYTA3TLY2573DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O2X706KECLBX?ASIN=B004N77JVY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2011",
                "reviewTitle": "5.0 out of 5 stars Great value for the money, a very nice razor.",
                "reviewText": "I bought my husband a Merkur for Valentine's day, 2011. He loved it so much that I bought myself one of that same model. The craftsmanship and beauty of the Merkur won me over not to mention the exceptional reviews given to the particular Merkur razors that I ended up going with. The only thing I didn't like about the Merkur was the price. The particular model Merkur I selected cost around $32 back in February. However when I purchased mine in July it had gone up to around $36 or so. Fast forward to making Christmas plans when I decided that we were enjoying the comfort of wet shaving so much that I would put together a wet shave kit for the sensitive-skinned guys on my shopping list. Feeling the pinch of the tight economy and hoping that the Merkur model I was so fond of had dropped back down in price I hopped online to Amazon only to discover that now the same model razor was going for around $42 each. No way, I thought so I went in search of a good quality, economical razor. I had completely overlooked and not even noticed the Lord before. For the price I assumed it must be a piece of junk and so I went on in search of a high quality razor even if a bit pricey. Even though the Lord was enjoying several good reviews here on Amazon I was still afraid of getting what I paid for if I went cheap. After reading everything on Amazon written about the L6 Lord though I thought it was at least worth researching a bit more. After browsing a few different wet shaving sites I decided to put my question to the wet shaving, double edge blade loving crowd at Badger & Blade. What I received back in answer to my question were many very honest opinions regarding the Lord. Firstly, the guys who responded insisted that I get the Merkur-type head of the L6 and not the tech head available on what I believe is the previous model (the L5 I think?). Overall, everything they said sounded like this was one really good performance razor that while lacking in the craftmanship and beauty as compared to a Merkur, was still nice looking. I'd like to think of it as comparing a Mercedes Benz to a Honda. I needed four shave kits and needed a good quality, nice looking razor that would look great in a shave kit, perform extremely well, and cost enough to allow room in my budget to add soaps, dishes, badger brushes, razors etc... So I took the plunge and bought four. After tucking them away in my \"Christmas storage space\" I pulled them out a week or so ago. My husband and I decided to pull them out of the packaging (which looked cheap anyway and had obviously bad grammar printed on the back - I'm no grammar snob but this was pretty obvious). We placed each razor in it's little decorative box to create the shave kit along with the other goodies. I have to say that I agree with the boys at Badger & Blade. The razor is heavy but not nearly as heavy as the Merkur (actually I think it's better and the Merkur is too heavy). It has a nice weighted balance and a nice overall feel to it - it doesn't feel cheap at all. It isn't tacky in the least. In fact it looks awfully good (just don't hold it next to the Merkur or it does look fairly plain). My husband and I even ran the head of the Lord against our palms to get a feel and both admitted that if it wasn't exactly the same as the Merkur it was close to it. No, the craftsmanship isn't there the way it is in the Merkur. In a few of the razors the head isn't perfectly aligned just right, the decorative pattern on the handle feels like it's going to give you a \"paper cut\" if you slide it through your hand too fast, and it may have a few nicks here and there. But, despite all of that it's truly a great razor. It has character, it feels balanced and friendly in your hand, and it promises to deliver a great shave which I have no doubt it will. For me it was very simple - either find an affordable razor or find some other gift to give. I've bought four and well, although I don't regret buying the two Merkur razors, they are great but for the money I do honestly believe the Lord L6s will turn out just as well (although not as pretty).P.S. I'm going to try my best to remember to come back and update after the gift giving to see how the guys like their razors and how well they shave.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael R Stairs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDQ72A43CCFIIBMHIYONBTGKUXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HPN6E9D8IOAQ?ASIN=B004N77JVY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "4.0 out of 5 stars Solid razor",
                "reviewText": "A nice razor at a good price. Shaves well, a little rough around the edges; but all and all a good razor.I like the long handle and solid metal parts.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Not your avg. Bobby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3DENMUUHVCSPH6KGBXNWSKZPWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7LPM62ACR4QR?ASIN=B004N77JVY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2014",
                "reviewTitle": "5.0 out of 5 stars Great razor for starting out!",
                "reviewText": "I fit in the category wanting to try double edge razors so I'm not wanting to break the bank and then not like it. I used to shave with a double edge when I was about 14 or 15 but that was just when I had peach fuzz. There was really no need to shave then because when I dried off after a shower if I just rubbed my face hard enough it probably would have come off anyway. Now that my nickname is Chewy or Yeti its a different ballgame. So I read through all the reviews both good and bad and I became incredibly nervous of such wide difference of opinion. My rating should tell you I really like this razor, but if you need more details let me clear a few things up.1. This is a 10 dollar razor! That's it. I'm one for deals as well but I am very well aware of cost of materials vs price margin. There ain't no body out there making 30 – 50 dollar razors and selling them for 10 bucks. The head has bad chrome and the handle is some sort of very poor aluminum. It holds your blade that's it! I too have notice the blade not being even and then I took it apart and turn the bar opposite and BAM! Blade was straight. Even the more expensive razors only line up one way. Its just there's an arrow on them to indicate how to line it up. You're saving 20-40 bucks not having that arrow.2. I too scraped the crap out of my face...the first time. Guess what I realized I was flexing my wrist and pressing WAY too hard. All the mistakes I make with a disposable razor because disposable razors are designed for people that don't want to take the time and/or can't shave anyway. So guess what practice like I did. You may even need to practice form with your disposable razor. This morning people asked me if I gave up the DE razor fad. No I have skills now. I can now shave with now redness and minimal nicks.3. I didn't just change technique I realized the soap I was using was total crap and the lather would go away mid way through my shave. Also, I bought shaving oil. Many experience shavers will scoff at shaving oil but I'm not experienced. I bet they would ask for shaving oil if they let me shave them. If we were pro's right out the gate when shaving with this kind of razor would we have 5 blade razors today or would we still be at 2 or 3? Just do what your face needs you to do.4. Another problem people may have with this razor is it not cutting close and they are taking too many passes for their face to handle. I have been doing some research and not all DE razors are the same. And it has nothing to do with prices, although, price does bring more options. There are mild and more aggressive razors even with in the closed and open comb razors. This one is mild. This gets me pretty close with 2 passes but I think 2 passes is all I can handle. So guess what that means. IF IT HURTS STOP! I too will be up grading to a better quality razor and trying a more aggressive when I feel I have the technique down. But I will be able to make use of it when I get it.So take this review for what it is and others for what they are. I feel this is a great razor for the price and will get your foot in the door. Everyone's face is different and this razor might give you the best shave right when you open it. I hope I have helped you with the ability to spot some reviews with someone who can't shave, don't want to admit they have to start at the bottom like everyone else, or it must be they ripped their face off with a cheap razor instead of ripping it off with a 50 – 100 dollar razor. I guess if you have money you have skills too.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesse E.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4COTOKWLFWS2NBQAPXZKWWVAUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W1K3YU71ZLEB?ASIN=B004N77JVY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice and cheap!",
                "reviewText": "This was an add on to make an order worth clicking. Nothing more. Surprised to say it gave a GREAT shave! The five box of blades is worth the price!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFN2UC2AAWJPGSDKIZDHTWBVWIKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YD4KUP1LZNLJ?ASIN=B004N77JVY",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "1.0 out of 5 stars Blade would not center and handle threads stripped.",
                "reviewText": "I was very excited to try this razor(L6), I loved the feel of the heavy head with the light aluminum handle. I could not get the blade to center on the head. One side was mild and one side was overly aggressive. After a few shaves I noticed the head was not staying tight. I could see that the top two threads on the handle were stripped. This is a result of a bad design where the threads don't go all the way up the handle. Unfortunately there is a no return policy, so I am stuck with a defective razor. I would recommend looking for another razor such as the DE89 or the King C Gillette.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jordan N.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 4, 2023",
                "reviewTitle": "Great Value for money.",
                "reviewText": "I have very many safety razors in my collection, some costing upwards of 150$ and this one shaves very well considering the cost. This razor's head design is based on the venerable merkur \"type\" head. It is a no frills razor that does the job and performs well. It is quite light-weight and would serve well as a travel razor due to it being light-weight and inexpensive. If ever you loose it on a trip its not a huge big deal.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JUAN MANUEL ANAYA VAZQUEZ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 15, 2022",
                "reviewTitle": "Es una excelente maquinilla",
                "reviewText": "su relación calidad precio es genial se las recomiendo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alessandro F.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on June 10, 2023",
                "reviewTitle": "Rasoio",
                "reviewText": "Rasoio con testina gressssiva mi sembra quasi l'R41 ma closed.Il manico di diametro troppo piccolo e leggerissimo non permette un buon controllo con ovvi Red point e irritazione.Problema risolto tornendomi un nuovo manico di d12 mm x 95 mm di lunghezza in inox com peso x me ottimo .A questo prezzo il risultato eccellente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "U. F. IOAN",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 22, 2022",
                "reviewTitle": "The best safety razor for me",
                "reviewText": "Even if I own some other classic safety razors from Muehle, this one still feels better to me, easier to control, lighter in hand and precise.The angle of the blade is perfect for my tough beard and sensitive skin.Coupled with a Gillette Platinum blade, it is very effective and smooth.Well worth the otherwise very affordable price, I bough a couple just in case they will no longer be available in the future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Naplet",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Poland on February 3, 2022",
                "reviewTitle": "ŚMIEĆ",
                "reviewText": "Bardzo złe wykonanie.Żyletka układa się krzywo.NIE KUPUJ TEGO",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.42",
                "sellerName": "Razor Blades Club.",
                "sellerRating": "5"
            },
            {
                "price": "$8.98",
                "sellerName": "SafetyRazorPlace",
                "sellerRating": "5"
            }
        ]
    }
}