{
    "remaining_requests": 23017,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Rockwell-Gunmetal-Double-Edge-Adjustable-Recyclable/dp/B0779ZW9YH",
    "body": {
        "name": "ROCKWELL RAZORS 6C Gunmetal Chrome Double-Edge Safety Razor with 6 Adjustable Shave Settings and 5 Blades",
        "price": "$59.99",
        "originalPrice": "",
        "rawPrice": 59.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Rockwell-Gunmetal-Double-Edge-Adjustable-Recyclable/dp/B0779ZW9YH",
        "soldBy": {
            "sellerID": "A22IN47VD6EA13",
            "name": "RockwellRazorsUSA",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A22IN47VD6EA13&asin=B0779ZW9YH&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07CS7HGC2"
        ],
        "asinVariationValues": [
            {
                "asin": "B0779ZW9YH",
                "variationName": "Style",
                "variationValue": "",
                "price": "$59.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41-JGpoZAkL._SS36_.jpg"
            },
            {
                "asin": "B0779ZMLXJ",
                "variationName": "Style",
                "variationValue": "",
                "price": "$59.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41q-f9mAuAL._SS36_.jpg"
            },
            {
                "asin": "B0778NC6Z9",
                "variationName": "Style",
                "variationValue": "",
                "price": "$4.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31-oQq7HnIL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41-JGpoZAkL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/410p9hr0ZaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OPpuJeqkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EAqx7UIQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/416IclL3uTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51LKprelXNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41yPHTt6tcL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c232f787-b0cc-4735-a349-b5c8ce65b9d5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ba88f3e8-565d-442b-a254-928954b3ab17/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4ddd2ec8-ad26-4b82-adc1-6600864e1dee/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce189e66-7b15-44d0-ad6d-e38b7914fc1b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c626e869-42b9-4279-ac68-2894f401e4d0/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a4dc935-a393-403e-a546-06654e0cceb5/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the ROCKWELL RAZORS Store",
            "link": "https://www.amazon.com/stores/RockwellRazors/page/13C5B1F6-C8FE-4E77-A416-603307AACB19?ref_=ast_bln"
        },
        "brand": "RockwellRazors",
        "merchantInfo": "RockwellRazorsUSA",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 3039,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Made from a durable alloy in a striking chrome finish, our 6C safety razor eliminates skin irritation and ingrown hairs to deliver the best shaves you have ever experienced",
            "The 6C features our patented design that offers 6 adjustable shave settings to deliver the best shaving experience for every skin type and every shaving occasion",
            "Rockwell 6C safety razor is perfect any man or woman shaving their face, head or sensitive areas and comes with a beginner setting that makes it impossible for users to cut themselves while shaving",
            "Packaged in an elegant eco-friendly paper box containing 1 6C safety razor with 5 premium Swedish stainless steel razor blades",
            "We stand behind the craftsmanship that goes into all our razors. All of our safety razors are backed by a 100% satisfaction guarantee against manufacturing defects and damages caused during regular use"
        ],
        "description": "A fully adjustable razor for any skin type and stubble length, so you get a close, comfortable shave - every time! Never waste money on cartridges or subscription shave clubs again and make shaving something to look forward to with Rockwell's adjustable, precision-engineered optimized blade angles. Say goodbye to razor burn for good and say hello to the closest, most comfortable shave of your life.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3778591"
            },
            {
                "name": "Men's",
                "link": "https://www.amazon.com/Mens-Shaving-Hair-Removal-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13271079011"
            },
            {
                "name": "Razors & Blades",
                "link": "https://www.amazon.com/Mens-Shaving-Razors-Blades/b/ref=dp_bc_aui_C_4?ie=UTF8&node=13271080011"
            },
            {
                "name": "Disposable Razors",
                "link": "https://www.amazon.com/Mens-Disposable-Shaving-Razors/b/ref=dp_bc_aui_C_5?ie=UTF8&node=13271086011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3.94 x 1.57 x 0.98 inches; 6.4 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ RR-960576"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 628235770071"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Rockwell Razors"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0779ZW9YH"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#22,548 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #15 in Indiegogo #35 in Men's Disposable Shaving Razors #375 in Unique Beauty & Health"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 3,039 ratings"
            },
            {
                "name": "Brand",
                "value": "ROCKWELL RAZORS"
            },
            {
                "name": "Number of Blades",
                "value": "1"
            },
            {
                "name": "Unit Count",
                "value": "1.00 Count"
            },
            {
                "name": "Skin Type",
                "value": "All"
            },
            {
                "name": "Number of Items",
                "value": "1"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Rockwell Razors Stand for 2C and 6C Rockwell Razors Synthetic Bristle Shave Brush with Premium Black Acrylic Handle Rockwell Shave Cream - Barbershop Scent Description The Rockwell Inkwell Stand is an elegant solution to proudly display your Rockwell Model T, 6C, or 2C. Designed to be the last shave brush you'll ever need - this custom crafted synthetic brush features exceptionally soft bristles and a firm 20mm backbone for durable long term use. Rockwell Shave Cream uses a thoughtful, glycerin-based formulation of natural ingredients and soothing oils to prepare even the coarsest hair for a close, quality shave.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/23b8fda8-16ab-45a7-8434-aecce61c1f83.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/81b339bf-0759-4822-9104-0809d4e2aa22.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fc86175a-0d32-4e95-9f52-0d2b4843c061.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/24386047-a756-4690-a6d4-977a7b32a42a.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dd49cf09-d0a6-48b2-879e-7f67f4c31da7.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bf33eb97-03c7-4583-a8ef-cc787221e989.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/974c0281-5d88-4aeb-ac65-4cce98c64c32.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SteveInSac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGS5QC67ZG6DLCZWCVLUBKXLCX7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L9NNTKNB2U2E?ASIN=B0779ZW9YH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars This ended my search",
                "reviewText": "Short story: I've had this razor for several weeks and finally had the real test tonight shaving my head. I started out with the #1 razor for my morning shave until working up to the #3, which is about perfect for me. It's great that I can still go up a few more for even closer shaves.Close shave with no irritation and no nicks. The razor has a thick handle and good weight so it's easy to control. This was the first time shaving my head with a single blade, so it took a bit longer but no nicks. I was hesitant to spend the $$ for the Rockwell, but it's money well spent. This will last the rest of my life.Long story: I'd been a member of dollar shave club for a number of years and while I didn't like the waste and the cost, I got a decent enough shave. They up and changed their razor style which is horrible and I started looking for options. I saw an ad on Instagram for a safety razor and I was intrigued, but after buying their razor, you had to buy their proprietary single blades. That got me thinking about an old travel razor I had inherited.I've started to become pretty disillusioned with all the marketing of what amounts to disposable products. This IG advertised safety razor was selling the concept of old single blade shaving, but by buying their razor you're tied to using their blades at a buck apiece. Sure, it's better than the multi-blade razors that are expensive and filling up landfills, but with how inexpensive the double edge blades are, why did we ever stop doing it the old way?I bought the Astra blades - a pack of 100 for $8.50 - and was already way ahead of that advertised brand. The travel razor I have is vintage, but still in pretty good shape. It's small though and not much to it. I got a really nice shave with it, even though I had to endure a few nicks and abrasions until I got the hang of it. I stuck with it and it was doing the job, but I already knew I was already going down the rabbit hole.I won an auction for a vintage Gillette adjustable razor. It was just about $25, which is a decent price. I discovered that the popular vintage razors can set you back $100 or more. So, the one I bought was reasonably priced, but as it turned out there was no setting I could use that didn't cause at least a fair amount of abrasions or a few nicks.I was already looking at another vintage razor when I decided to research new razors. I looked into the Merkur and Muhle, but ultimately settled on the Rockwell. I didn't know just how well the interchangeable plates would work, but it's a pretty simple and effective design. As I said, the razor has a nice weight to it - most of that comes from the plates.I started with the #1 and it did a decent job, but it took a few passes to get a close shave. The #2 was better. The #3 though has been the sweet spot for my daily shave, but I may end up moving up to the 4 for head shaves. Again, I like the flexibility of the different plates to find the perfect setup.Overall, I'm quite happy with the Rockwell and while I was starting to get into the vintage razors and potentially collecting, I have no reason to now. Happily.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JSJS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE56CT2Y3HB33EGN4766ZNR66DIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JR86BJ5D468R?ASIN=B0779ZW9YH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2019",
                "reviewTitle": "5.0 out of 5 stars A 15 week review of the Rockwell 6C adjustable razor.",
                "reviewText": "Unboxing: The razor is nicely packaged in a sturdy cardboard box with a plastic molded insert to hold the razor parts along with a two sided instruction sheet explaining how to use the adjustable bases. Despite not being stainless steel like its sibling 6S model, the 6C is still impressive and hefty due to being made of solid Zamak metal parts. Don’t let the use of Zamak turn you off this razor, the finish is quality and I doubt I’ll ever use the included lifetime warranty. My scale reports it weighs in at a respectable 97.4 grams (almost double the weight of my G Slim Adjustable). The finish is perfect, I could find no flaws in the finish on the handle, cap or the included bases.The razor not only looks nice, but feels great in my hand. The handle has just enough knurling in the grip to provide traction for wet fingers while not biting into your fingers. The handle length of 85mm / 3.35in is, in my opinion, neither too long nor too short which keeps it nimble when shaving. The side of the base-plate you face outward during assembly will determine the razor’s blade gap. While there are only three bases included, each side of the base-plate is designed to provide a different gap setting. The Base-plates are paired as follows: (R1/R3), (R2/R4), (R5/R6) - with R1 being the least aggressive, and R6 being the most aggressive blade settings. The razor's cap (top of the razor that secures the DE blade in place once attached to the handle) uses a post type system to secure the DE blades - there is no wobble or play anywhere in the razor once assembled.The Shave:My prior razor weighed only 58.5 grams, so I had developed a habit over 30+ years of applying some pressure while shaving. I had to quickly unlearn that habit as the natural heft of the 6C is all that is needed. I was immediately impressed by how easily the entire assembly glided across my face - absolutely zero drag/friction from the cap was experienced. The base plate design also includes three generous channels on each side that allow the shaved slurry of soap and hair to easily exit the gap space between the blade and base plate. A quick pass under the faucet removes any remaining remnants of shaving. Once dialed in with the right base-plate for your face, it's very smooth sailing with this razor!Base-Plate Selection Process:During my initial research, I had incorrectly assumed that the R6 base would probably be the only one I used since all the blade gap data I could find online indicated it was a bit less of a gap (aka less aggressive) than my Slim Adjustable on the “7” setting. In fact, I was actually worried it would not be aggressive enough to remove the barbed wire I call facial hair and that I’d ultimately regret my purchase. I also vaguely remember reading somewhere on one of the shaving forums not to go by just the blade gap for comparisons - and after months of use I completely agree. I found that both the R6 and R5 bases resulted in nicks and weepers despite having less gap than my Slim on the higher settings. I also re-confirmed this result by using the R5 base-plate again after using the razor for a couple of months to eliminate that my early technique was the cause of my weepers. The second attempt with the R5 base produced similar outcomes, although admittedly not as many nicks. It would appear that the blade gap alone is not the complete story on this design. Ultimately, I have found that for me, the R4 base resulted in a very consistent and forgiving BBS shave when using the three pass method (with, cross and against grain). Un-rushed, with the R4 base I get no weepers, and only occasionally experience any skin scrapes/irritation when the aftershave was applied. I can also get the same with the R3 plate and shave much faster, but I typically have to do a few spot clean ups if I go down to that base-plate.I really encourage anyone who purchases this razor to go ahead and start with the R1 base and then progress to the next base only after completing a full 3 pass shave. When you hit that base that causes weepers and discomfort, go back down and you’ve probably found your sweet spot. After you have been shaving with this for several weeks, check again and adjust up & down at least one more time to be sure you’re still on the right one. Keep in mind the goal isn’t to see who can survive the most aggressive razor, but rather which setting results in a great shave with minimal discomfort/damage to your face.Conclusion: IMO, this was money well spent! I have absolutely ZERO complaints about this razor, how it performed once dialed in, or the quality of the product. I did invest into three minor accessories that were not included. A good storage case (I’m not a fan of storing things in a cardboard box near wet areas), a blade cover, and a razor stand to keep it handy and neatly stored out of the way when not in use. I agree with Rockwell’s decision to not bundle them in and raise the cost as not everyone wants these things. Thankfully, they are all available either through Rockwell or a third party, I was able to purchase the matching gunmetal grey base from Rockwell via Amazon, the razor leather protective sleeve from a 3rd party since Rockwell didn’t have theirs available on Amazon (*Hint hint), and I purchased a 3rd party Large storage tin on another site for small vendors that functions as both a storage place for the unused bases and it will also work as a travel case for my razor the next time I hit the road <- Something I do wish Rockwell produced.While this will not replace my straight razor, I do find myself using it in rotation with it and much prefer using this Razor over my straight to shave my neck. Self-shaving your own neck with a straight razor is.... exciting...Unless I find something better (I'm considering also picking up the 6S), this razor will also be my trusty fall back when I get old enough that my hands betray me and can no longer use a straight razor. If you were on the fence about trying a DE razor - this is a great choice that will spoil you due to the adjustable bases (which MOST DE razors do not have). If you’re an old DE veteran like me (G Slim Adjustable on “7” for decades), you also won't be disappointed. If you’re frugal, and spending two times the cost of this razor for the Rockwell 6S is out of the question - you'll be happy knowing you got the same build (different metal) at half the price.Update 23 Nov 2020 - The Year of Covid19 and unemployment – In just a few months it will have been two years since I purchased the Rockwell 6c (back in March 2019), and I can still say with confidence it was a great purchase that I would do again if I somehow lost my current 6S. Since using a straight razor requires a lot more prep time, I’ve found in the last year I use the Rockwell 6S for at least four out of five shaves these days. It still works just a well as it did on day one, and I’m still very impressed with the design details like the generous exit channels in the base plates. I have swapped out the base plate on that rare occasion where I have switched to a different Mfg DE Blade if it was nicking or just not cutting close enough, but had I stayed with one brand – that would not have been necessary. I’m just glad it included so many plates so I could still use the blades once dialed in again.",
                "reviewVotes": "98 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61OMplidsiL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/713+BBbtBzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71MC-EhlzXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81+3hZ-b-lL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luke B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG37KTZVR77I7AA6ECAMOLJN3ZTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q319OPBHAZRU?ASIN=B0779ZW9YH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing Razor",
                "reviewText": "I have used a Merkur 34c ever since I got into wet shaving many years ago. Its a great razor so I was kinda hesitant to try the Rockwell 6c. After much back and forth I decided to shell out the $60 and get it. I got the gunmetal version. It arrived quickly and the moment I opened it, I knew I made a great choice. It looks very nice and the gunmetal is attractive. When i picked it up in my hand I fell in love. Its nice and balanced and has a nice weight to it. I was hoping it would not let me down when i shaved with it. I paired it with a gillette silver blue blade on the #3 plate. I had a short stubble so i figured the #3 plate would be a good place to start. First pass using the #3 plate and i was amazed. It shaves very nicely and so smooth. I flipped the plate to the #1 plate for a 2nd and 3rd pass and WOW, a very nice bbs shave. I want to try the other plates so i will try it with different levels of beard growth. I also want to try it with different blades, I use Astra blades, Silver Blue's, and Perma Sharp blades so I can definitely give it a really good test. I have no doubts that it will hold up to the test. I honestly think i may have found my new go to razor. I highly recommend it",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BrookBrook",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIHK2UD4QHNXIQQT3DIZ3DB2ZIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D7FIE281TFN8?ASIN=B0779ZW9YH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Functional and Completely Recyclable",
                "reviewText": "I am on my second Rockwell Blade Bank. Instead of continuing to fill up landfills with disposable razor blades, I decided to go with a safety razor. They use old school double edge stainless steel blades. The blades cost very little compared to disposable blades and give a better shave. Everything from the razor to the blades can be recycled. Using a metal blade bank, like the Rockwell, you drop your used blades in the bank to keep them safe and secure from cutting anything or anyone. When the bank is full, you drop the entire bank and the contained blades into recycling. The Rockwell Blade Bank is stylishly designed and functional. I like the style over the competitors.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ZqjX-jTHL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ruben P",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 28, 2023",
                "reviewTitle": "Hasta ahora parece la opción más versátil",
                "reviewText": "No lo he probado con gran variedad de navajas aún pero ha sido muy efectivo y el hecho de que tenga distintos niveles lo hace versátil ya sea para un rasurado que permita hacerlo diario sin irritación a uno muy efectivo, actualizare más adelante pero los materiales se ven bastante bien, no he tenido cuidado especial con el más que lo normal y ha mantenido su aspecto y funcionalidad.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jairo Barragan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 25, 2023",
                "reviewTitle": "Poco ajuste entre el 1 y 6",
                "reviewText": "Está hecha para principiantes, en el plato 6 apenas y llega a un 3 de la merkur future, en agresividad del 1 al 10 le doy 5, pero para iniciarse es muy segura, muy difícilmente te cortaría",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul Y",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 12, 2023",
                "reviewTitle": "Should have bought one years ago",
                "reviewText": "Yesterday I had the best shave of my life!I've had my eye on this razor for a couple of years, but I owned other razors like the Merkur 34C, Edwin Jagger DE89, a Parker 99R butterfly... and I thought it would be a waste of money to buy another razor. How many razors does a man need? Well, the Merkur 34C handle broke off the head (simply from twisting it on too firmly - did not drop it) and I never warmed up to the Parker (allowed way to much blade flex and \"skipping\"), so I was down to just the Jagger. I liked the Jagger, but never loved it. I got decent shaves but invariably had minor razor burn and/or weepers. It wasn't a big deal, but I wasn't eager to shave, and so only did so every few days. This confused me, because the DE89 is considered a very mild razor.So yes, it was time to try something new. I decided that I wanted something adjustable because I had a theory that maybe a mild razor wasn't the best choice for me. Rather than buy an aggressive razor and possibly regret it, adjustable was the obvious choice and I already had my eye on the Rockwell, so... cha-ching... Amazon.For the initial shaves I went with the #2 and #3 plates. I would say the #3 is pretty close to the Edwin Jagger DE89 regarding aggressiveness. The shave quality/comfort is a bit better though. With the #2, I could easily shave carelessly and have zero burn, but not a very close shave, either. Various blades were used, but I won't get into the weeds on that topic.The perfect shave: So yesterday I decided to bring things up a notch - the #4 plate, with 2 days growth. I loaded a new Shark DE blade with the #4. Showered, applied Proraso green pre-shave cream, lathered up some Proraso green soap and then proceeded, using almost zero pressure because I was intimidated by the more aggressive plate. First pass, WTG, AMAZING! Smooth as silk! Second pass, ATG, AMAZING! No razor burn, extremely close shave, BBS, one extremely minor weeper that stopped with cold water. Even my neck, which typically gets pretty irritated, felt fantastic. Finished up with Proraso green after shave and I was grinning from ear to ear.My only regret is that I didn't buy this razor first, years ago when I switched from cartridges to DE.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOHNSON JOSEPH",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 25, 2024",
                "reviewTitle": "Super Razor",
                "reviewText": "I like it ,super razor",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JC ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 23, 2021",
                "reviewTitle": "Excelente opción",
                "reviewText": "Una excelente opción para resguardar las navajas utilizadas, además tiene un diseño que se ve elegante.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}