{
    "remaining_requests": 23072,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Weishi-Nostalgic-Handle-Butterfly-Double/dp/B00PKHIDRA",
    "body": {
        "name": "WEISHI Safety Razor Double Edge Nostalgic Long Handle Butterfly Open Razor",
        "price": "$15.66",
        "originalPrice": "$23.55",
        "rawPrice": 15.66,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Weishi-Nostalgic-Handle-Butterfly-Double/dp/B00PKHIDRA",
        "soldBy": {
            "sellerID": "ANCPZX9WCZ0P0",
            "name": "WEISHI Shaving",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ANCPZX9WCZ0P0&asin=B00PKHIDRA&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BZH9HDB2"
        ],
        "asinVariationValues": [
            {
                "asin": "B00PKGXZ24",
                "variationName": "Style",
                "variationValue": "",
                "price": "$15.66",
                "variationImageURL": "https://m.media-amazon.com/images/I/41LFNkwBPBL._SS36_.jpg"
            },
            {
                "asin": "B001D4Z87W",
                "variationName": "Style",
                "variationValue": "",
                "price": "$12.66",
                "variationImageURL": "https://m.media-amazon.com/images/I/41T1+shi8sL._SS36_.jpg"
            },
            {
                "asin": "B00PKHIDRA",
                "variationName": "Style",
                "variationValue": "",
                "price": "$15.66",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Bkaz5YP4L._SS36_.jpg"
            },
            {
                "asin": "B07L4FY6T4",
                "variationName": "Style",
                "variationValue": "",
                "price": "$17.66",
                "variationImageURL": "https://m.media-amazon.com/images/I/41LOnGQ6j-L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418R4-UhJhL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/519CZ8 nk6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417tE8A FRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31w-pAWe2CL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JNgqGx1dS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419Fh7NYL3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71rA5O9fIkL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/315d457f-dee9-4630-a4b4-1b36e6511035/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1c41f0ef-0cd9-4282-893d-b66c155f7733/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a3d7e8f2-9146-46d9-a089-bd7728a29cb0/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fd1516b2-ce7c-4616-bd54-2f84287a9baf/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2d47e802-5d27-47c5-a807-7f9eebecb1ff/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 5,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the WEISHI Store",
            "link": "https://www.amazon.com/stores/WEISHI/page/79EC301A-CE1B-44E0-AAFE-0CB1BE75F37C?ref_=ast_bln"
        },
        "brand": "WEISHI",
        "merchantInfo": "WEISHI Shaving",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 13923,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 1 hr 16 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "WEISHI Double Edge Safety razor is for those who enjoy a smooth and clean shave. Easy to use, this razor will help you achieve your perfect look.",
            "Easy to replace blades: to your convenience, twist the knob (at the bottom of the razor handle) to open the blade chamber, then replace the razor blade. Use your favorite standard double edge blade in WEISHI.",
            "Perfectly balanced to fit in anyone's hand (length: 4.3 in/11cm), excellent grip and perfect weight to use (weights 2.61oz/74g).",
            "Here are four keys to a successful shave. Use as little pressure as possible. Let the weight of the razor do the work for you. Hold razor by the tip of the handle. Angle the blade at a 45 degrees angle. Shave with the grain of your beard.",
            "WEISHI collection of both classics and fashion. If for any reason you are not satisfied, feel free to contact us."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3778591"
            },
            {
                "name": "Men's",
                "link": "https://www.amazon.com/Mens-Shaving-Hair-Removal-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13271079011"
            },
            {
                "name": "Razors & Blades",
                "link": "https://www.amazon.com/Mens-Shaving-Razors-Blades/b/ref=dp_bc_aui_C_4?ie=UTF8&node=13271080011"
            },
            {
                "name": "Safety Razors",
                "link": "https://www.amazon.com/Mens-Safety-Shaving-Razors/b/ref=dp_bc_aui_C_5?ie=UTF8&node=13271088011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 4.33 x 1.57 x 0.98 inches; 2.54 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 9306CL-5ym"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 799443649555 799443649036 764560811406"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ WEISHI"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00PKHIDRA"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ China"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,214 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #5 in Men's Safety Shaving Razors #33 in Life Hacks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 13,923 ratings"
            },
            {
                "name": "Brand",
                "value": "WEISHI"
            },
            {
                "name": "Number of Blades",
                "value": "5"
            },
            {
                "name": "Unit Count",
                "value": "1 Count"
            },
            {
                "name": "Special Feature",
                "value": "reusable"
            },
            {
                "name": "Skin Type",
                "value": "Normal"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Be strict in work,meticulously attentive WEISHI BUTTERFLY OPEN MECHANISM PROVIDE QUICKLY CHANGE BLADES Twist the knob located at the bottom of the razor handle to open the blade chamber until the doors are completely open. It's convenient for you to replace the razor blades. Excellent grip feeling which fits in hands of all the persons and perfect weight to use. \"Shaving with safety razors is unlike shaving with cartridge razors. It may take you a few shaves to get used to it, but once you do I'm sure you'll love it.\" WEISHI collection of both classics and fashion. Thank you for choosing us.",
                "media_link": []
            },
            {
                "media_text": "How often need to change blades? First, use your favourite blade in WEISHI and enjoy a smooth shave. Once you're not getting the shave you desire, it may be time you change your blade. That has little to do with the razor and more to do with the blades you use, and your skin, etc. Has any ladies used this? Ladies, it's a bit of a learning curve because you really have to take your time and make sure to contour to the curves in your legs/underarms. WEISHI safety razor is a non aggressive shaver and it would enable to reach everyplace that needs shaving what is it made of? The main components are made of heavy brass.",
                "media_link": []
            },
            {
                "media_text": "It will be like your eternal friend Let's enjoy shaving,fun on WEISHI. Prepare skin and hair with a thick, moisturizing shaving cream, gel or lotion. Allow it to remain on your face and hair for a few minutes to soften the hair. This will also allow the moisturizing agents to protect your skin.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/366a3c1f-20d1-413c-8eea-a710be4bbc4b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Compare with similar items Nostalgic Add to Cart Nostalgic Chrome Add to Cart Elegant Rainbow Add to Cart Adjustable Chrome See Details Adjustable Black Add to Cart Customer Reviews 4.5 out of 5 stars 13,923 4.5 out of 5 stars 13,923 4.5 out of 5 stars 13,923 4.2 out of 5 stars 819 4.2 out of 5 stars 819 Price $15.66$15.66 $15.66$15.66 $17.66$17.66 — $25.55$25.55 Twist to open ✔ ✔ ✔ ✔ ✔ Adjustable ✘ ✘ ✘ ✔ ✔ Weight 2.61oz/74g 2.61oz/74g 3.10oz/88g 3.90oz/110g 3.90oz/110g Plating/Coated Premium durable Durable Chrome Premium multicolored Durable Chrome Durable Matte black Height 11cm 11cm 11.4cm 11.4cm 11.4cm",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/366a3c1f-20d1-413c-8eea-a710be4bbc4b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/891a813e-fd5c-475c-ba75-7d9fd84733f7.__CR0,0,2527,2843_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c8b7b413-8326-4fe4-aeb5-67f2f0bc36ac.__CR0,0,2411,2712_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02f35ce0-3ecd-464e-af35-c1f0499f0d44.__CR0,0,2578,2900_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/74a18351-2099-45ce-b246-01af09b7b51a.__CR0,0,1566,1762_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9870766d-68ef-45c0-8246-c7f6bbf1e811.__CR0,0,2434,2738_PT0_SX200_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Megan CMegan C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXGZN7MZ3PTWNW6OCZNXGFIKMHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I1R0C5VWX7ML?ASIN=B00PKHIDRA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2020",
                "reviewTitle": "5.0 out of 5 stars THIS IS LONG – DE RAZOR OVERVIEW /3 HANDLE COMPARISONS/4 BLADE COMPARISONS - REVIEW",
                "reviewText": "LADIES AND GENTLEMEN –IN REGARD TO DE RAZOR SHAVING IN GENERALI love seeing all the helpful reviews as it is absolutely a tidbit intimidating starting out. Women, I think, get a bit more worried as we have so much more real estate and curvy areas (for the guys who also shave all the bits, this is for you too, of course). HOWEVER, it would seem that many women only shave a few (or couple??) times a week (finding this out in my early 20’s, blew my mind) and I only found one review in all my reading that was written by someone who like me…absolutely abhors body hair. I shave every day, and have done so since I started shaving at 12 or something thereabouts. Now, it is important to keep in mind that everyone’s bodies are different. Skin types and…how your skin sits against your body, vary. For reference, I am 5’2 and 99.6 lbs with an athletic build. When I watched videos showing how women safely shaved their armpits I was confused because their skin laid flat with their arms upraised. I have a very deep indent when my arm raises, many angular points, so I had to figure out my own tactics. Shaving my calves was also a tiny learning curve because of grazing against the muscle line and not having a pivoting head. I would also NOT describe myself as having sensitive skin. I keep reading about people switching their blades every few shaves!? I used Schick men’s razors until I was probably 20 then switched to Harry’s. I replaced my blades every two months or so. Considering the cost as well as wanting something I could easily toss in my hiking pack or keep in a go-bag. (Yes, I will shave if on an extended hike (+4 days)) provided I find a water source). So, I wanted to write the review for the folks like me out there, and provide what answers I can.In short, maintain a 45 degree angle (like you have probably always done), do not press down, let the weight of the handle do the work, use short and slow gentle strokes when starting out (I absolutely am back to doing long strokes on my legs now that I am confident *not cocky*), watch some videos, pay attention to the curves of your body as well as to how your hair grows, never slide the blade horizontally, don’t slide your finger along the sharp part because..duh. The handle is literally made to protect you; it is not just the blade against your skin as there is a guard. When installing the blade, hold it by the dull sides (again, common sense but still), and be mindful.Now, I am pretty much recommending this to EVERYONE. However, please keep in mind that you do need to be mindful. If you are one of those people (ladies and fellas both) who can be an airhead (you know who you are, and there is nothing wrong with your quirk) then this is perhaps not for you. Like any instrument that can pose a risk, take care. I turned off the shower my first few times while shaving and used shaving cream so I could pay close attention. By week -2- I was shaving as I always have and am getting quicker. The only nick I really got was from a compression mark from socks and the blade (feather) bumbling over it in my first week. Besides that, it has just been a matter of being mindful. Brand new and aged blades can also require some more focus.Don’t be afraid to give it a shot, be mindful and take time for yourself. Enjoy!IN REGARD TO HANDLES I love my Weishi handle. I have now had the opportunity to test this against two other handles and I am staying firm. MY ONLY COMPLAINT is that the attractive anodized coating has come off the head of my razor in entirety and looks less snazzy which is just a bit disappointing. If Weishi reads this and wants to comment, I would be interested as to why this happened. Before my Weishi, my husband allowed me to use his Merkur 34C handle to see if I really wanted to make the switch and I definitely prefer my Weishi. The Merkur Handle has a classic vertical lines design on the handle and a classic spin top. The longer handle on the Weishi Handle is fantastic, and it is far grippier. IN FACT, SUBSTANTIALLY MORE GRIPPY. This matters greatly as some of those artistic and classical looking razors are aesthetically pleasing but I rather not risk a slip and wound myself for no reason. The longer Weishi handle is great for getting the correct balance while doing my legs and not applying too much pressure. In lieu of my switch my husband tested the Shaving Revolution Handle. It is both longer and heavier than the Weishi. While I enjoyed the added weight I found that the even longer handle made me wary when doing sensitive areas and was concerned about bumping the end of the handle, causing an incident. The head is almost identical to the weishi and I liked it, I just prefer more of a paring knife for delicate work than a longer chef blade. The Weishi handle is a perfect length balance between the classic short handle and the very long handle of the Shaving Revolution. This is purely personal though, my husband loves it.IN REGARD TO BLADESAs stated above we all have different skin. Please be careful as I have seen people have all sorts of different responses to different blades. Don’t be afraid to get a sample pack, it is cheap. Also, as stated above, I was used to being cheap and making my blades last what is probably a questionable amount of time…I learned the uncomfortable way that this does not fly with DE blades. I went two weeks and was getting nicked. Dubious, I went to my husband who proceeded to be somewhat mortified and tell me that I need to change my blade every week. My skin was grateful for the correction…I doubt there will be many of you who shave as much as I do, but to translate, change your blade every 5 to 7 uses at most apparently…haha. In the last month I have tested the Weishi Blades, Shaving Revolution Blades, FeatherLite Blades, and Derby Blades. My first blade was the FeatherLite which are renowned for being sharp. This was maybe not the best place to start but it was fine. Maybe that is why I got the nick over the compression sock dent? I will say my husband had an unpleasant time using this blade on his face, and even my tough skin got a bit dry in a few spots. He shaved half of his face with the Featherlite and half with a Derby. The difference was significant. It looked deeply uncomfortable at the very least. I mean, really uncomfortable. Poor guy. We both loathed the Shaving Revolution Blades, they felt weak and dull. The Weishi Blades were a step up from the Shaving Revolution Blades and probably a safe place to start but nothing to rave about. Again though, I think Weishi chose a safe start so I understand. Now, the Derby Blades were an experiment that my husband ordered as they are supposed to be a bit thicker and sturdier. We both love these. The other side of his face was gorgeous and unblemished. I am able to be far quicker with these blades as they feel more firm. I LOVE my Derby Blades and will probably stick with them for life. Go experiment; just always use a bit of caution with a new blade.Good luck, and happy shaving",
                "reviewVotes": "110 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81EGXDATCVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81a-wsuEjuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81zE5CkMqrL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Larry Jr.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF5CNLPVQKKVE23LVA55VT2L6DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z4QJHSXILAA8?ASIN=B00PKHIDRA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Good quality razor",
                "reviewText": "This is a great razor. I got the long handle version and it is a must for my big hands. I would have liked a thicker handle for better control, but it does well enough as-is. It takes some practice to get it right when moving from other forms of shaving; personally, I was shaving WAY too fast coming from the refillable safety razor side. If you're having trouble, visit a barber and have them show you how to properly prep and shave. Sometime, adjusting the angle, speed, etc. can make all the difference.I've seen some comments regarding how to determine which side was used or how often the blade should be changed. Obviously if you have a rough shave, it's probably time to replace. But some wisdom from my grandfather: draw a line down the center of your face (or body, if you're using it for other parts) and every time you cross the line flip the razor. You'll get roughly the same wear on both sides. Pop in a new blade as needed, for me 1-2 times per week.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GovtCheese",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHL3IFEPPPCE4COIWPUZXEEWKQPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LPDUZ7LUNUPK?ASIN=B00PKHIDRA",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2023",
                "reviewTitle": "4.0 out of 5 stars Good Budget Razor",
                "reviewText": "This is my first DE safety razor, so it took me some time (about a month) to hone my technique and not nic the skin and or cause irritation. Once I learned to lock my wrist with each pass, results greatly improved.I like the weight and handle grip of the razor. Blade alignment can be a bit of an issue, so be sure that it's all even Stevens before you make the final twist to cinch it down. I found that the quality of the blade is the biggest determining factor for the razor, so be sure to get a blade variety pack and experiment to find a blade that best suits you.Of course, angle is everything with this razor so if you don't have that part figured out, then no blade will save you from yourself.Looking to upgrade now, but overall this is a good entry level razor.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Curious Reviewer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPVKJ737JFGP7V5Z4EZU4CDAQBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ATZHG367ORIW?ASIN=B00PKHIDRA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars A Perfect Shave Every Time! Wife Approved",
                "reviewText": "I recently purchased the WEISHI Safety Razor Double Edge Nostalgic Long Handle Butterfly Open Razor, and I have to say, it's been a game-changer in our household! My wife and I both use it, and we couldn't be happier with the results.Design:The nostalgic long handle design not only looks classy but also provides excellent control during shaving. The butterfly open mechanism makes blade replacement a breeze – no more fumbling with tiny parts.Quality:The build quality of the WEISHI Safety Razor is top-notch. It feels sturdy in hand, and the chrome finish gives it a sleek and durable look. We've been using it for a while now, and there's no sign of wear or rust.Versatility:What surprised me the most is how versatile this razor is. Despite being designed for men, my wife finds it perfect for her shaving routine. I've even borrowed it a couple of times, and it performs exceptionally well for a close and clean shave.Overall, we highly recommend the WEISHI Safety Razor to anyone looking for a reliable and effective shaving tool. It has become a staple in our daily routine, and we couldn't be happier with the results. Happy shaving!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 13, 2024",
                "reviewTitle": "Worth the money.",
                "reviewText": "Work as intended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Carbonelli",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 6, 2021",
                "reviewTitle": "¡¡¡Excelente producto, precio, calidad... solo aquí!!!",
                "reviewText": "Sin duda un gran regalo para brindar y compartir con alguien más, excelente 👌 , es justo lo que esperaba. Y lo mejor los materiales y la precisión con la que está hecho, para rendir por muchos años 😃😃😃😃, ¡¡¡soy feliz!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "StephanieStephanie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 28, 2020",
                "reviewTitle": "Beautiful Tool That Perfectly Suits My Needs",
                "reviewText": "Received this beautiful razor yesterday and it actually surpassed my expectations. The pictures in the listing really didn’t do it justice! It feels solid in hand, has a great handle length for use in the shower and it kept the blade steadily in place resulting in an easy, smooth shave. I used an Astra Superior Premium Platinum blade and was very happy with the result. I’m very pleased to be able to kick the expensive and wasteful plastic cartridge razor habit with the bonus of having such a beautiful tool that is so easy to use. I really hope it stands the test of time. Being my first DE razor I have no idea how it compares to any of the others out there, but if it continues to perform this well, I likely won’t ever feel the need to shell out the cash for anything more expensive.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Y4t-X1rCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Om0ff4WvL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71dE9cds-iL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zZDL9CTyL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura Chavez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 30, 2020",
                "reviewTitle": "Buen producto",
                "reviewText": "Es una excelente opción para depilar sin estar comprando rastrillos de plástico, no hay mayor dificultad en hacerlo con esto, cumple su función muy bien, y el color está hermoso",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Solomon Thomas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on March 4, 2020",
                "reviewTitle": "Great razor - could be cheaper.",
                "reviewText": "Not a very aggressive razor and gives clean shave in two passes. Has a nice even balance and the long handle is comfortable to hold. It takes a.few.shaves to get used to the weight if you are moving from.a.cartridge shaving system. The finish and fit is top notch and comparable to Parker and Mercur for a.fraction of the price. I use a Wilkinson's sword feather blade and it lasts 4 to 5 shaves easily. I felt the pricing was.a.bit high as similar product was available for far lesser on another chinese product portal. Must buy if you enjoy wet shaving.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}