{
    "remaining_requests": 22856,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Razor-Rolling-Thunder-Motorcycle-Club-ebook/dp/B09PYS9M36",
    "body": {
        "name": "Razor: A motorcycle club kinky M/m Daddy shifter romance (Rolling Thunder Motorcycle Club Book 11)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Razor-Rolling-Thunder-Motorcycle-Club-ebook/dp/B09PYS9M36",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81otn8cXtOL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Candace Blevins",
            "link": "https://www.amazon.com/Candace-Blevins/e/B004GOQJ5Q/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 209,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Razor moved from the Memphis RTMC chapter to Chattanooga to set up and manage a series of laundromats, because the local chapter needs more ways to legitimize their illegal income. He’s gay, but the Chattanooga chapter has accepted gay couples into their social circle, so he hopes they can accept him.Matty is about to graduate college, and he’s in the market for a Daddy. He walks into the RTMC bar with three of his girlfriends, and a huge hulk of a man rescues him from some rednecks. He recognizes the bouncer for the leather daddy he is, and sparks fly between them.Most of the MC is prepared to accept Razor as a gay brother, but they know they’ll have to figure things out as they happen once Razor is serious about someone. Will his ‘boy’ be an ol’lady? And can all the ol’lady rules really apply to a man?Razor is a raven, Matty is human. The RTMC fits into the local supernatural hierarchy in a myriad of ways, but a supernatural storm is about to blindside the club, and their personal ties to The Dragon King and Master Vampire won’t be enough to help.Warning: Male-male sexual practices are front and center in this book, not to mention it’s kinky as your grandmother’s old phone cord. Razor and Matty are heavy on the D/s, the S&M, and the B&D.Since some reviewers have been surprised by this, it seems necessary to also warn that sometimes bikers solve problems with their fists, and there’s lots of sexy fun in the clubhouse with women who hang around because they want to be there, and who can leave anytime they want. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09PYS9M36"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Kaleidowords Publishing; 2nd edition (January 6, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 6, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1049 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 362 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#260,557 in Kindle Store (See Top 100 in Kindle Store) #6,173 in Paranormal Werewolves & Shifters Romance #7,231 in Gay Romance #7,300 in Werewolf & Shifter Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 209 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Angie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFX4EOQFMLOU242HZNCZEEYG3XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6P0POE7P9F36?ASIN=B09PYS9M36",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 2, 2018",
                "reviewTitle": "5.0 out of 5 stars Daddy Kink",
                "reviewText": "This was book 11 in the \"Rolling Thunder Motorcycle Club\" We first met Razor in \"Leashed\" when Abbott invite him over to play with his boy Spencer. Razor is new to Chattanooga he is from the Memphis chapter he is here to help the MC set up laundromats to so the club can legitimize their illegal income. While working in the bar he meets 23 year old Matty who is looking for a daddy, but the club doesn't know that Razor is gay. Razor who is a Raven shifter comes out to the club although he has had a*al sex and gotten head from the club girls not everyone in the club is happy about him being gay and when he starts bring Matty around all of the guys accept him but one. Matty is considered to be one of the ol'ladies and he gets along great with the others although he did have a problem with Cam when they first meet although I thought his reason was childish they are both graphic designers Matty is also an interior designer he also races motor bikes professional. The sex scenes in this book were very hot Razor and Matty had a lot of chemistry. I also liked Matty's best friend Micca she really had his back. When the club goes on a run and they have a crash where Harmony is hurt Matty finds out about shapeshifters and that Razor is a Raven Brain changed Harmony so she would live. I really liked reading this book and this series. While out with the ol'ladies on a girls night out one of the guys fell to protect a few of the women and Matty he put the club in a situation that they didn't handle right in the beginning also the women refuse to come to the club although Matty and the ladies held there own against the guys messing with them. If you haven't read about I recommend that you read his book he is truly a cruel sadist vampire. I really want to read more about Isaac and what kind of shifter he is. I was glad that Bud and Nickie was in this book and the fact that they have an in house slave Beau and they played with Razor and Matty. This was a really good book one of my favorites in this series. This book was well written like the rest of the books with no errors in grammar or spelling. I am looking forward to reading the next book and I hope that Ms. Blevins writes about the guy that caused the trouble.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JMcJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIP7QOQLB3UXMDWGHRF4NJVUYXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22WWY5XADFTSW?ASIN=B09PYS9M36",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 27, 2018",
                "reviewTitle": "4.0 out of 5 stars Good book. A little too much telling/vs showing and time skipping",
                "reviewText": "I love MC books but I'm not always a fan of supernatural characters. I almost skipped this, especially since it's part of a very intertwined universe that looks like it covers over 20 interconnected books.But, M/M, MC, BDSM.. kinda had to do it. And, I was very engrossed and glad I jumped into this world. I liked Razor and I liked Matty. I liked how they meshed and communicated. I liked that they had unrelated careers and lives but still made it work. The bdsm was very kinky but wasn't really very titillating. As a voyeur it seemed more about endurance than connection too often. The book also skipped and time hopped a lot. This book spans over a 1.5 years and I suspect we overlap with some of the stories in other books but I can't be positive of that.I found I liked many of the other prior characters. I'm sure their stories would be just as well written if I was going to invest that much time into the whole world. I don't think I have the patience for that but I did go get the book for Abbott and Spencer. I'm interested to learn more about Abbott and I'm tempted to go find out about Duke and Gen as well",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bibliowyrm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEACJVHENLPQCEXHDXAY7JDNCN2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31D1BV41KJVPG?ASIN=B09PYS9M36",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 17, 2018",
                "reviewTitle": "5.0 out of 5 stars Just when you thought the series was winding down . . . BOOM! No winding down here!",
                "reviewText": "This book! Oh my goodness, so much going on in addition to the relationship between Razor and Matty.First, the relationship. Matty and Razor meet when Matty is injured while at the bar Razor where was working. Matty is a twink, just like Razor likes. Matty wants a Daddy and Razor fits the bill but is temporarily in the closet due to having recently moved to the area. It doesn't take long for them to find each other again and realize that they are a great fit for each other. The negotiations between them are done several times as their relationship progresses, with enough detail given to show how it changes but not so much that the reader is overwhelmed. When those inevitable blips in their relationship happen, they deal with them in believable ways that show progression in healthy ways.Second, the MC and supernatural world. Matty is human and has no idea, in the beginning, that Razor is involved in anything except the MC. As Matty and Razor get closer, trust builds between them so that when bad things happen and Matty finds out about the supernatural world around him, it is not the end of their relationship. It takes some adjustment for them but it works out. The nature of the MC is more of a hindrance for Matty, for a couple of reasons. I won't spoil with the reasons but they are doozies! I wasn't sure how they were going to overcome these issues and stay together.Third, the secondary ongoing characters from other stories. Oh my, Candace Blevins can twist me up with these continuing glimpses of characters and couples from prior books! One of my least favorite characters from all the books is a major side character here and I still don't like this character. The story was so good, though, that I was rooting for things to work out for this character so Matty would be happy.I liked the small glimpse we have of what a Daddy/boy relationship could look like and hope to see these two in future books in a thriving relationship still. Plus, I would love to see the house Matty designed for the two of them!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 26, 2020",
                "reviewTitle": "Not for me",
                "reviewText": "While I can appreciate sadists and massocists, this book was not for me. I liked the story line and while I felt the punishments were way over the top, I made it through until 72% and then I just couldn’t ready anymore. Way too intense for me",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}