{
    "remaining_requests": 22890,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Multipurpose-Exfoliating-Dermaplaning-Trimming-Precision/dp/B07TSBBQLZ",
    "body": {
        "name": "1Eyebrow Razor, 60 Pcs Multipurpose Exfoliating Dermaplaning Tool Trimming and Shaving Grooming For Face and Eyebrow Shaper For Women and Man With Precision Cover,3 Colors 1",
        "price": "$8.99$8.99",
        "originalPrice": "",
        "rawPrice": 8.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Multipurpose-Exfoliating-Dermaplaning-Trimming-Precision/dp/B07TSBBQLZ",
        "soldBy": {
            "sellerID": "A2Y7JFEX0J6L8R",
            "name": "DK0988 US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2Y7JFEX0J6L8R&asin=B07TSBBQLZ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ls IF-9PL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31YbqOHYxaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BfXmsuvhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/313PPii58XL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nl9-rMkrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417RRvYZQBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31L33OFYgXL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Mroobest",
            "link": "https://www.amazon.com/Mroobest/b/ref=bl_dp_s_web_19822274011?ie=UTF8&node=19822274011&field-lbr_brands_browse-bin=Mroobest"
        },
        "brand": "Mroobest",
        "merchantInfo": "DK0988 US",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 9929,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 10 hrs",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest pickup Friday, February 16. Order within 21 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Packaging: eyebrow+razor, 60 pieces eyebrow shaver, 3 bright colors, blue, pink, yellow, 20/color, help remove eyebrows, neck and face fine hair and other unnecessary hair. Carry with you 60 pieces of portable razor, provide you with decoration anytime, anywhere, suitable for your own use, and share with your friends and family.",
            "High quality: dermaplaning tool, stainless steel blade + ABS resin + protective cover, sharp and not easy to rust, smooth and delicate feel, safe and convenient operation. This facial shaver is made of precisely designed stainless steel blade, with lasting sharpness, stainless steel blade, easy to use and shape your eyebrows. The cutting edge of eyebrow blade is designed with areola surface, sharp but mild, and not easy to hurt the skin.",
            "Safety in use: eyebrow shaper safety cover acts as both brow comb and razor groove type safety protection device - to protect delicate skin and prolong blade life. Each face. razor is equipped with a precise protective cover to protect the blade when it is not working. eyebrow razor is expected to be used for a long time. Even beginners can use it easily and safely.",
            "Give you the perfect experience: eyebrow shaver can gently and painlessly remove excess hair, very suitable for trimming eyebrows and facial beard. It's easier than pulling, waxing or threading, and reduces pain and redness. It is very suitable for removing any part of the face and other fine hair. You can also trim the bikini area to make you confident. Helps remove fine hair from your eyebrows or face, making you look more beautiful and attractive",
            "Face shavers family travel is essential: eyebrow makeup shaver is your cosmetic kit must be light, compact, portable, can be placed anywhere you want, such as bedroom, bathroom, toilet, cosmetic bag, hotel, warm tips: Do not let children touch. The blade is sharp. Please cover it when not in use."
        ],
        "description": "Packaging includes: 60 Pcs stainless steel eyebrow shaver -20 x blue eyebrow shavers -20 x pink eyebrow shavers -20 x yellow eyebrow shavers Shaver length: 14.7 cm/5.78 inches Blade length: 3.6 cm/1.4 inches Manufacturing Design: Stainless steel blade + ABS resin + protective cover, sharp, not easy to rust, smooth and delicate feel, safe and convenient operation. Lightweight and non-slip grip, easy to control, suitable for precise trimming of eyebrows, facial hair, easy to use and storage. Multifunctional facial shaver: Not only eyebrow shaver, it can also be used for lip, neck and face fine hair and other unnecessary hair. Removing excess hair gently and painlessly is healthier than other methods. Family travel is essential. Lightweight, compact and portable, you can put it anywhere you want, such as bedroom, bathroom, toilet, cosmetic bag, hotel, etc. Reminder: -Our eyebrows are sharp. Please use them carefully. -Hold the small razor on the 45 degree eyebrow and gently slide down. Please don't press hard. -Before use, please apply moisturizing cream or water to moisturize the skin. After use, please clean the blade carefully and dry it for preservation. -Keep out of reach of children. -The blade is sharp. Please cover it when not in use. face razors for women, eyebrow razors for women, face dermaplaning tool, eyebrow razors for women face, womens face razor, face shavers for women, razor eyebrow, razors for women eyebrow, womens facial razors",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3778591"
            },
            {
                "name": "Men's",
                "link": "https://www.amazon.com/Mens-Shaving-Hair-Removal-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13271079011"
            },
            {
                "name": "Eyebrow Trimmers",
                "link": "https://www.amazon.com/Eyebrow-Hair-Trimmers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7706129011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 6.5 x 6.89 x 1.38 inches; 11.64 Ounces"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 725766538092"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Mooerca"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07TSBBQLZ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,641 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #21 in Eyebrow Hair Trimmers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 9,929 ratings"
            },
            {
                "name": "Brand",
                "value": "Mroobest"
            },
            {
                "name": "Unit Count",
                "value": "60.0 Count"
            },
            {
                "name": "Special Feature",
                "value": "Portable"
            },
            {
                "name": "Skin Type",
                "value": "Dry"
            },
            {
                "name": "Number of Items",
                "value": "3"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "In my opinion ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2LPR3JC5PF6MGNHKGKUP52EO2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE4IPJZEI4JO6?ASIN=B07TSBBQLZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice",
                "reviewText": "Super easy to use",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPAWHD5H3IPUKZ4GSF6FPI46TQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QEYZWMQXIYCU?ASIN=B07TSBBQLZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Good face and eyebrow razors",
                "reviewText": "This is a good set of 60 eyebrow and facial razors and shapers that you can use to trim your beard or shape your eyebrows.The blades are sharp and easy to hold and a set of 60 would last probably six months or longer in my home.Good set at a good price.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shawn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFYF6BBKU5PMSKTKN7FMF26R5NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FO9C9CHBCC55?ASIN=B07TSBBQLZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Great purchase",
                "reviewText": "I would buy these at my grocery store for double the price for three. I will definitely re-purchase when needed.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5H2ABT3VMC5TIZRDL7WZYB7JPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3N8N15O5OF2E6?ASIN=B07TSBBQLZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "4.0 out of 5 stars Good considering the price",
                "reviewText": "I use these type of razors for my eyebrows and face and they are good considering the price and how many you receive. I used others that work way better but are more in price so if you’re looking for some that do the job then these are for you but they aren’t 10/10 sharpness. They get the job done",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alycia Neddo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYKJAMC4MWYQG3TNXULST56FDLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D867IKFBW3K6?ASIN=B07TSBBQLZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Love these!",
                "reviewText": "The media could not be loaded. The amount you get for this price is amazing. I use these for microblading and for cleaning up my eyebrows. They’re so easy to use and I just throw it away after. Easy for traveling and storing",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/064e5995-1cc0-4c9b-8f1c-64419d04faa7/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJU74LLU3MC5M2XRO5CX74UP72Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AQJYL9TASVY5?ASIN=B07TSBBQLZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing for a first-timer!",
                "reviewText": "Over 50 and derma planing at home for first time. A friend recommended these and after watching many youtube videos on \"How to\", I gave these a try yesterday.. It has been over a year since I had an aesthetician derma plane my face, so I was a little skeptical and scared, but oh how gratifying! My face and neck feel SO much better! Not to mention, I don't see all of the peach fuzz in the sunlight! Exceptional value for the money. Don't wait like I did, give them a try!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachael Shrock",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4OXNOMN7SSEEN2AZ54HLZLGSVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBLXYCYAPYAQ2?ASIN=B07TSBBQLZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 4, 2023",
                "reviewTitle": "5.0 out of 5 stars So many for so little!",
                "reviewText": "my family loves these. They come in a huge pack at a great price. If you use these, this is the perfect pack! It seems silly to buy a three pack for almost the same price. I keep them everywhere. I even use them for other things, since the blades work great. Opening packages and mail lol. The quality does not lack. I highly recommend these!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JustlilOmeJustlilOme",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOP52T56SETA42BDCGCL7Z27CDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OP2B1JU09II6?ASIN=B07TSBBQLZ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2022",
                "reviewTitle": "3.0 out of 5 stars Blade not even and sharp like higher priced items",
                "reviewText": "Having bought just about every brand of these type razors (dermaplaning works!) - I decided to try the cheap \"eyebrow razors\" based on price and reviews. I use these mainly like a razor on my face, not just for eyebrows, as the name of this product implies.The blade of this product is not good as Tinkles. The reviews that show poor quality for these are spot on. That said, as you can see from the pictures, the product has its merits (obviously not a professional photographer here!). The cost of these products shown in the picture goes up from left (the current product review) to the most expensive of the three (Japonesque) - based on what I paid for them. If you are a first timer for derma planing - maybe try a high quality product first before going cheap? - that is my opinion.Reviews really help me decide on products and that is why I am taking time to write this review: to possibly help others who may be on the fence about these cheap razors.My opinion is Japonesque is the best quality and they can be purchased on Amazon. I find Tinkles, also on Amazon at fair prices, to be of good enough quality, lower price, and, like Japonesque, they can be used a few times. This is a once a week hygiene practice for me so it is really worth it to go with higher quality. That said, I provide some potential pros for these cheap razors below.The pictures show the used products of all 3, new product packaging for Tinkles, and the \"bulk cheaper razors\" . The cheapest one could not be used more than once as the blade deflected after one use - this is not visible in the photo. It caused scratches on my face. As the product description on Amazon states clearly - do not press hard on your face! However, I need to press just hard enough to exfoliate and trim \"peach fuzz\" on my face.Some reviews complain these cheap razors arrived with finger prints on them, and I did not find that to be the case - just cheaper plastic scratches from the razors scraping against each other - likely because they come in bulk packaging. IMHO these cheap blades could be used for crafting projects - especially since they have that protective cover - How can the company make a profit selling these at 17cents per blade?! It really is inexpensive, if you can use them.Another plug for the cheapest razors: If you believe the dermabrasion caused by these blades might stimulate collagen (versus scarring) and do not mind the nicks that come from the poor blade quality, then these blades might be a deal for you.I am on the fence about returning them, based on price alone - otherwise, for dermaplaning, I will go back to using Tinkle based on the quality/price ratio and \"splurge\" on Japonesque when there is a sale (they feel great in my hand and are just the right weight and size). Both products really work well for me - what can I say? - I am a bargain hunter at heart.Hope this was helpful:).",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41wA8hrHUsL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51AzoEMyolL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51zFwhXBjpL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Muy bien producto...",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 8, 2023",
                "reviewTitle": "👌",
                "reviewText": "Buen producto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Molly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on May 29, 2020",
                "reviewTitle": "Works Well",
                "reviewText": "Shaves well. Arrived on time",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "laura stroud",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 14, 2021",
                "reviewTitle": "dony buy they dont work and scratch and make u bleed",
                "reviewText": "waste of money and dangerous",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}