{
    "remaining_requests": 22981,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Preserve-Refillable-Recycled-Materials-Assorted/dp/B019Y366KQ",
    "body": {
        "name": "Preserve Shave 5 Five Blade Refillable Razor, Made from Recycled Materials, Assorted Colors: Coral/Neptune/Key Lime (Color May Vary)",
        "price": "$9.62$9.62",
        "originalPrice": "$12.99",
        "rawPrice": 9.62,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Preserve-Refillable-Recycled-Materials-Assorted/dp/B019Y366KQ",
        "soldBy": {
            "sellerID": "A2IG93052XZBJ0",
            "name": "We've Got You covered",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2IG93052XZBJ0&asin=B019Y366KQ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "6",
        "stockDetail": "Only 6 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41wQeJ2p5cL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31ICWbslcbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41IrvotP8BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XGIpa-8gL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31zqDfnCJXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zxELXgMsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/616c 6NDlRL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/765ce92e-9a3b-4f51-aeb6-e3aca1567bd5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/d1f66e7f-aec4-5310-a88f-885ef0120127/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Preserve Store",
            "link": "https://www.amazon.com/stores/Preserve/page/29559901-F65B-4B30-B028-44E49448DADA?ref_=ast_bln"
        },
        "brand": "Preserve",
        "merchantInfo": "Callie Products",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 396,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Sunday, February 18. Order within 6 hrs 47 mins",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest Same-Day pickup Today 2 PM - 6 PM. Order within 5 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Ergonomic handle is designed for all uses and is made from recycled materials",
            "The 5 blade cartridge features ceramic coated blades for improved comfort and a lubricating strip with cocoa butter and aloe",
            "Set includes one razor blade cartridge and one razor blade handle, replacement \"Shave 5\" cartridges are sold separately (type B019Y3686I into Amazon search bar for Shave 5 replacement blades)",
            "For use by both men and women",
            "Blades and >90% of handle made in USA; cartridge assembled in Mexico, never tested on animals"
        ],
        "description": "Preserve's \"Shave 5\" is a next generation razor that is beautifully designed to offer an extraordinary shave while being gentle on the environment. Preserve \"Shave 5\" Five Blade Razor features 5 ceramic coated blades in a cartridge that moves easily over both contours and angles, all at the end of an ergonomically designed recycled plastic handle. Preserve \"Shave 5\" is designed to offer an exceptional shave for both men and women. The comfortable handle will not only accommodate, but work well and feel good with the various grips used by shavers of all stripes. The handle is made from recycled materials, and is recyclable with Preserve's Gimme 5 recycling program after use. The 5 blade cartridge features ceramic coated blades for improved comfort and a lubricating strip with cocoa butter and aloe. The blades and >90% of handle are made in USA; the blade cartridges are assembled in Mexico. Included in this set is one razor handle and one blade cartridge. Preserve Shave 5 blade cartridge replacement blades are sold separately (type the Amazon item number: \"B019Y3686I\" into Amazon search bar for Shave 5 replacement blades)",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3778591"
            },
            {
                "name": "Women's",
                "link": "https://www.amazon.com/Womens-Shaving-Hair-Removal-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13269990011"
            },
            {
                "name": "Razors & Blades",
                "link": "https://www.amazon.com/Womens-Shaving-Razors-Blades/b/ref=dp_bc_aui_C_4?ie=UTF8&node=13269991011"
            },
            {
                "name": "Cartridge Razors",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=23595315011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.75 x 1 x 5.75 inches; 1.6 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 273913"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 631740050514"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Recycline, Inc."
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B019Y366KQ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#304,511 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #85 in Women's Cartridge Razors"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 396 ratings"
            },
            {
                "name": "Brand",
                "value": "Preserve"
            },
            {
                "name": "Number of Blades",
                "value": "5"
            },
            {
                "name": "Unit Count",
                "value": "1 Count"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Handle Material",
                "value": "Plastic"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TXAggieMomma",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUQT5ONELE2JMRR2QQJYB5KSP4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL3XA8FKLVD22?ASIN=B019Y366KQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 16, 2017",
                "reviewTitle": "5.0 out of 5 stars Itchy after shaving? Hallelujah THIS blade is NICKLE FREE!!",
                "reviewText": "I would have done ANYTHING to have known this nickel-free razor was out there. I have a severe nickel allergy that I had never considered to be a culprit of the problems I have had for YEARS with shaving. I absolutely have never been able to shave my legs without scratching them raw from the itch that I experience the hours following a shave. I'm talking years of itching, ingrown hairs, and discomfort. I even ditched shaving and switched to waxing for the relief. But waxing can be an expensive pain. Once I realized that the blade itself on most razors is often made of nickel or nickel plated, i started to research. Preserve razors were the only ones that popped up consistently in reviews and searches for nickel-free blades. Y'all! It's like the heavens opened up and the angles handed me this razor because they were tired of me having half hairy legs (I'm a mom of 3, waxing is the last thing on my priority list!). I LOVE shaving my legs now. I never thought I'd say that in my entire life! I've used it consistently for a month now and NO ITCHING! I'm so grateful to the makers of this razor! <3",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raptor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSBEENROKCVNTSKI33Q7SPXAZ6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QBTWR5AXMA2D?ASIN=B019Y366KQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 20, 2021",
                "reviewTitle": "5.0 out of 5 stars Literally CHANGED MY LIFE",
                "reviewText": "If you have problems with overly itchy legs after shaving, bumps or redness etc. or if you’ve ever had problems with wearing fake earrings.. you might be insensitive to nickel like I am.And lemme tell you, I came from itching SO bad after shaving to the point I would have giant open wounds on my legs. I tried this razor and I have 0 itchiness, it’s a literal miracle for me. I can -finally- shave my legs like a normal person!!!Seriously, if you’re even thinking about it just try it when you can! I will never EVER look back!!!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kelly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXDBCOGCLX6CVQBB3ALOU7LXY3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27HPEEFDUB0PN?ASIN=B019Y366KQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2019",
                "reviewTitle": "5.0 out of 5 stars If you have a nickel allergy, buy these!",
                "reviewText": "My world was changed when I found these razors. I have a severe nickel allergy, and somehow never thought about razors having nickel in the blades (which most razors do). But not these! After nearly 20 years struggling with very irritated skin after shaving, and trying everything to remedy the issue, I was told about these razors and I fell in LOVE! I can now shave anywhere with no irritation at all. The fact that they are inexpensive is just a bonus. I do wish they were more widely available in retail settings, but for now I will keep ordering them online for as long as they are manufactured. And I pretty much tell everyone with nickel allergies or sensitive skin about these amazing razors.Note: Definitely get the 5 blade system, it is much sturdier than the 3 blade system and a better shave overall.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Helen C. Gonzalez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNJO33K3YVQLHH2N4FF5L3JZ6SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LD3CRL9NPXIJ?ASIN=B019Y366KQ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 20, 2018",
                "reviewTitle": "3.0 out of 5 stars Eco-Friendliness a bit misleading, so-so shave",
                "reviewText": "I switched to this razor hoping to be a bit more \"green\" and reduce my personal waste but unfortunately, this product is not as eco-friendly as I had hoped. The only thing made from recycled material is the handle. The blades themselves are not made from recycled material nor are they recyclable through normal municipal programs and preserve does not offer a recycling program for their products. Seeing as I already had a refillable razor handle that used similar non-post consumer material, unrecyclable blades, all this purchase has done is create extra waste I could have avoided simply by sticking with the brand I was already using. On top of that, this brand's razor blades deliver a subpar shave. I have sensitive skin but despite that have never really struggled with razor burn, these blades, however, drag against the skin and make it very irritated. Even with a completely fresh blade, I broke out on my legs after one use. Forget multiple uses when they're this dull to begin with. My previous razor I could use between 4-6 shaves (underarms and legs) before it was too dull and I had to trash it so really all this \"green\" razor has done for me is create more unrecyclable waste.I was quite disappointed in this outcome as I expected more from preserve after having great success with their toothbrushes.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffany Arlyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5XBJ7IGG4Z7F7CMUE3NKKBH2SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MFO4I4OKB47A?ASIN=B019Y366KQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 3, 2019",
                "reviewTitle": "4.0 out of 5 stars Held up well so far, doesn't break easily",
                "reviewText": "I've had this one for a long time now and I'm surprised it's held up so well. There's a tiny piece that keeps coming lose, but I'm sure I could glue it down.Other than that, the handle lasts for a long time, it's easy to grip and never slips out my hands.The only downside is, the razors they provide are still not good for my skin, but they're the best I can find. My nickel allergy is so extreme, anything will make me break out, and I get ingrown hairs so badly no matter the razor.Wish it could be a bit cheaper initially, but for how long it has lasted me, I can't really complain that much. The refills I wish were cheaper since those go way faster.Otherwise, I totally recommend this product if you have sensitive skin and want to stop using name brands who put a bunch of garbage in their razors.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nora",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFXOJQDSCAIM6EYVHJBS2FRCVFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21BIO7VHK7550?ASIN=B019Y366KQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 24, 2019",
                "reviewTitle": "5.0 out of 5 stars Great eco-friendly razor!",
                "reviewText": "After going cruelty-free a number of years ago, I didn't know what to do about shaving. I learned that Preserve was not only cruelty-free, but also made of recycled materials, so I was so excited to support them! The new/fresh blades are super sharp, so my underarms were a bit irritated at first after so many years of using duller razors but that went away after the first couple uses. The razor didn't come with a protective cover, unless you count the original packaging which is definitely sturdy enough for travel, so I wouldn't be comfortable tossing it in my checked luggage (I recycled the original packaging because it was a bit bulky for my taste and I just don't need the extra clutter). I am definitely a converted customer and will be purchasing replacement blades from Preserve in the future!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jess D.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 16, 2022",
                "reviewTitle": "Yes! For the thick haired humans!",
                "reviewText": "Fiiiirst of all, it works really well. I have thick hair that is deeply structured in my DNA to genetically protect my people from the hot desert sun for another 1000 years. I've tried so many razors that just don't cut it (literally) and it's irritating beyond all measure that a woman's razor is designed for dainty butterfly peach fuzz and not the realistic closet yeti's we are. These get a close, smooth leg and other parts shave. The handle is light but it's sturdy and the blades are top notch. I've always needed to use men's razors and even then, they are expensive and have zero thought for the environment. I love the sustainability factor of this brand, that they are cruelty-free, are using recycled material, can also BE further recycled and their commitment to reshaping the identity of a razor for just plain normal hairy people. Yes, yes yes to this.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on March 23, 2022",
                "reviewTitle": "perfette per chi soffre di allergie",
                "reviewText": "ottimo per chi soffre di allergia al nickel",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leticia Cadena",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 22, 2020",
                "reviewTitle": "No son 6 piezas, llega solo 1",
                "reviewText": "Pongan mucha atención, no son 6 piezas como dice la publicación, solo llega una pieza!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cindi Dingman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2020",
                "reviewTitle": "Great option for Vegan/Cruelty-Free razor",
                "reviewText": "I bought this razor specifically because it's vegan/cruelty-free (the moisture bar) and it's made of recycled plastic. It still isn't as great as a completely zero-waste razor (in terms of waste) but I've heard too many horror stories with those to give it a try right now. This is an awesome compromise! The 5 blade one is WAY better than the 3 blade one - don't buy the 3 blade to save money - it feels WAY cheaper and doesn't give a good shave, at all. This one is great! Would definitely recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fernanda Haro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 24, 2018",
                "reviewTitle": "Info equivocada de producto",
                "reviewText": "La descripcion del producto indicaba que vienen 6 piezas y solo llego una. Deberían corregir la informacion.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.62",
                "sellerName": "Callie Products",
                "sellerRating": "5"
            },
            {
                "price": "$9.81",
                "sellerName": "Lifeline Brands",
                "sellerRating": "5"
            },
            {
                "price": "$12.99",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}