{
    "remaining_requests": 22823,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/PURA-DOR-Anti-Thinning-Clinically-Ingredients/dp/B00FH692PQ",
    "body": {
        "name": "PURA D'OR Anti-Thinning Biotin Shampoo, Clinically Tested DHT Blocker for Thickening Color Treated Hair, Herbal Scent, 16oz",
        "price": "$28.49$28.49 ($1.78$1.78 / Fl Oz) $25.49$25.49 ($1.59$1.59 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 28.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/PURA-DOR-Anti-Thinning-Clinically-Ingredients/dp/B00FH692PQ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BV3W4JXS"
        ],
        "asinVariationValues": [
            {
                "asin": "B07ZHMG8C1",
                "variationName": "Size",
                "variationValue": "8 Fl Oz (Pack of 1)",
                "price": "$19.99",
                "variationImageURL": ""
            },
            {
                "asin": "B00FH692PQ",
                "variationName": "Size",
                "variationValue": "16 Fl Oz (Pack of 1)",
                "price": "$29.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41UjxdY9L9L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/510aKmqL4GL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51GL RclxsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EaiC2fO0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xOxdSIhqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51d8nes RAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514hgjAKMJL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the PURA D'OR Store",
            "link": "https://www.amazon.com/stores/PURADOR/page/DF923BAC-6895-4743-B8A4-E1F27AEC401E?ref_=ast_bln"
        },
        "brand": "PURADOR",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 27471,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 23 hrs 37 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 23 hrs 37 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "GET TO THE ROOT OF THE PROBLEM. It all starts with a healthy scalp. This invigorating blend of natural extracts and essential nutrients fortifies and invigorates hair, reducing the appearance of hair thinning due to breakage",
            "FIGHT HAIR THINNING, NATURALLY. Powerful blend of Biotin, Pumpkin Seed, Black Cumin Seed Oil, Nettle, and other plant-based ingredients to help increase volume and thicken hair",
            "GENTLE, YET EFFECTIVE. Ultra-nourishing blend of premium oils and Plant-Based ingredients specially formulated to effectively treat damaged, and/or color-treated hair. Gentle enough for daily use",
            "SCIENCE plus NATURE. All PURA D’OR formulas combine science and nature to deliver transformative hair therapy. Select Natural Ingredients. No SLS (Sulfates). No Parabens. No Harmful Chemicals. Gluten Free. Hypo-Allergenic. Cruelty Free. Manufactured in the USA. Color Safe. Vegan"
        ],
        "description": "PURA D'OR Original Gold Label Anti-Hair Thinning Shampoo is formulated with 17 Top Rated Key Active Ingredients that promote stronger, cleaner, healthier hair. Hand selected botanical ingredients, such as Argan Oil, Red Korean Seaweed, Saw Palmetto, He Shou Wu and Nettle Extracts, add shine and help strengthen hair follicles by increasing thickness while reducing hair thinning and breakage. Our shampoo is gentle, especially for those with a sensitive scalp or even treated hair. All PURA D’OR products are cruelty-free and made without any parabens or sulfates. PURA D'OR is produced and bottled in a renewable energy source facility in Southern California.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Hair Care",
                "link": "https://www.amazon.com/Hair-Care-Products-Beauty/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11057241"
            },
            {
                "name": "Hair Loss Products",
                "link": "https://www.amazon.com/Hair-Loss-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10898755011"
            },
            {
                "name": "Hair Regrowth Treatments",
                "link": "https://www.amazon.com/Hair-Regrowth-Treatments/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11057581"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3 x 3 x 7.5 inches; 1.25 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 610"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 851615006105"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Vital's International Group"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00FH692PQ"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#539 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #1 in Hair Regrowth Shampoos #2 in Scalp Treatments #9 in Hair Regrowth Treatments"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 27,471 ratings"
            },
            {
                "name": "Brand",
                "value": "PURA D'OR"
            },
            {
                "name": "Item Form",
                "value": "Liquid"
            },
            {
                "name": "Hair Type",
                "value": "Thin"
            },
            {
                "name": "Scent",
                "value": "Herbal"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Original Gold Label Shampoo About PURA D'OR PURA D’OR is driven by desire to provide superior solutions to your toughest beauty and personal care problems. Experience nature and purity in every formula with the combination of select natural ingredients, premium oils, and our naturally-based preservative system. Manufactured in sunny Southern California, PURA D’OR is dedicated in providing products that uses renewable energy and recyclable packaging. Our Original Top Seller! Anti-Hair Thinning Shampoo (Formerly named Anti-Hair Loss Shampoo) PURA D’OR Original Gold Label Anti-Hair Thinning Shampoo is still made with the leading and exotic ingredients from different parts of the world for an effective plant-based formula. This blend is a clinically proven and tested formula known to reduce hair thinning by promoting hair strength and thickness along with increased volume and reduced breakage.* This new label to the exact same formula as the old product name Anti-Hair Loss shampoo. Now called \"Anti-Hair Thinning Shampoo\".",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f6f8c75e-4297-45ae-82fe-316c323cbac2.__CR450,0,2700,3600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d88eba1f-6ad5-4ce3-8aef-1201e92e62e4.__CR0,0,1568,784_PT0_SX350_V1___.png"
                ]
            },
            {
                "media_text": "Less Hair In Brush Less Hair In Drain Our Gold Label Anti-Hair Thinning* shampoo is clinically tested in 8 week study to reduce hair in falling and ultimately, less hair in drain* Reduce Hair Thinning and Less Hair in Brush* Clinically Tested and Proven Effective in 8 Week Study After 8 weeks of daily use, users show significantly less hair in brush, thicker and healthier hair* *Decreases thinning and promotes thickness by reducing breakage. Based on (1) repeated brushing test analyzing breakage after using PURA D'OR shampoo (and conditioner) compared to using shampoo alone and (2) users' self-evaluation of hair thickness, strength and reduced breakage compared to baseline after 8 weeks of using the PURA D'OR SYSTEM.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/1a31279a-7fea-4775-8c3d-365f4e5ac7f0.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/9a266904-2875-4138-a381-b6734c1491ec.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "We source ingredients from every corner of the globe and formulate it in a single bottle: 24 Rare & Exotic Ingredients. 17 DHT Blockers to Help Thinning Hair. Vitamins & Minerals For Healthy Hair Growth* Nettle Extract: DHT Blockers such as nettle extract helps promote healthier hairSaw Palmetto: Saw palmetto reduces hair thinning and promotes thickness*He Shou Wu: He Shou Wu improves circulation and health from scalp to tipRed Korean Seaweed: Red Korean Seaweed supports healthy hair growthArgan Oil: The superior natural hair moisturizerBlack Cumin Seed: Black cumin Seed penetrates deep to keep hair and scalp healthyAloe Vera: Aloe vera juice as a water substitute moisturizes hair all day longTea Tree: Protects hair from itchiness and scalp irritationBiotin: An essential hair nutrient that supports healthy and thicker looking hairNiacin: Plays an important role in circulating key nutrients to improve hair and scalp healthVitamin E: Locks in moisture from scalp to tip",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/b7389e62-669c-4599-a6c8-3a8f7a9304cb.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Maximum Defense Anti-Hair Thinning Hair Thinning Therapy Gold Label Anti-Hair Thinning Advanced Therapy Professional Grade Biotin 2X Concentrated Benefits Hair Thinning, increases thickness, Dandruff and scalp irritation Reduces Hair Thinning, increases thickness Reduces Hair Thinning, increases thickness Reduces Hair Thinning, increases thickness Reduces Hair Thinning, increases thickness # of Key Herbal Active Ingredients 19 15 17 17 17 Actives Concentration 1x 1x 1x 1.5x 2x Preservative system Natural, plant based Natural, plant based Natural, plant based Natural, plant based Natural, plant based Keto ✓ USDA Biobased ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/7e143cf6-7036-406b-9af5-b639898058ed.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f6f8c75e-4297-45ae-82fe-316c323cbac2.__CR450,0,2700,3600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d88eba1f-6ad5-4ce3-8aef-1201e92e62e4.__CR0,0,1568,784_PT0_SX350_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/1a31279a-7fea-4775-8c3d-365f4e5ac7f0.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/9a266904-2875-4138-a381-b6734c1491ec.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/b7389e62-669c-4599-a6c8-3a8f7a9304cb.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/55a1ad7b-ca83-4c03-9547-ae54c2b5622b.__CR750,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/7c8c77f2-053e-45d3-95c6-dc3cca82956a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f6f8c75e-4297-45ae-82fe-316c323cbac2.__CR900,0,1800,3600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/553949c5-0ad6-414e-9c15-bac5071d9e27.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/507cc303-adc0-4db1-bbc2-1e2fbab4fb79.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sally B.Sally B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRTKIPKZVBK4LQ6VTD7NE5UQUEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN1K0CA9PXHYT?ASIN=B00FH692PQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 31, 2015",
                "reviewTitle": "5.0 out of 5 stars Very Happy to Recommend this to Other Women!!!",
                "reviewText": "UPDATE: FEBRUARY 12, 2017- My Two Year PURA D'OR Anniversary. Don't think I have ever stayed with one product for so long. It still is working for me!!!QUICK REVIEW: This shampoo helped regrow my postmenopausal (plus recent hysterectomy) thinning hair. It has no silicones (silicones clog pores) but you might need a no silicone conditoner for detangling afterwards. Use it faithfully for at least 3 months. Take before and after pictures to see how your hair is progressing. Read my full story when you have time. It will tell you how the first year went. Also, I have just purchased and left a review for Pura D'OR Deep Moisturizing Conditioner, which pairs nicely with the shampoo especially of you have dry, curly, or hard to comb out hair. It also is my pick if you are used to regular shampoo and conditoner because it will gives hair more \"slip\" but does not weigh it down. If you have hair that goes flat in one day (fine and oily) then go with the regular \"blue label\" conditioner. I am very impressed with all of these products. Please email me if you have questions and please like my review if it helped you. I PAID FULL PRICE AND WAS NOT COMPENSATED FOR MY REVIEW. I have no interest or affiliation with the manufacturer or seller.MY STORY: I was skeptical when I purchased this shampoo 3 months ago. So skeptical that I took a before and after picture to see if it was working. I had pretty full hair until I became of a certain age. Slowly I could see my hair thinning, especially in the front. I went to a dermatologist who told me there was not much I could do. I wanted to tell myself that it wasn't true but I would not only find hair all over the shower but everywhere else, too. As far as me, I shampoo daily and have for many years. This shampoo has a pleasant smell (reminds me of incense) but not overpowering or lingering. You will probably need a conditioner afterwards as it appears to be very cleansing. I have colored hair and it did not strip the color. My hair now has body, much more shine and is noticeably thicker. I think you can see that by my before and after pictures. I hope you will give it a try before you give up on your hair.SIX MONTH UPDATE: After six months my hair has stayed thicker with no hair loss. I do continue to use Pura D'or Premium at least three days a weeks. I do switch off with low poo shampoo or apple cider vinegar a few times a week also. Like many women, my hair feels dryer or oiler as the seasons and weather changes. Also, even with great products sometimes switching it up is good! By the way, it pays to stick with this shampoo exclusively for at least three months. It takes time for hair to grow and to see a difference. Hope the update can help someone who is agonizing over thinning hair.Picture: I am adding two pictures (3&4) taken today 7/3/2015. I am 6 months out from first using this shampoo and about 5 months out of using the Pura D'or conditioner, which I left a review for today. Finally. As you may notice I need a touch up and also I am holding my hair back tightly like the before picture. The last one is how I normally wear my hair today. No more shortie bangs to TRY to cover the bald spot(never works!) Any questions please ask.ONE YEAR UPDATE: I placed my first order of Pura d'or Gold Label on 1/7/2015. So, I am pretty close to using it for one year. I took a few pictures today. I don't know if I really have any improvement over the last 6 months, maybe a little. Certainly, I have much improvement over my very first picture. My hair was broken off and very sparse at least an inch or two in. My scalp looked red and a bit angry. My fine front hair is definately a little longer at this point and you can't see my scalp anymore. My hair dresser said my hair was overall a bit thicker in December. This is the first time she has said that and I ask her EVERY time!! I have gotten used to using this shampoo which has no silicones and makes your hair a bit tangled before conditioning. I was so used to the slickness of silicones that I figured that this shampoo was drying out my hair. It was not. I have learned that the silicones can build up and also lead to hairloss. So it is a reason to keep using this shampoo and conditioner or at least one that is silicone free. I do recommend trying the Pura d'or Conditioner. It is very light, untangles my hair and a good match with this shampoo. I have left a review for it, if you are interested in looking at it. [...]",
                "reviewVotes": "2,316 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51EzEupp4qL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51czMvWwKSL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51gayCToe+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51w1vbvq6HL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/618mqYV5lhL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61pN3DP1IWL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debi D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIS6OG3KW43QTIXDO4KEMG2GJSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS3MQVTDSRX65?ASIN=B00FH692PQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing product!",
                "reviewText": "I received this on December 18, 2023 and immediately started using it. The smell is not bad, it reminds me of something but I can't figure out what. Anyways, I figured now is the time to do the review.My hair was thinning horribly and it was frustrating as well as embarrassing. Oh How I wish I had done a before picture!My hair feels and looks thicker, the areas of thinning seem to have disappeared. I don't think its because of hair growth, but more that my hair is fuller.I will continue using this shampoo for the remainder of my days on this earth. I have no regrets buying this and will be referring people to try this product! It's amazing!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexander",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGYTHJC7UNBSSY2646VZVRF6OAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPGPXNMC9JG35?ASIN=B00FH692PQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "4.0 out of 5 stars Natural ingredients",
                "reviewText": "I've been using PURA D'OR Anti-Thinning Biotin Shampoo, and it's been a game-changer for my hair. The natural ingredients and Biotin blend really seem to work wonders. My hair feels thicker, and I've noticed less hair loss. Definitely a go-to for healthier-looking hair!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fadi Shamaan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2UZ52SQ4HSIYYUEBYBY6R76JEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11A82OEDP1GK?ASIN=B00FH692PQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 18, 2023",
                "reviewTitle": "5.0 out of 5 stars From Thin to Thicccc!",
                "reviewText": "Oh boy, where do I even begin with the PURA D'OR Original Gold Label Anti-Thinning Biotin Shampoo? This stuff is nothing short of miraculous. As someone who has battled with thinning hair for years, I was on the hunt for a hair thickening product that actually worked. And let me tell you, this shampoo delivered in spades!Firstly, the scent is out of this world. It has this natural earthy aroma that instantly transports you to a serene forest. It's like having a mini spa treatment every time you step into the shower. I genuinely looked forward to washing my hair just to experience that delightful scent.Now, let's talk about results. The PURA D'OR shampoo is clinically tested and boy, does it live up to its claims. Within just a few weeks of use, I noticed a significant reduction in hair fall. My brush wasn't covered in strands of hair anymore, and I could run my fingers through my hair without feeling like I was losing half of it.But wait, there's more! This magical potion also thickened my hair. My once lackluster locks gained a newfound volume and bounce. It was like I had stepped out of a hair commercial every time I styled my hair. I couldn't help but catch glimpses of myself in every mirror, giving myself a cheeky wink.Even though I have color-treated hair, the PURA D'OR shampoo didn't fade or strip away the vibrancy of my dye job. My hair stayed lustrous and shiny, and the color remained intact. Talk about a win-win!Now, let's get personal. This shampoo has become a part of my daily routine, and I don't plan on ever letting it go. It's like a trusted friend who never fails to make me look and feel amazing. And the best part? People noticed. Friends, family, and even strangers couldn't help but compliment my new hair. I went from having thin hair to being the envy of everyone around me.And let me tell you, the journey to discovering PURA D'OR's Gold Label Biotin Shampoo was not an easy one. I had tried countless other hair thickening products that promised the moon and the stars but failed to deliver. My bathroom cabinet was a graveyard of half-empty bottles that did nothing but drain my wallet.But then, I stumbled upon PURA D'OR. I was intrigued by its claims of being a herbal DHT blocker, which is known to contribute to hair loss. I had read positive reviews online, but I knew I needed to try it for myself. And boy, am I glad I did!One thing that stood out to me about this shampoo is its natural ingredient list. It's packed with biotin, argan oil, and other botanical extracts that nourish and strengthen the hair follicles. I felt confident knowing that I was using a product that was not only effective but also gentle on my scalp.I must say, the results were truly mind-blowing. Not only did my hair become thicker and fuller, but it also felt healthier overall. It had a natural shine and bounce that I hadn't seen in years. I couldn't resist flipping my hair around and watching it gracefully fall back into place. It was like I had my own personal fan blowing through my locks!The effects of PURA D'OR's shampoo were not just temporary. With continued use, my hair continued to improve. It felt stronger and more resilient, and I could confidently style it in different ways without worrying about excessive breakage. My hair became my best accessory, and I found myself experimenting with new hairstyles and getting compliments left and right.Now, let's talk about the value for money. The 16-ounce bottle may seem small, but a little goes a long way. The shampoo lathers up beautifully and spreads evenly through the hair. I found that I only needed a small amount each time, so the bottle lasted me for months. That's a big win in my book!I also want to share a funny incident that happened while using PURA D'OR's Gold Label Biotin Shampoo. One morning, in a rush to get ready for work, I accidentally squeezed out way too much shampoo onto my hand. I stood there, staring at the overflowing palm full of shampoo, unsure of what to do. But hey, I figured, why not go all out?I applied the excess shampoo to my hair, creating a massive lather that could rival any bubble bath. My hair was transformed into a foamy cloud, and I couldn't help but laugh at the absurdity of it all. I must have looked like a walking shampoo commercial! But you know what? The results were amazing. My hair felt extra clean and refreshed, and the volume was out of this world. I couldn't help but strut around the house, pretending to be a shampoo model, much to the amusement of my family.But jokes aside, the PURA D'OR shampoo has truly been a game-changer for me. It has not only transformed my hair but also boosted my confidence. I no longer feel self-conscious about my thinning hair. Instead, I embrace my luscious locks with pride and carry myself with a newfound swagger.The compliments keep pouring in, and people can't help but ask me what my secret is. I happily recommend PURA D'OR to anyone who will listen. Trust me when I say, it's worth every penny.In conclusion, if you're looking for a hair thickening shampoo that actually works wonders, the PURA D'OR Original Gold Label Anti-Thinning Biotin Shampoo is your holy grail. With its incredible scent, clinically proven results, and ability to transform thin hair into a voluminous masterpiece, it's a game-changer. Don't waste any more time with other products. Get your hands on this shampoo, and get ready to turn heads wherever you go!",
                "reviewVotes": "145 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "calitrav",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSR43AFFQIB6TBAP6GFLDFPJ5DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RR6ZODPTBEKAN?ASIN=B00FH692PQ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "3.0 out of 5 stars Did they change the formula ?",
                "reviewText": "I ordered this a couple of times in 2020 and really Loved the scent(though I couldn’t see any big difference in the thickness or quality of my hair)So when I just so happened to see it was on sale the other day I ordered it again, but the smell is much stronger in a not-so-great way. I’m not certain what they changed but I believe they may have increased the amount of Tea Tree oil in it. And that’s a very potent scent I never want to smell too much of.For what it’s worth I own a large collection of colognes and make my own candles so I have a very good sense of smell — this bottle definitely smells different from my last 2.It does lather and clean the hair well though, so hopefully it’s still a good product overallI’d give my last 2 bottles a 5 Star rating, but this one gets just a 3 for now.I will adjust this review if I change my mind on this one...",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 22, 2023",
                "reviewTitle": "Excelente shampoo, boquea el DHT, funciona !",
                "reviewText": "Excelente valor por su precio, definitivamente contiene la combinacion de extractos herbales naturales que bloquean el DHT lo cual detiene el adelgazamiento y posterior caida del cabello. Tiene un olor herbal el cual a mi en lo personal no me molesta.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sargis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 27, 2023",
                "reviewTitle": "Das Natürliche für Ihre Haare",
                "reviewText": "Die Haare werden geschmeidig, glänzend und sogar die Schuppen sind verschwunden",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on July 30, 2020",
                "reviewTitle": "bon produit",
                "reviewText": "bon produit pour renforcer les cheveux et après chaque utilisation belle texture des cheveux , à recommander",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 14, 2020",
                "reviewTitle": "Buen champú",
                "reviewText": "Es un champú que deja el pelo con cuerpo, y en mi caso pelo rubio con reflejos me deja bien también el color. Ahora mismo es de mis favoritos. Pero recomiendo alternar con otro porque tiende a resecar las puntas, hay que acondicionar en melenas largas.Lo alterno con el champú de argan de art naturals que es mi champú preferido.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 4, 2017",
                "reviewTitle": "Vale il prezzo",
                "reviewText": "Fantastico funziona davvero, notata una ricrescita dei capelli non solo accelerata ma anche nuovi capelli, infoltisce e aumenta la corposità! Non testato il che è un plus non da poco per chi ci tiene e sa quanto è difficile trovare in Italia prodotti non testati!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$29.99",
                "sellerName": "Vidacora Corp",
                "sellerRating": "4.5"
            }
        ]
    }
}