{
    "remaining_requests": 22836,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/TRESemm%C3%A9-Moisturizes-Moroccan-Professional-Salon-Healthy/dp/B08BTNS4K8",
    "body": {
        "name": "TRESemmé Shampoo Smooth and Silky 3 Count Tames and Moisturizes Dry Hair With Moroccan Argan Oil For Professional Quality Salon-Healthy Look And Shine 28 oz",
        "price": "$17.01$17.01 ($0.20$0.20 / Fl Oz) $15.22$15.22 ($0.18$0.18 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 17.01,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/TRESemm%C3%A9-Moisturizes-Moroccan-Professional-Salon-Healthy/dp/B08BTNS4K8",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save an extra 20% on your first Subscribe and Save order.",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61k2BE84FiL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61lwE3jehzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61wqjN8yVFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61KOacKEXzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61OAQvqVKJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61FyjlxKivL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61UGhcWL4bL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the TRESemmé Store",
            "link": "https://www.amazon.com/stores/TRESemm%C3%A9/page/E2802A47-24C3-4CB0-AE62-A443BCECD237?ref_=ast_bln"
        },
        "brand": "TRESemmé",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 8133,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 16 hrs 54 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 16 hrs 54 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest Same-Day pickup Today 10 AM - 3 PM. Order within 9 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "FOR TOUCHABLY SOFT HAIR: TRESemmé Smooth and Silky Shampoo hair care delivers intense hydration that targets dryness and locks in moisture where your hair needs it most",
            "RESTORE MOISTURE: This gentle moisturizing shampoo is formulated with Moroccan Argan oil to help tame frizz and flyaways without weighing it down, leaving hair feeling salon-soft",
            "ADVANCED MOISTURIZING SYSTEM: Our moisturizing shampoo delivers optimized hydration that quenches dry hair and leaves it feeling silky and smooth",
            "SHAMPOO THAT DELIVERS: TRESemmé helps revive dry hair with gentle moisturizers for touchably soft hair with professional-looking shine that lasts for days",
            "MORE THAN HAIR PRODUCTS: TRESemmé is committed to advancing the next generation of female leaders by creating an intentional momentum forward",
            "PAMPER YOUR HAIR: Treat yourself to TRESemmé Smooth and Silky hair products to create beautiful styles on the go without the hefty price tag."
        ],
        "description": "Want to restore moisture lost from heat styling? Try TRESemmé Smooth and Silky to quench dry hair and tame unruly hair. TRESemmé wants you to look and feel your best, which is why the TRESemmé Smooth and Silky System delivers optimized hydration that targets dryness and locks in moisture where your hair needs it most—every day. Enriched with Moroccan Argan oil, this gentle shampoo is designed to deliver optimum hydration that targets dryness and seals in moisture. The lightweight formula means you can turn dry, damaged hair into soft, manageable strands with beautiful shine. It’s also safe for colored hair. How to use the Smooth and Silky System: Step 1: Coat hair with a liberal amount of TRESemmé Smooth and Silky Shampoo. Step 2: Gently massage the scalp and roots with fingertips to work into a lather. Step 3: Lightly squeeze the shampoo from roots to ends and rinse thoroughly. Step 4: Apply an adequate amount of Smooth and Silky Conditioner from mid-shaft to ends. Step 5: Run a wide-tooth comb or fingers from roots to ends to detangle and fully coat hair. Leave for 2-3 minutes, then rinse thoroughly. Step 6: Finish with your favorite TRESemmé styling products as desired. Are you looking for a moisturizing shampoo for damaged hair? The clear choice is TRESemmé. Use TRESemmé Shampoo with TRESemmé's salon-quality hair styling products to perfect your look. These professional, salon-quality hair care products are deep conditioning hair products for dry hair without the salon price tag. TRESemmé Smooth and Silky Shampoo and Conditioner system delivers intense hydration that calms frizz and tames pesky flyaways, all while yielding up to 7x smoother hair, vs. non-conditioning shampoo. Ever since our origin in salons, TRESemmé has been driven by a simple truth: every woman deserves to look and feel their best, and that usually starts with a good hair day.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Hair Care",
                "link": "https://www.amazon.com/Hair-Care-Products-Beauty/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11057241"
            },
            {
                "name": "Shampoo & Conditioner",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17911764011"
            },
            {
                "name": "Shampoos",
                "link": "https://www.amazon.com/Hair-Shampoo-Products/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11057651"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 8.93 x 4.99 x 9.73 inches; 0.01 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 10022400012565"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Unilever"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B08BTNS4K8"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,593 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #199 in Hair Shampoo"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 8,133 ratings"
            },
            {
                "name": "Brand",
                "value": "TRESemmé"
            },
            {
                "name": "Item Form",
                "value": "Liquid"
            },
            {
                "name": "Hair Type",
                "value": "Dry"
            },
            {
                "name": "Scent",
                "value": "Unscented"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "TRESemmé PRO Style Technology, with amino acids and ceramide, works from the inside out and leaves hair strong and manageable*. Make your hair the perfect style canvas. *with continued use.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2c61c09c-e38c-4719-9d00-0c88cd61283c.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "FRIZZ CONTROL + SILKY SMOOTHNESS Our Silky & Smooth System, with Argan OleoBlend, intensely moisturizes, taming frizz and flyaways to leave hair silky, soft and smooth. STRONG STRANDS READY FOR ANY STYLE These salon-level formulas, with Pro Style Technology, leave hair strong and effortlessly manageable so you have the perfect base to create any style. TRUSTED INGREDIENTS This collection is PETA-approved cruelty-free and has 0% parabens, mineral oil, and DMDM Hydantoin. TRESemmé brand – Listed as animal test–free by PETA's Beauty Without Bunnies program, 2022. PROFESSIONAL, SALON QUALITY EVERY TIME TRESemmé is dedicated to creating professional-quality, trend-inspired products that care for your hair and help you style it however you want. So you can do it with style.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d7053e2e-c127-420e-8342-fa3f4f642c66.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/20fd6d81-64c4-4833-baa3-68869b34df3c.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0732c84e-a8bf-4295-8c34-3e8c3f9a1dc6.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0d16b8d3-10c0-4c74-ad76-30ce155635a7.__CR0,0,220,220_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "TRESemme Silky & Smooth Conditioner, 28 oz TRESemmé Rich Moisture Shampoo, 28 oz TRESemmé Rich Moisture Conditioner, 28oz Main Benefit Tame frizz and boost your hair’s shine for 48 hours with the TRESemmé Silky & Smooth Collection. Made with Argan OleoBlend, this conditioner pairs with its shampoo to intensely moisturize, taming frizz and flyaways to leave hair silky soft and smooth Get 7x luxurious moisture with the TRESemmé Rich Moisture Collection. Made with Hyaluronic Plex, this shampoo, when paired with its conditioner, nourishes strands, leaving them feeling hydrated, soft and with a health-looking shine Looking for soft, shiny strands? The TRESemmé Rich Moisture Conditioner, with Hyaluronic Plex, pairs with its shampoo to nourish strands, leaving them feeling hydrated, soft and with a heath-looking shine.",
                "media_link": []
            },
            {
                "media_text": "TRESemmé brand – Listed as animal test–free by PETA's Beauty Without Bunnies program, 2022.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e37c1c84-9f56-402b-bddd-c625b0d8ebfa.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a3553461-3907-4f7d-a56c-c5bd4faa11ec.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2c61c09c-e38c-4719-9d00-0c88cd61283c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d7053e2e-c127-420e-8342-fa3f4f642c66.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/20fd6d81-64c4-4833-baa3-68869b34df3c.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0732c84e-a8bf-4295-8c34-3e8c3f9a1dc6.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0d16b8d3-10c0-4c74-ad76-30ce155635a7.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/78f378de-7859-4d8c-9f1b-6c20343e96ca.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a10bb831-21af-44a5-90ba-5cc0035ab98a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/296a7e59-650d-432b-a7e7-962f21439917.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e37c1c84-9f56-402b-bddd-c625b0d8ebfa.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mays' Healthy Lifestyle ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDZJ3DV3UBZ6JLSH5SXHXGWIZBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PMIADXYF4LQM?ASIN=B08BTNS4K8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Great shampoo and value for the three pack",
                "reviewText": "The media could not be loaded. TRESemmé Shampoo Smooth and Silky has become an essential part of my hair care routine. This 3-count pack offers exceptional value and delivers outstanding results. From the first use, I noticed a significant improvement in the texture and manageability of my hair.The formula of this shampoo is fantastic. It effectively cleanses my hair, removing impurities and product buildup without stripping away essential moisture. The smooth and silky effect is evident after each wash, leaving my hair feeling soft, smooth, and touchably luxurious.One of the standout features of this shampoo is its long-lasting fragrance. The delightful scent lingers in my hair throughout the day, giving me a boost of confidence and freshness.I also appreciate the convenient packaging of the 3-count pack, ensuring that I always have a backup available. The bottles are easy to handle and dispense just the right amount of product.Overall, TRESemmé Shampoo Smooth and Silky has exceeded my expectations. It delivers on its promises, leaving my hair beautifully smooth, manageable, and smelling great. If you're looking for a reliable shampoo that brings noticeable results, this is definitely worth a try.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da224735-b2e7-4ad4-b8ed-627ced408c08/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "John",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6PIPVFXVM2UIU2LKEGND4SN6GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZKY0JTVDVSUA?ASIN=B08BTNS4K8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Silky Strands Every Day: TRESemmé Smooth and Silky Shampoo – Your Secret to Luxurious Locks!",
                "reviewText": "Hair care enthusiasts, get ready to embark on a journey to silky, smooth, and absolutely fabulous hair with TRESemmé Smooth and Silky Shampoo. This shampoo is more than just a hair wash; it's a daily indulgence for your locks.The Good:Ultimate Smoothness: If you're battling dry, unruly hair, this shampoo is your secret weapon. It tames and moisturizes your hair, leaving it incredibly smooth and manageable.Moroccan Argan Oil: The secret sauce here is Moroccan Argan Oil. It's like a magic potion for your hair, providing intense nourishment, moisture, and a delightful, natural shine.Salon-Quality Feel: TRESemmé is renowned for its salon-quality products, and this shampoo is no exception. It gives your hair that 'just-stepped-out-of-the-salon' look and feel, every day.Affordability: You don't need to break the bank to enjoy luxurious, silky hair. This 3-pack offers great value for quality hair care.The Not-So-Good:Scent Sensitivity: While many love the shampoo's scent, some with sensitive noses might find it a tad strong. However, it dissipates after washing, leaving your hair smelling lovely and fresh.Sulfates: This shampoo contains sulfates, which some individuals prefer to avoid due to their potential drying effect on the hair. If you have sulfate-sensitive hair, this might not be your best choice.Final Verdict:TRESemmé Smooth and Silky Shampoo is a ticket to achieving that luxurious, salon-quality hair you've always dreamed of. It's more than just shampoo; it's a daily dose of pampering for your locks.The Moroccan Argan Oil infusion, combined with its exceptional ability to tame and moisturize, makes this shampoo a fantastic choice for those with dry, unruly hair. Plus, it comes in a convenient 3-pack, ensuring you never run out of the secret to smooth and silky strands.If you're ready to enjoy the feeling of stepping out of a salon every day, TRESemmé has your back. Get ready to revel in the confidence of incredibly smooth and silky hair, making every day a 'good hair day.' 🌟💆‍♀️🚿",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alisa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQH4RBJGPBVLWU4DXTUIEHXM5DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R354JJ7B5E2QR5?ASIN=B08BTNS4K8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Great deal",
                "reviewText": "Shampoo is high quality and got a great price on it as well",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "samantha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMXIMF35Q27VDG4QBMFCPITJ4WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q8MYFTI9W0WA?ASIN=B08BTNS4K8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2023",
                "reviewTitle": "4.0 out of 5 stars No Go for thinner-fine hair!",
                "reviewText": "I recently purchased the Tresemme Shampoo 3 Pack, and there's a lot to love about this product. The scent is delightful and lingers, leaving my hair smelling fantastic for hours. The shampoo is rich and luxurious, providing a thorough cleanse that leaves my hair soft and shiny.Shine and Softness:Tresemme has nailed it in creating a shampoo that delivers on the promise of soft, shiny hair. After use, my locks feel smooth and have a brilliant, healthy sheen. For someone who values their hair's natural luster, this shampoo delivers on that front.Not Ideal for Fine Hair:However, as someone with fine hair that lacks volume, this particular shampoo didn't quite meet my needs. While it smells great and initially leaves my hair looking fantastic, it tends to weigh down my already thin strands. I prefer shampoos that add volume and body, which this one didn't provide. Even when used sparingly, it still flattened my hair, making it look limp and lacking in bounce.Best for Thicker or Curlier Hair:This shampoo would be perfect for individuals with thick or curly hair or those needing extra moisture and sleekness. This might be the right choice if you're looking to combat frizz or add water to your hair. Additionally, if you use conditioner regularly and aren't concerned about additional weight, this shampoo could work wonderfully.Conclusion:In conclusion, while the Tresemme Shampoo 3 Pack offers a delightful smell, incredible shine, and softness, there might be better fits for individuals with fine, thin hair struggling to maintain volume. It's a matter of personal preference, and I've learned that my hair type needs a different treatment. I'll opt for a volume-thickening shampoo for my next purchase to address my specific needs. If you have thick, curly hair or require extra moisture and sleekness, this shampoo could perfectly match you. As for me, I'll be on the lookout for a product that gives my fine hair the lift and body it craves.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa F.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKUOMHWMWZU3ECMEPWMPAQ3HPGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN22DQMD1KHJ8?ASIN=B08BTNS4K8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent product for the money",
                "reviewText": "awesome product love it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJFDVJB2EFHZP52F5M64H4GLRNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N7JBR22YOG33?ASIN=B08BTNS4K8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice on my hair!",
                "reviewText": "First time in ordering and using this shampoo! I like it! Gentle scent and very foamy! Hair feels terrific and the bottle is large. Will rinse out nicely, too. You will like it!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}