{
    "remaining_requests": 22676,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Alpecin-Caffeine-Shampoo-Cleanses-Stronger/dp/B00O4XZYLO",
    "body": {
        "name": "Alpecin C1 Caffeine Shampoo, 8.45 fl oz, Cleanses the Scalp to Promote Natural Hair Growth, Leaves Hair Feeling Thicker and Stronger",
        "price": "$12.25$12.25 ($1.46$1.46 / Fl Oz) $11.64$11.64 ($1.39$1.39 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 12.25,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Alpecin-Caffeine-Shampoo-Cleanses-Stronger/dp/B00O4XZYLO",
        "soldBy": {
            "sellerID": "A2LYX7FKX6AP16",
            "name": "Wiki Deals",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2LYX7FKX6AP16&asin=B00O4XZYLO&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BQ7LGLDK"
        ],
        "asinVariationValues": [
            {
                "asin": "B00O4XZYLO",
                "variationName": "Size",
                "variationValue": "8.45 Fl Oz (Pack of 1)",
                "price": "$12.42",
                "variationImageURL": ""
            },
            {
                "asin": "B003M4TCXM",
                "variationName": "Size",
                "variationValue": "8.45 Fl Oz (Pack of 2)",
                "price": "$18.68",
                "variationImageURL": ""
            },
            {
                "asin": "B01N0B51ON",
                "variationName": "Size",
                "variationValue": "8.45 Fl Oz (Pack of 3)",
                "price": "$29.75",
                "variationImageURL": ""
            },
            {
                "asin": "B01MXEG3PY",
                "variationName": "Size",
                "variationValue": "12.68 Fl Oz (Pack of 1)",
                "price": "$17.95",
                "variationImageURL": ""
            },
            {
                "asin": "B01N8TJ25N",
                "variationName": "Size",
                "variationValue": "12.68 Fl Oz (Pack of 2)",
                "price": "$29.95",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "22",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/419 Lc5MRZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31rpzU-DATL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51BBoeeqBSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PrvF7gLUL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Alpecin Store",
            "link": "https://www.amazon.com/stores/Alpecin/page/3093903E-4B58-427E-8730-A4159711DDE4?ref_=ast_bln"
        },
        "brand": "Alpecin",
        "merchantInfo": "Wiki Deals",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 5593,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 23 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "NATURAL HAIR GROWTH: This shampoo cleanses the scalp to promote natural hair growth",
            "THICKER, STRONGER HAIR: Caffeine, zinc, and niacin work together in this men's shampoo to recharge your thinning hair for a thicker, stronger, fuller feel.",
            "GERMAN ENGINEERING FOR YOUR HAIR: Decades of German research is infused into every bottle of our Alpecin Caffeine Shampoos.",
            "ENERGIZE AND RECHARGE: With caffeine and castor oil, this shampoo recharges and energizes the strands for a fuller-looking head of hair.",
            "FIGHT FOR YOUR HAIR: Daily use of our Alpecin shampoo helps promote natural hair growth and keeps your hair looking and feeling thick and full."
        ],
        "description": "Alpecin Caffeine Shampoos Caffeine Hair Care for Men Experiencing Thinning Hair No one combines caffeine and hair like we do. Trusted for decades by men worldwide, Alpecin’s caffeine shampoos & tonics cleanse the scalp to promote natural hair growth and feature our science-backed proprietary Caffeine Complex. No matter your hair challenge, we’ve got your back with a collection of specialized products for healthier, stronger, and thicker-looking hair.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Hair Care",
                "link": "https://www.amazon.com/Hair-Care-Products-Beauty/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11057241"
            },
            {
                "name": "Shampoo & Conditioner",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17911764011"
            },
            {
                "name": "Shampoos",
                "link": "https://www.amazon.com/Hair-Shampoo-Products/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11057651"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.8 x 7.25 x 2.7 inches; 10.23 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 4008666213617"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 721865106767 721865238611 749447606016 721865222412 798627779132"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Dr. Kurt Wolff GmbH"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00O4XZYLO"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,557 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #262 in Hair Shampoo"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 5,593 ratings"
            },
            {
                "name": "Brand",
                "value": "Alpecin"
            },
            {
                "name": "Scent",
                "value": "Alpecin"
            },
            {
                "name": "Item Form",
                "value": "Gel"
            },
            {
                "name": "Active Ingredients",
                "value": "caffeine,castor oil,zinc"
            },
            {
                "name": "Material Type Free",
                "value": "Silicone Free"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Dr. Wolff Group Dr. Wolff, the maker of Alpecin, has a long tradition of championing caffeine as the secret weapon to men’s hair issues. Our dedicated research and development team of 37 doctors and scientists have spent decades researching the most effective caffeine formulations for our products, meaning your hair and scalp are benefitting from our vast experience. Alpecin Caffeine Shampoos Caffeine Hair Care for Men Experiencing Thinning Hair No one combines caffeine and hair like we do. Trusted for decades by men worldwide, Alpecin’s caffeine shampoos & tonics cleanse the scalp to promote natural hair growth and feature our science-backed proprietary Caffeine Complex. No matter your hair challenge, we’ve got your back with a collection of specialized products for healthier, stronger, and thicker-looking hair.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9eb19405-4807-4dfc-aea7-c5bab1297ef9.__CR586,0,614,614_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Alpecin C1 Caffeine Shampoo Why use Caffeine Shampoo C1? The best-selling caffeine shampoo in Germany and known worldwide, the Caffeine Shampoo C1 is Alpecin’s tried and true original formula suitable all men with thinning hair. Infused with a proprietary Caffeine Complex containing caffeine, zinc and niacin, this shampoo effectively cleanses your hair and scalp to promote natural hair growth. Benefits Helps maintain natural hair growth Noticeably thicker-looking hair Energizes and strengthens Keeps hair healthy and nourished",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a985319f-355c-450f-8afa-13752581a6ff.__CR0,0,2160,2160_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Use daily The caffeine deposited in your hair lasts 24 hours, so use Alpecin every day to ensure your scalp receives caffeine consistently. If hair requires less washing, use the After Shampoo Liquid Scalp Tonic on the days you don’t shampoo. Leave on for 2 minutes Lather and massage your Alpecin Caffeine Shampoo of choice into your scalp and leave in for 2 minutes to give the caffeine enough time to recharge your hair. Rinse, then follow with the Alpecin After Shampoo Liquid for an extra dose of caffeine. Visibly fuller-looking hair in 3 months With consistent and regular use, visibly fuller hair can be seen in 3-6 months.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/a7566574-bdcb-4b9b-becb-bf143de00cf3.__CR0,0,800,800_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/fdeacf85-ce03-4f80-a061-ac5ef288356c.__CR0,0,800,800_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/aba0deac-b159-4711-87c2-30afc9f60bfc.__CR0,0,800,800_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "FAQs: Q: What is the Caffeine Complex? A: Alpecin caffeine products, with its proprietary and exclusive Caffeine Complex ingredient combination of caffeine, zinc and niacin, cleanses the scalp to promote natural hair growth. These ingredients have been shown to aid in strengthening and improving the appearance of hair. Q: Does drinking coffee have the same effect? A: Orally ingested caffeine only distributes a small amount of caffeine to the hair. A local and direct supply of caffeine to the hair is expedient and necessary. Q: Does Alpecin smell like coffee? A: No, all Alpecin caffeine products all have a unique and refreshing masculine scent. Q: Can Alpecin be used by women? A: While Alpecin caffeine products were specifically formulated for men’s hair and scalp needs, women could use if need be. For better results tailored to women, use Alpecin’s sister brand Plantur.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A2B18V6837S6FB/4c6cc8ea-9523-4499-a71d-8c654931446b._CR0,0,300,300_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Alpecin Caffeine Shampoo C1 Alpecin Caffeine Sport Shampoo CTX Alpecin Hybrid Caffeine Shampoo Alpecin Black Edition Caffeine Shampoo C1 Alpecin After Shampoo Liquid Use Cleanses the scalp to promote natural hair growth and helps hair to feel stronger. Cleanses the scalp to promote natural hair growth and helps hair to feel stronger – for those with an active lifestyle. Cleanses the scalp to promote natural hair growth while also providing soothing moisture for dry, sensitive scalps. Cleanses the scalp to promote natural hair growth and helps hair to feel stronger. Recharges hair with a refreshing effect on the scalp. Contains Caffeine complex made of caffeine, zinc and niacin. Caffeine, taurine and micronutrients (CTX) Caffeine complex made of caffeine, zinc and niacin. Caffeine complex made of caffeine, zinc and niacin. Caffeine complex made of caffeine, zinc and niacin, plus menthol and castor oil. Available Sizes 8.45 fl. oz., 12.68 fl. oz. 8.45 fl. oz. 8.45 fl. oz. 8.45 fl. oz. 6.76 fl. oz. Application Apply shampoo once a day to wet hair and massage into hair and scalp. Leave on for 2 minutes and rinse. Apply shampoo once a day to wet hair and massage into hair and scalp. Leave on for 2 minutes and rinse. Apply shampoo once a day to wet hair and massage into hair and scalp. Leave on for 2 minutes and rinse. Apply shampoo once a day to wet hair and massage into hair and scalp. Leave on for 2 minutes and rinse. Apply entirely on the dry scalp or on wet scalp after washing your hair. Do not rinse out. Let dry briefly. Style hair as usual.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9eb19405-4807-4dfc-aea7-c5bab1297ef9.__CR586,0,614,614_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a985319f-355c-450f-8afa-13752581a6ff.__CR0,0,2160,2160_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/a7566574-bdcb-4b9b-becb-bf143de00cf3.__CR0,0,800,800_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/fdeacf85-ce03-4f80-a061-ac5ef288356c.__CR0,0,800,800_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/aba0deac-b159-4711-87c2-30afc9f60bfc.__CR0,0,800,800_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A2B18V6837S6FB/4c6cc8ea-9523-4499-a71d-8c654931446b._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/af414c30-2e61-44b3-a9e1-ab7015d8d031.__CR75,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/0737e138-5528-4f88-87a3-98106cb64ab8.__CR75,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/19d580ba-7685-49bd-beb5-c459ca8527c9.__CR75,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/7b6eef0d-5ded-4875-8586-7a25a08f4068.__CR75,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/764a98bb-6601-4548-b02e-617622e63912.__CR75,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kyle Z. Boland",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXVCXKHIKQMVBVLD6ADLXPNE62A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16FIVA29ROC0R?ASIN=B00O4XZYLO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 24, 2011",
                "reviewTitle": "5.0 out of 5 stars I Really Like This Shampoo",
                "reviewText": "I don't review many products. I believe this is my second or third review. I only review something if my satisfaction with it really stands out. As for the shampoo, just as a shampoo, it is great. I love the smell (it has a very manly smell lol), and I love the way it leaves my hair. I normally have to use conditioner, but I don't have to with this shampoo.But I got this shampoo mostly for the hope that it may help with hair loss. In that respect, I have been using the shampoo about 2 months, so it is difficult for me to honestly say with 100% certainty that it has helped, but I feel confident that it has. By about a month to month and a half mark of using it, I have definitely noticed I am shedding less hair. It is undeniable that I am shedding less. I did rough counts of how much hair I shed virtually every day for a while before I used the shampoo and now after using it. There is no doubt I am shedding less. This isn't placebo, this is actual counts of hairs shed, that can't be denied. I used to shed tons of hair in the shower, and then tons of hair all throughout the day. every few hours I would go to the bathroom, run my hands through my hair, and I would shed 20 hairs. I would take a shower and shed another 50. Now at about the 2 month mark, I still shed about 40 or 50 hairs in the shower, but I seem to shed about 20 more hairs for the entire rest of the day, whereas before I would shed 50 hairs in the shower, and then probably another 100 or more throughout the day. Can I say absolutely that the decrease in shedding is the shampoo? No, but I haven't used anything else, and my shedding was consistent for a year so I don't know what else would have done it.As for regrowth, I am not certain, as it has only been 2 months. I have had some finer hairs on my hairline starting to grow in, and I have just noticed that they are starting to thicken up towards the root. Whether they would have thickened like that without the shampoo, I don't know, but it isn't a risk I want to take. My hair has shed less, and I am more than satisfied with this as a shampoo. I am currently on no medications, like propecia or rogaine. Although I am going to see a doctor to ask if I should. In the meantime I am very satisfied with this as a shampoo, and something to add to the fight against hair loss. I am not going to say this will prevent hair loss if you are destined to be a norwood 7, but I will say, I don't think you will find a better shampoo out there, to help slow it down.I want to make one note for how I use the product. Because I can foresee people putting this on their hands, giving their hands a quick run through their hair and washing it out, and personally I don't see this helping that much. I massage this shampoo into my scalp, and continue to massage it into my scalp for 5 minute before washing it out. I will get the suds from the shampoo and compress it with my hands onto my scalp and then massage, then I will slowly add a little water to my hands to make the shampoo more watery and hopefully more easy to penetrate the hair follicle. This is how I use it. Do I have any evidence this is the most effective method? No, but it seems logical, and it works for me.**UPDATE**Well it has been about 4 months I think since I started using this shampoo and I am still completely happy with it. While I have a prescription for Propecia now, I honestly am not sure if I am going to start it yet, even though if you asked me 4 months ago, I would have said I would have taken Propecia the first chance I get. But now 4 months later, IDK if it is the shampoo or my hairloss just slowed naturally, but my hair appears at least as thick as it was 4 months ago, maybe even thicker. So I really don't know if I am going to start Propecia yet. I think I may wait a little longer. But 4 months later I have to say I am still completely satisfied with this shampoo. I had tried Nizoral before this, but this honestly seems like as best as you are going to get with a shampoo treatment. I say try it, if you don't feel it is helping by the end of the first bottle, then don't get it again, because I think by the end of the first bottle you should notice less hairloss, I have.**UPDATE 1/29/15**Eventually I did go to a dermatologist and get prescribed Propecia as a preventative measure. After taking it a few months I did get side effects unfortunately so I stopped. After that I decided to give Rogaine another shot. The first time on Rogaine I started to get some palpitations, so this time I decided to put a little less on and to ALWAYS wash my hands after application, and those two factors kept the side effects away. So right now I am using Rogaine foam in the morning and liquid at night mostly I apply it on my hairline and brush it back with my fingers even though it is not directed for the hairline. I use the foam because it doesn't make my hair greasy for the whole day and I use the liquid at night because I believe the liquid may be slightly more effective. Also with the liquid I can get the generic version and save money.So that said it is very difficult to say what has helped me most. I have been using this shampoo and alternating it with Nizoral (also potentially helps hairloss) and regular shampoo. My hair on my crown which I had definitely noticed thinning has ceased getting worse. The hair on my hairline has receded slightly, but I have a mole that makes it fairly easy to measure, and in the last 4 years, it hasn't receded much. I would say I saw some regrowth on my crown, and my hairline has been for the most part holding with possibly a very slight recession. Again, it is hard to say which product has worked best for me, because I wasn't willing to lose hair to experiment with only using one.My recommendation would be to get Nizoral shampoo and use it once a week, 2 at most, and then use this shampoo 3 times a week, and then regular shampoo the other 2 days. I would also recommend either Propecia or Rogaine. While Propecia is definitely most effective, I got side effects with it and I kind of regret taking it, although I would have hated if I never gave it a chance. If you don't get side effects with it, then Propecia could very likely save you for at least 10 years and is your best bet if you need more than just to hold where you are but need significant regrowth. Just be warned that I would bet side effects are far more likely than the studies suggest, and not all of them completely go away after you stop. So if you don't want to go on Propecia or had side effects, I highly recommend the combination of Rogaine and these two shampoos. I wouldn't expect temple regrowth, but I would recommend it for some crown regrowth and a significant slowing of temple loss.",
                "reviewVotes": "137 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Annie A.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJECX25AT7J67YXMTZ7L6F3X2NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZMDQT3DE8DV6?ASIN=B00O4XZYLO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars My husband loves it!",
                "reviewText": "Great product, good price, smells good, really rejuvenates the scalp.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas P. Zbikowski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG743JPKONGJY5JW55LDDJRFHOMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUTNAYO3HBCN2?ASIN=B00O4XZYLO",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "4.0 out of 5 stars good shampoo",
                "reviewText": "worth the money",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pooji",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4RV7SPU3F7QY2M26MUVLJKC27A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8QFL43935PIC?ASIN=B00O4XZYLO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Good shampoo",
                "reviewText": "So far so good. Been using it for a month now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Salma Lopez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPDTE45PDAZAN5DZF7ZFCSP34MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27JD2DYUHTK9I?ASIN=B00O4XZYLO",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "3.0 out of 5 stars Works but it broke me out",
                "reviewText": "The shampoo works. It definitely made my hair grow in the short time I used it. I noticed especially in my bangs, which I had cut way too short and after using this shampoo for a few weeks, my bangs were too long! My hair usually grows at an extremely slow rate.Unfortunately, I had an allergic reaction to it. It gave me sores on my scalp that I thought would fix themselves but they didn’t and I had to stop using it.Also, it smells like man.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joe Pereyra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLQVBMHMUQRJEIOEOCT7TIPPJ3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M3UE7RVTM1K3?ASIN=B00O4XZYLO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars This really works! Thank You!",
                "reviewText": "I bought this shampoo and the dry shampoo in later October 2023. Now it is Jan 2024 and I see the baby hairs coming! I’m really happy with this product!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jingwei Wang",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBLLFEK2A5D5KG25AZJU57XESNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R1HD4HZ78GI0?ASIN=B00O4XZYLO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Like this",
                "reviewText": "Like this overall.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SparedTime",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFS324VL5MAJDWYNSMCF5INZAVWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R274YTK2DPZZ2B?ASIN=B00O4XZYLO",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "4.0 out of 5 stars Good shampoo",
                "reviewText": "Makes my hair clean shiny and bright! Haven’t noticed any noticeable new growth though I have a good amount of hair for my age and really was trying this to maintain and keep what I already have!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yesha Mody",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 27, 2022",
                "reviewTitle": "Blessing for hair",
                "reviewText": "It’s the best thing for any hair.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vesko",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 6, 2021",
                "reviewTitle": "Thank you",
                "reviewText": "Great product, value for the money",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rashi Agrawal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 14, 2019",
                "reviewTitle": "Has been very helpful with controlling hair fall",
                "reviewText": "Was told about this by my dermatologist and have been using it for more than a year now. Is very effective",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kamal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 3, 2019",
                "reviewTitle": "The best shampoo",
                "reviewText": "I m using this shampoo since 5-6 years and it’s superb",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 3, 2020",
                "reviewTitle": "This is a good product and was at a good price.",
                "reviewText": "I have previously used this product so was and still happy with it. Note that at the time Amazon was the only place that I could find with supplies - possibly due to COVID.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$12.25",
                "sellerName": "MYSTORE US",
                "sellerRating": "5"
            },
            {
                "price": "$12.25",
                "sellerName": "Ferebe",
                "sellerRating": "4.5"
            },
            {
                "price": "$12.45",
                "sellerName": "Dr. Wolff USA",
                "sellerRating": "5"
            }
        ]
    }
}