{
    "remaining_requests": 22771,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Avalon-Organics-B-Complex-Thickening-Shampoo/dp/B0016BC2BM",
    "body": {
        "name": "Avalon Organics Therapy Thickening Shampoo, Biotin B-Complex, 14 Oz",
        "price": "$10.44$10.44 ($0.75$0.75 / Fl Oz) $9.34$9.34 ($0.67$0.67 / Fl Oz)",
        "originalPrice": "$12.00",
        "rawPrice": 10.44,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Avalon-Organics-B-Complex-Thickening-Shampoo/dp/B0016BC2BM",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09J97YVNK"
        ],
        "asinVariationValues": [
            {
                "asin": "B0016BC2BM",
                "variationName": "Size",
                "variationValue": "14 Fl Oz (Pack of 1)",
                "price": "$10.99",
                "variationImageURL": ""
            },
            {
                "asin": "B008OL3UYK",
                "variationName": "Size",
                "variationValue": "32 Fl Oz (Pack of 1)",
                "price": "$19.49",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "Save an extra 20% on your first Subscribe and Save order.",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41C2MKgnd4L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/417zQxs68BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MCmuVUOCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61JN3cAKDzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21dJBLg65jL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ECAlat4kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31XR9znG2RL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Avalon Organics Store",
            "link": "https://www.amazon.com/stores/Avalon/page/B134704F-ED90-4C2D-886C-ACC03D3AA01B?ref_=ast_bln"
        },
        "brand": "Avalon",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 12680,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 11 hrs 31 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Compact by Design (Certified by Amazon) products remove excess air and water, which reduces the carbon footprint of shipping and packaging. EWG Verified products are reviewed to ensure they are free from EWG’s known chemicals of concern and adhere to strict health standards."
        },
        "features": [
            "One 14 oz. bottle of Avalon Organics Natural Biotin B-Complex Thickening Shampoo",
            "Gently cleanses and nourishes fine, thinning hair to help build volume",
            "Certified organic, plant-based formula made with botanicals and essential oils",
            "No GMOs, parabens, harsh preservatives, synthetic colors or fragrances, or phthalates",
            "Always cruelty-free, never tested on animals; recognized by the Leaping Bunny Program"
        ],
        "description": "Gently cleanse and nourish fine, thinning hair with Avalon Organics Biotin B-Complex Thickening Shampoo. Made with organic botanicals and essential oils, this pH balanced formula deeply conditions hair from the follicle through the entire shaft to invigorate the scalp and enhance hair volume. A carefully balanced blend of biotin, saw palmetto, quinoa protein and vitamin E work in harmony to strengthen hair strands and help build body, leaving hair feeling thicker and softer. This EWG VERIFIED, certified organic shampoo is made with non-GMO ingredients and no parabens, harsh preservatives, synthetic colors or fragrances, or phthalates. It is also vegan and not tested on animals. Includes one 14 oz. bottle of Avalon Organics Biotin B-Complex Thickening Shampoo. Curated from nature’s pure resources, Avalon Organics NSF organic certified skin care, hair care and bath & body products are deep-rooted in a profound respect for the earth. Combining modern science with the botanical world, we constantly strive to perfect each formula, evolve expertise and deliver innovation. Searching out the beautifying benefits hidden within each plant, Avalon Organics thoughtfully develops formulas to not only nourish the body, but also nourish the mind and the soul.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Hair Care",
                "link": "https://www.amazon.com/Hair-Care-Products-Beauty/b?ie=UTF8&node=11057241"
            },
            {
                "name": "Shampoo & Conditioner",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17911764011"
            },
            {
                "name": "Shampoos",
                "link": "https://www.amazon.com/Hair-Shampoo-Products/b?ie=UTF8&node=11057651"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.97 x 1.97 x 5.51 inches; 1 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ AV36102"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 654749361016 654749361023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Avalon"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0016BC2BM"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,421 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #61 in Hair Shampoo #192 in Climate Pledge Friendly: Beauty"
            },
            {
                "name": "#192 in Climate Pledge Friendly",
                "value": "Beauty"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 12,680 ratings"
            },
            {
                "name": "Brand",
                "value": "Avalon Organics"
            },
            {
                "name": "Item Form",
                "value": "Liquid"
            },
            {
                "name": "Hair Type",
                "value": "Fine, Thin"
            },
            {
                "name": "Scent",
                "value": "Biotin B"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Deep Rooted Beauty Curated from nature’s pure resources, Avalon Organics NSF organic certified skin care, hair care and bath & body products are deep-rooted in a profound respect for the earth. Combining modern science with the botanical world, we constantly strive to perfect each formula, evolve expertise and deliver innovation. Searching out the beautifying benefits hidden within each plant, Avalon Organics thoughtfully develops formulas to not only nourish the body, but also nourish the mind and the soul.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/22042567-1817-45b6-ba29-971158eea076._CR0,0,1667,1667_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Driven by a dedication to organic agriculture and formula transparency, all Avalon Organics products are certified to the NSF/ANSI 305 Standard for Personal Care Products Containing Organic Ingredients*. Through this honest, transparent process, the Avalon Organics brand creates products that are safe, effective and conscious of the greater good. *Claim approval was given on April 11, 2011 from QAI with certificate ID C01655324-NSF3HNPC-5.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/32470920-da47-4b2c-92e5-2403409b9a84.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Humbled by a profound respect for all living beings, Avalon Organics products are vegan and cruelty-free.* The Avalon Organics brand never tests products on animals, and will only source ingredients that the supplier can document are not tested on animals. This commitment to kindness is represented by the leaping bunny logo that appears on product labels. *Cruelty free certified by the CCIC on October 1st, 2008",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f730d7fc-3f63-4d79-9540-306da84793c4.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Avalon Organics Rosemary Shampoo, 32 fl oz Avalon Organics Rosemary Conditioner, 32 fl. oz Avalon Organics Shampoo, Clarifying Lemon, 11 Oz Avalon Organics Conditioner, Clarifying Lemon, 11 Oz More Hair Care Products from Avalon Organics Formulated for thin and limp hair, this shampoo, containing a medley of Rosemary Essential Oil, Quinoa Protein, Calendula, Aloe and Vitamin E, thoroughly cleanses hair while reinforcing volume from root to tip. Formulated for thin and limp hair, this conditioner, containing a medley of Rosemary Essential Oil, Quinoa Protein, Calendula, Aloe and Vitamin E, lightly conditions hair while reinforcing volume from root to tip. Restore natural highlights and shine to dull, lackluster hair with Avalon Organics Clarifying Lemon Shampoo. Restore natural highlights and shine to dull, lackluster hair with Avalon Organics Clarifying Lemon Conditioner.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/8a4e4a77-4548-4717-b90c-05f7a2b87e96._CR0,74,1464,453_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/22042567-1817-45b6-ba29-971158eea076._CR0,0,1667,1667_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/32470920-da47-4b2c-92e5-2403409b9a84.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f730d7fc-3f63-4d79-9540-306da84793c4.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a23b4e65-4b0c-4418-85fb-c9f794a85f4b.__CR68,7,365,729_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3005a593-e416-4a14-9643-0f6f67212580.__CR74,0,397,793_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a4a3e8cf-dfa9-425d-9228-0765140f0c33.__CR31,36,356,713_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30c37e9b-c496-4fa8-95f4-bcea6eef5475.__CR78,0,384,768_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Fair Perspective",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQFLE2SC2W5X67ASSH2GRVGDFQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D7EBG5PHRHTY?ASIN=B0016BC2BM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Transform Your Hair with Avalon Organics B-Complex Thickening Shampoo",
                "reviewText": "I recently had the pleasure of trying out the Avalon Organics B-Complex Thickening Shampoo, and I must say that it exceeded my expectations in every way. This product is a true game-changer for anyone looking to add volume and thickness to their hair. The shampoo's unique blend of organic botanicals, vitamins, and essential oils work together to nourish and strengthen the hair, resulting in noticeably thicker and healthier locks.One of the standout features of this shampoo is its impressive ingredient list. It contains B vitamins, including biotin and panthenol, which are known to promote hair growth and improve overall hair health. The inclusion of essential oils like rosemary and lavender not only enhances the sensory experience but also provides additional benefits such as stimulating the scalp and reducing hair breakage. Moreover, the shampoo is free from harsh chemicals like sulfates, parabens, and synthetic fragrances, making it a safe and gentle option for all hair types.In terms of value for money, the Avalon Organics B-Complex Thickening Shampoo truly delivers. Despite its premium organic ingredients, it is reasonably priced and offers excellent value for the quality it provides. A little goes a long way with this shampoo, as it lathers up beautifully and effectively cleanses the hair without stripping it of its natural oils. The thickening effect is noticeable even after just a few uses, and with continued use, I have seen a significant improvement in the fullness and body of my hair. Additionally, the bottle is generously sized, ensuring it lasts for an extended period, making it a cost-effective choice.Overall, I highly recommend the Avalon Organics B-Complex Thickening Shampoo to anyone looking to enhance the thickness and volume of their hair. With its impressive blend of organic ingredients, including B vitamins and essential oils, this shampoo provides noticeable results while also being gentle on the hair. Considering its reasonable price point and long-lasting formula, it offers exceptional value for money. Say goodbye to flat, lifeless hair and hello to luscious, voluminous locks with the Avalon Organics B-Complex Thickening Shampoo.",
                "reviewVotes": "49 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angela Simmons",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXOIFIQZMYPO4KRN7DR342SVCQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EYI3M4QFLTLK?ASIN=B0016BC2BM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Quality shampoo!",
                "reviewText": "This shampoo is our go to because it doesn't contain the sulfates or parabens, but lathers up well. We don't need alot of shampoo to get into the scalp, and it rinses well.We buy the largest size and fill smaller bottles for travel because it's better than the travel sized shampoos.We have used this product for several years now.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristina Montes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLXIAADUBQ3NF7XVVE4PIRBP5VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13GVGEUXD7YA2?ASIN=B0016BC2BM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 27, 2013",
                "reviewTitle": "4.0 out of 5 stars Happy so far... losing less hair!! See detailed review.",
                "reviewText": "6/8/2013, first review: I thought to review this product as time goes on. I've only been using it for a week, so I do not expect to see hair growth at this point. It's good to note that I'm 42 years old, w/disturbing hair loss.The bottles are SMALL so I'm not using it carelessly. The smell is not flowery & fun, but it's more medicinal in scent, not overpowering. The shampoo lathers if you work at it, & it's a low lather rather than a high and luffy one. I rub it gently on my scalp & throughout my hair. If scrub too hard, I'll lose MORE HAIR. :( I am washing my hair every day, where I used to wash every other day. The conditioner does not lather. It's more of a cream that I rub gently onto wet hair. My hair feels sort of weighty as I wash it & I think that I'm going to have a BAD HAIR DAY ahead of me, but after styling, it's actually soft, manageable, not weighty! After washing, I wrap in a towel for about 5 minutes, apply FINESSE styling mousse, let my brown curls air dry. Sometimes a touch of hairspray but most days, not. With the thick feel in the shower, I am surprised that it's not weighted down after styling. SO, I'll keep on trying this for 3 months. I'll try to remember to update if I see a difference. Feel free to ask me questions.**IT'S IMPORTANT TO MENTION THAT ALONG W/THE SHAMPOO & CONDITIONER, I'M TAKING, MAXI HAIR SUPPLEMENTS. My Dr. was pleased w/the ingredients of the shamp, cond AND supplements. I use the supplements in place of a multi so I also take OMEGA 3 & Calcium Citrate w/ D3. (As per Dr).**6/8/2013, first review: I thought to review this product as time goes on. I've only been using it for a week, so I do not expect to see hair growth at this point. It's good to note that I'm 42 years old, w/disturbing hair loss.The shampoo&conditioner bottles are SMALL so I'm not using it carelessly. The smell is not flowery & fun, but it's more medicinal in scent, not overpowering. The shampoo lathers if you work at it, & it's a low lather rather than a high and fluffy one. I rub it gently on my scalp & throughout my hair. If scrub too hard, I'll lose MORE HAIR. :( I am washing my hair every day, where I used to wash every other day. The conditioner does not lather. It's more of a cream that I rub gently onto wet hair. My hair feels sort of weighty as I wash it & I think that I'm going to have a BAD HAIR DAY ahead of me, but after styling, it's actually soft, manageable, not weighty! After washing, I wrap in a towel for about 5 minutes, apply FINESSE styling mousse, let my brown curls air dry. Sometimes a touch of hairspray but most days, not. With the thick feel in the shower, I am surprised that it's not weighted down after styling. SO, I'll keep on trying this for 3 months. I'll try to remember to update if I see a difference. Feel free to ask me questions.**IT'S IMPORTANT TO MENTION THAT ALONG W/THE SHAMPOO & CONDITIONER, I'M TAKING, MAXI HAIR SUPPLEMENTS. My Dr. was pleased w/the ingredients of the shamp, cond AND supplements. I use the supplements in place of a multi so I also take OMEGA 3 & Calcium Citrate w/ D3. (As per Dr).**6/27/2013 - Although there is NO new hair growth, I've noticed that I'M LOSING LESS HAIR when I wash & style! It's enough for me to notice & enough for me to keep going w/ this trial. 19 days in, w/ consistent use of shamp/cond & Maxi Hair, my hair is smoother, softer, shinier stronger, doesn't have a bad smell, still not weighty & continues to be manageable. I feel like whatever residue was clogging my hair is out. My hope is that this is the case for my scalp & maybe, just maybe, I'll see some new sprouts. A girl can dream. :)6/30/2013 - Could it be? New hair? Will keep you posted. I see three short hairs poking through! I should also note that my nails need to be trimmed more often than ever, and I have to shave, (legs, underarms), more frequently! I suspect this would be from the internal good I'm getting from the Maxi-Hair supplement.7/21/2013 - YES! Still losing less hair, AND there IS new hair growth in little stray spots. My nails, which I keep short, need to be cut once every week to 10 days as opposed to once every 3 or more weeks! I rcvd two complements on my hair this past week, about how shiny &healthy it looks! I remain faithful to the products, using them EVERY DAY as recommended.UPDATE 11/16/13 - I use the shamp/cond. once or twice, about every 3 wks to a month. It was making my scalp itch. It's great for that monthly \"stripping of gunk\". I cannot live without the MAXI HAIR. Two weeks ago, I got lazy and missed a few doses. Within two days, more hair began to fall out in the shower and with styling. I went right back on it. Since I've started I have new hair growth that is now over an inch long.6/27/2013 - Although there is NO new hair growth, I've noticed that I'M LOSING LESS HAIR when I wash & style! It's enough for me to notice & enough for me to keep going w/ this trial. 19 days in, w/ consistent use of shamp/cond & Maxi Hair, my hair is smoother, softer, shinier stronger, doesn't have a bad smell, still not weighty & continues to be manageable. I feel like whatever residue was clogging my hair is out. My hope is that this is the case for my scalp & maybe, just maybe, I'll see some new sprouts. A girl can dream. :)6/30/2013 - Could it be? New hair? Will keep you posted. I see three short hairs poking through! I should also note that my nails need to be trimmed more often than ever, and I have to shave, (legs, underarms), more frequently! I suspect this would be from the internal good I'm getting from the Maxi-Hair supplement.7/21/2013 - YES! Still losing less hair, AND there IS new hair growth in little stray spots. My nails, which I keep short, need to be cut once every week to 10 days as opposed to once every 3 or more weeks! I rcvd two complements on my hair this past week, about how shiny &healthy it looks! I remain faithful to the products, using them EVERY DAY as recommended.9/21/13 - IMPORTANT UPDATE. It seems that with months of use, this product is GREAT for clearing up any residue on my scalp, BUT it is drying out my hair. I have to rotate my use of this and the conditioner. It's stripping the oils from my hair. I will still use the shampoo and conditioner, but may just use it once a week. WIll keep updating. I did notice that for the past two weeks, when I use the products, my scalp gets just a little itchy. That also indicates to me that the residue blocking my pores may be cleared up! That is the good part! SO, I will be using the MAXI HAIR daily as bottle recommends, but will limit the use of the shampoo and conditioner.11/16/13 - continue to use shamp/cond once a month. Two weeks ago I got lazy with the Maxi Hair doses and noticed a difference two days in! More hair was coming out in the shower! Cannot live without this little plan I've got going on.",
                "reviewVotes": "91 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5RBMX45VYUQXAJUHAG356A7XSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R397FW65KHQQCY?ASIN=B0016BC2BM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars It works!",
                "reviewText": "I have had a great experience with rhis shampoo. I was loosing so much hair for months before using this shampoo, i was truly thinning. Since using the shampoo I have farrr lesss hair loss when washing and brushing, my hair is stronger, its thicker and i dont have to wash it as much. I love the shampoo. I have noticed my waves are not as wavey since using and my hair feels dry when coming out the show but what i do to combat that is put Jojoba oil on my damp hair which helps alot.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "susie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYHZLEBN7FXOMXTFUC55RLCHCTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YS46S8Z1M77M?ASIN=B0016BC2BM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Safe",
                "reviewText": "It works really good, it helps with if you have dandruff or sculp dryness. I mixed with rosemary, cinnamon & cloves.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Farida Yakobi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on January 12, 2024",
                "reviewTitle": "Didn’t do much",
                "reviewText": "I used it for 2 months did not see anything apart from making my hair super thick and voluminous, do not use this shampoo without a conditioner afterwards or you’ll rip your hair out whilst brushing it wet or dry!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 23, 2023",
                "reviewTitle": "Meilleur shampoing jamais utilisé.",
                "reviewText": "Sans sulfate, odeur extrêmement plaisante, prix adapté à la qualité, je recommande fortement.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Salvador Llorca Borrás",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on October 9, 2023",
                "reviewTitle": "Buen producto",
                "reviewText": "El mejor champú que he probado para pelo graso con caída",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chick",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 12, 2023",
                "reviewTitle": "Amazing",
                "reviewText": "This actually works it has helped strengthen my thin hair",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jesus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 28, 2023",
                "reviewTitle": "Muy buen producto",
                "reviewText": "Es un muy buen shampoo la verdad ayuda bastante, el cabello se siente más fuerte, solo el precio es un poco elevado pero dura bastante no se ocupa mucho con solo un poco de shampoo lava bastante bien.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$10.99",
                "sellerName": "Beauty Factoria",
                "sellerRating": "4"
            },
            {
                "price": "$11.99",
                "sellerName": "MA INTERNATIONAL 3014",
                "sellerRating": "4"
            },
            {
                "price": "$14.78",
                "sellerName": "Express Goods",
                "sellerRating": "5"
            }
        ]
    }
}