{
    "remaining_requests": 22724,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Botanic-Hearth-Tea-Tree-Shampoo/dp/B0849L3675",
    "body": {
        "name": "Botanic Hearth Tea Tree Shampoo, Vitamin C, Peppermint, Lavender and Rosemary Oil, Fights Dandruff and Dry Scalp, 16 fl oz",
        "price": "$17.99$17.99 ($1.12$1.12 / Fl Oz) $17.09$17.09 ($1.07$1.07 / Fl Oz)",
        "originalPrice": "$23.99",
        "rawPrice": 17.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Botanic-Hearth-Tea-Tree-Shampoo/dp/B0849L3675",
        "soldBy": {
            "sellerID": "AZKEVAAQIEO3Q",
            "name": "Botanic Hearth",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AZKEVAAQIEO3Q&asin=B0849L3675&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "15",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31UO0AAhDNL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41webXiVnAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51giWYqiulL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PQpp9za6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZIsFz2rqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/310ojXRUflL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Botanic Hearth Store",
            "link": "https://www.amazon.com/stores/BestHairCareProducts/page/4CCA8AE4-4788-4C2A-B1AA-6C17080C77F5?ref_=ast_bln"
        },
        "brand": "BestHairCareProducts",
        "merchantInfo": "Botanic Hearth",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 3393,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 16 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Soothes Itchy & Dry Scalp : The Botanic Hearth Tea Tree Shampoo contains natural tea tree oil that provides a calming effect on the scalp, relieves dryness & itchiness while leaving the hair feeling clean & refreshed",
            "Keeps Hair Hydrated & Smooth : This hair care formula is enriched with hydrating and nourishing ingredients like peppermint, rosemary and lavender oils that work together to deeply nourish and hydrate the hair",
            "Helps Fight Dandruff : The Tea Tree shampoo helps fight dandruff and scalp irritation, while also moisturizing and hydrating the hair, leaving it feeling healthy and refreshed",
            "Helps Improve Hair Growth : The Botanic Hearth Tea Tree Shampoo helps strengthen and nourish hair follicles, promoting healthy hair growth while also improving the overall texture of hair",
            "Ethically Sourced & Cruelty-free : Botanic Hearth products are made or packaged in the USA, safe, healthy, sulfate-free, paraben-free, and cruelty-free"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Hair Care",
                "link": "https://www.amazon.com/Hair-Care-Products-Beauty/b?ie=UTF8&node=11057241"
            },
            {
                "name": "Shampoo & Conditioner",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17911764011"
            },
            {
                "name": "Shampoos",
                "link": "https://www.amazon.com/Hair-Shampoo-Products/b?ie=UTF8&node=11057651"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3 x 3 x 8.5 inches; 1 Pounds"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 850001249454"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Botanic Hearth"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0849L3675"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,899 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #334 in Hair Shampoo"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 3,393 ratings"
            },
            {
                "name": "Brand",
                "value": "Botanic Hearth"
            },
            {
                "name": "Item Form",
                "value": "Liquid"
            },
            {
                "name": "Hair Type",
                "value": "All, Dry"
            },
            {
                "name": "Scent",
                "value": "Lavender,Peppermint,Rosemary"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/65a517fb-441e-4c6f-a38b-fe6610ca7d6d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/68b1004c-669f-458d-8e44-22a50240c3c1.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36abed8f-2a66-4611-863a-73fe2c45a81c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b5415df4-0108-4cbf-9b95-cff38755a2c0.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aca7ac4b-73df-4a85-aca0-af911c6130c3.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e215b516-210d-458f-a433-166fb9d0c89e.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "myreviews30",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHLI3DUBKFOJVM67KO5MCJYB2CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CWII8AYM0J74?ASIN=B0849L3675",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 13, 2022",
                "reviewTitle": "5.0 out of 5 stars Really Great Shampoo",
                "reviewText": "Nearly 3 months update:WOW....Since most of my hair is longer this has been a progression, many parts of my scalp where much of my hair seemed to be thinning....A lot of the follicles just stayed in resting....because you could see a lot of scalp underneath the longer growth....The follicles weren't dead....The hairs just weren't popping out, then there would basically be a little stubble sometimes, hair was thin though when things did grow....on top, not I think just as they call it \"the crown\" where guys can get like a circular bald spot on top near the back...but the actual top of my head only certain follicles we're growing at any given time and they were few....A lot of the hair seemed to be finer than when I was young, which I always heard \"Your hair is thick, I'm having to use my thinning shears....Lucky....\" I wasn't content just going with the thin hair look, It will be another 3 to 6 months probably for everything to completely even out....I've used roughly half a bottle at this point and getting better every day. Additional recommendation I left it on scrubbed into the scalp and just left it (slept on it, put on a shower cap and left it on) then slowly rinsed it out with cool warm water rubbing the scalp during the process....I think that helped possibly, definitely didn't hurt....My regular routine is I soak my scalp rubbing things under the water before adding shampoo....I think this might prep the scalp and follicles to better absorb things, then I use a glob add a little bit of water and rub it in, I start at the front sides and front hairline and rub a lot of the shampoo in then continue on back, rubbing it deep into the scalp as I go, another glob for the top and too back parts and work it into the scalp then work the rest into the rest of my hair but heavy focus of getting it down on the scalp....I leave it on, at times massaging it in I do this for several minutes and then do other shower things before slowly in cool warm water slowly massaging it out adding water until it's washed out.....The results have been awesome....I've also noticed \"less shedding\" of my other more established, longer hair that was there before I started using this. Also, I battled dandruff when I was growing up....and some time since and sometimes itchy scalp, couldn't wear darks because there could be and usually would be flakes even with head and shoulders, denorex, Selsun Blue, Neutrogena T gel shampoos etc...All these things have been long gone as I have been using this. Awesome.....I'll update again if this continues, this is some really great shampoo! I am very impressed with the results!Further updateI have now been using this for close to two months, Not only has it eliminated any scalp issues, itchy, flakes, etc....It has jumpstarted growth of hair where the follicles were in their resting phase.....So the scalp coverage is much better, I mean granted the new hairs are only filling in and are a lot shorter than the other existing hairs....The hairs are growing at the regular rate as the rest....and it will be a while before they reach the growth of the rest but I am very impressed.....The hair follicles woke right up and things are filling in....I take a glob of this, put a small amount of a biotin shampoo I like and a little water, mixing it on my hand then I apply it to my hair and making sure to really work it into the scalp, and let it sit until it's pretty much soaked up by the scalp and hair, continuing to massage into the scalp and I take my time during the rinse process, using cool, warm water working it into the scalp as it washes out....I don't appear to have any dormant follicles anymore since I have been using this, everything that was in a resting phase has jumped right in and been consistently growing.....Full and even scalp coverage....This stuff is amazing. I wish hair would grow faster than it does :) there I don't think is a way to make hair grow faster....But getting resting follicles to wake up.....Usually we have a lot of follicles in the resting phase, basically dormant and can be that way for weeks or a month or more....This got things growing! I had the usual.....a percentage of follicles that were just resting.....Now they have been growing new hair rather than resting....It's awesome! I knew I wasn't going bald and things seemed to be thinner due to the amount of hairs growing vs resting, this woke things up and scalp coverage is looking very good!UpdateI wanted to update on how this is going now that more time has passed and hair has grown out more...My scalp and hair follicles are really doing well with this stuff....a lot of new growth is visible when looking at the scalp below the longer other hair that was present around a month ago when I started using this...And my scalp feels great....not oily or dandruff or itchy or that kind of thing....Which has been an issue now and then since I was a young child....so I often used things like denerex and head and shoulders anti dandruff....And then Pantene Pro V shampoos to nourish the hair, but I wanted to try some new stuff that would not just treat the issues with chemicals etc, but add nutrients that could benefit the scalp and follicles....And this is working very well after about a monrh...My Scalp and follicles are really responding well....It's not making hair grow faster per se' Because that's probably not even a real claim anyone can prove...What it is doing is giving rich nutrients to make the scalp and follicles able to thrive....Great stuff!I've been using this for several days....I am already impressed by the results! Also a tiny amount goes a very long way! A lot of shampoos you have to use a huge clump of the shampoo to get it really lathered up so you can get down into the scalp...And I work it into the scalp not just coating the hair, then I leave it for several minutes (the thick lather goes away as it's absorbed into the scalp and hair....I wait for that point then I rinse it out slowly while working it in as it rinses....Gradually adding more water while massaging it in until it's all rinsed out....) Usually I don't tend to need to shampoo every day, I just rinse and condition, but this has already been working and I've been using it, wash massage and slow rinse every day since I got it to get all the nutrients all soaked in.....My hair and scalp look and feel great so far.... And even washing every day, the amount that is needed isn't much so it looks like a bottle will last quite a while at this rate...A lot of shampoos get used up quick because you have to use a massive amount to get a real good down to the scalp lather, others you have to add a little water to them to get them to a consistency where you can coat every strand and also get it down to the scalp....with this, a little goes a long way....I usually with any shampoo, I will put my hand under the faucet when I put the shampoo in my hand so I can get the lather started before putting it in my hair....And it means this stuff will last a while ....Hair really looks nourished and feels great as does the scalp, very impressed so far by the results....It will be interesting after a few months of use to see how things have progressed....This stuff so far....seems like it's working great....The only issue I have is the bottle has a pump on top, the pump was broken on arrival....So I have to unscrew the cap and pull the whole pump with the inner tube out then pour the shampoo directly into my hand with the cap off then put it back on and tighten the cap back down since the pump part was broken already, before I even got started with it....As for the product though....It is already seeming to be doing a lot of good for both hair and scalp.....",
                "reviewVotes": "52 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan J",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH54CP4OM5VEF6OTJUKPTEWSF7AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3P2H8VG4HSEVC?ASIN=B0849L3675",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2021",
                "reviewTitle": "5.0 out of 5 stars liked it",
                "reviewText": "I fight psorisis, dandruff, fungus infections, and oily scalp conditions. I get really bad itch from most shampoos and I've given up on every off-the-shelf cheap piece of garbage I've tried. I've learned over time that these tea tree shampoos are perfect for sensitive scalp issues based on many years of using Regis Tea Tree Shampoo and additional reading. In a pinch, I decided to try this one. The price felt high for the quantity and cost so I use it sparingly. I was pretty impressed after initial use of just a few times though... I got no itch, irritation or dandruff from it, but it's early to tell yet. It did not leave my scalp oily. I enjoy the very slight tingle from the tea tree extract (and other additives) but it does not compare to the Regis which I understand has been discontinued or reformulated. There was a deep ripe lime smell to this when using it, but it doesn't last long.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P.B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHD65EGXFKNYT3MT2Y474H3ZNDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EBBGTHKG2IYR?ASIN=B0849L3675",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Broken but still usable",
                "reviewText": "The spout on the pump came broken off completely. But the product itself is good. It smells good and has a good lather to it. It's done good for my hair so far.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDD5X2DSNKWDAVZS4Y7M24OXZUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B61SACOCACBN?ASIN=B0849L3675",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2023",
                "reviewTitle": "5.0 out of 5 stars I expect a tingle from tea tree.",
                "reviewText": "This product says tea tree but it does not tingle like tea tree which is why I buy Tea Tree items. I used to like Menthol and they don't carry that anymore so I switched to tea tree this has no tingle and no pleasing smell",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61JdrB3eYkL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter N Yun",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOBBZ34SLOJ7FHAXQXE6KWYQNYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37Y5PZAWTUY52?ASIN=B0849L3675",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "3.0 out of 5 stars FIX THE PUMP.FIX THE PUMP.FIX THE PUMP.FIX THE PUMP.FIX THE PUMP.",
                "reviewText": "Not that noticeable difference compared to other generic shampoo, but it cleanses your hair alright and does its job. I suppose it's more organic. The biggest issue is the PUMP. It really sucks. You'll spend 2 full minutes under shower to get a decent amount out of that pump; for a man. The pump only disperse a little and takes forever to come up. No joke. FIX THE PUMP. FIX THE PUMP.FIX THE PUMP.FIX THE PUMP.FIX THE PUMP.FIX THE PUMP.FIX THE PUMP.FIX THE PUMP.FIX THE PUMP.FIX THE PUMP.FIX THE PUMP.FIX THE PUMP.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maureen Painter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLET2DVHXMPE4KLTBURGKN2OZQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRG3NZ6BB2YAM?ASIN=B0849L3675",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Smells Great",
                "reviewText": "Smells great, feels refreshing on your scalp",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUXFH7GY2J737774KAJVPQVCERA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TOEJ3QJD1MOW?ASIN=B0849L3675",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Quality Shampoo",
                "reviewText": "This product is by far the best shampoo I've ever used. Our daughter told us about it. She loves it. A little goes a long way. Just a little dab will do you. After using, my hair is clean and fresh. It is as close as we can get to a healthy shampoo without all the unhealthy additives. On the con side, i thought the shampoo was a little pricey.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CDP ATL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGERT46WCFR3LH34OJZVYR7SD6YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V9T8Z8DFP027?ASIN=B0849L3675",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2023",
                "reviewTitle": "1.0 out of 5 stars There is no tingle.",
                "reviewText": "My first time buying this brand. It smells like tea tree and peppermint, but my scalp does not tingle like it does when I use other same type shampoos. I purchased this product because I thought the ingredients would give me a refreshing tingle. I will not purchase again. My hair felt rough after washing with this product, not soft at all.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 25, 2024",
                "reviewTitle": "So far so good",
                "reviewText": "Like everything about it, first wash all dandruff went away. Leaves a lovely shine to hair, refreshing smell. Love it!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 19, 2023",
                "reviewTitle": "Very good product",
                "reviewText": "Keeps hair and scalp from dryness",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 7, 2023",
                "reviewTitle": "Feels good on the scalp",
                "reviewText": "Nice smell, good suds . Highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philippe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 6, 2023",
                "reviewTitle": "Shampoing",
                "reviewText": "La senteur et l’efficacité.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "brent mcarthur",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 10, 2023",
                "reviewTitle": "good",
                "reviewText": "good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$17.99",
                "sellerName": "Botanic Hearth",
                "sellerRating": "4.5"
            }
        ]
    }
}