{
    "remaining_requests": 22529,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Garnier-Treasures-Restoring-Preservatives-Sustainably/dp/B09424YQJR",
    "body": {
        "name": "Garnier Whole Blends Restoring Shampoo Bar for Dry, Damaged Hair, Honey Treasures, 2 Oz, 1 Count (Packaging May Vary)",
        "price": "$7.57$7.57 ($3.79$3.79 / Ounce) $6.77$6.77 ($3.39$3.39 / Ounce)",
        "originalPrice": "$8.99",
        "rawPrice": 7.57,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Garnier-Treasures-Restoring-Preservatives-Sustainably/dp/B09424YQJR",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "Savings",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41twYLP8-ZS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61GAW2X yZS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gVonfPFQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xTnyMxxTS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VsQ61gUEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HzAJngXOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511lBIm-KEL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d904d9a9-9d6a-4bc1-9cc2-986146cc1e1e/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Garnier Store",
            "link": "https://www.amazon.com/stores/Garnier/page/0B5229A4-14F7-47F2-A4E8-ED9162D257DB?ref_=ast_bln"
        },
        "brand": "Garnier",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1843,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 16 hrs 44 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 16 hrs 44 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Compact by Design (Certified by Amazon) products remove excess air and water, which reduces the carbon footprint of shipping and packaging."
        },
        "features": [
            "Whole Blends Restoring Shampoo Bar- Full of care for your hair, free of plastic packaging for the planet - 100 percent recyclable cardboard",
            "For Dry, Damaged Hair- 93% less breakage, Doesn’t strip, nourishes and protects hair against damage- Easy to lather and fast rinse formula- blended for the family ages 3+",
            "How To- 1 Wet your hair and the solid shampoo to make it foam- 2 Hold the shampoo bar to your hair and lather from roots to tips- 3 Massage scalp and rinse off, Follow with conditioner- 4 Store in a dry place",
            "Garnier aspires to create a positive impact by paving the way towards more and more sustainable beauty that’s accessible to all - All Garnier products are approved by Cruelty Free International under the Leaping Bunny Program"
        ],
        "description": "Raise the bar on shampoo! Introducing a bar full of care for your hair that cleanses and lathers like a liquid shampoo, with zero plastic packaging. The nourishing and foamy formulas soften, protect, and revitalize hair, delivering shiny and healthy-looking strands that are cleansed with no harsh effect. Formulated with 94% plant-based ingredients, the shampoo bars are blended without silicones, preservatives, soap and dye. Bonus: Each easy-to-use bar lasts up to 40 washes. The fast-rinsing formulas are 97% biodegradable and dermatologist-tested for safety. To use, wet hair and the solid shampoo to make it foam, hold the bar and lather from roots to tips, massage scalp and rinse. Follow with your favorite Garnier Whole Blends shampoo or conditioner for added nourishment. New Whole Blends Shampoo Bars are available in four blends for your hair needs, packaged in 100% recyclable and Forest Stewardship Council certified cardboard boxes: Whole Blends Restoring Honey Treasures Shampoo Bar for dry and damaged hair, Whole Blends Hydrating Coco & Aloe Vera Shampoo Bar *Sulfate Free* for normal hair, Whole Blends Softening Oat Delicacy Shampoo Bar for fine to normal hair, Whole Blends Strengthening Ginger Recovery Shampoo Bar for weak hair.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Hair Care",
                "link": "https://www.amazon.com/Hair-Care-Products-Beauty/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11057241"
            },
            {
                "name": "Shampoo & Conditioner",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17911764011"
            },
            {
                "name": "Shampoos",
                "link": "https://www.amazon.com/Hair-Shampoo-Products/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11057651"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 3.31 x 3.03 x 1.22 inches; 2 Ounces"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Garnier"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B09424YQJR"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ France"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,309 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #555 in Hair Shampoo #780 in Climate Pledge Friendly: Beauty"
            },
            {
                "name": "#780 in Climate Pledge Friendly",
                "value": "Beauty"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,843 ratings"
            },
            {
                "name": "Brand",
                "value": "Garnier"
            },
            {
                "name": "Item Form",
                "value": "Bar"
            },
            {
                "name": "Hair Type",
                "value": "Dry"
            },
            {
                "name": "Scent",
                "value": "Honey"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Watch Drew Barrymore try Whole Blends Shampoo Bars",
                "media_link": []
            },
            {
                "media_text": "Difference between Whole Blends shampoo bar and a soap? Shampoo Bars are a solid shampoo but not a soap. They offer all the benefits of a liquid shampoo – foamy, cleansing and nourishing! Garnier’s scientists have developed a perfect formula. It has been designed to use on your hair and not on your body. Do I need a conditioner with Whole Blends shampoo bar? Our Garnier Whole Blends Solid Shampoo Bars have the same nourishing properties as a liquid shampoo and we love to pair it with our favorite Whole Blends conditioner and indulge in our Miracle Nectar 10-in-1 Leave In Treatment for added nourishment. Why should I make the switch to Whole Blends shampoo bar? Switching to a Shampoo Bar doesn’t mean you have to sacrifice having nourished and healthy-looking hair. By purchasing and using your Solid Shampoo Bar you help to fight plastic pollution one hair wash at a time. Let’s raise the bar on shampoo! Can I use Solid Shampoo on Curly Hair, too? Yes! Our Honey Treasures, Oat Delicacy, and Ginger Recovery Shampoo Bars can be used to nourish straight, wavy, and curly hair. Let us know your favorite blend in the reviews! Can I travel with a Shampoo Bar? This non-liquid shampoo is perfect to bring along on trips or keep in your gym bag. We recommend storing in a small container for best preservation on-the-go.",
                "media_link": []
            },
            {
                "media_text": "Find Your Blend Honey Add to Cart Coco Aloe Add to Cart Ginger Add to Cart Oat Add to Cart Customer Reviews 4.3 out of 5 stars 1,843 4.2 out of 5 stars 1,382 4.3 out of 5 stars 1,071 4.3 out of 5 stars 1,331 Price $7.97$7.97 $7.99$7.99 $7.00$7.00 $7.97$7.97 Benefit Restoring Hydrating Strengthening Softening Hair Type Dry, Damaged Hair Normal Hair Weak Hair Fine to Normal Hair Preservative Free Yes Yes Yes Yes Silicone Free Yes Yes Yes Yes Sulfate Free No Yes No No Cruelty Free Yes Yes Yes Yes Blended With Honey & Beeswax Coconut Oil & Aloe Ginger & Almond Oil Oat Milk & Rice Cream",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b519828b-4fd8-4b06-a54d-393d75ec8686.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/862b5cd2-9a8c-4e9e-b3b5-d416329d3f2b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95b46e45-235a-4c70-9ee4-feb7c5910257.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1ca0be37-bd53-4618-af2e-6c6ee77dc65f.__CR167,0,2667,3000_PT0_SX200_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/38439e10-271b-4843-9d65-b960b14e0d6e.__CR167,0,2667,3000_PT0_SX200_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a9b3bc2a-7089-4d8e-8d89-32b0da9e8edc.__CR167,0,2667,3000_PT0_SX200_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/83eb5266-b17d-4d9a-b1db-f3c029e424d6.__CR167,0,2667,3000_PT0_SX200_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5219f135-25d1-4bf8-8879-d0dd10a027c2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Angel B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHYEM3ZLCMGVYV7P52WWVWOQSCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYCZHMPDIWZPP?ASIN=B09424YQJR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2022",
                "reviewTitle": "5.0 out of 5 stars Less plastic and it works!",
                "reviewText": "I have medium thickness, slightly wavy hair that is down to my waist and tangles very easily. I get greasy roots, and my ends are very dry and prone to breakage. That being said, I bought this bar shampoo back in September 2021 and have been using it exclusively for at least the last 3 months ( I tried to use up my bottles first so I didn’t start using this exclusively until around November 2021). I start at the roots and suds up my scalp and then squeeze the suds down to the ends of my hair. I rinse and then repeat doing the scalp again due to my oily scalp. This gets my hair super clean and I don’t have to use conditioner except a small amount of leave in on the ends.Sometimes, I don’t even need the leave in conditioner if I am not too vigorous with the lathering. The bar is still going strong as of January 22, 2022. I shampoo my hair about 2-3 times a week this way due to the length of my hair and the dry ends. The bar lasts a long time. It smells wonderful like honey. It lathers well and my hair doesn’t feel too tangled unlike with regular shampoo and even conditioners. I saw Drew Barrymore’s Instagram post showing her hair, which appears to be similar to mine in length and texture. I thought I would try it. I was very surprised. If it helps cut down on plastic, cleans my hair and smells good, it’s a win-win. One thing, when ordering from Amazon they ship it in a big oversized bubble wrap plastic envelope mailer. That kind of defeats the purpose of the packaging that the bar comes in. Next time I will see if I can find it in the store.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ward Family",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEMKBLDB4JJLBAFO3VQ6VIASLKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7DR2Z0ZOBA50?ASIN=B09424YQJR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Good Garnier stuff",
                "reviewText": "I’ve been trying shampoo bars for easier travel/vacation packing, and I have had good experiences with this brand. I was delighted at the ease of use, pleasant and subtle honey-beeswax scent, and how my hair felt after use. I’ll definitely use this and buy it again, and would be curious about other scents and a solid hair conditioner bar, too!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SkylarSkylar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZPQAN6CS7VFNZBRLHWS7KFS7PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ4JJWT7MS9BS?ASIN=B09424YQJR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 12, 2022",
                "reviewTitle": "4.0 out of 5 stars Very Moisturizing",
                "reviewText": "First, let me start with some information about me. I have thick, curly/wavy, long hair that I wash about four times a week. My shampoo before was leaving my curls limp and oily, and I had to wash my hair almost every day because of it, so I decided to try this. It my first shampoo bar, so it did take a transition period for my hair to adjust, but after that, it worked fantastically. It smells amazing and it left my hair clean and soft after washing. The reason I am giving it four stars is because by the time I was whittling the soap down to about the end of its life, it started to crackle and fall apart, as you can see in the attached picture. I got about three months of use with it before this started happening. Other than this, it worked fantastically. Also, I give it four stars because it does not work well in hard water, so if you have hard water you will need to do a rinse with vinegar or be left with waxy feeling hair. For the money, this is a good shampoo bar. Definitely worth a shot if you are new to them and just want to try it out without breaking the bank!",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71kweLWh5DL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patricia Holmes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZWWYFCYF36Q6JRGXD2TE2JB6HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3M1MUMCOHXE80?ASIN=B09424YQJR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Great product",
                "reviewText": "Bought this product originally from a referral. Have used same shampoo from a bottle. The bar is easy to use, lathers even better and makes my hair feel fuller and less weighed down. Have repurchased numerous times and will continue to.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jay W",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH62ZOP3VLTX4M2OP6XMNQ73KSVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NYJGC19YJWZW?ASIN=B09424YQJR",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 16, 2022",
                "reviewTitle": "3.0 out of 5 stars Not awful",
                "reviewText": "I was looking for a lower cost alternative to Hibar. Hibar is the best shampoo bar I’ve tried out of a half dozen or so shampoo bars. The Garnier honey shampoo bar is lighter weight and not as dense as Hibar, so fail there. The Garnier bar had a sickly fragrance so I set it in the garage for a week hoping it would fade a bit. Once unpackaged, used and set in the shower, I could smell the fragrance as soon as I came in the house after being gone all day. It has a semi-natural honey fragrance but a strong synthetic undertone that’s kinda nauseating. If you’re someone who uses fragranced body care, cosmetics, laundry products, cleaning products, etc. you probably will like it. I don’t enjoy smelling like a chemist’s idea of mountain breezes and generally avoid fragranced body care. I guess I thought it would be naturally sourced, my bad.Unfortunately it left a residue and also dried out my hair. I may research Garnier’s other bars to see if they’re fragranced differently or if reviews say it leaves their hair soft, etc. It would be nice to be able to grab a bar shampoo off a shelf at a large retailer. Im stubbornly avoiding plastic packaging as much as possible.But Hibar is where I’ll be spending my shampoo dollars. Please don’t acquire them and ruin the product Loreal!",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Ward",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK64N6ORFDVXT2ARQBDKB3XMQYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U0SVQ89945W9?ASIN=B09424YQJR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Conditioner please! 🙏",
                "reviewText": "I’ve used other more expensive shampoo bars but I have to say, this might be my new fave. Great lather, mild scent, works great on my curly hair. I really hope Garnier will make a conditioner bar soon!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "carla datri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7NLPNJCSWKABGGNOPYPKBI4GNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NF8STHYGLBQV?ASIN=B09424YQJR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2023",
                "reviewTitle": "5.0 out of 5 stars WONDERFUL!",
                "reviewText": "Love this! Shape is easy to hold. Lathers so easily. Rinses easily. Nice smell. Lasted a long time. Plz make a conditioner bar to go with this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denise",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRA4F4GWSJ3XSVQZOGQNE7KEM4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KLS84N0VOBYJ?ASIN=B09424YQJR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 8, 2023",
                "reviewTitle": "4.0 out of 5 stars 3rd time Purchasing....",
                "reviewText": "Love this bar..the scent not over powering, pretty good lather and makes my hair soft until I rinse it out and i just use leave in condition from the Garnier Whole Blends collection...my only complaint is I wish the bar was bigger.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}