{
    "remaining_requests": 26052,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Biokleen-Clear-Natural-Laundry-Detergent/dp/B001WY7V32",
    "body": {
        "name": "Biokleen Free & Clear Natural Laundry Detergent - 150 Loads - Powder, Concentrated, Eco-Friendly, Plant-Based, No Artificial Fragrance or Preservatives, Free & Clear",
        "price": [
            "5 options from$46.98"
        ],
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Biokleen-Clear-Natural-Laundry-Detergent/dp/B001WY7V32",
        "soldBy": {
            "sellerID": "APJP7F08PY5OY",
            "name": "Cozy Farm",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=APJP7F08PY5OY&asin=B001WY7V32&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B2TM97VV"
        ],
        "asinVariationValues": [
            {
                "asin": "B000CBGATW",
                "variationName": "Style",
                "variationValue": "",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51hb5Qr88QL._SS36_.jpg"
            },
            {
                "asin": "B001WY7V32",
                "variationName": "Style",
                "variationValue": "",
                "price": "$40.11",
                "variationImageURL": "https://m.media-amazon.com/images/I/51Ic+LShyYS._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Ic LShyYS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51bNvNMK47L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oUiKoHGWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OLssgIwBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jR4SWsrbS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mEo2W4rbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411F TG-sJL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Biokleen Store",
            "link": "https://www.amazon.com/stores/Biokleen/page/FA18AB24-2FB9-4FE4-A0B8-EB1D96B97B62?ref_=ast_bln"
        },
        "brand": "Biokleen",
        "merchantInfo": "Cozy Farm",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2772,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 27 - 28."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "POWERFUL LAUNDRY CLEANER: Mineral-based cleaning agents and chlorine-free oxygen bleach remove the toughest stains and odors.",
            "FREE & CLEAR FORMULA: Biokleen Free & Clear uses a hypoallergenic formula that works great in High Efficiency and standard washers, and is gentle on sensitive skin.",
            "ULTRA-CONCENTRATED: Biokleen laundry products are concentrated to reduce packaging, waste and energy.",
            "GET SHARPER LOOKING CLOTHES: Lighten whites and brighten colors with the stain fighting power of oxygen bleach. It rinses clean with no residue on fabrics.",
            "MADE IN THE USA: We use biodegradable ingredients, never test on animals, and are manufactured in the USA with US and imported parts"
        ],
        "description": "Whitens and brightens whites and colors with the stain fighting power of Oxygen Bleach. Plant-based surfactants and extracts of citrus and grapefruit seed help remove tough stains and odors. Rinses clean and leaves no harsh fumes or residue on fabrics.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Laundry",
                "link": "https://www.amazon.com/Laundry-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15356111"
            },
            {
                "name": "Laundry Detergent",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17572415011"
            },
            {
                "name": "Powder Detergent",
                "link": "https://www.amazon.com/Powder-Laundry-Detergent/b/ref=dp_bc_aui_C_5?ie=UTF8&node=15342921"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 16 x 10 x 8.5 inches; 10 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ B00043"
            },
            {
                "name": "Department ‏",
                "value": "‎ Laundry Care"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ March 18, 2009"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Biokleen"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B001WY7V32"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#25,601 in Health & Household (See Top 100 in Health & Household) #35 in Powder Laundry Detergent #2,555 in Sales & Deals"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,772 ratings"
            },
            {
                "name": "Brand",
                "value": "Biokleen"
            },
            {
                "name": "Item Form",
                "value": "Powder"
            },
            {
                "name": "Scent",
                "value": "Free & Clear"
            },
            {
                "name": "Unit Count",
                "value": "150.0 Count"
            },
            {
                "name": "Material Type Free",
                "value": "Phosphate, chlorine, ammonia, petroleum solvents, butyl, glycol ether, brighteners, SLS or SLES, EDTA or DEA priority pollutants. No materials listed by the ACGIH as hazardous. See more"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2bee0502-1b4f-4a11-b1e6-6c68615a35d6.__CR0,366,3000,928_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f673e00-4d39-48ea-b19b-6a632faf4e80.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5fc0a792-7b91-42cb-a390-4c5d38d7e87e.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9b7e85c7-bb5f-41d3-8000-6e5433873bc2.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b8e1c880-e306-4d28-b6f8-a2cac8054538.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f891b714-ff70-42c3-a582-19e04bbec1b1.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e5b4680e-af34-4df2-b46a-0aa3717bd45e.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4e7ec07a-802b-4885-b124-c6006e392954.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/376e282c-4013-4ad2-9e37-d7e25f6b0300.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mr. Shelby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBE6XF37I3YETCWU7RP2Y6F7VTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31HG2HICCY6XQ?ASIN=B001WY7V32",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 2, 2023",
                "reviewTitle": "5.0 out of 5 stars A Gentle, Eco-Friendly Powerhouse for a Clean and Fresh Wardrobe",
                "reviewText": "As someone who values both the environment and the well-being of my family, I am absolutely delighted to share my experience with Biokleen Free & Clear Natural Laundry Detergent. This remarkable product not only delivers exceptional cleaning performance but also champions eco-friendliness and skin sensitivity, making it a truly outstanding choice for my household.The effectiveness of Biokleen Free & Clear in removing stains and grime from my clothes has been nothing short of impressive. Its plant-based, enzyme-powered formula cuts through even the toughest stains, leaving my garments looking pristine and smelling fresh. What's more, this detergent works wonders in both hot and cold water settings and is compatible with high-efficiency washing machines, making it a versatile addition to my laundry routine.As someone with sensitive skin, I cannot emphasize enough how much I appreciate Biokleen Free & Clear's gentle formula. Free of fragrances, dyes, and harsh chemicals, this detergent has been a game-changer for my family, as it cleans our clothes without causing irritation or allergies. It's a relief to know that I can trust Biokleen to care for my family's skin as well as our wardrobe.Biokleen's commitment to environmental responsibility is evident in every aspect of their Free & Clear detergent. The concentrated formula ensures that a little goes a long way, reducing both packaging waste and the need for frequent repurchasing. Moreover, the detergent is biodegradable and free of phosphates, chlorine, and other harmful chemicals, minimizing its impact on aquatic ecosystems. It feels good to know that my laundry choices are not only benefiting my family but also contributing to a cleaner, greener planet.Finally, I would like to acknowledge the outstanding customer service and support offered by Biokleen. Their dedication to customer satisfaction and their wealth of information on eco-friendly living make them a truly remarkable brand that I am proud to support.In conclusion, Biokleen Free & Clear Natural Laundry Detergent has surpassed all my expectations, delivering exceptional cleaning performance while remaining gentle on our skin and the environment. If you're seeking a reliable, eco-friendly, and skin-sensitive detergent, look no further than Biokleen Free & Clear - it truly is a laundry game-changer.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Urso",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEI3Y7YXG5HIXELRMNXYANXD7QXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34ZKSZRDMDS7C?ASIN=B001WY7V32",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2020",
                "reviewTitle": "5.0 out of 5 stars non-toxic and gets cloth diapers clean (needs water conditioner for hard water)",
                "reviewText": "Most \"eco-detergents\" receive a grade C or D from the the Environmental Working Group (this includes 7th Generation, Ecos, and most others) OR they don't work very well. Two exceptions are Bio-Kleen and Planet which both receive a grade of A AND actually work. I find that Bio-Kleen powder is slightly better at getting things clean than Planet, but I use both because we have a HE washer and Bio-Kleen foams/suds if you use too much. Planet is specifically formulated for HE so doesn't make suds.The real test for eco-detergents is cloth diapering in hard water. I've been using the following regimen for about a year in my mountain well water, with high levels of calcium and magnesium salts, with good success - absolutely no rashes, no ammonia, no barnyard smell - my cotton prefolds and hemp inserts come out clean as a whistle. I also use organic coconut oil on baby's bottom with most changes, and lanolized wool covers, so this washing strategy also works to get those oils out of the cotton and hemp.(Note for hard water: If you want to use a non-toxic, eco-detergent and you have hard water (80-90% of the USA has hard water) you will need to add in some kind of hard water treatment to your wash. The only kinds that work in the long-run are non-precipitating water conditioners: Sodium tripolyphosphate (STTP) 1/2 - 2 tbsp per load* in a front loader; or EDTA (calcium disodium EDTA), or Charlie's Booster & Hard Water Treatment (potassium diphosphate). AND/OR, this is something I've been playing with - adding 1/2 - 1 cup vinegar, or 10% citric acid solution** in the rinse compartment which dissolves mineral deposits and softens fabric naturally. I am not sure if vinegar or citric acid rinses alone will control the hard water deposits but it seems to be enough for some people, I suspect their water isn't extremely hard. Some people like Calgon as a water softener, but it wasn't a miracle for me - I'm not 100% sure how well the new formulation works - it contains zeolites and some synthetic polymer with an unclear safety profile ... Be aware that borax and washing soda are sold as water softeners, but they actually precipitate mineral salts onto your fabrics unless they are used with non-precipitating water softeners as mentioned above. The other problem with borax is that it's toxic to humans, not just ants.)*STTP and EDTA are non-toxic, and are even approved for use as food additives**10% citric acid solution is easy to make by adding 100 g granulated citric cid per liter of water, I make a gallon at a time.Here is what I do, with high water hardness, in my mediocre Samsung HE front loading washer, for a load that fills up 2/3 of the washer:1) Pre-soak prefolds and inserts in hot water in several 5 gallon buckets for 1 - 2 hours: 1/2 scoop biokleen + 1/8 cup washing soda (alkaline) + 1 tbsp STTP per bucket. This cuts through oils and removes mineral build-up on fibers. It also removes stains. And the STTP softens the water to prevent and remove mineral deposits. Dump the water after soaking, and do a spin only load in the washer to remove excess liquid.2) Then light wash on warm water with extra rinse: to remove remaining poo + urine, with 1/2 to 1 scoop biokleen + 1 tbsp STTP3) Then heavy duty hot wash + extra rinse: with 1-1.5 scoop biokleen + 1 tbsp STTP4) Final warm water light wash with extra rinse: to remove residual detergent and alkali residue to assure baby's sensitive skin doesn't react. I add 1 cup vinegar or 1/2 cup citric acid solution to this (in the detergent slot), which helps remove hard water mineral buildup and makes sure the pH of the diapers is back to neutral or just slightly acidic which human skin does fine with.This is a fair bit of work - wish I had an old-fashioned non HE washer, or a better HE one. But the truth is that most HE washers don't use enough water to effectively wash / rinse in cloth diapering situations. I know Fluff Love University says don't do extra rinses, but that is rubbish. I experimented with leaving out the final rinse a few times and that is the only time that a contact rash began to appear on baby's bottom. It went away immediately when I added the extra rinse back in. My background is chemistry, and the way this works is \"dynamic equilibrium\" - as long as you take steps to keep the mineral deposits in check, you can do some extra rinses without creating more of a mineral build-up on the fibers in the long run.If you ever need to strip your diapers, I'd recommend first soaking in a very strong de-greaser like dawn in very hot water for 4-6 hours (I do it in a big cooler to keep it hot), and agitating with a plunger (NOT in your front loader! - use a bathtub or big bucket instead), you can also add some enzymes like Bac-Out which helps too. This gets rid of oily or greasy residues and organic gunk. And, then follow this with either a vinegar or citric acid soak in very hot water for 4-6 hours. This removes the hard water mineral deposits and soap scum residues. If you have soft water, normal stripping regimens will probably work fine - I don't think there would be much benefit from the acid soak.Hope this is useful. It took some trial and error to figure it out.",
                "reviewVotes": "173 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFF562Z74D46CQ56CA2SGC5WKHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GNFL9U0L647S?ASIN=B001WY7V32",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 16, 2023",
                "reviewTitle": "5.0 out of 5 stars It has been working great",
                "reviewText": "So far, I have been using this for over a month and I'm impressed with its performance. There is a \"clean\" smell to the powder, but no actual scent on my clean laundry, which is what I like. I used to use the Arm and Hammer unscented powder, but I couldn't find it anywhere so I decided to try this. I will probably use this from now on. My clothes are clean, they do not smell like perfume, they just smell like clothes. It even works well on dog blankets and other hairy, stinky stuff, and it does remove stains. After reading some other reviews, I do dissolve a scoop into a jar of hot water if I am washing my clothes on cold. Other people have reported a residue on their clean clothes, but I have never had this occur, either with washing with hot or cold water. I do tend to have my washer rinse my clothes twice to ensure all detergent and animal hair has been thoroughly flushed out. The scooper is about 2-3 tablespoons and one scoop will clean a large load in my front loader.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRR4RQIU74VRFW6K2NV3COGE5RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8MX1CH5K7PQW?ASIN=B001WY7V32",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 8, 2023",
                "reviewTitle": "4.0 out of 5 stars Work well, but...",
                "reviewText": "It cleans well. However, I find that it tends to clump up in our detergent drawer. Not sure if we are putting too much power or our washer does not flush the drawer with enough water. Either way, it is less than ideal.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Annie Skarie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAMV5RLHBYTFUH2BWYFHAWED7UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCCUYLS0LINHR?ASIN=B001WY7V32",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 8, 2023",
                "reviewTitle": "5.0 out of 5 stars It's FREE of everything bad for me & the environment",
                "reviewText": "Bought this after reading a post on Pinterest. I use to make my own laundry detergent, but read that the ingredients I was using weren't all that safe. It also said that if you wanted to get something safe & effective to get Biokleen - so I did. I really like the product, plus I like the fact that it's plant-based & free & clear of any harmful chemicals. Next time I order I want to try the sheets. I'm one of those who makes their own cleaning products or buys products that are natural. This laundry powder is right up my alley.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$40.13",
                "sellerName": "I Buy Direct",
                "sellerRating": "4"
            }
        ]
    }
}