{
    "remaining_requests": 25818,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Soulink-Laundry-Detergent-lavender-Apartments/dp/B0BMZZGC7K",
    "body": {
        "name": "Soulink Lavender Laundry Detergent Sheets, 240 Loads - Eco-Friendly, Plant-Based, Hypoallergenic, No Plastic Jug",
        "price": "$16.19$16.19 ($0.07$0.07 / load) $15.29$15.29 ($0.06$0.06 / load)",
        "originalPrice": "",
        "rawPrice": 16.19,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Soulink-Laundry-Detergent-lavender-Apartments/dp/B0BMZZGC7K",
        "soldBy": {
            "sellerID": "AA6C6ESZW1YT7",
            "name": "SOULINK",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AA6C6ESZW1YT7&asin=B0BMZZGC7K&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CDPT84LN"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CCJGZDB8",
                "variationName": "Scent",
                "variationValue": "Fresh Linen",
                "price": "$17.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BMZZGC7K",
                "variationName": "Scent",
                "variationValue": "Lavender",
                "price": "$17.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CCJJBS12",
                "variationName": "Scent",
                "variationValue": "Unscented",
                "price": "$16.69",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "Save an extra 5% on your first Subscribe and Save order.",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51WoxTlEGuL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51g5DZw7PaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51l6VhlXJOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KytqGQvPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-Xxt6hUzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ClveAl xL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517pM4ZFCqL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Soulink Store",
            "link": "https://www.amazon.com/stores/Soulink/page/45EE7FC1-704C-4B98-8C43-4C5460EF2D6A?ref_=ast_bln"
        },
        "brand": "Soulink",
        "merchantInfo": "SOULINK",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 560,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 7 hrs 35 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Compact by Design (Certified by Amazon) products remove excess air and water, which reduces the carbon footprint of shipping and packaging."
        },
        "features": [
            "Ultra-cleaning Power - Soulink laundry detergent sheets are made from high quality Materials for stronger cleaning power. Each detergent strips contains surfactants and enzymes, which dissolve easily and completely without leaving any residue on the clothes. It can easily various stains like oil, red wine, blood, and coffee from your clothes. What’s more, the laundry sheets can be used for any machines included HE and work with cold & warm water.",
            "Plant-based Ingredients - Our laundry detergent sheets are added with natural plant ingredients, with a mild smell and the aroma of plants can make you relax. Paraben-free, phosphate free, bleach free, dye-free. Safe for sensitive skin and baby.",
            "Eco Friendly - Soulink use greener laundry detergent sheets, both in terms of ingredients and packaging . All ingredients of Soulink are environmentally friendly. Our packaging uses no plastic jug, more lighter and more convenient to carry. Use biodegradable packaging to reduce carbon emissions!",
            "Space Saving - Great cleaning power in one small package. Our soap sheets can perform as well as the leading detergents on the market when washing. The liquidlese design makes washing more convenient. Just follow the instructions and put in the detergent strips you need. No mess, lightweight and easy to carry, and perfect for when you're traveling.",
            "Our Mission - Making life easy！Our pursuit is to make cleaning convenient and life simple. All packaging and ingredients of Soulink laundry detergent sheets are eco-friendly. When you buy soulink products, you are also contributing to the reduction of ecological pollution and the protection of the earth. Now, join us!"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Laundry",
                "link": "https://www.amazon.com/Laundry-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15356111"
            },
            {
                "name": "Laundry Detergent",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17572415011"
            },
            {
                "name": "Liquid Detergent",
                "link": "https://www.amazon.com/Liquid-Laundry-Detergent/b/ref=dp_bc_aui_C_5?ie=UTF8&node=15342931"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 6 x 5 x 5 inches; 1.15 Pounds"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ November 21, 2022"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Soulink"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0BMZZGC7K"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,118 in Health & Household (See Top 100 in Health & Household) #125 in Liquid Laundry Detergent #1,717 in Climate Pledge Friendly: Health and Household"
            },
            {
                "name": "#1,717 in Climate Pledge Friendly",
                "value": "Health and Household"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 560 ratings"
            },
            {
                "name": "Brand",
                "value": "Soulink"
            },
            {
                "name": "Item Form",
                "value": "Sheet"
            },
            {
                "name": "Scent",
                "value": "Lavender"
            },
            {
                "name": "Unit Count",
                "value": "240.0 Count"
            },
            {
                "name": "Material Type Free",
                "value": "Dye Free"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Choose Soulink Laundry Detergent Sheets! Fastly Dissolve Using high quality ingredients, soulink laundry sheets dissolve quickly and leave no residue on your clothes. Simple to use, making your clean easy! Deep Cleaning Cleans clothes with surfactants and enzymes, easily cleaning various stains. It cleans clothes better and also protects clothes and fixes colors. Perfect for sensitive skin Soulink laundry detergent sheets are infused with botanical ingredients and have a mild and fragrant scent that helps to relieve stress. Compact Packaging With a compact design, products require less packaging, can be transported more efficiently, and lower carbon footprint.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/84e1451a-f7ca-4b56-913e-a3636d83e560.__CR0,0,300,225_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a7fed809-edfd-4160-9c0e-be36b0f86645.__CR0,0,300,225_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c01ce5ea-b633-42af-9143-6619e125add8.__CR0,0,300,225_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4ff81b27-c210-4827-85ee-76e94ca04a60.__CR0,0,300,225_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Are your laundry sheets tested on animals? Absolutely not. Soulink is committed to not experimenting on animals, we love the earth, we love life. This is not what we set out to do. Why do Soulink laundry detergent sheets reduce carbon emissions? We do not use any plastic in our products. For packaging, we use recyclable virgin pulp material. Please note: This packaging is degradable within 60 days. About the dosage of laundry sheets? The dosages provided by soulink are for reference only and are based on actual conditions. If your clothes are dirty, we recommend you to add more laundry sheets for better cleaning power.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1d5a1449-0cbc-4bf0-a5f6-c21a7b7df205.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b5bbf353-7277-440a-8884-25172eb163be.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce7e67e4-00a7-4af5-b0b3-822035d194b7.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/84e1451a-f7ca-4b56-913e-a3636d83e560.__CR0,0,300,225_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a7fed809-edfd-4160-9c0e-be36b0f86645.__CR0,0,300,225_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c01ce5ea-b633-42af-9143-6619e125add8.__CR0,0,300,225_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4ff81b27-c210-4827-85ee-76e94ca04a60.__CR0,0,300,225_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7db26bc-11b4-4faf-bec0-993c066dbbfc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Derrick D. Powell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3PQCSXPDPX4RRLV2HFTL7IY2NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YS59VLIRAP4J?ASIN=B0BMZZGC7K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars The Future of Laundering Is Here!",
                "reviewText": "Soulink Lavender Laundry Detergent Sheets are a game-changer in the world of laundry care. These innovative sheets offer a convenient and effective way to clean your clothes while leaving them smelling fresh and feeling soft. I can confidently say that these detergent sheets have revolutionized my laundry routine. One of the standout features of Soulink Lavender Laundry Detergent Sheets is their convenience. Gone are the days of measuring out liquid or powder detergents. These sheets are pre-measured and ready to use, making laundry a breeze. Simply toss a sheet into the washing machine with your clothes, and you're good to go. No more spills, no more mess, just effortless cleaning. Despite their compact size, these detergent sheets pack a powerful punch. They effectively remove stains, dirt, and odors from my clothes, leaving them looking and smelling fresh. The lavender scent is absolutely delightful and adds a touch of relaxation to the laundry process. It's not overpowering but leaves a subtle, pleasant fragrance on the clothes that lasts. Another impressive aspect of Soulink Lavender Laundry Detergent Sheets is their eco-friendly nature. These sheets are biodegradable and free from harsh chemicals, making them a great choice for those who are conscious of their environmental impact. I appreciate that I can achieve clean and fresh laundry without compromising on sustainability. The quality of the detergent sheets is exceptional. They dissolve quickly in the wash, leaving no residue or clumps behind. I have noticed that my clothes feel softer and more comfortable after using these sheets, which is an added bonus. The gentle formula is suitable for all types of fabrics, including delicate items, ensuring that my clothes are well-cared for. Lastly, the value for money with Soulink Lavender Laundry Detergent Sheets is outstanding. Each pack contains a generous number of sheets that last for multiple loads of laundry. I find that I can stretch out the use of each sheet by tearing it in half for smaller loads, making them even more cost-effective. In conclusion, Soulink Lavender Laundry Detergent Sheets are a game-changer in the laundry care industry. Their convenience, effectiveness, and eco-friendly nature make them a standout product. Say goodbye to messy liquid or powder detergents and hello to effortless, fresh laundry. I highly recommend giving these detergent sheets a try and experiencing the difference for yourself.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "patricia k swider",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVXCYIOSFOOFJNIX5D3LRW2IC7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37RH4NJFIV8MZ?ASIN=B0BMZZGC7K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars works well I think.",
                "reviewText": "Aroma is not too strong at all. They do not make much suds, but the laundry seems to come out clean & fresh. This was the 2nd time I have bought this item. I like it over all. Sure cuts down on plastic to recycle!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQXDIQ7WAEUEQWU5VUVIZKQ2AIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3YYDMMTWBRFK?ASIN=B0BMZZGC7K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars They work. Light weight, easy to use. No big plastic jug.",
                "reviewText": "It's very convenient being able to order these. Very compact and light weight. The packaging is small and is not a huge, heavy plastic jug. I use one sheet for load that is mildly dirty, or two for dirtier loads. In summer I wash most loads in cold water, in winter I use warm. My water is on a purifier for well water, which I think also helps with cleaning. I don't use fabric softener. These work fine for me. The scent does not persist but isn't really needed anywayFor people who want to reduce using plastic and reduce shipping of a heavy jug that mostly contains water anyway, I think these are a good option. They are also easier than pouring out of a jug, and no spills for an older, sometimes clumsy person like me.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sandy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6YIPMDYGOJTTQKZUK3VSOFPMLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17U6FKFW836O0?ASIN=B0BMZZGC7K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Environmentally friendly",
                "reviewText": "No more big plastic bottles! Cleans just as well as Tide or All. Box recycles. Usually put 2 in unless small load then I use 1. Works just fine! Clothes are clean.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pamela H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2DGZ6TRPHYLR25WQICO24UPYPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R339UN12Z25CM1?ASIN=B0BMZZGC7K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Reasonably price Great scent.",
                "reviewText": "I decided to try and buy SHEET LAUNDRY detergent to save plastic waste. It is scary to see plastic bottles floating in the oceans. This is the first Laundry Sheets I have ever purchased.1)I was really impressed by this product. It came in a small box that is great for storage. It would be great for anybody limited on space. Rv's, efficiencies vacations etc.2)The scent is mild but pleasant. I do smell it on my clothes faintly when I wear the clothes. It is not overpowering.3) I am a messy person. I like cooking and it is not unusual for me to get my clothes greasy or stained. I had a white tank top that had many various stains on it. Every stain came out but the rust from my caste iron skillets and some very dark oil. It cleans well. All my regular clothes come out clean.4) They don't suds, but you will see the water getting dirtier.5) They dissolve quickly. I hold them in my hand on a rop loading machine and they dissolve in seconds. I am not sure personally how the world dissolve in a front loader but I am sure it will work on top loaders because most of them have wather running through them.6) They are gentle on my clothes and don't make me itch. ( I am nor allergic but some protects cause me to itch.)6) As I am on a fixed income, I searched for the most economical product on Amazon..This is the lowest price I found for a QUALITY product.7) NOTICE: These sheets DO HAVE perforations to split each one in two pieces. They are not easily visible. If you take the upper to edge and pull gently it will tear in two equal sheets.8)Each sheet is made for one SMALL LOAD. I use 1.5 sheets for a full top loader. I full sheet for medium sized loads. If the clothing is dirty or smelly, I add a 1/2 sheet more on large loads ( total of 2 sheets.)All in All I am pleased with this product. I plan on buying them from now on. I am pretty traditional,so it is not common for me to stray from.life long habits. Realizing that WE ALL have to do our part to keep the planet safe for the next generation. I was using \"Pod\" products. They do reduce except for the heavy plastic they are packaged in. I can recycle the cardboard this comes in right into my garden. That is a plus!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bethlynn05",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKPRTKF6ZMGVZZL6EP6GA4FWW2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DARMLKX37OZE?ASIN=B0BMZZGC7K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Great product!",
                "reviewText": "Love these! I'm so glad I chose these as my first laundry detergent sheet. They dissolve quickly and easily in all temps of water. I haven't noticed residue or color changes. I wear a lot of black for work and so far no signs of residue! The fragrance is light and clean (fresh linen) for large heavily soiled loads I use 3 sheets. I haven't tried less, but I have just followed previous comments.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Ginn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTIHT7HUSQENTQ4HDOEXULE5C2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W440HI6T4UEO?ASIN=B0BMZZGC7K",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 26, 2023",
                "reviewTitle": "3.0 out of 5 stars Clothes does not smell like lavender.",
                "reviewText": "Clothes do not smell like the product lavender scent. Not sure if they are very clean.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lori irvin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 18, 2024",
                "reviewTitle": "Amazing",
                "reviewText": "The detergent is amazing . I was doubtful but it works I’ll definitely will purchase again in the future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 19, 2024",
                "reviewTitle": "Waxy residue and smells synthetic",
                "reviewText": "Smells highly synthetic. Not even close to lavender. Doesn’t dissolve in HE cold wash, just warm wash. I used the sheets based on the weight of laundry as advised & it did not clean well. It removed some stains, but the laundry smelled terrible after the wash (I have never had this issue with other detergents). Don’t recommend these.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas Wolf",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 7, 2024",
                "reviewTitle": "Does not clean. Unless you use 4-5 sheets",
                "reviewText": "I have a top loader and unless I use 4-5 full sheets (not half sheets) the water does not get soapy enough and the clothes do not get clean.And the clothes aren’t even that soiled/dirty - not talking about grease or oil stainsI will not buy again.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}