{
    "remaining_requests": 28547,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Smoke-Mirrors-Savini-Collectors-Blu-ray/dp/B0B432KS3P",
    "body": {
        "name": "Smoke And Mirrors: The Story Of Tom Savini",
        "price": "$15.30",
        "originalPrice": "$24.95",
        "rawPrice": 15.3,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Smoke-Mirrors-Savini-Collectors-Blu-ray/dp/B0B432KS3P",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/517ShOaETaL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Tom Savini",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_dvd_1?ie=UTF8&search-alias=movies-tv&field-keywords=Tom+Savini"
        },
        "brand": "Tom Savini",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 82,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 2 hrs 16 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Product Description THE STORY OF ONE OF THE MOST ICONIC SPECIAL EFFECTS ARTISTS IN HORROR FILM HISTORY, WHOSE CREATIONS EARNED HIM THE TITLE \"THE KING OF SPLATTER.\" The definitive documentary on one of the most iconic and sought after special effects artists in horror film history, whose genre-defining creations earned him the title \"The King of Splatter.\" We follow Savini from his childhood in Pittsburgh and his tour of duty during the Vietnam War, leading into his legendary collaboration with George Romero (Dawn of the Dead, Creepshow) and beyond. Here. Savini is celebrated by his peers, friends and collaborators like Robert Rodriquez, Tom Atkins, Tony Todd, Greg Nicotero and more.Wild Eye Releasing presents this Special Collector's Edition Blu-ray, packed with over four hours of bonus content and features an exclusive slipcase and folded poster!SPECIAL FEATURES: Audio commentary with Tom Savini and director Jason BakerTom's personal behind the scenes video archives: Featuring BTS footage from several classic horror films like Day of the Dead, The Texas Chainsaw Massacre 2, From Dusk Til Dawn, Creepshow, Friday the 13th Part IV, and moreTom's behind the scenes personal video from directing Night of the Living Dead (1990) Excerpts from Tom's personal home moviesExcerpts from Tom's personal video of Dracula - The Stage ShowTrailersBlu-ray Exclusive - Folded posterBlu-ray Exclusive - Illustrated SlipcaseReversible ArtworkOptional English subtitles Review A fascinating glimpse into one of the most iconic special effects make-up artists and filmmakers of our time. It is quite thorough yet never repetitive, as every minute is utterly absorbing. --Film ThreatTom Savini's fire appears impossible to extinguish, and 'Smoke and Mirrors' makes sure everyone can see how brightly that blaze burns. --Culture Crypt",
        "breadCrumbs": [
            {
                "name": "Movies & TV",
                "link": "https://www.amazon.com/movies-tv-dvd-bluray/b?ie=UTF8&node=2625373011"
            },
            {
                "name": "Featured Categories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=2644980011"
            },
            {
                "name": "Blu-ray",
                "link": "https://www.amazon.com/b?ie=UTF8&node=2958935011"
            },
            {
                "name": "Horror",
                "link": "https://www.amazon.com/b?ie=UTF8&node=2959133011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 6.69 x 5.43 x 0.63 inches; 5.92 Ounces"
            },
            {
                "name": "Director ‏",
                "value": "‎ Jason Baker"
            },
            {
                "name": "Media Format ‏",
                "value": "‎ Anamorphic, NTSC, Widescreen"
            },
            {
                "name": "Run time ‏",
                "value": "‎ 1 hour and 31 minutes"
            },
            {
                "name": "Release date ‏",
                "value": "‎ October 11, 2022"
            },
            {
                "name": "Actors ‏",
                "value": "‎ Tom Savini, Robert Rodriguez, Greg Nicotero, Tom Atkins, Alice Cooper"
            },
            {
                "name": "Studio ‏",
                "value": "‎ Wild Eye Releasing"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0B432KS3P"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Number of discs ‏",
                "value": "‎ 1"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#44,765 in Movies & TV (See Top 100 in Movies & TV) #171 in Special Interests (Movies & TV) #1,992 in Horror (Movies & TV)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 82 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "bugman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFB4CQ3S5M7OB7JQWLRCWMJASAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F59XHRW2AQWW?ASIN=B0B432KS3P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 10, 2020",
                "reviewTitle": "5.0 out of 5 stars Magic Man",
                "reviewText": "Smoke and Mirrors: The Story of Tom Savini (2015). Before I say anything, it's important to lay all my cards on the table. I have had two experiences with Tom Savini, one in 1993, the other in 2004. In each instance, he totally ignored me as I was purchasing an item from his table and getting it signed, in both instances I was simply trying to say something complimentary and move on. But his eye contact and attention were completely on the ladies both times. Now, I'm not some entitled horror fan who believes that I deserve the full attention of an individual for excessive amounts of time. But I do believe it is the grass roots nature of horror that makes it a unique and special community, one where our celebrities, can interact with our fans. Ten seconds of engagement while you write your name in the book I just gave you 25 dollars for is all I ask. This sort of behavior from Mr. Savini has been experienced by many others, as well as kind engagement, so, I know he aint all one thing. Additionally, I've never let these two experiences sour my awareness and appreciation of Savini's genius. He is one of the great FX artists in film...ever. Even if he's been a jerk to me twice. Smoke and Mirrors was an excellent way to at least mitigate some of my feelings, as it really dives deep into Tom's personal life, his experiences and trauma in Vietnam, his relationship with his parents, his siblings, but most especially, his daughters. This latter point really touched me, and I never realized how much Tom gave up in order to be a parent, especially when he received full custody of one of his daughters in the late nineties. Yeah, he might be a loud-mouthed Lothario, but he's also, apparently, a really good dad, a really good parent. He talks a lot about Vietnam and what that did to him, really digging into the ways he came back an emotionally withdrawn shell of a person. Smoke and Mirrors was a really personal exploration of Savini's genius, and it really deepened my impressions of him, and took me a little deeper than what I already knew, what I already thought I knew. Of course there's lots of interviews with folks like Robert Rodriguez, Alice Cooper, Greg Nicotero, Tony Todd, Caroline Williams, and others, but the ones I like best were comments from his daughters. Also features a lot of his best gags from his Romero films, from Maniac, from Prowler, The Burning, and others. Smoke and Mirrors peels back the Grande Illusion just a bit, so we get to see the person, not just the magician.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lewis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCZ54QFQMQXOP6VH5DX6DKKSWUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYI8YB4V436PZ?ASIN=B0B432KS3P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Great movie",
                "reviewText": "Great picture and sound a+++",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MonsterZeroNJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFGVJFUXFZCDNFMHIXRFHREOMDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F4L8CH9RQBQC?ASIN=B0B432KS3P",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2021",
                "reviewTitle": "4.0 out of 5 stars A great documentary about a great horror legend",
                "reviewText": "Wonderful documentary from Jason Baker tells the story of a true legend in the film industry, renown especially for his contributions to the horror genre, Tom Savini. The film tells the story of Savini growing up in a modest income family in Pittsburg and being influenced by his older brothers and his sister. It details his going to horror movies with his mother, seeing The Man With A 1,000 Faces and deciding from there he wanted to be a part of show business and started doing make-up FX and magic as a kid. It takes us to his harrowing time in Viet Nam and his discovery of a love of acting in theater upon his return home. We are told of his first collaboration with George Romero on Martin and then finally the fateful call from Romero to do the make-up FX for the classic Dawn of the Dead. From there we watch his career unfold as an actor, director, one of the greatest make-up FX creators of all time and a legendary genre personality. In between we get a lot of personal details about his life outside the movies and it builds a strong picture of the man behind the make-up.Baker wisely tells the story from the words of the man himself, supporting Savini’s intimate details of his life and work with extensive photos and video from the legend’s personal life, along with behind the scenes and deleted scene footage from both his make-up work and acting roles. We also get interviews and anecdotes from many of those who worked with Savini, including George Romero, Tony Todd, Robert Rodriguez, Tom Atkins, Corey Feldman and even personal details from his daughter, Lia. It’s a must-see documentary about a true giant in the film and horror film worlds, not only for his fans, but anyone interested in a career in film. It’s a story of a man from humble beginnings who overcame a nightmarish experience as a combat photographer in Viet Nam and many personal hardships to become one of the greatest talents and beloved personalities in the movies, not to mention a true horror icon. Very highly recommended.-MonsterZero NJ",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSOUVOL3XLM2S5KF2VQSZ4VA6BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RP5FSHZ6RVTWF?ASIN=B0B432KS3P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Great documentary for avid fans!",
                "reviewText": "As a person who's grown up watching horror movies on weekends & seeing the amazing monsters or makeup effects all while getting freaked out, there was always an intriguing aspect of how it was all done and who was the crazy person that figured it out.Tom Savini is a legend in the horror industry. This documentary gives a great look into his life.Highly recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RAVENOFGEMS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2QUPSJRVBL3D2GW43ZZVPCKNLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I4C9BU4YDUZA?ASIN=B0B432KS3P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2021",
                "reviewTitle": "5.0 out of 5 stars Tom Savini - Horror Fans Love You !!!!",
                "reviewText": "theres not enough time in the day to do all that he does is amazing talent that blows my mind and so many movies here that i really didnt know he did makeup & effects on especially Day of the Dead the guy rips in half at the end so gruesome how he pulled that off dayumm= i mean literally some of the scenes for other movies he did are so believable the sheer pure artformof this guy is friggn amazing",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anthony Kamm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFN6WMQ3ORKQBK6NASCKYW6U5NKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27WO8TZ288J2L?ASIN=B0B432KS3P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2020",
                "reviewTitle": "5.0 out of 5 stars Its an inspiring story",
                "reviewText": "Just watched this documentary on Tom Savini. I met him a few times. He taught one of my classes for a day when I was a film student at his school. I wish I could have met George Romero too when I was a student. If you're into horror films this is a good watch. :)",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ChocloditeLensman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE44BUR4PRHBAGE4D6RJOMHGF3SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRCVH7YDYNOEN?ASIN=B0B432KS3P",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 24, 2023",
                "reviewTitle": "4.0 out of 5 stars Pretty Informative",
                "reviewText": "It’s a decent documentary - savini provides insight on many areas of his professional and personal life - which is somewhat new. My disappointment was less focus on DOTD and Friday 1 - which were his career starters. I was hoping to see / hear some behind the scenes from these movies and it didn’t happen. What the documentary did do was talk about his upbringing and family life - which was really interesting. Savini is a one of a kind talent and his abilities are numerous ! It’s a good documentary to have in the collection but I still like scream greats 1 as my favorite !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colt Lacey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDFDYJWCKXJLYUJ76H33PB3CSSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GXCYWKX29V1G?ASIN=B0B432KS3P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2019",
                "reviewTitle": "5.0 out of 5 stars fantastic",
                "reviewText": "This is a great insight into the life of the legend known as Tom Savini. Great documentary and covers a lot of ground! If you are familiar with his work and have been intrigued by it, check this out.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dianne Boyd",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 16, 2023",
                "reviewTitle": "Loved this",
                "reviewText": "Gave this as a gift and they loved it. Arrived very quickly. Very pleased with this purchase",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 19, 2022",
                "reviewTitle": "Awesome!",
                "reviewText": "Not only is this an excellent documentary, there’s hours of awesome extras on this blu ray!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}