{
    "remaining_requests": 28570,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Black-Mirror-Online-Game-Code/dp/B077SHBG5V",
    "body": {
        "name": "Black Mirror [Online Game Code]",
        "price": "$29.99",
        "originalPrice": "",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Black-Mirror-Online-Game-Code/dp/B077SHBG5V",
        "soldBy": {
            "sellerID": "A3ODHND3J0WMC8",
            "name": "Amazon.com Services LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3ODHND3J0WMC8&asin=B077SHBG5V&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "Available now",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/71 ILgG9qmL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/B1qwETdXLPS.png",
            "https://images-na.ssl-images-amazon.com/images/I/A1 7fkZTwGL.png",
            "https://images-na.ssl-images-amazon.com/images/I/A1k5H3pGYnL.png",
            "https://images-na.ssl-images-amazon.com/images/I/B1qOSZGWSZS.png",
            "https://images-na.ssl-images-amazon.com/images/I/B1scxqpVqkS.png",
            "https://images-na.ssl-images-amazon.com/images/I/B1hOdJtfIgS.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the THQ Nordic Store",
            "link": "https://www.amazon.com/stores/THQNordic/page/497AC039-6FA8-4BEE-9885-B10D8166692C?ref_=ast_bln"
        },
        "brand": "THQNordic",
        "merchantInfo": "Amazon.com Services LLC",
        "customerReview": "3.8 out of 5 stars",
        "customerReviewCount": 5,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Scotland, 1926. Following the suicide of his father, David Gordon visits his ancestral home for the first time in his life.",
            "A life that is soon threatened by the dark secrets that claimed the sanity of many Gordons before him.",
            "A modern re-imagining of the acclaimed gothic-horror adventure series",
            "Interactions with vision-like apparitions which help you learn more about the past of your family"
        ],
        "description": "Scotland, 1926. Following the suicide of his father, David Gordon visits his ancestral home for the first time in his life. A life that is soon threatened by the dark secrets that claimed the sanity of many Gordons before him.Tormented by nightmares and waking dreams for all his life, David fears that it might be his destiny to follow in his father’s footsteps, down a path that leads to madness, and death.Is there really a Curse that has been haunting his family, like his father believed? It is up to David to uncover the horrible truths, buried under generations of silence and fathoms of stone. Black Mirror Castle demands an offering...KEY FEATURESA modern re-imagining of the acclaimed gothic-horror adventure seriesInteractions with vision-like apparitions which help you learn more about the past of your familyEerie atmosphere focusing on the horrors of the mind, in the style of EA Poe and HP LovecraftHigh quality voice acting from a compelling ensemble castTHE STORYDavid Gordon never knew his estranged father particularly well. Still it comes as a shock when he is summoned to his family's ancestral home in the Scottish highlands, after his father has taken his own life there. David does not know much about his father's final weeks, but the circumstances of his death seem more than peculiar. Settling the heritage is merely an excuse for David to find out more about the castle his father grew up in, meeting the family he never knew and for shedding light on the mysteries surrounding his father's death.Tormented by nightmares and waking dreams for all his life, he fears that it might be his destiny to follow in his father's footsteps, down a path that leads to madness and death.Is there really a curse that has been haunting his family for generations as his father believed? Or are the mysteries hidden inside the cold walls of Black Mirror house of a far more wordly nature?It is up to David to uncover the horrible truths, buried under generations of silence and fathoms of stone.ABOUT THE GAMEPLAYLike in the original graphic adventure trilogy, the Gothic Horror genre and its unique atmosphere of madness and psychological distress remains at the heart of Black Mirror. The point-and-click gameplay of the original trilogy served as the basis for the re-imagined gameplay, which focuses on close-up investigation and interaction with nightmarish visions that plague the protagonist of the game David Gordon.ABOUT THE ORIGINAL TRILOGYIn the original adventure trilogy, Samuel Gordon and Darren Michaels search for the truth behind the Curse of the Black Mirror that has haunted the Gordon-family for generations.The acclaimed original trilogy laid the foundation Black Mirror (2017) is built upon.Dense gothic horror atmosphere, rich visual details and a dark story full of characters who are not what they seem to be - the journey of Samuel Gordon and Darren Michaels is as captivating today as it was when the games were first released.PC Minimum System Requirements:PC Recommended System Requirements:Processor: Intel Q9650 / AMD Phenom II X4 940RAM: 8 GB RAMHard Disk: 11 GB available spaceVideo Card: GeForce GTX660 / Radeon 7870 - 2GB VRAMSupported OS: Windows 10, Windows 8.1, Windows 8, Windows 7Processor: Intel Core i7 3770 3,9 Ghz / AMD FX-8350 4 GHzRAM: 8 GB RAMHard Disk: 11 GB available spaceVideo Card: GeForce GTX960 / Radeon R9 290 - 4GB VRAMMac Minimum System Requirements:Mac Recommended System Requirements:Processor: Intel Core i5 3,2 GhzRAM: 8 GB RAMHard Disk: 11 GB available spaceVideo Card: HD7950 Mac Edition / GTX 680 Mac / R9 M370X (dedicated 2 GB VRAM)Supported OS: Mac OS Sierra 10.12, Mac El Capitan 10.11Processor: Intel Core i5 3,2 GhzRAM: 8 GB RAMHard Disk: HD7950 Mac Edition / GTX 680 Mac / R9 M370X (dedicated 2 GB VRAM)Video Card: 11 GB available space",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b/ref=dp_bc_aui_C_2?ie=UTF8&node=229575"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN",
                "value": "B077SHBG5V"
            },
            {
                "name": "Release date",
                "value": "November 28, 2017"
            },
            {
                "name": "Customer Reviews",
                "value": "3.8 3.8 out of 5 stars 5 ratings 3.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#133,544 in Video Games (See Top 100 in Video Games) #5,149 in Mac Games & Accessories #36,153 in PC Games & Accessories"
            },
            {
                "name": "Countries",
                "value": ""
            },
            {
                "name": "Return Policy",
                "value": "This product is non-returnable and non-refundable."
            },
            {
                "name": "Terms of Use",
                "value": "By placing your order, you agree to our Games and Software Terms of Use."
            },
            {
                "name": "Type of item",
                "value": "Software Download"
            },
            {
                "name": "Rated",
                "value": "Mature"
            },
            {
                "name": "Date First Available",
                "value": "November 28, 2017"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Valerie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERUL42XBJJYUVBQIYYWOEFYBG7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCIQ7IGOMYFXX?ASIN=B077SHBG5V",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 22, 2018",
                "reviewTitle": "1.0 out of 5 stars Game launches then quits immediately after loading screen",
                "reviewText": "Followed instructions and downloaded game to steam, which took two hours. Then when I tried to play it the loading screen loads then the game automatically quits every time. Have uninstalled and reinstalled three times with same issue. Cannot find a way to get refund.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marion Köhler",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 20, 2023",
                "reviewTitle": "Über Steam nicht spielbar.",
                "reviewText": "Steam installiert, kann aber nicht geladen werden. Kontakt mit dortigen Kundenservice seit 6 Wochen. Bisher spielen nicht möglich.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bibbi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 27, 2017",
                "reviewTitle": "rausgeschmissenens Geld",
                "reviewText": "Kenne Black Mirror aus Windowszeiten als der erste Teil rauskam. Wollte es nun für den Mac streamen. Das war auch soweit kein Problem, allerdings ist der Spielablauf so huckelig und die Sprachausgabe erinnert an eine gesprungene LP so das man definitiv nicht von einen Spielspass sprechen kann. Keine Kaufempfehlung",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}