{
    "remaining_requests": 28557,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Game-Insight-UAB-Mirrors-Albion/dp/B00FVVR2ZO",
    "body": {
        "name": "",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://mirrors of albion/dp/B00FVVR2ZO",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "",
        "images": "",
        "imagesCount": "",
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Game Insight UAB&search-type=ss",
            "link": "https://mirrors of albion/gp/search?index=mobile-apps&field-brandtextbin=Game+Insight+UAB&search-type=ss"
        },
        "brand": "Game Insight UAB&search-type=ss",
        "merchantInfo": "",
        "customerReview": "3.2 out of 5",
        "customerReviewCount": 6146,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [],
        "productInformation": [],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Martha E. Rice",
                "reviewerLink": "https://mirrors of albion/gp/profile/amzn1.account.AHHDJ5D7YIGQ3BIV7UZNWWTZOM4A/ref=cm_cr_dp_d_gw_tr?ie=UTF8&contextId=masrwMedleyDesktop",
                "reviewLink": "https://mirrors of albion/gp/customer-reviews/R2H0BKHQR7OU22/ref=cm_cr_dp_d_rvw_ttl?ie=UTF8&ASIN=B00FVVR2ZO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 31, 2014",
                "reviewTitle": "5.0 out of 5 stars Very creative",
                "reviewText": "Mirrors of Albion is a fun HOG, unlike many other ones I have played. You have goals to meet and they tell you which locations will help you fulfill those goals. Each location has several modes it can be in: words, silhouette, nighttime. They can also have one of the following anomalies associated with it: lightning - which takes away a letter each time it goes off, ghost - which has a special magnifying glass that can see invisible objects, bubbles- which makes the location look as if you are seeing it through water, and fog - which disperses as you run your finger along the screen. You can get rid of these anomalies before searching a location as long as you have the appropriate tool.I have only gotten to level 16, but so far am enjoying the game very much and highly recommend it.There is one problem: it does allow you to make in-app purchases, so if you are not a very patient person, it could wind up costing you a lot of money to progress more quickly through the game.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debbie C.",
                "reviewerLink": "https://mirrors of albion/gp/profile/amzn1.account.AFLKUJDKO3FHOBXLARYMOSNPR6YA/ref=cm_cr_dp_d_gw_tr?ie=UTF8&contextId=masrwMedleyDesktop",
                "reviewLink": "https://mirrors of albion/gp/customer-reviews/R2Q44NX0YYTMO/ref=cm_cr_dp_d_rvw_ttl?ie=UTF8&ASIN=B00FVVR2ZO",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 19, 2016",
                "reviewTitle": "1.0 out of 5 stars This game is obviously SPAM OR MALWARE!! DO NOT BUY IT UNLESS YOU NEVER WANT TO GET RID OF IT.",
                "reviewText": "I tried this game because I like hidden object games, but was disappointed in how long it takes to advance in the game. You just do 1-3 rooms over and over and though I played for a long time, never advanced. It's frustrating to see that the game has a lot of \"story\" but that you have to play repetitive activities over and over and don't advance.THEN, I found that my fire would be slow a lot and when I would look, the game was \"updating.\" This would go on for ages and I could hardly do anything on the fire because of it. There is no way to cancel an update so I was stuck. Both of these situations made me remove the game from my fire.THEN, Every once in a while I would notify my fire was really slow again. When I checked the notifications, I would see that the game was \"Installing\" of it's own accord. I had not downloaded it again and it was installing without my permission. Again it wouldn't let me cancel it. This made me angry that the game would install itself. So, I went to my app page on Amazon and deleted the game completely from my account, so it was like I had never bought it. It is currently trying to install itself again and this is the second time since I deleted it.This game is obviously SPAM OR MALWARE!! DO NOT BUY IT UNLESS YOU NEVER WANT TO GET RID OF IT.If anyone knows how to get rid of it, please let me know!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hugo Medeiros",
                "reviewerLink": "https://mirrors of albion/gp/profile/amzn1.account.AGQDAYD5N33YYJZBCXVQ7N7VH7YQ/ref=cm_cr_dp_d_gw_tr?ie=UTF8&contextId=masrwMedleyDesktop",
                "reviewLink": "https://mirrors of albion/gp/customer-reviews/R1EY5MQ02WPJMS/ref=cm_cr_dp_d_rvw_ttl?ie=UTF8&ASIN=B00FVVR2ZO",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 11, 2014",
                "reviewTitle": "2.0 out of 5 stars Decent HOG which I don't like",
                "reviewText": "If you like Hidden Object Games Mirrors of Albion (MoA onwards) is a technically competent choice. Maybe too well designed... Free if you want, with possibility to speed up progress via in app purchases and/ or friends: the usual model. I prefer another HOG named Secret Society: Mystery of the Seekers (gave it 3stars).MoA has very good graphics, with cartoonish colors and themes yet almost realistic drawings (slightly caricatured). The characters' design is smart, both clearly aimed at children/ teens and often suggestive of celebrities which should appeal to adults. The map of search locations is a London map where you see characters roam the streets - tap to interact. The animations are overall quite pleasing - it feels alive.But it doesn't engage me. The fantastic requests and the numerous arrests required are a constant reminder this is just a grind. An upside for me is that when you solve a picture, you don't just get random drops - you also get a score. Scoring tip: look around in the start to find all the initial objects and try to memorize other objects' positions, only then start tapping - the score multiplies if you find everything almost at same time. If you are competitive reaching for higher scores against your friends should be appealing.MoA also feels unrewarding to me. Your energy is quite low, the drops are very random, the frequency that locations are \"cursed\" is high, many time limited quests... It's clearly oriented toward getting you to go spend real money getting the aids, or the talismans, or the objects you need… but of course, even if you do, there's always the next goal… It's not a pay wall, but many pay bumps. Not for me, but you can just try it yourself.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BanaBabe",
                "reviewerLink": "https://mirrors of albion/gp/profile/amzn1.account.AGI4OOLQVEGH3JBQCUET3OBTDLVA/ref=cm_cr_dp_d_gw_tr?ie=UTF8&contextId=masrwMedleyDesktop",
                "reviewLink": "https://mirrors of albion/gp/customer-reviews/R1STPY4I5K8ZY2/ref=cm_cr_dp_d_rvw_ttl?ie=UTF8&ASIN=B00FVVR2ZO",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2015",
                "reviewTitle": "3.0 out of 5 stars I want to give it five stars...",
                "reviewText": "This is a great game! Lot's of action. Each level has it's own difficulties and that's what makes this particular app so cool! Having said that, there are problems with the application of the game.The beginning levels are easy to pass & don't use up much energy. This allows you to \"investigate\" more rooms and reach the upper levels faster. However, once you reach those higher levels your energy is depleted at a faster rate. This slows your progress way, way down. You need to \"eat\" for your energy to replenish. If you have none on hand, then you must either wait for you energy to come back or purchase it with real money.I am not willing to spend my hard earned money on a game. Don't care how much fun it is too play. See, they don't just get you with the energy....you may need a special tool, or a key, or an animal's help, etc. They all cause you to, at some point, ALMOST have to use cash. I say that because, those are rooms I will never finish. I'm not spending cash!These game makers need to realize that we are not made of money. We've worked hard for that paycheck and have bills, kids, insurance and a great deal of other more important things to use it on. Don't some of them have bills too?Please, when making these apps in the future, think hard about your customers. How would you like to be treated? Then, hopefully, you'll act accordingly.I'll continue to play. Just gotta do it at a \"much slower rate\".",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "poisonivy59",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 29, 2015",
                "reviewTitle": "awesomw",
                "reviewText": "I love the different rooms a nd challenges each one has as well as all the villians that can be detained and arrested .the graphics are great i would recommend thisgams to my family and friends as its a great game for children and adults alike",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sara de Castro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 6, 2015",
                "reviewTitle": "Adictivo",
                "reviewText": "Engancha mucho, el problema es lo que tardan en cargar las vidas y que para acceder a nuevos escenarios o pagas o sino tardas mucho. Pero el juego está genial",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Uwe Ebert",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 31, 2015",
                "reviewTitle": "gutes Wimmelbildspiel",
                "reviewText": "Seit einen Jahr Spiele ich dieses Spiel schon und es ist keinerlei langweilig im Gegenteil es wird immer interessanter und spannender mit jedem weiteren Level. Vor allem ist es gratis und das begrüße ich, weil man nichts zu bezahlen braucht. Es wäre schön, wenn es mehr Gratisspielen von dieser Sorte geben würde.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sabrina barkat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on March 12, 2015",
                "reviewTitle": "très bon jeux",
                "reviewText": "Malgré que la barre d'énergies descend vite c'est un très bon jeu et les graphisme sont magnifiques. Par contre certain objet son difficile",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cazza Simpson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 7, 2015",
                "reviewTitle": "Mirrors of Albion",
                "reviewText": "WOW this is such a cool and brilliant game, I find it really too impossible to put down my laptop, I even actually fall asleep playing it lol. There's just so much to do and I find it helps me relax and I don't get stressed out at all while I play this game. I would highly recommend this game to everyone. So good luck to everyone who plays this cool game. I also play a few more game on Facebook. But I am struggling for friends and neighbours on some games. My name is cazza Simpson I am Sat with a cream and blue coat on and sat in front of me is my big black dog. Please send me a friends request if you need a friend too x x",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}