{
    "remaining_requests": 28416,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/scumio-Adhesive-Flexible-Stickers-Frameless/dp/B0CLHDX1XV",
    "body": {
        "name": "scumio 4 Pcs Wall Mirror Tiles, 8 x 8 Inch Self Adhesive Acrylic Square Mirror, Flexible Mirror Sheets Wall Stickers Frameless Small Mirrors Wall Decor Set for Bathroom Home Gym Bedroom",
        "price": "$15.99",
        "originalPrice": "$9.59",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/scumio-Adhesive-Flexible-Stickers-Frameless/dp/B0CLHDX1XV",
        "soldBy": {
            "sellerID": "A3FNVKIP8RWJDM",
            "name": "SCUM",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3FNVKIP8RWJDM&asin=B0CLHDX1XV&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CSBK4DK1"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CLHF2FRV",
                "variationName": "Color",
                "variationValue": "12'' X 12'' X 4pcs",
                "price": "$15.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41vLeD2HdZL._SS36_.jpg"
            },
            {
                "asin": "B0CLHDX1XV",
                "variationName": "Color",
                "variationValue": "8'' X 8'' X 4pcs",
                "price": "$8.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31aA2GO7ChL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31aA2GO7ChL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ihD9gIYrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41y7REeYrPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41flrWjtpFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-JvaMeVwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uPiu9LKsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nThtF4T3L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: scumio",
            "link": "https://www.amazon.com/scumio/b/ref=bl_dp_s_web_120218112011?ie=UTF8&node=120218112011&field-lbr_brands_browse-bin=scumio"
        },
        "brand": "scumio",
        "merchantInfo": "SCUM",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 20,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 15. Order within 1 hr 3 mins",
            "FREE pickup Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest pickup Friday, February 16. Order within 14 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Acrylic Square Mirror】 This self adhesive mirror is made of high quality acrylic material, smooth surface, shatterproof and unbreakable, with rounded corners, so you can enjoy a safe environment and protect your children from accidental injuries. Each set of acrylic mirror sheet comes with self-adhesive stickers to stick to smooth walls. Each mirror sticker has a protective film on the front, peel off the film to see the reflection of the mirror.",
            "【2MM Thickness】Our acrylic wall mirrors thickness is 2MM, compared with the ordinary plastic mirror tile with 1mm thickness, our mirrors look clearer and more realistic, advanced technology ensures smooth and delicate edges.",
            "【Reflective Effect】Our acrylic mirror has a reflective effect, can be used as beautiful mirror wall decor, reflective surface can make the space look bigger and brighter; reflective effect is effective at a certain distance, the closer the closer the better the effect; please use mirror tiles on smooth surfaces, the flatter the wall, the better the reflective effect.",
            "【Applicable Scene】These acrylic mirror stickers can be used as interior decoration to achieve mirror reflection, make the interior space more spacious, expand the space or illuminate the dark wall. They are unbreakable mirrors, perfect for living rooms, bathrooms, bedrooms, dressing rooms, kitchens, gyms, offices and more.",
            "Thank you for choosing scumio brand Wall Mirror, if you have any product questions or suggestions, please feel free to contact us, we will reply you within 24 hours."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Home Décor Products",
                "link": "https://www.amazon.com/home-d%C3%83%C2%A9cor/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063278"
            },
            {
                "name": "Mirrors",
                "link": "https://www.amazon.com/mirrors/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3736371"
            },
            {
                "name": "Wall-Mounted Mirrors",
                "link": "https://www.amazon.com/wall-mounted-mirrors/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3736411"
            }
        ],
        "productInformation": [
            {
                "name": "Room Type",
                "value": "Bedroom"
            },
            {
                "name": "Mounting Type",
                "value": "Wall Mount"
            },
            {
                "name": "Special Feature",
                "value": "Frameless"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Dressing"
            },
            {
                "name": "Frame Type",
                "value": "Unframed"
            },
            {
                "name": "Frame Material",
                "value": "acrylic"
            },
            {
                "name": "Material",
                "value": "Acrylic"
            },
            {
                "name": "Product Dimensions",
                "value": "8\"L x 8\"W"
            },
            {
                "name": "Assembly Required",
                "value": "No"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 20 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#173,284 in Home & Kitchen (See Top 100 in Home & Kitchen) #485 in Wall-Mounted Mirrors"
            },
            {
                "name": "Brand",
                "value": "scumio"
            },
            {
                "name": "Number of Pieces",
                "value": "4"
            },
            {
                "name": "Number of Items",
                "value": "4"
            },
            {
                "name": "Shape",
                "value": "Square"
            },
            {
                "name": "Color",
                "value": "8'' X 8'' X 4pcs"
            },
            {
                "name": "Theme",
                "value": "Children"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2c415d75-86dc-4283-9d82-98dd10afb247.__CR0,0,1751,1083_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3b257ba7-9842-482b-bf77-619148dea61f.__CR0,0,1751,1083_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f93af51b-938f-495e-ac33-de59f99cb482.__CR0,0,2020,1249_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b9bec06e-192d-4ae1-aae8-6d8df7a9fb64.__CR0,0,1347,833_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3efd1a92-3a5d-4278-9fd9-9fb28adf0e16.__CR0,0,1347,833_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/48d205e4-5c0c-4844-98eb-c9e767afb333.__CR0,0,1347,833_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/77fa1e2c-cb88-418b-8930-f7bc1da2304c.__CR0,0,1347,833_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6QWWYCDCBSSA4LSR7CSIXVSVOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N7BTALV31GU3?ASIN=B0CLHDX1XV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Useful and good clarity",
                "reviewText": "These mirror tiles are neat. It's nice that these are mail-able in an envelope and won't break. We had not tried the non-glass mirrors before and were not sure what to expect from these compared to glass mirror. Durable and smart design. They are thin and lightweight and well made. Since they are light weight they can go on most any hard surface and there is no worry of them not staying stuck. They probably will stay because it's lightweight, but if any do fall I doubt they would break anyway. They seem sturdy.The image is good and not warped. It looks like normal mirror. There is a protective film on each of them that needs to be removed and that is easy to do. The double sided sticky foam pads are included. They stick well and are a generous size. I adhered the first one to a door with just two of the four tabs enclosed for each mirror tile. Then I realized I needed to adjust the height a bit, removed it right after that and it restuck fine. The sticky pads did not need replacing and it only took two, so the other set can be used for future use if we relocate this later or hang up something else.If you are using the tiles separately, say to use as a face/makeup mirror, the size of one of these tiles is perfect for that, framing a face nicely.These mirror tiles are versatile and would be neat as a four set, aligned in any number of creative ways but also work very well as individual mirrors in different locations. (Doors, closets, walls, lockers...) and could even be stored in a drawer and used as a portable hand held option instead of sticking to a surface. The edges are not sharp. Would be good for wall mounting lower on the wall for babies and toddlers to discover their faces or for curious indoor pets to be entertained by \"that other animal\". Would be a super easy option to add mirrors to a home gym wall. Also useful in applications such as Feng Sui and such. Also for displays. And crafts or course.Arrived in good condition, no chem smells, no flaws.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C.D. MA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMHJO55IYU6WS537YOZYIYCEBCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3L1UF8UKBI18T?ASIN=B0CLHDX1XV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Multifunctional mirrors",
                "reviewText": "So excited to have just received my Scumio 4 piece 8x8 self adhesive acrylic square mirror. I immediately placed each one on a shelf at the back of my very narrow curio cabinet. Each mirror now reflects a collectible and, hopefully, good taste.These mirrors offer the visual appeal of both light and depth to displayed items, brightening up a dark corner in the hall. The mirrors come with 16 double sides pieces of tape where each can be stuck to any surface. I chose to simply rest the mirrors on the back of the shelves.The mirrored tiles are multi functional and can also be used in a shower, the inside door of a gym or school locker or any other place you want. The mirrors offer a true image, are lightweight, non breakable if dropped, but thin and can be broken if bent.The arrived protected by a thin cellophane film that was difficult to remove without scratching the mirrors. By quickly rubbing my thumb back and forth at the corners, I managed to roll enough of the film to grab and pull off. That’s the only thing I disliked about the product.The size and quality of these mirrored tiles are perfect for my needs and I’m happy to recommend them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DerrickDerrick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHANFJRRESFUC7T6TRVXYURGPHRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1R8JJ6OBNOQ94?ASIN=B0CLHDX1XV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Lightweight and sleek, but beware your walls will be destroyed",
                "reviewText": "This is a review for 8\" x 8\" self adhesive acrylic square wall mirror tiles. I've been searching for a modest sized mirror for my bedroom, but didn't want one that was too large as who knew how expensive mirrors are! I also didn't want one mounted to the back of my bedroom door either (although these are among the cheapest I've found for a full-sized mirror). When I came across these 8 x 8 self adhesive mirrors, I wanted to give them a try and I figured if they solved my mirror needs, I could always order another set or two and get creative with mounting them around this first installation. They ship in a cellophane wrapper with 16 1-inch square perforated adhesive tabs. I chose the wall to mount them on, and after cleaning and drying the wall in question I was ready to go. With 4 adhesive squares per 1 mirror tile, I chose each corresponding corner to adhere the adhesive too. CAUTION: Be sure you have a spirit level or a leveler on-hand and that you have at least outlined where you want these mirrors placed. Once the adhesive tab touches the wall, I mean even the slightest touch against the wall will have you struggling to remove the mirror all while your paint and drywall get ripped from your wall. Yes the adhesive is that strong and suffice to say you'll likely need to knock your wall down to get rid of the mirrors (joking of course). With that being said, there are no \"extra\" adhesive tabs included (depending on how many you use for each mirror, of course). Once you've applied pressure to the mirror to fully seal it to your wall, you're ready to remove the protective film on the mirror face and check out the good looking person staring back at you :)For the materials included, you get a small mirror cluster, one that's adequate to check yourself over. This product is recommended, but remember to check out your Full Monty, you'll need more than 4.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71AXmDxuohL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71sVHuj+LRL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tried&True",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEECIV3YILNVKFN4N2TYHN3YW3JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VZKL7E023SAJ?ASIN=B0CLHDX1XV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Inexpensive solution to full length mirror",
                "reviewText": "This a great alternative to a full length mirror. The mirrors are lightweight and long enough to get a full body. What is great about these mirror tiles is that you can move them around however you'd like in different shapes where it does not have to be a full length mirror. This is great for a apartments, dorms, offices, and bedrooms. This is also easy to put up. If you are thinking of getting them, you will not be disappointed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Nabholz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXAZBITKLC5KU4ZECV6UWM265DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16US9S9E6YEJP?ASIN=B0CLHDX1XV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Sensory experience",
                "reviewText": "I purchased these mirror panels for my grandson to add to his sensory needs. When giving him a bath I often notice his delight in seeing his reflection on the bathtub’s chrome spout. He will laugh and laugh with joy. So I attached these mirrors in several locations around the edge of the bathtub. The included double stick pads work easily to safely attach to our tile. The adhesive is very strong so only attach to a hard surfaces as it might damage drywall or paint when removed. These mirrors have added to bath time fun.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}