{
    "remaining_requests": 25013,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Kleenex-Ultra-Facial-Tissues-Packs/dp/B00I9KQYEY",
    "body": {
        "name": "Kleenex Ultra Soft Facial Tissues, Flat Box, 120 Tissues per Flat Box, 3 Packs",
        "price": "$16.99",
        "originalPrice": "$18.30",
        "rawPrice": 16.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Kleenex-Ultra-Facial-Tissues-Packs/dp/B00I9KQYEY",
        "soldBy": {
            "sellerID": "A3KD911CIE6T20",
            "name": "deals 4 u",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3KD911CIE6T20&asin=B00I9KQYEY&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/510yiYFHYML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/517MCnMmoBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51WQNTetg9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 SLSPdX-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51x6BCdmPcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512vWAIk15L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FigAyqARL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Kleenex Store",
            "link": "https://www.amazon.com/stores/Kleenex%C2%AE/page/369C4C54-BB8A-4539-AAF8-AD96A9EE1155?ref_=ast_bln"
        },
        "brand": "Kleenex®",
        "merchantInfo": "Media A",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 3174,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 16 - 20.",
            "FREE delivery February 28 - March 1.",
            "Or fastest delivery Tuesday, February 20. Order within 18 hrs 29 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Contains 3 boxes with 120 Kleenex Ultra Soft* tissues per pack",
            "The softest ultra tissue* (among national brands)",
            "Compact facial tissue box for living rooms, bathrooms, kitchens, offices and more",
            "Facial tissue flat box in a variety of colors and designs (may vary from image shown)",
            "Buy tissues in bulk & save up to 15% with Subscribe & Save - keep tissues available for family, guests and yourself",
            "Face tissues are durable with 3-ply thickness & lock in moisture with their thick absorbency - the strongest tissue for colds or allergies",
            "Be prepared during cold & flu season, allergy season, back-to-school and holidays"
        ],
        "description": "One soft tissue is all it takes to show you care. Reach for gentle, indulgently soft Kleenex Ultra Soft Tissues for a friend, a stranger or yourself. With the perfect balance of softness and strength, Kleenex facial tissues are durable with 3-ply thickness, delivering a strong facial tissue to lock in moisture. Strong & soothing facial tissues are perfect for makeup smudges, sniffles and sneezes, children’s messy faces and more. Just use and toss. Stock up and save! Keep tissues on hand to care for family, company and yourself during cold and flu season, allergy season, back-to-school and holidays. And as always, Kleenex Pack come in a variety of colors and designs that blend beautifully into your home décor. Place Pack in the living room, kitchen, bathrooms, bedrooms and office. Kleenex disposable facial tissues have been there for happy tears and stuffy noses since 1924. Kimberly-Clark is proud to provide $4 million through May 31, 2020, to support World Wildlife Fund’s efforts to protect forests and other critical ecosystems. ‘WWF’ and ‘World Wildlife Fund’ are WWF Registered Trademarks. 1986 Panda Symbol WWF.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Tissues, Toilet Paper & Sprays",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=23700319011"
            },
            {
                "name": "Facial Tissues",
                "link": "https://www.amazon.com/Paper-Facial-Tissues/b/ref=dp_bc_aui_C_4?ie=UTF8&node=15356241"
            },
            {
                "name": "Box Tissues",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=23700321011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 11.02 x 8.27 x 0.16 inches; 1.85 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 00036000258820"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ April 22, 2014"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Kleenex"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00I9KQYEY"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#83,689 in Health & Household (See Top 100 in Health & Household) #109 in Box Tissues"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 3,174 ratings"
            },
            {
                "name": "Brand",
                "value": "Kleenex"
            },
            {
                "name": "Special Feature",
                "value": "Ultra Soft"
            },
            {
                "name": "Skin Type",
                "value": "All"
            },
            {
                "name": "Number of Items",
                "value": "3"
            },
            {
                "name": "Sheet Count",
                "value": "120"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tiger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXCMT2BGGJALRCEJ2A2FIZVPGNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CILARWB5MZ05?ASIN=B00I9KQYEY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2014",
                "reviewTitle": "5.0 out of 5 stars Great, Convenient, & Better Than Standard Kleenex, But Can't Pick Colors",
                "reviewText": "The media could not be loaded. I am very happy with my Kleenex Ultra 8-pack, which is the Kleenex you expect, convenient, and better than standard Kleenex. Kleenex Ultra is nicer than Kleenex standard, which seems thicker, sturdier, and softer (but less absorbent if used for minor spills). I just put this on subscription every 2 months, is usually a good value, and very convenient to keep stocked. You get a variety of colors, which vary by shipment, and you might get multiple of the same design in a box. I have received 3 orders of this now, and am very happy.The main drawback is that you cannot pick your colors. You get a random selection, which is usually just fine. But there may be colors you dislike. You might end up with multiple of your least favorite design in a box. I once got several boxes where the sheets were not fully cut and would pull multiple and had to tear them, which I figure could happen at the store as well. I once noticed a slight funky smell when using a few boxes, which I am rather sensitive to, but it isn't always the case as I haven't noticed it recently.Overall, it is Kleenex Ultra, the same as you would find at the store (as far as I can tell), in a convenient box.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cd6e0611-31f6-4759-87c5-5095298e6298/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Burwells",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEV4QAO52QVYUDSJHF6VZM7Z3KQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R289HPL7YLOJ1R?ASIN=B00I9KQYEY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 5, 2016",
                "reviewTitle": "5.0 out of 5 stars Super Soft and Strong, like the Box Says!",
                "reviewText": "There are only two kinds of tissues I will buy anymore, and this is one of them (I can't mention the other brand probably but it's very soft and puffy too). Wish I could pick the exact box colors since I'm kinda anal about what boxes go in what locations around our home, but I just buy a bunch and hope we have enough different colors.I review hundreds of products I buy on Amazon and rely on reviews from others a lot too to make my purchase decisions. I paid full price for these and always do and always will because they are great and worth every penny! I only rate an item 5 stars if I would pay full price for it or be willing to give it as a gift. I do give 1 star (since you can't give 0) to items which are so bad that I throw away, return for refund or wouldn't want even if free. I try to mention all the pros and cons of products. I have no affiliation with this company or any company for products I review, and my reviews are always totally my own (including any photos/videos). I hope my time spent reviewing this item helped in your decision. If it did, please vote \"yes\" below! Thanks!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesus is returning soon!",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVFVF3VLLNYSJ5ZQ3ACAL7SAG3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVW2RD1THYDHS?ASIN=B00I9KQYEY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2017",
                "reviewTitle": "5.0 out of 5 stars Jesus is coming soon!",
                "reviewText": "Jesus is coming in the clouds to rapture His church on September 23rd, 2017 at 10:35AM Central as per the Revelation 12 sign.We know it's the date of the rapture due to God promising to pour out his Holy Spirit upon all flesh in the end days. He is telling and warning us of the coming rapture. Be warned.Amos 3:7Surely the Lord GOD will do nothing, but he revealeth his secret unto his servants the prophets.Joel 2:28-32 & Acts 2:17-21 is where God promises to pour out his Holy Spirit upon all flesh in the last days. Children will prophesy (check), young men will be given visions (check), and our old men will dream dreams (check).1 Corinthians 15:52, 1 Thessalonians 4:16, 1 Thessalonians 5:1-5, Hebrews 10:25, and Revelation 3:3 all tell us that the true believers will know the time of the rapture.1 Corinthians 15:52In a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed.1 Thessalonians 4:16For the Lord himself shall descend from heaven with a shout, with the voice of the archangel, and with the trump of God: and the dead in Christ shall rise first:1 Thessalonians 5:1-51 But of the times and the seasons, brethren, ye have no need that I write unto you.2 For yourselves know perfectly that the day of the Lord so cometh as a thief in the night.3 For when they shall say, Peace and safety; then sudden destruction cometh upon them, as travail upon a woman with child; and they shall not escape.4 But ye, brethren, are not in darkness, that that day should overtake you as a thief.5 Ye are all the children of light, and the children of the day: we are not of the night, nor of darkness.Hebrews 10:25Not forsaking the assembling of ourselves together, as the manner of some is; but exhorting one another: and so much the more, as ye see the day approaching.Revelation 3:3Remember therefore how thou hast received and heard, and hold fast, and repent. If therefore thou shalt not watch, I will come on thee as a thief, and thou shalt not know what hour I will come upon thee.- 1 Thessalonians 5:4 tells us we will know the day. (Written as per the revelation Jesus gave to Paul - Galatians 1:11-12).- Revelation 3:3 tells us we will know the hour. (The very words of Jesus directly).Galatians 1:11-1211 But I certify you, brethren, that the gospel which was preached of me is not after man.12 For I neither received it of man, neither was I taught it, but by the revelation of Jesus Christ.We can conclude with Mark 13:37 where Jesus Himself tells us to watch. If we cannot know the date of the rapture, why would Jesus tell us to watch for it?Mark 13:37And what I say unto you I say unto all, Watch.The rapture and second coming of Jesus are two totally different and separate events.The rapture happens at the beginning of the seven year tribulation period.The second coming happens at the end of the seven year tribulation period.Romans Road to SalvationRomans 3:10As it is written, There is none righteous, no, not one:Romans 3:23For all have sinned, and come short of the glory of God;Romans 5:8But God commendeth his love toward us, in that, while we were yet sinners, Christ died for us.Romans 5:12Wherefore, as by one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned:Romans 6:23For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord.Romans 10:9-119 That if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved.10 For with the heart man believeth unto righteousness; and with the mouth confession is made unto salvation.11 For the scripture saith, Whosoever believeth on him shall not be ashamed.Romans 10:13For whosoever shall call upon the name of the Lord shall be saved.Romans 11:36For of him, and through him, and to him, are all things: to whom be glory for ever. Amen.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAUISJ7CE56KLD27ANYVEZVTP2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27J2JNZ4FEBUH?ASIN=B00I9KQYEY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 23, 2014",
                "reviewTitle": "5.0 out of 5 stars Regular high quality, and so CONVENIENT!!!",
                "reviewText": "I LOVE having enough Kleenex at home to pull out a replacement box anytime!These are the same 3-ply tissues you can buy at your local grocery store -- except that Amazon delivers them for you free of charge and even gives you a discount via Subscribe-and-Save! I LOVE having enough Kleenex at home to pull out a new one each time any of the boxes by the bed, or in the baths, or on the end tables in the living room or on the counter in the kitchen (can you tell hay fever is rampant in this house?) suddenly run dry, usually at very inconvenient moments.No more having to count how many are still left in the pantry before going shopping. No more temporarily stealing a mostly full box from elsewhere because there aren't any extras left in the pantry! (and then, of course, discovering I have to get up from my comfy chair when I start to sneeze and find the table nearby has sacrificed its box to another location!). Believe it or not, we use up a whole case each month. Just as I'm starting to wonder whether there will be enough left, another case arrives. There's plenty to take charge of in this world, and lots of claims on our energy and attention. This is one thing I no longer have to worry about!No compromises -- usual high quality, great convenience, and savings to boot -- what a deal!!!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janet  Withers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVDNGM3DX6NPLVCGMWYSNL6WTCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD6GBZEO3308F?ASIN=B00I9KQYEY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 20, 2023",
                "reviewTitle": "5.0 out of 5 stars strong and soft",
                "reviewText": "This is a long time favorite of mine. Tissues are soft and strong.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$18.34",
                "sellerName": "ARTRIUM LLC",
                "sellerRating": "3"
            },
            {
                "price": "$18.45",
                "sellerName": "Sahara Sellers",
                "sellerRating": "4.5"
            },
            {
                "price": "$18.45",
                "sellerName": "\"Prime Sell\"",
                "sellerRating": "4.5"
            }
        ]
    }
}