{
    "remaining_requests": 10223,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ivation-Generator-Purifier-Deodorizer-Purifies/dp/B01G62N5SO",
    "body": {
        "name": "Ivation Ozone Generator Air Purifier, Ionizer & Deodorizer -Purifies Up to 3,500 Sq/Ft -Great for Dust, Pollen, Pets, Smoke & More Cherry",
        "price": "$149.99",
        "originalPrice": "$159.99",
        "rawPrice": 149.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ivation-Generator-Purifier-Deodorizer-Purifies/dp/B01G62N5SO",
        "soldBy": {
            "sellerID": "A2LM6ZPY06LT1N",
            "name": "DBROTH",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2LM6ZPY06LT1N&asin=B01G62N5SO&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51lYBoxZ2hL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51KGXqk9VuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Vvg oGN2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518fMfPuRpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dSIkJiNnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51PkAyir cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bEUSINMJL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ivation Store",
            "link": "https://www.amazon.com/stores/Ivation/page/128E4963-931B-47F8-A19E-2EB86EA915FF?ref_=ast_bln"
        },
        "brand": "Ivation",
        "merchantInfo": "DBROTH",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 3478,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "THIS PRODUCT DOES NOT MEET CALIFORNIA AIR CLEANER REGULATION REQUIREMENTS: CANNOT BE SHIPPED TO CALIFORNIA - Powerful Ion Energy – Releases Negative Ions to Purify & Refresh Up to 3,500 Sq/Ft Space for 24/7 Dust Control",
            "Improves Air Quality – Helps You Breathe Fresher, Cleaner Air with Reduced Dust, Allergens & Other Irritants",
            "Beneficial Ozone Generation – Activated Oxygen Removes Odors from Tobacco, Food, Pets, Paint, Mold & Mildew",
            "Durable & Attractive Design – Elegant Cherry Wood Exterior & Stainless Steel Cabinet Provide Years of Use",
            "Reenergizes Your Mood – Recreates Nature’s Unique, Invigorating Smell; Great for House, Apt. or Office"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b?ie=UTF8&node=267554011"
            },
            {
                "name": "Air Ionizers",
                "link": "https://www.amazon.com/air-ionizers/b?ie=UTF8&node=510196"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Cherry"
            },
            {
                "name": "Brand",
                "value": "Ivation"
            },
            {
                "name": "Product Dimensions",
                "value": "11\"D x 12.5\"W x 15\"H"
            },
            {
                "name": "Controller Type",
                "value": "Button Control"
            },
            {
                "name": "Item Weight",
                "value": "7.33 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Ivation"
            },
            {
                "name": "ASIN",
                "value": "B01G62N5SO"
            },
            {
                "name": "Item model number",
                "value": "IVAOZP001"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 3,478 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#103,039 in Home & Kitchen (See Top 100 in Home & Kitchen) #25 in Home Air Ionizers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Power Source Corded Electric",
                "value": "Item Weight 3.33 Kilograms"
            },
            {
                "name": "Control Method Touch",
                "value": "Floor Area 3500 Square Feet"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "THIS PRODUCT DOES NOT MEET CALIFORNIA AIR CLEANER REGULATION REQUIREMENTS: CANNOT BE SHIPPED TO CALIFORNIA please note the above",
                "media_link": []
            },
            {
                "media_text": "THIS PRODUCT DOES NOT MEET CALIFORNIA AIR CLEANER REGULATION REQUIREMENTS: CANNOT BE SHIPPED TO CALIFORNIA please note the above",
                "media_link": []
            },
            {
                "media_text": "Breathe cleaner air, breathe easier. weed odor eliminator pot Ever noticed the clean, distinctive smell and sensation after a thunderstorm, or standing by a waterfall? Enjoy that same refreshing, mood-lifting effect at home with the Ozone Air Purifier by Ivation. Unlike a simple filter, our 2-in-1 ionizer and odor remover achieves multiple air effects for an incredibly breathable space up to 3,500 square feet. Ivation’s latest 300B model requires less power and features a quieter fan, better ion quality, and stronger output than the competition. Simply power on the ionizer, and experience significantly better air quality as negative ions latch onto and expel harmful airborne particles. Meanwhile, the unit’s separate ozone generator pumps healthy activated oxygen into the room to purge foul odors from dogs, food, mold, chemicals, and more. With its cherry wood and stainless steel construction, this small but mighty purifier is ready to complement any room in your home. Enjoy the pure sensation of being alive with that indescribable “clean-smelling” atmosphere only found in nature. You’ve got to breathe it to believe it. What’s in the Box? 1 Ivation Ozone Air Purifier1 AC Adapter1 Ceramic O¬¬3¬ PlateUser GuideAn ionizer you can’t breathe without! Specs & Details Measures 12.5” x 11” x 15”Weighs in at 12 lbs.Ozone Output: 360 mg/hrMax Coverage: 3500 sq/ftExterior Material: Cherry WoodCabinet Material: Stainless Steel How to Enjoy Place in central location 4 feet above groundPlug in unit with provided adapterSet desired fan speedStart low, then increase O¬¬3 for desired effectRun ionizer for 24/7 fresh airFollow manual’s maintenance tipsBreathe well for many years to come!",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/d6f011e0-7b04-4563-8dba-183251aca9a3.__CR0,1,2500,2500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/8bf50b58-534e-4121-b4bb-7817fabce6fa.__CR0,0,1971,1971_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/e21d796e-c404-4ddd-ae8f-cd3c6276f60c.__CR0,0,2000,2000_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "USAFA93",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETIWF743XSNISOISVTGOZA7WCNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28WLKSNBXOUY7?ASIN=B01G62N5SO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Serious piece of equipment",
                "reviewText": "I purchased this to replace a low-energy, non-intrusive Shaper Image Ionic Breeze that had finally failed. Although there is an easy argument to be made that ionization of oxygen (O3 - Ozone) is a pollutant, for indoor smokers it is often the lesser of two evils. Ozone is tremendously effective at attaching to smoke particles and neutralizing. It is not a scented cover-up, but an actual neutralization, and it works great. As you may know, lawsuits against The Shaper Image's claims that the Ionic Breeze was an \"air purifier\" drove The Sharper Image to insolvency. So I needed a new solution, and I am fully aware of the harmful effects of ozone, and I, as a consenting and informed adult, accept the risk.The Ivation is indeed a hardcore ozone generator. It is FAR more serious than even the largest of the Ionic Breeze-style machines. There are two controls on it. The first is the ionization level, and the second is the fan speed. As an example, if I cordon off several rooms in my house and run this little box on high-ozone and high-fan, it will effectively load those three rooms, about 500 square feet, full of a high concentration of ozone in about 8 hours or less. How high? High enough that you will need to move rapidly through the rooms to open windows and extricate yourself from that environment. If you take too long, and need to take a gulp of air, beware. You'll be sucking down what smells and tastes like chlorine bleach. That is ozone. Depending on your tolerance, you may be able to take it, or you may feel nauseous. It is that strong.That strength is a good thing. Remember, you have the capability to dial-down the ozone generation. So if it is too strong, dial it down to a lower level. If you are an indoor smoker, this will definitely go a long way towards removing that stale, cigarette smell. Almost no one can tell that I smoked indoors throughout the winter, with closed windows.This is NOT the type of air purifier I would use if there are people in the room. It is an after-action clean-up type of purifier. Use a HEPA air filter when you are in the room. It's loud, but there are no noxious, ozone gas to deal with.Be aware that ozone can damage all sorts of things. That free oxygen atom wants to bind; it is a chemistry fact. It will not only bind with other pollutants, but also your books, artwork, silverware, et al. For this same reason, never run this the same time you are running a charcoal prefilter on another air filter. You'll waste that charcoal filter in no time. Charcoal loves to bind - ozone loves to bind - the ozone will quickly render your charcoal prefilter entirely used. Know your risks. Be aware.All that said, I am highly satisfied with my purchase. That I can smoke inside, and the place has a sterile, clean smell, is rather incredible. I would recommend you understand exactly what this machine is good for, and make sure it meets your needs. For most people, this may not be the right match. But for those that it is, you're probably going to love it.",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MEC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCN46LYDGS7PDIRIATNNZDH7WOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TD1TZBOBG9PN?ASIN=B01G62N5SO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Cleans the air",
                "reviewText": "Works well!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jon simmons",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIJC6A3ZE25LUC44YEBRGXQRETQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA6ZV0Q5DP811?ASIN=B01G62N5SO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars What??",
                "reviewText": "The unit worked well. I’ve had 2. The first one quit after a couple of months. I wanted to repair it but the seller sent me a new unit instead. That worked for a couple of months. Now I have 2 units that don’t work. I wouldn’t mind trying to fix them but I don’t have a repair manual. I guess I’ll just have to buy another one when I get extra cash. I like them and I’m sure you will too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nils",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKVLJ3IGSBVWSCV4U7Q2QJY6HUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ITVK3URCII4Y?ASIN=B01G62N5SO",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 16, 2020",
                "reviewTitle": "4.0 out of 5 stars A good ozone generator and ionizer.",
                "reviewText": "I should say first that I've had trouble with ozone generators in the past.The first was my own error. I once had an ozone generator (OG) which had been given to me by my father. I liked how it got rid of smells and seemed to freshen the air. So I ran it at full intensity while working in my home office, with the door closed. I'd heard that ozone breaks down into oxygen and thought, for some vague reason, that this meant it would be fine to breathe it. (Not smart, I know.) This was decades ago, before it was widely known that ozone can be problematic. But I still should have done more research before using it without ventilation.After several weeks of doing this, I found abruptly that I couldn't breathe... could not get air into my lungs. I ended up taking a trip by ambulance to the local hospital. They gave me oxygen and I recovered.Based on this (expensive) experience I learned that it really, truly is good to NOT breathe ozone. You might be able to breathe a small amount in without a problem, or think there's not a problem, but if can be dangerous, so it's best to avoid breathing it in, especially in a concentrated dose.Five years ago, I bought a new ozone generator from Amazon. I'd learned by then not to breathe the ozone, but missed the air purifying qualities of the OG I'd owned. I planned to run it when I wasn't home.But the one I bought was terrible. The \"ozone\" or whatever it was producing smelled like burning plastic. It reeked, and made everything in the room I had tested it with also reek. I actually had to throw a bunch of clothes away, because they stunk so badly. Ozone does have a sharp, acrid smell but it shouldn't smell like toxic waste. Whatever that OG was producing was not pure ozone. I returned it to Amazon.A few months ago, I bought this one.And... it's great. Unlike the weird one I bought five years ago, this one makes real ozone. I recognize the smell.But of course, I don't breathe it. Instead, I put it on sometimes when I'm leaving the house, using a timer so it'll shut off production of ozone an hour before I get back. And I leave a ceiling fan going. That gives the ozone time to dissipate and degrade into oxygen. The house smells fresh and clean, all odors gone, when I get home. I don't know if ozone kills all viruses; I suspect it may; but I know it kills some, and using one (when not home) is a good way to clear them out of the air.The other feature this one has, besides a highly effective ozone generator, is a very potent ionizer. It's on a separate control, so you can use it on its own. As far as I know, it ONLY generated ions, not ozone, when you use that knob. I do use this feature when I'm home, because I'm in wildfire-smoke-country and it helps clean the smoke out of the air. (I also have a Winix air purifier that I usually have going at the same time. Together, they totally clear out the smoke.One funny note: when the Winix is on auto, if I turn on the ionizer on the ozone generator, the Winix detects the ions in the air and comes screeching on to try to get rid of them. So I run them in opposite sides of the house.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jenn StevensJenn Stevens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWZRTN7F5OV4HPG6W35R5NNFTTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35JHUAFS2G5G3?ASIN=B01G62N5SO",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 15, 2023",
                "reviewTitle": "1.0 out of 5 stars DO NOT BUY! WILL Put BLACK SOOT on Walls!!",
                "reviewText": "I purchased this Late December 2022. Product seem to work fine at first. Made house smell good and clean. But then......in March, 3 months later I discovered that it was emitting a Black soot. It did significant damage before I realized it. You could not smell it. It didnt smell bad. I am NOT a dirty person. All my walls was washed in November for the holidays, we do not smoke nor do we have any wood burninf stove of any sort. No fireplace! So all this Black you see is from This Air purifier . Apparently it has black carbon it uses to clean or purify. Whatever the case may be. This caused Black soot to be all over in several rooms. This soot was nearly impossible to get off walls and decorations etc. So disappointed. I reached out to the company and they wouldn't respond to me. I made 2 attempts.I spent 8 hours washing and scrubbing walls, to no avail. It was like trying to get cement off a wall. I will have to have several rooms repainted.Do NOT BUY!! If I could give it negative stars I would. And FYI, I never leave reviews. I just wanted everyone to beware so you don't have thousands to shell out from Damages it will cause! Buyer beware!!",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61AEHf7B-KL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61McgAXPy1L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61WaW9KV2IL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61hjqa-oIFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711lLnREbiL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711lLnREbiL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff Welsh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFULEC7RVQDJDPJZQ3QVDO62SB5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2K5HLY6E7YKPS?ASIN=B01G62N5SO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great",
                "reviewText": "This is perfect if you have odors in your home. It instantly made my house smell fresh and clean",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$149.99",
                "sellerName": "DBROTH",
                "sellerRating": "5"
            }
        ]
    }
}