{
    "remaining_requests": 10288,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Purifiers-Bedroom-Wall-Mounted-Purifier-Activated/dp/B0CLCFJX9B",
    "body": {
        "name": "Air Purifiers for Home Bedroom, Wall-Mounted HEPA Air Purifier for Home Large Room, Smart Air Cleaner with Activated Carbon for Pets, WiFi & RC, Auto Mode, Timer…",
        "price": "$129.99",
        "originalPrice": "",
        "rawPrice": 129.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Purifiers-Bedroom-Wall-Mounted-Purifier-Activated/dp/B0CLCFJX9B",
        "soldBy": {
            "sellerID": "A2WZXF68CXN83J",
            "name": "Newpad-Aliao",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2WZXF68CXN83J&asin=B0CLCFJX9B&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTFD28LD"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CLCD1RGM",
                "variationName": "Color",
                "variationValue": "Black and Grey",
                "price": "$129.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51BydFVUHJL._SS36_.jpg"
            },
            {
                "asin": "B0CLCFJX9B",
                "variationName": "Color",
                "variationValue": "White and Grey",
                "price": "$129.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51YpYZKWM9L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $47 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51YpYZKWM9L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41TW 7AQTqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QOLiOWfWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51IFpbhX24L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ukfeMIcEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41i2CtuA54L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1tiNlcvzWL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1tiNlcvzWL.pdf"
        },
        "byLineInfo": {
            "name": "Brand: newpad",
            "link": "https://www.amazon.com/newpad/b/ref=bl_dp_s_web_36932086011?ie=UTF8&node=36932086011&field-lbr_brands_browse-bin=newpad"
        },
        "brand": "newpad",
        "merchantInfo": "Newpad-Aliao",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 39,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 17 hrs 23 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Wall Mounted & Desktop in 1 - This large room air purifier is designed to be mounted on the wall or placed on the desk and floor, refresh the air of a 269 sq ft room in 12 min and a 1345 sq ft whole home in an hour, ideal for bedroom, dorm, office, living room, etc.",
            "LCD Display & Auto Mode - You can know the air changes and make corresponding adjustments with the high-sensitive air quality sensor. When in auto mode, this smart air purifier changes the fan speed automatically according to the results fed back by the sensor.",
            "3 Stage Filtration & Washable fiber- Features washable nylon filter and pre-filter to block large particles above 10 microns; H13 HEPA filter captures 99.97% dust, smoke, wildfire smog, and pets dander as small as 0.3 microns; Activated carbon filter for pets remove odors and cooking smells.",
            "Smart Air Cleaner - With the free Tuya app, you can make it run or turn off at specific times, check filter life, and change your fan speed and purifying mode. In addition, we are equipped with a remote control for the convenience of some elderly people who do not like to use smart devices.",
            "Durable Replacement Filter - Different from others' small and poor filters with 1000-2500 hours of service life, our filter can last at least five months even if you run it 7/24, or even a year if you make a reasonable schedule with the app. Search B0BJZPMW53 to get the official replacement filter.",
            "Authoritative Certification - Certificated by CARB, ETL, EPA, FCC, and Energy Star."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b?ie=UTF8&node=267554011"
            },
            {
                "name": "HEPA Air Purifiers",
                "link": "https://www.amazon.com/hepa-air-purifiers/b?ie=UTF8&node=510192"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 7.2 x 20.3 x 15.2 inches; 8.82 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ KJ-460"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ October 19, 2023"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CLCFJX9B"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#99,161 in Home & Kitchen (See Top 100 in Home & Kitchen) #173 in HEPA Filter Air Purifiers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 39 ratings"
            },
            {
                "name": "Color",
                "value": "White and Grey"
            },
            {
                "name": "Brand",
                "value": "newpad"
            },
            {
                "name": "Product Dimensions",
                "value": "7.2\"D x 20.3\"W x 15.2\"H"
            },
            {
                "name": "Floor Area",
                "value": "73.5 Square Inches"
            },
            {
                "name": "Specification Met",
                "value": "Energy Star Certified, ETL Certified, CARB Certified, EPA Certified"
            },
            {
                "name": "Power Source ac_dc",
                "value": "Item Weight 8.82 Pounds"
            },
            {
                "name": "Control Method App, Remote, Touch, Voice",
                "value": "Filter Type HEPA, Activated Carbon"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Why Choose Newpad Air Purifiers KJ-460? Newpad Air Purifiers KJ-460 certificated by CARB, ETL, EPA, FCC, and Energy Star. The unique wall mounted design and diverse operating methods make it widely used. When should I change the filter? In general, each filter can be used for 5-12 months. The usage time of the filter will be displayed in real-time on the APP, and when the filter needs to be replaced, the PM2.5 display will go in a circle. How to reset the filter life? We provide two methods to reset the filter life. 1. Reconnect the power, and don't turn the machine on. Press and hold the \"wind speed\" button for 3 seconds until the machine beeps, and the filter lifespan is reset. 2. One-click reset on the app. How to get the replacement filter? You can search \"B0BJZPMW53\" or \"Newpad replacement filter for KJ-460\" directly on AMAZON to get the replacement filter. How to connect to the phone via WiFi? 1. After the machine is on, hold the \"wind speed\" button for three seconds, and the WiFi indicator light will flash. 2. Download the Tuya Smart and follow the prompts. Note: The WiFi indicator will be off whether it is connected or not in 2 mins.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/56d58310-1e16-4db9-bd23-8478e26fb5fd.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5b7ad2a2-e618-416f-a6c2-c586353b2219.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/610b4c82-666b-4ed3-b779-d03ad5d132aa.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d4297a14-9dbe-4d78-9395-9fd7e3ea7e9f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f6e2cfea-a08d-4de4-b780-50f5d8f6e28a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/47018ee6-ebf5-4ace-981b-174fa5becc3f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/530b83a8-6233-4fb0-b387-31c5c583ee27.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f5f0265e-7634-4fa7-8996-5f96c694a4a7.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "PraJana Lotai",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOFUFMMCJRTPVXSHFGPFEZ4BP6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BT3XB3OKXNA3?ASIN=B0CLCFJX9B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy to Mount",
                "reviewText": "I tried the NEWPAD Air Purifier for my home and I have been quite with its performance. As someone who suffers from allergies and has pets in the house, having clean air is crucial for my health and well-being. After doing some research, I decided to give the NEWPAD Air Purifier a try and I am so glad that I did.One of the standout features of this air purifier is its wall-mounted design. This not only saves space but also makes it more efficient in purifying the air as it can be placed at a higher level. The sleek and modern design also adds a touch of elegance to my bedroom.The HEPA filter in this air purifier is highly effective in removing allergens, dust, and other pollutants from the air. I have noticed a significant improvement in my allergy symptoms since using this purifier. The activated carbon filter also helps to eliminate odors from pets and cooking, leaving the air smelling fresh and clean.The fact that this air purifier can be controlled through WiFi and remote control is definitely a bonus. This makes it very convenient to use, especially when I am not at home. I can easily adjust the settings and monitor the air quality from my phone. The auto mode is also a great feature as it automatically adjusts the fan speed based on the air quality, saving energy and ensuring optimal performance.The timer function is another great addition as I can set it to run for a specific amount of time, making it perfect for use while I sleep. The noise level is also very low, so it doesn't disrupt my sleep at all.Overall, I am extremely satisfied with the NEWPAD Air Purifier. It has exceeded my expectations in terms of performance and convenience. I would definitely recommend it to anyone looking for a high-quality air purifier for their home. It is definitely worth the investment for clean and healthy air.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "daynun",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFO2OVMQZQIXI275J3PTWNWK7PPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35QZQUKW98EYA?ASIN=B0CLCFJX9B",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "4.0 out of 5 stars Maybe not for every home",
                "reviewText": "I'm in a newer home with a decent furnace but we still get more dust on our shelves than I would have thought. So we got this air purifier. Honestly, I can't tell a difference with it on or not. The lights are always green, which means good air quality, and when left on auto, it's always hovering around 12 (the settings go from 0-99, with the higher numbers meaning it's detecting more of a need to purify the air). We even used it in the kitchen after cooking meals and left it running for a while and it didn't seem to eliminate the cooking smells.The feet were a bit odd to push on and determine what angle they needed to be at to help it stand up. I twisted them around until I eventually found angles that would allow it to stand up, though it's not the most sturdy device. It's designed to be mounted to a wall and I think that would save space and eliminate the tipsy turvy feel of the feet. The air is sucked in the front, through the HEPA filter, and then expelled out of the sides, thus allowing it to be mounted to a wall.It's a bit noisier than I anticipated. Obviously, if it's running on high, I expect to hear the fans blowing, but even on low it's noticeable in a quiet room. So I was hopeful about the sleep mode, making it whisper quiet. Well, that wasn't the case. Sleep mode just turns the lights off, which are already pretty minimal. I'm a heavy sleeper so the little bit of white noise it generated on low wasn't enough to bother me, but it did my wife who's a lighter sleeper. She had to use earplugs.Others have already talked about the filters and how to replace them. Right now, on Amazon, they sell for $25 so if you need to replace it every couple of months, you're looking at an annual cost of $100 to keep it running. I haven't had mine long enough to inspect the filter and see how dirty it's getting and how quickly.Overall, it brings a sense of satisfaction that I've got something pulling particulates out of the air, but so far we just aren't noticing much of a difference. Maybe if we had pets or lived in a big city with lots of air pollution, but right now I'm not sure how often I'll run it or need to replace the filter.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carl Lacy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTTPQJKQ3JP5FBC5UUS3ZYLDSZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7WZRL0SYICFH?ASIN=B0CLCFJX9B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent value in a large room filter",
                "reviewText": "We've noticed a difference since putting this filter on our son's bedroom. He struggles with dust allergies, and his respiration can be affected even when the air quality sensor still shows green. Over the past week, he's shown significant improvement. I can't give this all credit because we have a few other air filters in the home, but we added this one last. It has helped turn the tide. Its relatively large surface measures 18\" across and the fans pump quite a bit of air through the filter. I would expect it to be able to improve the air quality in a large room.In my initial search, I was unable to locate replacement air filters. Recently, have appeared under \"newpad filter kj-460.\" Thanks to another reviewer for pointing that out. Now, the main issue is their non-existent customer service. I messaged the seller asking about replacement filters and got no response, and I see from other reviews that I'm not the only one. I'm not deducting any stars for that because I'm impressed with the machine's results, and other reviewers have already given low marks on the replacement filter page.A few notes... If you hear strange noises when you first turn it on, you didn't remove the plastic from the included filter. The manual fails to mention this.Installing the Tuya app on a smartphone can also control the device. We have not tried the app yet in an effort to avoid Wi-Fi router clutter. One reviewer got it to work but another did not.It includes a bracket for wall-mounting, but I'm wary about using it and not ready to commit to one location.The sleep mode just turns off the lights; unlike some purifiers, it doesn't get totally silent.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}