{
    "remaining_requests": 10521,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Winix-5500-2-Purifier-PlasmaWave-Reducing/dp/B01D8DAYII",
    "body": {
        "name": "Winix 5500-2 Air Purifier with True HEPA, PlasmaWave and Odor Reducing Washable AOC Carbon Filter Medium , Charcoal Gray",
        "price": "$159.99",
        "originalPrice": "$249.99",
        "rawPrice": 159.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Winix-5500-2-Purifier-PlasmaWave-Reducing/dp/B01D8DAYII",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CJBY69LT"
        ],
        "asinVariationValues": [
            {
                "asin": "B01D8DAYII",
                "variationName": "Color",
                "variationValue": "Charcoal Gray",
                "price": "$159.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31skhhngBoL._SS36_.jpg"
            },
            {
                "asin": "B08B392R4W",
                "variationName": "Color",
                "variationValue": "Dark Gray",
                "price": "$189.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41OLSYLsydL._SS36_.jpg"
            },
            {
                "asin": "B01D8DAYBA",
                "variationName": "Color",
                "variationValue": "Gray",
                "price": "$145.49",
                "variationImageURL": "https://m.media-amazon.com/images/I/31WGpGeu1QL._SS36_.jpg"
            },
            {
                "asin": "B0CDNH5NX4",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "$181.86",
                "variationImageURL": "https://m.media-amazon.com/images/I/41EOLgYdO7L._SS36_.jpg"
            },
            {
                "asin": "B07KQBNM7H",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$174.39",
                "variationImageURL": "https://m.media-amazon.com/images/I/51F+Pl3dSoL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31skhhngBoL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31EbSDDpP0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41bRXRmNNdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41imwdtjpWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31d0TgzwEVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41o0p9-vERL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51R1BnKkLQL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Winix Store",
            "link": "https://www.amazon.com/stores/Winix/page/8151109B-33FF-48EC-B065-2612BFE6A8CB?ref_=ast_bln"
        },
        "brand": "Winix",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 36884,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Monday, February 19. Order within 5 hrs 23 mins",
            "FREE delivery Wednesday, February 21. Order within 16 hrs 53 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "True HEPA filter captures 99.97% of airborne pollutants; dust mites, pet dander, pollen and other allergens as small as 0.3 microns",
            "Washable AOC Carbon Filter, made from activated carbon granulars for removal of household odors. Decibels 27.8 dB",
            "PlasmaWave acts as a permanent filter to safely break down odor, allergens, chemical vapors and other pollutants with no harmful ozone",
            "Smart Sensors gauge the air and our Auto Mode adjusts the fan to filter the air as needed; with a sleep mode for silent night time operation",
            "CADR rated for 360 square feet room size. Suitable for medium and large rooms; kids bedrooms, family rooms and kitchens",
            "Product has no extra filters"
        ],
        "description": "Winix 5500-2 Air Cleaner with PlasmaWave Technology. The Winix 5500-2 Air Cleaner replaces the wildly popular 5500 model. It is designed for any home environment and ready to capture dust, pollen, pet dander, smoke, mold spores, volatile organic compounds, and household odors. This unit is best used for medium to large living spaces, kitchens, or bedrooms. The WINIX 5500-2 uses a 3-Stage Air Cleaning System, featuring a Washable AOCTM Carbon Filter, 99. 97% True HEPA Filter, and Winix PlasmaWave Technology. True HEPA filter captures of airborne pollutants and allergens, while carbon filter traps offensive smoke, cooking and all other household odors. PlasmaWave Technology attacks pollutants at a molecular level to neutralize viruses, bacteria, chemical vapors, odors, and gases in the air. Air Quality Sensor offers Set-and-forget convenience by automatically adjusting your air cleaner settings to meet the needs of your environment. CADR Room Size Rating: 360 square feet - Suitable for bedrooms and living rooms Materials: Abs Dimensions: 14. 9\"L x 7. 8\"W x 23. 6\"H Weight: 17. 5 lbs",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=267554011"
            },
            {
                "name": "HEPA Air Purifiers",
                "link": "https://www.amazon.com/hepa-air-purifiers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510192"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Charcoal Gray"
            },
            {
                "name": "Brand",
                "value": "Winix"
            },
            {
                "name": "Product Dimensions",
                "value": "7.8\"D x 14.9\"W x 23.6\"H"
            },
            {
                "name": "Floor Area",
                "value": "360 Square Feet"
            },
            {
                "name": "Specification Met",
                "value": "Energy Star Certified"
            },
            {
                "name": "Noise Level",
                "value": "27.8 dB"
            },
            {
                "name": "Particle Retention Size",
                "value": "0.3 Micron"
            },
            {
                "name": "Controller Type",
                "value": "Remote Control"
            },
            {
                "name": "Wattage",
                "value": "70 watts"
            },
            {
                "name": "Item Weight",
                "value": "16 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Winix"
            },
            {
                "name": "ASIN",
                "value": "B01D8DAYII"
            },
            {
                "name": "Country of Origin",
                "value": "Korea, Republic of"
            },
            {
                "name": "Item model number",
                "value": "5500-2"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 36,884 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,270 in Home & Kitchen (See Top 100 in Home & Kitchen) #15 in HEPA Filter Air Purifiers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Care instructions",
                "value": "Change filters every 12 months"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "Two year limited mfg. Warranty."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "unit and filters"
            },
            {
                "name": "Import",
                "value": "Imported"
            },
            {
                "name": "Power Source Corded Electric",
                "value": "Item Weight 16 Pounds"
            },
            {
                "name": "Control Method Remote",
                "value": "Filter Type HEPA"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "We Care for Your Air in Real Time Air Quality Indicator LED light changes in real-time based on air quality. Dual Smart Sensors + Auto Mode The built-in air quality sensors measure and adjust the fan speed in real-time. Rest Easy When the room is darkened, the unit automatically activates Sleep Mode to ensure continuous, quiet and energy-efficient operation. It changes back to Auto Mode in the presence of light.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/45756369-02de-4b65-be59-9d8eb5b7eaa0.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/c6f37c30-0c1b-468f-9ae2-20652c10d136.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/149a9f8c-8c64-4f0b-9ac4-1bfb7b5a63be.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Easy to Use Convenient Remote Control! Tested and Trusted Energy Star and AHAM Verifide. 1 Year Filter Supply Includes 1 True HEPA replacement filter and 1 AOC Replacement Filter. 5500-2 Air Purifier by Winix 4-Stage True HEPA Air Purifier with PlasmaWave Technology",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f64311cc-2ffc-4588-b2ac-c0f5d3f06ec9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/9294f989-a5a2-49f5-b04a-b27a5458ee7a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a86a4cf8-d2f7-41a6-83fe-b401afd36d94.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4e7a58a3-11b4-4b2b-894b-670fd79cc571.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/c5d5a7e1-5462-4168-89dc-963f9355aa4a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/45756369-02de-4b65-be59-9d8eb5b7eaa0.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c6f37c30-0c1b-468f-9ae2-20652c10d136.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/149a9f8c-8c64-4f0b-9ac4-1bfb7b5a63be.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f64311cc-2ffc-4588-b2ac-c0f5d3f06ec9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9294f989-a5a2-49f5-b04a-b27a5458ee7a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a86a4cf8-d2f7-41a6-83fe-b401afd36d94.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4e7a58a3-11b4-4b2b-894b-670fd79cc571.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "David",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFC2NT4A44JDXII52UASEQ6WMYEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AFAGV0IEK7V1?ASIN=B01D8DAYII",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 23, 2020",
                "reviewTitle": "5.0 out of 5 stars Fantastic Machine, Automatic, Very Quiet, Great looking",
                "reviewText": "** 3-week update **After a few weeks a clicking noise developed in the fan when running on the sleep (lowest) speed. Looking at the fan it appears there maybe an imbalance that over the weeks developed into a motor shaft tapping. Make sure to inspect your unit for a balanced fan. I just issued a replacement on the 5500-2 so we'll see what happens.** Original **I spent weeks comparing units on Amazon and elsewhere. I didn't want to spent > 200 on an overbuilt fan, or be stuck buying overpriced filters. I ended up buying the Winix 5500-2 and Renpho AP002 and first impressions with the two units are that they both appear well built, quiet, and have the automatic mode I really wanted.TL;DR;Winix 5300-2 - Quieter w/Smarter hands off Automatic technology & Ionizer - Set and Forget!Winix 5500-2 - Identical in Black w/Remote & washable carbon filterRenpho AP001 - Incredible unit, Amazing filters, Low cost ownership!Renpho AP002 - Almost identical, slightly more air volumeFILTERSThe Renpho filter has a price and feature advantage over the Winix. Both units have H13 Hepa filters, both have the honeycomb active carbon filters (for capturing VOC), and both have a washable pre-filters for catching large particles. The Renpho however has 2 bonus layers, a microbial coating on the Hepa filter, and an additional charcoal filter sitting before the carbon filter to collect larger particles. The Winix does claim the active carbon filter is washable - Renpho does not make this claim, however both appear similar so it maybe purely marketing. The Renpho filter is shorter and fatter - if you ran the numbers they both likely have similar surface area, thought the Winix is CADR rated for 360 sqr/ft while the Renpho is 330 sqr/ft. They are close.Renpho OEM filters sell for $25 for a full replacement. Winix OEM filters sell for $50 for a full replacement. Renpo claims the filter should be changed every 6 months, Winix claims every 12. I assume this is reflected in their price strategy, however since the filters are so similar, I doubt both claims can be true - and this all depends on how dirty your air is! So cost of ownership is likely less with the Renpho.AIR IONIZATIONThe Winix comes with an Ionizer (called Plasmawave) and Renpho does NOT. The Ionizer charges any particles passing through the unit so they are heavier and will float to the ground and out of air. If you're concerned about Ozone gasses, then this is a feature you can disable and is not a feature on the Renpho.SOUNDThis is a real issue for me - I am sensitive to sound and like the home quiet at night. Deciding on a unit for my children makes this even more important, and I don't want to force them into a white machine for air filtration. In Sleep mode the Winix is significantly more quiet at (advertised) 26dB where the Renpho is at 35dB. With the Winix 10ft from the bed I can just barely hear it. The Renpho is noticable but not \"loud\". The Winix appears to have 5 speed modes, Sleep, Low, Med, High, and Turbo. The Renpho has just 3 modes, Low, Med, High, with Sleep mode being the Low mode with lights off. Here's the rub however - outside of Sleep mode, the Winix sounds \"louder\" having a higher pitched whine while the Renpho is more of a hum. If I was going to just set this on High in a corner and forget it, then Renpho is the winner. For a quiet bedroom the Winix appears the winner.AUTOMATIC MODEThis was a huge feature for me and the Winix is a much \"smarter\" unit. Both units have a similar Automatic feature, sensing the air, bringing the fan speed up or down according to the readings. Both have light(s) indicating the current air quality reading. The Winix however had a light sensor that, when the unit is in Automatic mode, will place the unit in Sleep mode when the lights go out (for more than 1 min). In the morning the unit goes back into Automatic mode. This is huge if you appreciate how quiet the unit is. You can set the Winix to Automatic mode and not touch it until your next filter cleaning. If you wish to use the Sleep mode on the Renpho you will need to push the Speed button to cycle through the speed options back to Sleep - and then again in the morning cycle back to Auto. In reality you maybe better covering the lights with black tape and leaving it in Auto or just leave it in Sleep mode permanently.REMOTEWinix has one, Renpho not - for my needs this is a non-issue.CHILD LOCKRenpho has one, Winix does not - this is a great feature if young kids are around!APPEARANCEPersonally I think the Winix looks clean, modern, and the black color blends well into a corner near furniture. The Renpho AP002 like the Renpho AP001 have their signature funky look which is fine but not as refined. It's an air purifier, so who cares, but it is also a visible piece of equipment in your home.For us the Winix seems more appropriate for a bedroom, the Renpho for a living room. Winix higher cost of ownership justified by the features and sound levels, Renpho for lower ownership cost.If the Renpho unit was QUIETER (ahem - hint hint Renpho) then I would just go that route - save on upfront and ownership cost.SIMILAR MODELSThe Winix 5300-2 and Winix 5500-2 are the exact same physical unit in different colors with different filters. The 5300 is gray, the 5500 is black. Only the 5500 has a remote. The 5500 has their \"advanced\" AOC Washable Active Carbon filter, while the 5300 has a disposable active carbon. The 5300 Hepa filter is slightly thicker (good) and you get 4 disposable filters with each replacement. If you buy the 5500 and don't like the washable filter it comes with you can buy the 5300 replacement pack and use them instead. For $23 more we went with the Winix 5500-2 to test the AOC filter, and for the black aesthetic. Currently you can get the 5300-2 for $129 (Amazon) and when I purchased the Winix 5500-2 for $152 (now listed at $159 on Amazon).The Renpho AP001 (often found as RP-AP001 or AP-001) and Renpho AP002 are very similar products, both using the exact same filters, having different aesthetic designs, and with the AP002 having more airflow (for supposedly the same sound levels) and covering 30 sqr/ft more space. The AP001 has a dedicated Sleep button while the AP002 Sleep mode is the first option on the Speed cycle button - more daily button work for you. Currently the AP001 sells for $99 (Renpho direct) while the AP002 for $137 (Amazon). I bought the AP002 thinking the newer model maybe more quiet than advertised. If we get another Renpho it will be the AP001 for $37 bucks less.",
                "reviewVotes": "268 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GinoGino",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOSRGSVWQCRR6OR6PQWD464UEVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PLYCJM1KUSU6?ASIN=B01D8DAYII",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2017",
                "reviewTitle": "5.0 out of 5 stars Best Bang For Your Buck",
                "reviewText": "I've been looking for a new air purifier for almost a year now, doing research here and there trying to find a unit that meets all the requirments I'm looking for. I need a unit that's for a larger room, has an auto feature, has good priced replacement filters, and looks good to match my home decor. A recent 80,000 acre fire hastened my research due to the thick blanket of smoke that blanket the area (and still is) every morning. With all things considered, the Winix 5500-2 met all my requiements.The unit arrived promptly and unpackaging was an ease. I literally had it set up ans running in about 5 minutes. The body is a hard, matte black plastic that feels sturdy and durable. The front panel is easy to remove, and secures to the unit via a clever magnetic clasp that is secure, yet simple to remove to access your prefilter for bi weekly cleaning and hepa/carbon filter replacement. There are 3 filters in total, and they fit snugly inside the filter chamber, amd ate secured in with the prefilter that snaps firmly into place.The control panel at the top is intuituve and user friendly. The buttons are clearly marked and visual ques explain what each button does taking out any guesswork as to what they do. A stylish indicator light bar runs along the bottom of the control panel indicating the level of air cleanliness with a 3 color scheme...green for clean, orange for okay, and red for bad. You can manually run the machine on 4 fan settings, or choose auto mode and let the machine choose the settings based on the data colected from the sensor. This means hands off operation. There's a night mode that will set the fan to its lowest setting to cut down on noise, and also dim all lights on the panel. This night mode will set automatically if you have the auto mode set on the unit, a light sensor will detect (or not detect) any light in the room and go into night mode. A filter change indicator light also is on the control panel. According to what i've researched, the hepa filter should last approx 1 year. It also comes with a remote control with a battery preinstalled. I dont plan on using it, but if that's your thing, it's there.This is the quietest air purifier I've ever owned. On level 1, it's almost undetectable, and even on level 4 turbo mode, it's no louder than a standing floor fan on high. This was a very pleasant surprise.It cleans the air well. I'm currently using it in my 350 sq ft bedroom. I don't have the equipment to test it, but per their website I should be getting at least 4 air changes per hour which is the amount of air exchanges you need for allergies and serious air purification. I've had no smoke smell AT ALL in the bedroom when I run this with the door shut to the rest of the home and it was initially startling to walk from the bedroom into the rest of the home after the first night of using it.This unit has more than exceeded my expecations ans meets all the things I was looking for in an air purifier. I plan on purchasing 2 more of these when money permits for my combined kitchen/dining/living room area that totals 700 sq ft. I can place these at opposite sides of the area and get more than ample coverage. I would highly reccomend this unit. For the price and the feature list, this just can't be beat. The cost is low, the replacement filters don't cost an arm and a leg, it covers a large area, and you get a lot of features.09/28/20192 years later and this machine is STILL going strong. Besides the occasional vacuuming of the pre filter and the yearly filter changes, I've had this guy quietly working away in the house keeping my air clean. Can definitely say at this point that it's a durable machine!08/20/20203 years later and still working! I'm only posting this update because I find myself in ANOTHER horrible fire season for California, and I'm in a zone getting insane amounts of smoke. Besides regular cleanings on the pre filter, and my yearly change out of the hepa and carbon filter, not much else to report. I really hadnt expected this thing to last this long as I run it 24/7, often on its highest setting to get maximum results. I own 2 now, I bought another one last year to get more coverage throughout the house. I would highly recommend this until to anyone.01/03/2022I was buying a new filter today on here and remembered that I actually had a review for this product. I've owned this air purifier for 5 years now. I just added 2 more photos (should be the last 2 in my string of pictures) just to show that I STILL own this device. 5 years of literal CONSTANT USE. I've had it set on the 3rd setting, just 1 below it's highest setting, for nearly this entire time. I have absolute confidence stating that this is a solid piece of machinery. I'm actually shocked that this guy hasn't given up on me yet! If you're worried about durability, at least in my case, yes, this is a very durable air purifier. Winix created a home run product with this one. I think that this may be my FINAL update on the product (unless of course it survives for 10 years, in which case I may throw a party for the thing!)***I also want to add to those who say this device produces harmful amounts of ozone. That's simply not true. You can go to the California Air Resource Board, specifically to the section under California Certified Air Cleaning Devices. This will show you a list of air purifiers that have been tested by the state and produce under 0.050 ppm of ozone. This device, and all others from Winix, are on the list. That means that this device is at, or below, the levels indicated as safe. Make sure when reading reviews you guys do your own follow up research on an item. It's insane the amount of bad information that's out there! Dont take anyones word, look up what they claim!***",
                "reviewVotes": "2,733 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71-RezsqqCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71PT0a75q+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71goJ4tW4GL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71GgwEyPTBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71nLORyY9ZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michel F",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 27, 2023",
                "reviewTitle": "What's not to like",
                "reviewText": "I just got this air purifier a few days ago so this review is not about long term use or efficacy. So far I love it. It looks and sounds cool and very modern and more importantly it works well with no smells, no fumes, etc. It's easy to understand and move around with the handle on top. I initially set it on automatic and since the air seemed clean, the fan was staying on slow speed or going in sleep mode (very slow). Since this unit is used in a basement with concrete flooring and 2 cats around with litter, I manually set it on fan speed 3 and leave it there throughout the daytime. On rare occasions the air quality light will turn amber for a few minutes and then turn to blue again so I guess it's doing what it's supposed to do. Even on speed 3, I can hardly hear it. I can look and listen at the TV a few feet from the unit with no problems.The only thing I didn't like was the very lousy manual that comes with it. The writing is ridiculously small. They mention how to clean the screen filter (first one) but not how to clean the carbon one. I went on online to find out. It's pretty simple. I don't care or need the remote but it's there for those who might. I get the feeling most people will lose it anyway.The online reviews seem to agree that this is a great air purifier and so far I really like it. A review mentioned that it was made in Korea. Mine is not. It's made in Thailand according to sticker on the box.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 3, 2023",
                "reviewTitle": "Impresionante - Purifica de Verdad",
                "reviewText": "En Monterrey cada vez hay mas contaminación y los sensores de contaminación que comparten en el gobierno no muestran la realidad, mencionan que estamos en verder y uno amanece con la garganta irritada y mucha alergia. Después de este aparato, lo primero que se elimina es la alergia, sientes como hay un ambiente mas limpio. Existen fabricas que liberan gases que muchas veces llegan a los domicilios y el ambiente dentro de casa se siente menos pesado. La opcion automatica, es espectacular, el sólo decide la velocidad dependiendo la contaminación y cuando se apaga la luz el mismo se pone en dormir. El nivel de ruido solo lo notarias en el nivel 4 (Máxima) pero realmente sería momentos muy puntuales con esa velocidad, pero la mayor parte del tiempo es nivel1 y no lo notas.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "hector mercado",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 12, 2021",
                "reviewTitle": "silencioso",
                "reviewText": "buen equipo, solo no es wiifi",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel LópezDaniel López",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 20, 2020",
                "reviewTitle": "Realmente limpia el aire de la contaminación, polvo y olores",
                "reviewText": "The media could not be loaded. Realizo esta reseña después de usarlo durante tres meses, lo compré por que actualmente vivo en la CDMX y me estaba afectando mucho la contaminación. Puedo decirles que realmente funciona, ya que el aire se siente más fresco (sin llegar a ser frío) y limpio, dejé de tener problemas para respirar.Al encenderlo o apagarlo se escucha ese tono musical del vídeo y se enciende una luz de acuerdo al grado de partículas en el aire (Rojo=Muy contaminado, Naranja=Contaminado y Azul=Limpio), además cuenta con varios modos.Limpiar los filtros es sumamente fácil y en las fotos podrán ver (con la misma sorpresa que yo) todo el polvo y partículas que acumuló en estos tres meses, me encuentro casi en shock al saber que todo eso es lo que respiramos día a día en un espacio cerrado.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71gSAuCP68L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71N1d8nFY7L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71T7yAbmiJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71bxb4udONL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711ozCsfvPL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/A1Uv0U8IdDS.mp4"
                }
            },
            {
                "reviewerName": "Ana Sanchez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 1, 2020",
                "reviewTitle": "Muy feliz!",
                "reviewText": "Soy asmatica y sufro de muchas alergias desde que lo tengo en casa me ha ayudado muchisimo. Casi no hace ruido.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}