{
    "remaining_requests": 10321,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Purifiers-Purifier-Aromatherapy-Function-White-ZHIBO-C30-2SET/dp/B0CPBCHPFV",
    "body": {
        "name": "Air Purifiers for Bedroom HEPA Air Purifier With Aromatherapy Function For Pet Smoke Pollen Dander Hair Smell 20dB Air Cleaner For Office Living Room/Kitchen (White-ZHIBO-C30-2SET)",
        "price": "$25.88$25.88",
        "originalPrice": "$49.99",
        "rawPrice": 25.88,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Purifiers-Purifier-Aromatherapy-Function-White-ZHIBO-C30-2SET/dp/B0CPBCHPFV",
        "soldBy": {
            "sellerID": "APEHNM5LD249A",
            "name": "ShunRen",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=APEHNM5LD249A&asin=B0CPBCHPFV&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CPBKBGLL"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CPBCHPFV",
                "variationName": "Color",
                "variationValue": "White-ZHIBO-C30-2SET",
                "price": "$25.88",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Jhx9WYA2L._SS36_.jpg"
            },
            {
                "asin": "B0CVRWXSHS",
                "variationName": "Color",
                "variationValue": "White-ZHIBO-C30-FILTER",
                "price": "$15.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51Tbl78jnjL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Jhx9WYA2L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51FanlxyIwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51r101tz2wL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EzR5hUVBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Y95NJGioL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519sv RW0bL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/615kXF kkFL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e05eeb2b-e367-4b0f-8747-1e4246464bee/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Shunrenful",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=Shunrenful"
        },
        "brand": "Shunrenful",
        "merchantInfo": "ShunRen",
        "customerReview": "2.9 out of 5 stars",
        "customerReviewCount": 11,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35. Order within 17 hrs 27 mins",
            "FREE pickup Wednesday, February 21 on orders shipped by Amazon over $35. Order within 17 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "High Circulation Rate: Enjoy clean and fresh air with air purifier! Using advanced air spiral technology and 360-degree inlets, it refreshes the air per hour in spaces up to 215 sq ft/20 sq m. Experience a 25% increase in purification efficiency for a healthier and more comfortable living environment.",
            "20 dB Low-Noise Operation: Our air purifier operates at just 20dB when in sleep mode, thanks to its reduced fan speed. Even though it's quietly working hard to filter the air, you'll hardly notice its presence. Enjoy a peaceful and calm indoor environment with our low-noise air purifier.",
            "Enjoy Fragrant Air: Enhance your indoor air with your favorite scent by adding 4-5 drops of essential oil to the top aromatherapy pad. The fragrance will circulate throughout the room with the fresh air, providing not only a healthy and comfortable environment but also a pleasant aroma for you and your family to enjoy.",
            "Efficiency Filtration: Air purifier is equipped with HEPA filters that meet high-efficiency particulate air (HEPA) standards, ensuring efficient filtration of smoke, pollen, dander, hair, and more. By turning on the purifier, you can improve the quality of your indoor air and enjoy a healthier life.",
            "Notice: Our air purifiers are equipped with a filter replacement reminder that will turn on the \"Replacement\" light after 2000 hours of use. To ensure the health of you and your family, we suggest replacing the filter cartridge every 3-6 months. Please note that the air purifier has a voltage of 120V and is only suitable for use in the United States."
        ],
        "description": "About this itemEfficiency Filtration: Air purifier is equipped with HEPA filters that meet high-efficiency particulate air (HEPA) standards, ensuring efficient filtration of smoke, pollen, dander, hair, and more. By turning on the purifier, you can improve the quality of your indoor air and enjoy a healthier life.Enjoy Fragrant Air: Enhance your indoor air with your favorite scent by adding 4-5 drops of essential oil to the top aromatherapy pad. The fragrance will circulate throughout the room with the fresh air, providing not only a healthy and comfortable environment but also a pleasant aroma for you and your family to enjoy.20 dB Low-Noise Operation: Our air purifier operates at just 20dB when in sleep mode, thanks to its reduced fan speed. Even though it's quietly working hard to filter the air, you'll hardly notice its presence. Enjoy a peaceful and calm indoor environment with our low-noise air purifier.High Circulation Rate: Enjoy clean and fresh air with air purifier! Using advanced air spiral technology and 360-degree inlets, it refreshes the air per hour in spaces up to 215 sq ft/20 sq m. Experience a 25% increase in purification efficiency for a healthier and more comfortable living environment.Notice: Our air purifiers are equipped with a filter replacement reminder that will turn on the \"Replacement\" light after 2000 hours of use. To ensure the health of you and your family, we suggest replacing the filter cartridge every 3-6 months. Please note that the air purifier has a voltage of 120V and is only suitable for use in the United States.1. About 1,000,000+ families and 38,000,000+ peoples suffering adverse reactions such as coughing, sneezing, and difficulty breathing. (Tips: The voltage of air purifier is 120V, which is only suitable for the United States)2.Turn on the sleep mode of the purifier and the fan will be reduced to the lowest speed. You won't hear any sound anymore, but the purifier is really working. Filtered air noise is as low as 20dB, perfect for a quiet and soothing indoor environment.3.Adopts dual-channel technology and 360-degree air outlet, refreshes the air per hour in rooms as large as 215 ft² / 20 m²cover.4.Take out the aroma pad below the purifier air outlet and add 4-5 drops of your favorite essential oil (Not Included). With the flow of the fresh air, the fragrance will follow it to circulate to every corner of your room.5. air purifier utilizes a HEPA filter that effectively removes smoke, pollen, dander, hair, and more from the air. (Note: The air purifier has a voltage of 120V and is designed for use only in the United States.)6. High-Efficiency Filtration System, Powerful Air Suction Performance, Quickly Purifies Indoor Air, Per-Hour Air Change +36% Faster Than other Air Intake Systems.s, which can cause sneezing,",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=267554011"
            },
            {
                "name": "HEPA Air Purifiers",
                "link": "https://www.amazon.com/hepa-air-purifiers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510192"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2 x 2 x 5 inches; 8 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ AIR PURFIER（ZHIBO-C30）"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ December 2, 2023"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CPBCHPFV"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#481,936 in Home & Kitchen (See Top 100 in Home & Kitchen) #470 in HEPA Filter Air Purifiers"
            },
            {
                "name": "Customer Reviews",
                "value": "2.9 2.9 out of 5 stars 11 ratings"
            },
            {
                "name": "Color",
                "value": "White-ZHIBO-C30-2SET"
            },
            {
                "name": "Brand",
                "value": "Shunrenful"
            },
            {
                "name": "Product Dimensions",
                "value": "2\"D x 2\"W x 5\"H"
            },
            {
                "name": "Floor Area",
                "value": "215"
            },
            {
                "name": "Noise Level",
                "value": "20 dB"
            },
            {
                "name": "Power Source USB",
                "value": "Item Weight 8 Ounces"
            },
            {
                "name": "Control Method Touch",
                "value": "Filter Type HEPA"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MondayMonday",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6V5VTGV34KLUIHNVMPSXZUU2TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22WTRU2BD3J3G?ASIN=B0CPBCHPFV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "4.0 out of 5 stars Somewhat effective",
                "reviewText": "My expectations when I ordered this pair of air purifiers were reasonable. I realized these were not for the whole house, and the effectiveness would be limited. I placed one in my bedroom where my dog sleeps, so I figured there were airborne particles such as pet dander or dust. These air purifiers do draw in air from all sides through a Hepa H-13 filter and the filtered air is expelled through the top. It does circulate the air well in small spaces. It has three speeds/functions, but they just seem like air speeds. I like white noise, so I keep mine on high in the bedroom. I do have essentials oils, so I put several drops of lavender oil in the aromatherapy pad at the top where the air blows out. Each is powered with the provided USB power cable. There is no transformer provided, so you cannot operate it out of the box if you do not have a transformer. I have plenty of transformers, so that did not keep me from operating it immediately. I placed the second one on the bar in the kitchen where I have a fryer. When I use the fryer, I want something to filter the air and cooking odors, so they do not linger in all rooms. I fried some fish with the air purifier running and peppermint oil applied to the aromatherapy pad. That worked better than I thought it would. I could tell that the odors were less than they would have been without the purifier running. My main concern is that you should change the Hepa filter every 3-6 months (2000 hours), but there is no link to the correct replacement filters. I have sent a message to the sellers asking for a place to purchase these proprietary sized filters. If I cannot find replacement filters, these will be tossed after 6 months. I shall withhold an opinion until the sellers respond. I find it interesting that you can operate it from your car, if your car has the USB ports. Mine car does and I did operate one of these air purifiers in my car. Overall, I like how they seem to clean and circulate the air, but more importantly I love the white noise.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41RzHY6iKxL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51HHnolcUVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51J9xIXDzKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51YISgi2eLL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "User",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOBAVEX53MLHSGAX4L63X6KMHDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2345NK61XMQLF?ASIN=B0CPBCHPFV",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "2.0 out of 5 stars No difference in air quality",
                "reviewText": "After using this for several days I don't think this does anything than just blow air out..I'm not 100% sure as I don't even know how to test it, but I do know it's USB powered and runs on 5 volts that's not very strong and only about a foot in size so I doubt it could actually purify anything except maybe a small closet or fridge, if it works at all because I think all it does is just make noise. It fell over a few times when I was trying to plug in the short USB cable and the whole thing toppled over and came apart..and still didn't make a difference and stayed on producing the same noise level.This company sells 2 of these for $10 each..so you have to wonder what the manufacturer cost is if theymark it up to $10...so to recap no actual detectable difference in air quality, very cheap price, low power..I'm going with my gut and say all this does is just make noise and blow air out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Silly Rabbit",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSL7ARTCT4QVG3PUQC7EUV5LPWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AEW0484ODV76?ASIN=B0CPBCHPFV",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "3.0 out of 5 stars Air Purifiers for Bedroom HEPA Air Purifier With Aromatherapy Function For Pet Smoke Pollen",
                "reviewText": "OK, I want to be straight up, the three-star review is due to the inability to source replacement filters... The seller does not appear to offer up replacement filters and try as I might even after pouring over pages of other Amazon listings I was unable to find a filter that was the proper dimensions for this purifier... That means based on the sellers directions in this listing, these are basically use for 3 month (2000 hours) and then toss in the garbage since you are unable to source new filters...They still hold 3 stars because at about $13 a piece in the ($26) double pack at this time they are not much more than many replacement filters cost alone, so it's not a huge loss to toss the entire unit in 3 months, but still very aggravating and wasteful... If the price goes up this single-use value obviously diminishes...On to the unit itself, they are simple devices, a small housing that holds a filter with a fan on top, the fan draws air into the unit and through the filter, this scrubs the air... They are small units so to get multiple air scrubbing cycles even in a smaller room you will need to run this for an extended period of time or constantly...I do a significant amount of 3D resin printing, the resin stinks... During printing I exhaust a lot of the air to keep the stink down, but when I'm done I generally just keep the door closed to that room and the odor lingers... I grabbed these to test out how well they will work at removing any residual odor in the room after printing... So I set up one of the units and have now left it running for 24 hours in the closed room and I have to say it did its job, the level of odor in the room has dropped noticeably over what it normally is... So they do work albeit slowly due to their small size... So again they do get a good rating on doing what they are designed to do, but not being able to find replacement filters is a big negative...All in all if you want a small room air purifier and understand that you will either be tossing these out after 3 months of use, making some makeshift filters or maybe being lucky and replacement filters might be offered in the near future they are not a horrible deal...If the seller offers reasonably priced replacement filters or you are able to find some on your own I would probably bump the rating up to 4 stars, maybe even 5 if the replacement filters are cheap enough...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}