{
    "remaining_requests": 10233,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hamilton-Beach-True-Odor-Eliminator/dp/B000H0Y4XM",
    "body": {
        "name": "Hamilton Beach TrueAir Plug-Mount Air Freshener Odor Eliminator for Common Household-Tobacco, Pet, Bathroom & Trash, On/Off Fan, with Carbon Filter, White",
        "price": "$20.72",
        "originalPrice": "",
        "rawPrice": 20.72,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hamilton-Beach-True-Odor-Eliminator/dp/B000H0Y4XM",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Ou-uizthL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/4168f5buu8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dKJYvGBOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iu1ryjlmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419Dbqz1qDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Tl4swYBzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41SXQg-TJxL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Hamilton Beach Store",
            "link": "https://www.amazon.com/stores/HamiltonBeach/page/61F77C7C-D7C2-4996-90DD-A99598994A35?ref_=ast_bln"
        },
        "brand": "HamiltonBeach",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 1316,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 17 hrs 16 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 17 hrs 16 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Quiet and Efficient: Quiet Fan Pulls in Unwanted Smells That Are Trapped and Neutralized by the Replaceable Carbon Filter, Bringing Fresh Air Back Into Your Home.",
            "Traps and Neutralizes Common Household Odors: Terrific for Eliminating Kitchen, Bathroom, Pet, and Tobacco Odors. Also Good for Workrooms and Trash Rooms.",
            "Easy to Use: Simple On/Off Switch for Maximum Odor Elimination. Unit Plugs Directly Into Any 110 Volt Outlet.",
            "Eliminates Odors and Freshens Air for up to 3 Months: Includes Filter Replacement Indicator to Let You Know When It Is Time to Change the Filter.",
            "Replacement Filters Available: Use Any Trueair Replacement Filter for Common Household, Pets, Tobacco or Green Meadow Scent Cartridge. Models Include 04230g, 04231gw, 04234g, 04290g, 04291g, 04294g and 04600."
        ],
        "description": "Neutralize Odors: The Hamilton Beach TrueAir Odor Eliminator doesn’t mask pet smells, food and other odors, it eliminates them. The quiet fan pulls air through and the carbon filter, trapping and neutralizing odors before sending fresh air back into the room for about 3 months. Replacing your Hamilton Beach True Air filters is easy. Simply, place the filter in the unit, fitting the notched corner of the filter around notched edge of the odor eliminator.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b?ie=UTF8&node=267554011"
            },
            {
                "name": "Charcoal Air Purifiers",
                "link": "https://www.amazon.com/Home-Charcoal-Air-Purifiers/b?ie=UTF8&node=3737411"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Brand",
                "value": "Hamilton Beach"
            },
            {
                "name": "Product Dimensions",
                "value": "5.24\"D x 6.46\"W x 3.74\"H"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Controller Type",
                "value": "Button Control"
            },
            {
                "name": "Item Weight",
                "value": "1.1 pounds"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Hamilton Beach"
            },
            {
                "name": "ASIN",
                "value": "B000H0Y4XM"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "04530G"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 1,316 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#62,614 in Home & Kitchen (See Top 100 in Home & Kitchen) #15 in Home Charcoal Air Purifiers #516 in Home Air Purifier Parts & Accessories"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "One(1) Year Warranty"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Hamilton Beach® True Air® Plug-Mount® Odor Eliminator"
            },
            {
                "name": "Import",
                "value": "Made in the USA"
            },
            {
                "name": "Power Source Battery Powered",
                "value": "Item Weight 1.1 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Hamilton Beach products are thoughtfully designed to make your life easier. We use consumer insights, in-depth research to deliver the best solution to your everyday needs. Whether it's preparing delicious meals and beverages effortlessly, or making your clothes look their best, you can count on the brand that has spent over 100 years creating products with you in mind. Hamilton Beach TrueAir Plug-Mount Odor Eliminator Bring a breath of fresh air back into your home. Freshen up the air in your home with the Hamilton Beach TrueAir Plug-Mount Odor Eliminator. With an activated carbon filter, the TrueAir quiet fan pulls air in and neutralizes odors, sending fresh air back into the room. It plugs into a standard 110-volt outlet. A filter replacement indicator lets you know when it’s time to change the filter - typically about every 3 months. Carbon filter traps & neutralizes odors, doesn’t mask them Quiet fan pulls in unwanted odors Filter replacement indicator Great for kitchens, tobacco, pet areas and bathrooms Plugs into a standard 110-volt outlet",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/edb331b5-22cb-4c8c-a299-b1893047481f.__CR225,0,1350,1800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/931d0146-f599-419e-b8d4-6eb03c0b7db5.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Features: Neutralize Odors The Hamilton Beach TrueAir Odor Eliminator doesn’t mask pet smells, food and other odors, it eliminates them. Quiet Fan The quiet fan pulls air through and the carbon filter traps and neutralizes odors before sending fresh air back into the room. Standard Wall Mount With a standard plug-in for 110-volt outlets, the TrueAir Odor Eliminator can work in the kitchen, bathroom, nursery or any room that needs it.A filter replacement indicator lets you know when it’s time to change the filter - typically about every 3 months. Freshen the Air Around Your House Removes pesky kitchen odors & pet odors, eliminates the smell of tobacco smoke, and keeps the bathroom fresher for longer.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d845bbba-0ff8-496b-aafa-59015785498d.__CR0,0,1800,1800_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d4f774cf-f3e3-41c8-b659-a647a7c372dc.__CR0,0,1800,1800_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7c786d9e-0928-490a-9b05-3476c6c3a40d.__CR0,0,1800,1800_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4641d5af-5791-4a00-9fd9-ae9d25f4d7a3.__CR0,0,1800,1800_PT0_SX220_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/edb331b5-22cb-4c8c-a299-b1893047481f.__CR225,0,1350,1800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/931d0146-f599-419e-b8d4-6eb03c0b7db5.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d845bbba-0ff8-496b-aafa-59015785498d.__CR0,0,1800,1800_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d4f774cf-f3e3-41c8-b659-a647a7c372dc.__CR0,0,1800,1800_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7c786d9e-0928-490a-9b05-3476c6c3a40d.__CR0,0,1800,1800_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4641d5af-5791-4a00-9fd9-ae9d25f4d7a3.__CR0,0,1800,1800_PT0_SX220_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Michelle John",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVXF5CNWHBUSFTYVEPO2AISHHCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3REEIRF8IHIMR?ASIN=B000H0Y4XM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Odorbegone",
                "reviewText": "I recently purchased the Hamilton Beach TrueAir Plug-Mount Air Freshener, and I am very pleased with its performance. This compact device has effectively eliminated odors in my home, leaving it smelling fresh and clean.Firstly, I love the design of this air freshener. It is small and discreet, plugging directly into the wall outlet without taking up any extra space. The white color and sleek shape blend seamlessly with my home decor.The TrueAir air freshener works by using a carbon filter to trap and neutralize odors. I have noticed a significant improvement in the air quality since I started using it. It effectively eliminates unpleasant smells, such as cooking odors, pet odors, and even cigarette smoke.Another great feature of this air freshener is its adjustable scent control. It has a dial on the side that allows me to customize the level of fragrance intensity. Whether I want a subtle hint of fragrance or a stronger scent, I can easily adjust it to my preference.I also appreciate the long-lasting performance of the TrueAir air freshener. The carbon filter can be replaced, ensuring that it continues to effectively eliminate odors over time. The replacement filters are affordable and easy to install, making maintenance a breeze.One minor drawback of this air freshener is that it only works when the room is well-ventilated. It doesn't circulate the scent throughout the entire house like some larger air fresheners do. However, I find that it is sufficient for smaller rooms or areas where odors tend to linger.Overall, I highly recommend the Hamilton Beach TrueAir Plug-Mount Air Freshener for anyone looking to eliminate odors in their home. It is compact, effective, and offers adjustable scent control. Say goodbye to unpleasant smells and hello to a fresh and inviting atmosphere with this fantastic air freshener.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGTMMD3UZ5U75L4CXVPZDRJCENQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q4GXU7U4QLS0?ASIN=B000H0Y4XM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars True Air Plug-Mount Air Freshner Odor Eliminator",
                "reviewText": "This item removes the odors from cooking very well. It is quiet. I was surprised by how well it works because of its small size. I did not order the scented cartridges/filters for it but the basic machine works great. I did order replacement filters so I will have them as needed. I would recommend this product for anyone wanting to eliminator odors in their kitchen, and even in the bathroom.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rony Franky",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXWL7HLBN2EE4NPPX3NTXV6DZMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ETWIVARAZQKR?ASIN=B000H0Y4XM",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2016",
                "reviewTitle": "3.0 out of 5 stars ... product works for most people as it has a good positive amount of rating",
                "reviewText": "I see that this product works for most people as it has a good positive amount of rating. However, the True Air was a hit and miss for me. It really eliminated the odor in the first 2 weeks of use but after that it was more of a here and there situation until it ceased to eliminate anything period. I feel that two weeks was just such a short length of work for the filter in the item. I mean it's not like the bathroom was in heavy use at all. Worst is that my filter change indicator never worked and it was not quiet and discreet as described.I threw it away because I was so disappointed in it. I'm not sure if buying another one as a second try is a good idea. So, I may look into a competitor's product instead.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGB47LQJY5EK2PTFZL4MHQKTLPYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SJT2CNOPDTAD?ASIN=B000H0Y4XM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 16, 2012",
                "reviewTitle": "4.0 out of 5 stars Febreze/Hamilton Beach TrueAir plug-in small room air filter",
                "reviewText": "This air filter has a few good points and a few bad ones, but overall it's a decent little device that will filter the air in a small room if given adequate time.It is a bit larger than I expected, even with the photo showing the correct perspective against a wall outlet. It just appears bulkier in person than it does in the photo.The housing is made of a plastic that has some give/flexibility to it (which is a good thing), with a power switch on the right side and the air exhaust on the left. The entire front face contains the filter medium, just as the product photo suggests.Above the filter vents is a white strip that is supposed to indicate that the filter should be changed when completely red. I have not yet seen this change colour, at all. The indicator is contained in foil blister pack that slides into clip on the inside of the filter panel.The front filter panel snaps into place, positioned on two tabs attached to the housing at the top, and two tabs on the bottom of the front panel snap in place on the exterior of the housing.The unit is designed with a plastic centrifugal (squirrel-cage) fan due to the side exhaust, which makes it a bit loud for its size. But, it does move a fairly good amount of air.I purchased the model without the night-light as I don't intend to keep this thing running 24-hours a day.The back of the unit has a two-prong U.S. style plug at the top, and a small white foam strip near the bottom to balance the unit in a vertical position on the wall.PROS:- For the price, this little air filter is a capable unit that will filter odours in a small room given enough time.- The plastic housing is flexible enough to have a decent amount of durability. It apparently absorbs impact well enough to protect the unit from falls.- The filters last for a decent amount of time, replacement is easy, and new filters are affordably priced.CONS:- Rather large for an outlet, especially for a combination bathroom outlet and light switch. The top curvature of the unit is enough to accommodate the travel of a standard toggle light switch, but due to the size of the housing it will make use of a paddle switch difficult.- The two-prong electrical plug design makes it rather flimsy when plugged in, and if the unit is used on a outlet-switch combination plate it is easily knocked off the wall when trying to turn on or off the lights. The caveat appears to be the durability of the flexible plastic which has effectively saved my air filter from an untimely demise flying across the bathroom on several occasions. A three-prong grounded electric plug would probably have solved this.- Loud. In my opinion, too much so for 24-hour use in a main bathroom.- Air movement/circulation is restricted due to the 90-degree angle of air exhaust. If the unit is placed mid-wall, and too near the corner of the room, it will create a pocket of circulating clean air, and will require a much longer period of time to filter the entire room.The unit should have been designed to throw air back, more toward the centre of the room, rather than along the wall in order to better mix and move the air entering the front vents.Since the outlet in my bathroom is also the light switch, and next to the door, I have found that leaving the door cracked a bit while the fan is running will exhaust the clean air out of the bathroom and create enough air movement to take in fresh air from outside the bathroom. This moves enough air through the room to filter the entire room more efficiently.The alternative would be to cut a window in the exterior wall. Unfortunately, I live in a condo and they frown on that sort of thing.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}