{
    "remaining_requests": 10511,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Purifier-Washable-Pre-Filters-Particle-Allergens/dp/B073WJL99W",
    "body": {
        "name": "BLUEAIR Air Purifier Large Room, Air Cleaner for Dust Pet Dander Smoke Mold Pollen Bacteria Allergen, Odor Removal, for Home Bedroom Living Room, Washable Pre Filter, HEPASilent, Blue 211+ (Non-Auto)",
        "price": [
            "3 options from $152.10"
        ],
        "originalPrice": "$319.99",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Purifier-Washable-Pre-Filters-Particle-Allergens/dp/B073WJL99W",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CT96K3YM"
        ],
        "asinVariationValues": [
            {
                "asin": "B073WJL99W",
                "variationName": "Style",
                "variationValue": "211+",
                "price": "$211.37",
                "variationImageURL": ""
            },
            {
                "asin": "B073WJDQMN",
                "variationName": "Style",
                "variationValue": "Blue Pure 411",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/212cBsLQFvL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41DdMuw3STL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zSPbamtaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41jRo82JVPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41dkUCu VkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41E2Ovp-fSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51tM2h-ClTL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Blueair Store",
            "link": "https://www.amazon.com/stores/BlueairInc/page/8B8D544F-7625-4019-AD3A-858AE9E52123?ref_=ast_bln"
        },
        "brand": "BlueairInc",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 19002,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22. Order within 17 hrs 51 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SIMPLE ONE-BUTTON CONTROL: Easily adjust fan as-needed with one button to ensure optimal air quality, including lowering fan speed at night for uninterrupted sleep",
            "CLEAN AIR IN MINUTES: Blueair's HEPASilent technology, delivers clean air, faster, and much more quietly than traditional HEPA filtration alone; Quickly cleans 540sqft large room in about 12.5 min or up to 2592sqft XL space in 60min, on high",
            "ONE OF THE QUIESTEST AIR PURIFIERS: Quieter (31 dB) than whisper on low; ENERGY STAR rated - uses less energy (30W) than an incandescent lightbulb on low",
            "COMBAT ALLERGENS: Helps reduce allergens and pollutants that trigger allergy and asthma symptoms",
            "REMOVES ODOR & PARTICLES DOWN TO 0.1 MICRON: Ideal for smoke & smog during wildfire season; Removes 99.97% of airborne particles like smoke, dust, viruses and pet dander, while the carbon filter traps light household odors from smoking, pets and cooking",
            "MOST AWARDED AIR PURIFIER BRAND IN THE US: Blue Pure 211 plus has won Good Housekeeping – 10 Best Air Purifiers of 2021, Best Overall Air Purifier; Wirecutter Pick - The Best Air Purifier - 2019 - 2022",
            "INDEPENDENTLY TESTED FOR PERFORMANCE & SAFETY, ZERO OZONE: AHAM Verifide for CADR; Ozone Safety Standards Certified by CARB; Zero Ozone Verified (<5 ppb) by Intertek Sustainability Program; Trusted Education Partner of British Health Professional Academy",
            "GENUINE FILTERS FOR OPTIMAL PERFORMANCE: Replace your filter every 6 months to ensure proper functionality & only use genuine Blueair filters; Shop 211 plus replacement filter: B073SKH39W; Upgrade to SmokeBlock filter for enhanced removal: B0B453ZDZ6. A 360-degree air intake means you can place the 211+ almost anywhere without compromising performance. Combine this with its compact and lightweight design, and you have an air purifier that is easy to move and place wherever suits you."
        ],
        "description": "\"Blue Pure 211+ air purifier quickly cleans 540sqft large room in about 12.5 min or up to 2592sqft extra-large space in 60min, on high. Only Blueair air purifiers use HEPASilent™ technology, delivering maximum filtration with minimum noise. Combining mechanical filtration with electrostatic charging of particles produces clean air, faster, and much more quietly than traditional HEPA filtration alone. Delivers high performance with automated one-button control in a lightweight, compact package and includes washable, pre-filters in Dark Shadow (Gray) and Diva Blue. It can also be customized in other Swedish-inspired pre-filter colors that are sold separately. Carbon filter traps light household odors from smoking, pets, cooking, and more. Award-winning, sleek, Swedish design compliments your aesthetic while working hard to clean your air so you can place where it will be most effective at capturing airborne particles & odors without worrying about it cramping your style. Independently evaluated for safety standards and third-party tested for performance as part of the AHAM Verifide® Program for air cleaners, this air purifier has a Clean Air Delivery Rate (CADR) of 350 for fine smoke particles, 350 for pollen particles, and 350 for dust particles.CLEAN AIR IN A MATTER OF MINUTES: Comparing CADR performance of Blueair models with mechanical and electrostatic filtration vs same models with only H13 HEPA mechanical filtration. When similar CADR was measured, Blueair models with mechanical and electrostatic filtration achieved less noise with less energy than same models with only H13 HEPA mechanical filtration. According to AHAM, air changes per hour (ACH) is the measure of the outside air volume added to a space divided by the volume of that space over a set amount of time.REMOVES ODOR & PARTICLES DOWN TO 0.1 MICRON: Blueair models with HEPASilent's mechanical and electrostatic filtration produced higher CADR, lower noise, and had lower energy consumption vs. the same models with only mechanical filtration (H13 filter). Tested on PM2.5 (0.1 - 2.5 μm) up to 90min; Tested on Influenza A (H1N1) with a minimum reduction rate of 99.99% in 60min.MOST AWARDED AIR PURIFIER BRAND IN THE US: Based on survey of over 50 awards, accolades, and recommendations issued by independent consumer associations, media publications, and industry competitions from January 1, 2022, through August 16th, 2022, for products sold in the US by top 10 air purifier brands according to NPD Group Retail Tracking Service, Small Appliances, U.S. sales dollars June 2022 YTD.BACTERIA, VIRUS & MOLD SPORE REMOVAL: Tested to reduce E.coli and Influenza A (H1N1) with minimum reduction rate of 99.9% in 60min; Tested on A.niger with minimum reduction rate of 99.9% in 60min.&quot.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b?ie=UTF8&node=267554011"
            },
            {
                "name": "HEPA Air Purifiers",
                "link": "https://www.amazon.com/hepa-air-purifiers/b?ie=UTF8&node=510192"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Gray"
            },
            {
                "name": "Brand",
                "value": "Blueair"
            },
            {
                "name": "Product Dimensions",
                "value": "13\"D x 13\"W x 20\"H"
            },
            {
                "name": "Floor Area",
                "value": "540 Square Feet"
            },
            {
                "name": "Noise Level",
                "value": "56 dB"
            },
            {
                "name": "Particle Retention Size",
                "value": "0.1 Micron"
            },
            {
                "name": "Controller Type",
                "value": "Button Control"
            },
            {
                "name": "Wattage",
                "value": "61"
            },
            {
                "name": "Item Weight",
                "value": "12.98 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Blueair"
            },
            {
                "name": "ASIN",
                "value": "B073WJL99W"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "211PACF100711"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 19,002 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,221 in Home & Kitchen (See Top 100 in Home & Kitchen) #62 in HEPA Filter Air Purifiers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "1 year warranty. 2 year warranty with product registration through blueair."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Blue 211+ air purifier, 2 pre-filters, 1 particle with carbon filter, product documentation"
            },
            {
                "name": "Import",
                "value": "Imported"
            },
            {
                "name": "Power Source Corded Electric",
                "value": "Item Weight 5.9 Kilograms"
            },
            {
                "name": "Control Method Touch",
                "value": "Filter Type Activated Carbon"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Designed for large rooms​ Filters the air at a rate of approx. 4.8x an hour (or about every 12.5 minutes) in a 540 ft² room to effectively lower particle levels in large living rooms, family rooms & playrooms.​ Performance you can trust​ Independently evaluated for performance by the AHAM Verifide Program for room air cleaners with a Clean Air Delivery Rate (CADR) of 350 CFM smoke, 350 CFM pollen, and 350 CFM dust in 540 ft² rooms.",
                "media_link": []
            },
            {
                "media_text": "Previous page Washable Fabric Pre-Filter The fabric pre-filter offers the first layer of protection, catching larger particles from the air. Remove 99.97% of airborne particles Electrostatic filtration works with the particle filter to remove 99.97% of airborne particles. Charged particles stick to filter media The particle filter captures airborne germs and allergens like pollen, dust, pet dander, and more. Activated carbon layer removes light odors A layer of activated carbon traps light household odors from pets, cooking, and smoking. Next page 1 Captures large particles 2 HEPASilent technology 3 Removes pollutants 4 Traps odors",
                "media_link": []
            },
            {
                "media_text": "Wirecutter Pick Independently reviewed by the experts at Wirecutter, the Blue Pure 211+ ranks as one of their top air purifier picks, named \"A stellar performer for larger rooms.\" Good Housekeeping Lab Pick Good Housekeeping Lab Pick 2020 for best overall air purifier, the Blue Pure 211+ air purifier is featured in “8 Best Air Purifiers of 2020, According to Experts.” *Diva Blue pre-filter included",
                "media_link": []
            },
            {
                "media_text": "One-button control Forget about adjusting settings and knobs - a single button controls it all and lets you know when it's time to replace the filter. The built-in warning system glows red when it's time for a change. Simple to place Unlike some air purifiers with strict rules for placement, Blue models use a 360-degree air intake, meaning you can place it almost anywhere in the room without compromising performance.",
                "media_link": []
            },
            {
                "media_text": "Compare Blue family air purifiers 211+ Add to Cart 311 Auto Add to Cart 411 Auto See Details 411+ See Details 411 See Details 121 See Details Customer Reviews 4.6 out of 5 stars 19,002 4.6 out of 5 stars 3,160 4.6 out of 5 stars 6,889 4.5 out of 5 stars 2,309 4.6 out of 5 stars 19,002 4.5 out of 5 stars 576 Price $211.37$211.37 $141.32$141.32 — — — — Room Size 540 ft² ​ 388 ft² ​ 190 ft² ​ 185 ft² ​ 161 ft² ​ 620 ft² ​ CADR-Smoke 350 cfm 250 cfm 123 cfm 119 cfm 105 cfm 400 cfm Auto Mode ✘ ✔ ✔ ✘ ✘ ✘ AQI ✘ ✔ ✔ ✘ ✘ ✘ Included Pre-Filter Dark Shadow, Diva Blue Arctic Trail Arctic Trail Dark Shadow Dark Shadow, Diva Blue Dark Shadow, Diva Blue Metal filter housing ✔ ✘ ✘ ✔ ✘ ✔ AHAM Verifide ✔ ✔ ✔ ✔ ✔ ✘",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/4e8f6d1f-864d-475d-87ae-2d2208dd82f0.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f95658a7-779e-42f3-b191-757513f40af9.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/58070303-e35d-4e16-ae89-e2a05dd1a8d7.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f972f6a1-f2a8-4346-bae4-e1030f8ab06e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/acce921a-07cc-490d-a25e-1569b64a77bb.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/71499c67-f5d0-403f-a150-950fccfda283.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0d7fa882-6a5d-40f3-a8f9-b16fd65a505b.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/db96d077-51ff-465b-80c9-1bd7b9eb7bdd.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dae675f4-3000-4ff3-9609-0861e182b606.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/522f6516-e963-4aa2-a263-35b2d9894a69.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e70dff44-a1f9-4ba8-bb74-30ebea486ccd.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8c10ddaf-c9f6-458b-9a4d-d95d4569f13a.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/26a80e8c-3e98-4d17-ae34-02a41cd18573.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/28a82446-da59-4764-a5f0-4bc21634d36a.__CR0,0,200,225_PT0_SX200_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d00b6e56-5f17-4082-bcdd-7cd5352746d4.__CR0,0,200,225_PT0_SX200_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d5ddfcff-4c1d-496a-b65d-0c9525499a5e.__CR0,0,200,225_PT0_SX200_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/78572293-a33b-4158-a667-511ca0386430.__CR0,0,200,225_PT0_SX200_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/70540778-caf2-4746-9b44-5fadfa7bd918.__CR0,0,200,225_PT0_SX200_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTLMB7LUHMRRTP6L3KUC5HMGNEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYXDQUHM0JDVW?ASIN=B073WJL99W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 26, 2020",
                "reviewTitle": "5.0 out of 5 stars Simple, quiet, powerful",
                "reviewText": "Initial impressions of this purifier are very positive. I'm not setup to test the actual purification abilities beyond an anecdotal indication that it seems to clear the air well. See the reviews on Smart Air (they think it works very well but is over priced), Consumer Reports (the 211 and the Classic 605 are their two highest rated units), and elsewhere. BlueAir is very well regarded in terms of actual cleaning effectiveness.For all the other features, here are some of my key decision points and useful tips:First, I bought both a 121 and 211+ - they have similar specs, except the 121 has a 400 CADR rating rather than a 350 for the 211. I was a bit surprised to realize that they appear to have identical motor and fan units - you can swap them back and forth, and they measure identical power consumption, and sound the same. This means the 121 gets the slight boost by simply being taller and holding a larger filter. More filter area would make for more efficient filtration, and a small boost in CADR rating.This isn't really a knock, it is just worth noting if you are considering both units. I would say the 211+ is the better value in this regard, the 121 is over $120 more expensive, has $20 more expensive filters, and only slightly more filtration capacity. If you need something just barely over the 211+ in filtration, only have space for one unit, and have a large open space, then the 121 makes sense. Otherwise, if you need more than the 221 provides, and you have a space that isn't just one big open room, then buy two 211+s - it is still a better value than most of the other comparable units, and two small units will filter an uneven space better than one loud one.As for noise, these are both very quiet units (same noise, because they seem to have the same fan). The background noise in my house measured at 38dB, and I measured on an iPhone running DecibelX, A-weighted, at 1 meter from the unit, horizontally, mic pointed at the unit.- Low - 39dB, just barely over the background noise. It is not obvious that the unit is even on.- Medium - 48dB, I can tell that it is on from around the room, but only if I listen for it.- High - 55dB, OK, now it is making some noise, but it is soft in tone, not rattling or whining. Still reasonable in volume, and easy to talk over. It wouldn't kill your conversation and if you sleep with a white noise machine it might actually be similar volume (our DreamEgg at mid-high volume is about this loud).Power consumption is as indicated on the package - 30W, 43W, 62W, as measured by my meter. Quite reasonable again given the ~400CFM the fan must be blowing.Small things to appreciate:- The unit is attractive and simple. It doesn't look like a weird 90's appliance with a bunch of random protuberances or shiny stickers. It is clean and Swedish, and would integrate with a lot of decor. The changeable pre-filters come with a light blue and a midnight blue, and you can buy others. Looks fine without it as well, pure white.- The overall construction is simple and sturdy - a metal box to hold the square (but flat folding) filter, and an upper box with the controller and fan unit.- Upward blowing and pulling from all sides makes for a lot of filter area - units that just pull in the side or front are going to have a lot less filter area for the same air flow - meaning more noise.- The button on the front is capacitive - touch to change between off -> low -> med -> high -> off. It is sensitive and easy to use - I change it with my toe while holding a baby.- The unit remembers the last setting if the power is removed and restored. This means you can use it with a timer or in my case, Home Assistant automation!- The LED showing the current speed dims to 10% after a few seconds - very nice - I'm usually forced to put black tape over everything I buy to dim the bright LEDs everyone uses.The unit does not include Wifi (pointless and risky), particle counters (not going to be accurate at these price points), a display (why does it need one?), or an auto mode (read the articles on Smart Air about auto modes - they are mostly useless and sometimes much worse than just setting a moderate level and letting the unit run all the time). Basically it has everything you want - quiet fan, large filter area, easy buttons, and nothing you don't want.It isn't the cheapest unit, but it isn't the most expensive either. Compared to very cheap units you get a quieter fan and a more proven filter technology from a vetted company. Compared to more expensive units you lose some (mostly useless) control features, and some options for multi-stage filtering or chemical canisters like you might see from a (8X the price) IQair. My inlaws have a Blueair Classic 605 and this unit is smaller and quieter, for only slightly less filtration capacity, at 1/3rd the price.All in all, an easy recommendation if the filtration capacity meets your space needs.",
                "reviewVotes": "148 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Pedersen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQZBKVRGRN3JMGTBDL2SU4RSKYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V4IDGFHSPNT5?ASIN=B073WJL99W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 9, 2021",
                "reviewTitle": "5.0 out of 5 stars Seems to work well, really reduces odors and allergens",
                "reviewText": "This is a review of the 211+ (not auto) product.I purchased this to take the place of a Winix 5500-2 that I moved to a smaller room. I did a fair amount of research before deciding on this model. I wanted something under $300 that could filter a larger room. Consumer reports and the Wirecutter both rating this model very highly (in the case of CR this model was only beat out by the Blueair Classic 6XX model and that one goes for nearly $800 right now and is only somewhat more powerful.The unit is very simple. It’s a large fan in an attractive white housing with a slightly larger white plastic base that houses the main filters inside. There are two different colors of the washable external cloth filter in the box. You can use whichever one you prefer. My unit had a reasonably bright blue one and a dark gray one. It’s nice that they give you 2 of them. They only give you one of the large internal filters.The power cord is attached to the back of the unit, so if you break it or a pet chews the cord, the whole unit will have to be replaced. That’s a shame.The unit itself is made mostly of plastic, which makes it light and easy to move, but it won’t stand up to abuse. If your kid sits on this, it will break.I find the size to be good. It’s not really enormous, as some large room purifiers are, but it will take up more floor space than the Winix 5500-2 (but it isn’t as tall).The unit pulls air from all 4 sides, so you can’t stick this right up against a wall if you want the best performance. The clean air comes out the top of the unit.As for the sound at full power, a noise meter registers 64 dB right at the top of the unit wheee the air comes out. To put this into perspective, my Winix 5500-2 registers 74 dB at the air release when it is also on full power. The Blueair’s sound is noticeable, but it is very even and is decent white noise at top speed. I haven’t had a problem falling asleep near it. The Winix can be annoying at full speed.At the lowest speed for both the Blueair and Winix, they register at 42 dB measured from the same spot as before. You’ll have a hard time hearing them at this level unless the room is really quiet.The Blueair really moves air well. At top speed, you can feel the air moving in all parts of the room. It will make the room feel a bit cooler. It is noticeably better than the Winix 5500-2 in this regard.Controls: there’s one button. You tap (not press) it to control fan speed or turn the unit off. The top rim of the button lights up with a pretty bright white light to let you know the fan speed.The one thing I miss with the Blueair 211+ is there is no automatic mode. The Winix 5500-2 offers this and kicks the unit into higher gear if air quality is poor. It’s not a deal breaker, but I do appreciate the feature so you can save money but still have very clean air. There is a newer version of this Blueair that does offer automatic mode with air quality sensing. If you want that go with the 211+ Auto model. The price difference wasn’t worth upgrading, but you might catch it on sale.The Blueair does not have a remote control like the Winix 5500-2, and that I definitely miss, especially without the automatic mode.The cost of replacement filters seems about the same as other popular air filters and they offer a wide variety of colors for the external filter.A word about putting on that external filter. It goes on like a sock, but in order to stay in place, you have to put the filter material over the top part of the bottom white plastic unit. This means the filter will cover the latching locations where the top part locks into the lower part. I find this makes the security of the latching not as good, but it works well enough to keep the two parts together.The Blueair is not very heavy and I find it easy to move (though you may want to move the two halves separately if you find it awkward).As for air quality, Consumer Reports seems to be correct. It has done wonders for reducing allergens and smells. It also does this without the trendy but potentially problematic negative ion generation that some other filters offer. I find this to be a pro for the Blueair. I don’t need more ozone in the room.I did not have any odd smells from this unit, even with my nose up close. Based on other reviews I may have gotten lucky or perhaps they’ve improved the production process.All-in-all, I find this a great unit for the price.",
                "reviewVotes": "124 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Calvin Teetaert",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 8, 2024",
                "reviewTitle": "My favorite air purifier.",
                "reviewText": "I've tried many, many air purifiers. This one is definitely the winner. It's one of those things where it works so well, that you don't notice it. Strange, but true. We've gotten so used to having no odors around the house that soon as we leave our front door we notice a wall of smell (smoke, cooking fumes from other residents, etc). It's very quiet, super efficient, the only drawback is the slightly pricey filter, but I'm more than willing to pay $140 a year (new filter every 6 months of continuous use/$70 per filter) for *actually* clean air.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "María Gabriela Gonzalez Morales",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 2, 2022",
                "reviewTitle": "Excelente precio para su calidad.",
                "reviewText": "The media could not be loaded. Lo compré hace un par de semanas y me parece excelente, vivo en CDMX y el aire es de mala calidad, ahora estoy durmiendo toda la noche y se ha reducido mis alergias y el asma.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/A11 fOnTfcS.mp4"
                }
            },
            {
                "reviewerName": "Sra Diaz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 16, 2021",
                "reviewTitle": "Absorbe los olores !!!!!",
                "reviewText": "Purifica el aire PERO SE QUEDA con el olor anterior.1. Lo usé en la cocina porque hice pescado y ahora le quedó el olor a pescado ='(2. Después lo usé para purificar humo de cigarro en la recámara y..... ahora al prenderlo huele a pescado + cigarro.Horrible.....",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MyReviewDen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 10, 2021",
                "reviewTitle": "Breathe Easy - Blue Pure 211+ Air Purifier Works!",
                "reviewText": "Blue Pure 211+ Air Purifier is an amazing product! There’s almost zero assembly required. You unbox, put the washable outer filter on, you plug it in, and tap front button to turn on to start. Within 15 mins of it being on in my room, immediately I noticed how light and fresh the air is. There’s no unpleasant scent at all other than the new filter smell which doesn’t bother me. After 1 1/2 weeks of using it, this new filter smell is gone and it’s just fresh air. I love it. It gets rid of cooking smells too. I love cooking fresh fish often, and man, this purifier eliminates the odour within an hour compared to 3-4 days of lingering fish smell inside of the house. No more opening windows in the middle of winter just to air out odours. Noise Level is appropriate and can be tolerated. First level of air option is very quiet and almost no noise. Second level option you can hear the fan but sounds like a subtle white noise, Third level of air option, strong fan noise but man it’s very effective! Manoeuverability is easy. I like that the button to turn on the purifier is tap sensitive. The machine could use a nook for the hands on the sides for easier to move from one place to the other. There’s a warning label on top of the machine to carry the machine from the bottom when moving or carrying. The fan on top is connected to the filter at the bottom. There’s a locking mechanism between the two chambers, but I don’t feel it’s a sturdy lock and agrees that it’s safer to carry from the bottom and not from the sides of the machine. Weight is light for younger folks but I don’t recommend grand parents to carry the machine on their own. Overall, amazing air purifier!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex Callaghan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 18, 2021",
                "reviewTitle": "A reply to some of the critical reviews",
                "reviewText": "This unit arrived today, so I can't speak to the efficacy of it beyond my initial impression that it certainly changes the feel of the air quality in the room it's currently placed in.To those saying it's difficult to remove from the box - I'm 5'3 and not a big person. While it's somewhat cumbersome to remove from the shipping box, it's really not that difficult. Grab the packaging box by the sides and continue lifting until it slides out - takes maybe 30 seconds. Unless you aren't able bodied and then I'd recommend slicing the carboard box sides on each corner with an exacto knife so that the box folds openRemoving the unit from the packaging box? Get your hands halfway down inside the box, grip the sides of the unit (not the top part, it even has a sticker on it asking the user *not* to pull from the top since that's the portion that disconnects from the base) and pull up. Takes a moment but it'll slide right out.In terms of the size (which is available online *before* you purchase) it's 13\" wide x 13\" deep x 20\" tall. I'll be moving it from my bedroom to living room on occasion, it's not cumbersome to move at all because it's light. If you've got the pre-filter on, slide your hands under the pre-filter, grip the lower half of the unit and pick it up. Pretty simple.Sound: Low/eco setting is *very* quiet, medium setting is akin to medium speed on a traditional fan and high is, well, akin to the high setting on a fan. I've got the unit sitting 1.5 feet away from me (my bedroom is not that large) and the medium setting isn't very loud, I could take a call and still hear who I'm speaking to. They might be able to hear it in the background but I mean.. just turn it down temporarily.I'll update in a week or two once it's been running for awhile. I live beside a construction site and near a bunch of trees, my allergies are brutal and I've been without relief for a few weeks now. Hoping for a marked improvement.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$330.00",
                "sellerName": "Tazmotive (SN Recorded)",
                "sellerRating": "5"
            },
            {
                "price": "$338.00",
                "sellerName": "American Sunrise",
                "sellerRating": "4.5"
            }
        ]
    }
}