{
    "remaining_requests": 10489,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Honeywell-HFD320-Genius-Purifier-sq-ft/dp/B009P7SVHS",
    "body": {
        "name": "Honeywell HFD320 Air Genius 5 Air Purifier with Permanent Washable Filter Large Rooms (250 sq. ft.) Black",
        "price": "$179.99",
        "originalPrice": "$259.99",
        "rawPrice": 179.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Honeywell-HFD320-Genius-Purifier-sq-ft/dp/B009P7SVHS",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31biOrpUsdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41gyWcIT4KL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zkVnXHfAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51H71tlVzML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513kynIr0ML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LkMfktRLS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61Bhc0KLD0L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Honeywell",
            "link": "https://www.amazon.com/Honeywell/b/ref=bl_dp_s_web_21407250011?ie=UTF8&node=21407250011&field-lbr_brands_browse-bin=Honeywell"
        },
        "brand": "Honeywell",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2050,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Sunday, February 18. Order within 11 hrs 33 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "TOWER AIR PURIFIER – The Honeywell HFD320 AirGenius 5 Air Purifier helps provide cleaner, fresher air. Recommended for large rooms (250 sq. ft.), it helps capture up to 99.9% of microscopic airborne particles.*",
            "HELPS REDUCE ALLERGENS – This quiet air purifier has 5 levels of cleaning power and patented ifD technology to help capture the following microscopic airborne particles: dust, pollen, pet dander, dust mite debris and smoke.*",
            "EFFECTIVE AIR CLEANING AND CIRCULATION – This Honeywell Air Purifier for home filters and circulates air up to 4.8 times an hour in a large 250 sq. ft. room**. Plus, it features quiet operation, floor light accents and oscillation.",
            "WASHABLE FILTERS – Home air purifier includes a permanent, washable filter and a permanent pre-filter for easy maintenance***. You’ll never need to purchase an additional filter. Just remove and wash your existing filter and you’ll be good to go!",
            "ENERGY EFFICIENT – This Honeywell HEPA Air Purifier earned the ENERGY STAR label by meeting strict energy efficient guidelines set by the U.S. EPA."
        ],
        "description": "The Honeywell AirGenius 5 Air Purifier helps capture up to 99.9% of the following microscopic airborne particles: dust, pollen, pet dander, dust mite debris and smoke.* Recommended for large rooms (250 sq. ft.). This Honeywell air purifier can circulate air up to 4.8 times an hour. If you have pets or stale indoor air, air purifiers help deliver cleaner, fresher air. This quiet air purifier for home includes a washable permanent filter and a washable pre-filter for easy maintenance.*** It also features 5 air cleaning levels, floor accent light, oscillation and an auto-off timer option – 2, 4, 6, 8, 10, 12 hours. This Honeywell Air Purifier earned the ENERGY STAR label by meeting strict energy efficient guidelines set by the U.S. EPA. Disclaimers: * From the air that passes through the filter, 0.3 microns and larger. ** Based on 3rd party independent CADR testing for the smoke CADR value when operated at the highest level. Air circulation depends on many factors, such as room size and configuration. There is no guarantee that all of the air in a room will pass through the filter. *** The ifD® particle filter and foam pre-filer can be washed to clean. Permanent claim based on washing 4x per year for 5 years. The ENERGY STAR name and mark are registered trademarks owned by the U.S. EPA.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=267554011"
            },
            {
                "name": "HEPA Air Purifiers",
                "link": "https://www.amazon.com/hepa-air-purifiers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510192"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Brand",
                "value": "Honeywell"
            },
            {
                "name": "Product Dimensions",
                "value": "11.5\"D x 28.9\"W x 9.9\"H"
            },
            {
                "name": "Floor Area",
                "value": "250.0"
            },
            {
                "name": "Specification Met",
                "value": "AHAM Certified, Energy Star Certified, EPA Certified"
            },
            {
                "name": "Noise Level",
                "value": "60 dB"
            },
            {
                "name": "Particle Retention Size",
                "value": "0.3 Micron"
            },
            {
                "name": "Item Weight",
                "value": "5 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Kaz"
            },
            {
                "name": "ASIN",
                "value": "B009P7SVHS"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "HFD320"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,050 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#72,442 in Home & Kitchen (See Top 100 in Home & Kitchen) #142 in HEPA Filter Air Purifiers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Warranty Description",
                "value": "5 year limited."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Odor-Reducing Prefilter, Honeywell Airgenius 5 Air Cleaner/Odor Reducer, Owner's Manual"
            },
            {
                "name": "Import",
                "value": "Made in USA"
            },
            {
                "name": "Power Source Corded Electric",
                "value": "Item Weight 5 Pounds"
            },
            {
                "name": "Control Method Touch",
                "value": "Filter Type Pre-Filter"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/9c655055-1261-48d5-92bf-f50ddd578e88.__CR0,0,2022,1251_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1dd3bda4-008c-4abd-a66f-bb3bdd15eca7.__CR0,0,625,625_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/49b5cdd7-15cc-4146-b556-60fd60b91dbb.__CR0,0,625,625_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6ccb996b-611e-4103-a88b-b53bb0c7c560.__CR0,0,2022,625_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "B. Peacock",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUSYKLECEO2AIKTOVXDXBQN7APQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TU791C301CO2?ASIN=B009P7SVHS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2018",
                "reviewTitle": "5.0 out of 5 stars ... much cheaper by cost over time AND so much better it's a no brainer",
                "reviewText": "I know this is long but my soapbox is that this is SO much cheaper by cost over time AND so much better it's a no brainer. If you can spend $40 more upfront ($135 cost) it will cost more than $300 less over four years (ie., it will still only cost $135 total while the other one $440. That forty bucks saves you so much money. And BESIDES that the product itself is so much better in everyway.FIrst: WAY cheaper than ANYTHING because you don't have to replace filters every six months. This one you wash somehow. The replacement on the other filters can be $50 a pop. At $130 rather than $90 for other highly rated product, just ONE replacement makes the other product more expensive. They guarantee the filter will last 4 years at least (don't know if can buy replacement then?). So if you keep the other purified for four years and use it fulltime, the cost of replacement filters if $350 more. This one: ZERO. So $135 versus $440. You do the math. A little more upfront and the total cost is more than 50% cheapter. And this handles way more air. Is quieter. And then clearly this is such a better product anyway on all the other areas besides price too. I know i sound like cheerleader but have needed filters like this for decades and always had inferior products because I didn't know there were ones that aren't inferior.It is far more sturdy than expected. It is bigger than I expected but obviously can't be smaller to do it's job at the square footage it says it covers. Physics is physics.. It handles way more square feet than the $90 one I compared it to that requires replacement hepa filters every 6 months. I think twice as much. I looked up filters on Consumer reports (which given there are so many products and they are changing name and model constantly, test a small percentage of all of them.)This was ranked in top few. The other one I considered -- forget which one -- was $90. So this is $45 more than that -- but look below. Handles way more air/square footage. WAY quieter. Way more attractive. Way better constructed. I believe this product will last 5 years, the others if you've seen genersally might last two before something goes wrong (the one I STILL have is old and something happened quickly to make it way louded by something rattling inside the fan. I doubt this will happen with this product because unlike the old filter that blue left and right I think this one blows up and down.)I got the black on eand for this kind of thing it is attractive. WAY more attractive than competitors. The touch screen on top is classy. It is SO much quieter than the (superold honeywell) purifier I already had. Of course there will be noise -- it needs to pull air through and thus needs a fan. But even loudest setting is quieter than my old filter's lowest setting. There 5 different settings for amount of air it pulls through. My old product was only low and high. They have a setting called 'germs' and another kooky one and I have no idea if they are legit. BUT the consumer reports evaluated the efficacy of the filters at different settings, and this was the only one that got Good reviews for low volume (and it has excellent for high.) The competitor products they basically said you shouldn't even use the low setting as it hardly did anything.They have an 'ambient' light button I could figure out what it was doing. There is a light sort of recesses at the bottom of the tower that glows blue. You can turn high, low or off. It strikes me as corny and unnecessary but then I thought about it as a night light. It has super efficeint rating -- says takes as much power as a light bulb. OH. Among all the things the other products don't do, IT OSCILATES. Construction seems excellent.Every company should be selling products like this. The washable filter is a million times better than paying 50 bucks every six months",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pasquale DePaul",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNRMQQZPFLL5JBNGJWH5KTBJJFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27DCUHUCBK0RS?ASIN=B009P7SVHS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 19, 2023",
                "reviewTitle": "5.0 out of 5 stars High quality",
                "reviewText": "Been searching for some time for a unit that has washable filters. Not a fan of replacing filters. Eventually they get harder and harder to find.Pros: Honeywell is a good brand. Doesn't take up much room. Doubles as an oscillating fan. Deep cleans quick. Smells fresh. Touchscreen is nice, as is ambient light option. Easy to use, filters easily accessible. Quiet, except for high/deep clean, which is tolerable. Powerful.Cons: a little on the pricey side. However...I dont need to buy filters and I do believe you get what you pay for. Worth the money.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shannon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQNXPYC6SD2WROBGYHEWQHJXZ3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RP2IJF3W75Y0H?ASIN=B009P7SVHS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2015",
                "reviewTitle": "5.0 out of 5 stars Absolutely Fabulous!",
                "reviewText": "This is wonderful!! My old air purifier died in the middle of the summer, and I kind of forgot about it for 5 months. After constantly running my machine for over 5 years, I didn't realize how much I needed it, but took it for granted!!!I considered buying a same brand replacement, but it was expensive, and 2 of the filters and the UV bulb required replacement parts - also expensive. Just cleaning my old purifier was a bit of a job.When my breathing, sneezing, and quality of sleep got to a certain point, I knew I needed a new purifier!!My number one requirement was a permanent filter. I spent over a month shopping around, comparing reviews, and ease of use. I kept coming back to the Honeywell AirGenius. I was flip-flopping between the 5 and previous models. The AirGenius5 met all my requirements, and the price was very reasonable!This product has 5 levels of purification. When I first got it, I ran it on the top speed (5) for about 2 months. After just a week I noticed that my breathing was so much better!!!Unlike my previous purifier, the air on this product blows out of the front. Since I was still using fans, it actually helped in cooling and circulating my air. I also ran it on the oscillating feature. After a week or so, I noticed a bit of a noise, and let it sit in the still position. The noise went away and I was able to oscillate again. Anything you keep moving for a long period of time is going to get a noise... so I suggest only oscillating from time to time, if/when needed.There's a quick setup ATTACHED to the unit that you can pull out from the indented handle in the back, just in case you need a refresher.The top is a touch-screen! Only the power button requires actual (minimal) force. There's a filter status, letting you know when it needs cleaning, and a timer!! There's also the option for ambient light located at the bottom of the unit. All the lights are LED blue, so they are bright. Most people I know like this. In my bedroom, I like absolute dark, so I just cover the top with a folded cloth. In my living room, I found I enjoyed having the bit of light, as it wasn't too bright, but it allowed me to navigate without having to turn on any overhead lights in the middle of the night.I've seen reviews that say that this is loud, but I have to disagree! It's quieter than my quietest fan... it just makes a \"moving air\" noise at the highest level - it recommends the middle level for sleep.The last thing I love about this, is the ENERGY STAR rating!! My electricity bill is amazingly lower than it was with my last air purifier! I live in the NE, so I use a lot of electricity in Summer, and our 6 month long Winter...I'm seriously considering buying a second unit to leave in my living room, and the 2 would completely cover my 1 bedroom apartment.I highly recommend this unit to anyone with allergies!",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brian Wallace",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 8, 2023",
                "reviewTitle": "The sound that’s so quite we don’t even hear it.",
                "reviewText": "Air-filter works very well.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 11, 2018",
                "reviewTitle": "Five Stars",
                "reviewText": "Excellent and very usefull.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aron Ma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 6, 2015",
                "reviewTitle": "Five Stars",
                "reviewText": "Happy with it",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}