{
    "remaining_requests": 10462,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Kaz-Honeywell-HPA060-Compact-Allergen/dp/B00BWYO1HG",
    "body": {
        "name": "Honeywell AllergenPlus HEPA Tower Air Purifier, Airborne Allergen Reducer for Small Rooms (75 sq ft), Black - Wildlfire/Smoke, Pollen, Pet Dander, and Dust Air Purifier, HPA060",
        "price": "$69.98",
        "originalPrice": "$99.99",
        "rawPrice": 69.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Kaz-Honeywell-HPA060-Compact-Allergen/dp/B00BWYO1HG",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/413jC5A1PnS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51-gSHSBHBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41B-euI8fWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31ZHDR6Gw7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41u50PCxCcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JUlmZCPHS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412rgyYcHoL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Honeywell",
            "link": "https://www.amazon.com/Honeywell/b/ref=bl_dp_s_web_21407250011?ie=UTF8&node=21407250011&field-lbr_brands_browse-bin=Honeywell"
        },
        "brand": "Honeywell",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1498,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tomorrow, February 17. Order within 1 hr 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SMALL ROOM AIR PURIFIER – Honeywell HPA060 HEPA Air Purifier helps provide cleaner, fresher air. Recommended for small rooms (75 sq. ft.), HEPA Filtration helps capture up to 99.97% of microscopic airborne allergens and particles.",
            "HELPS REDUCE ALLERGENS – This quiet air purifier has 3 levels of cleaning power to capture the following microscopic airborne allergens and particles: dust, pollen, pet dander, dust mite debris and smoke.",
            "EFFECTIVE AIR CLEANING and CIRCULATION – A Honeywell Air Purifier filters and circulates air in a 75 sq. ft. room up to 4.8x an hour. Activated carbon pre-filter helps capture large airborne particles and reduces odors and VOCs.",
            "ENERGY EFFICIENT – This Honeywell HEPA Air Purifier earned the ENERGY STAR label by meeting strict energy efficient guidelines set by the U.S. EPA.",
            "COMPATIBLE DOES NOT MEAN COMPARABLE – For best performance, use only genuine Honeywell air purifier filters. Compatible air purifier filter replacements are not guaranteed to offer the same performance or efficiency."
        ],
        "description": "This Honeywell HEPA Air Purifier includes a Certified Honeywell HEPA Filter that helps capture up to 99.97% of the following microscopic airborne allergens and particles: dust, pollen, pet dander, dust mite debris and smoke.* Recommended for small 75 sq. ft. rooms. This Honeywell air purifier can circulate air up to 4.8 times an hour.** If you have pets or stale indoor air, air purifiers help deliver cleaner, fresher air. This quiet air purifier for home features a filter check/reset light that tells you when it’s time to change your filter, as well as 3 air cleaning levels and a backlit manual control knob. This Honeywell HEPA Air Purifier earned the ENERGY STAR label by meeting strict energy efficient guidelines set by the U.S. EPA. Always purchase Genuine Honeywell replacement air purifier filters. They are certified to help capture odors and the following microscopic allergens and particles: dust, pollen, pet dander, dust mite debris, and smoke.* Other compatible filter replacements are not guaranteed to offer the same performance or efficiency. Disclaimers: * From the air that passes through the filter, 0.3 microns and larger. ** Based on 3rd party independent CADR testing for the smoke CADR value when operated at the highest level. Air circulation depends on many factors, such as room size and configuration. There is no guarantee that all of the air in a room will pass through the filter. *** When operated with the odor reducing pre-filter. It is recommended to always use the pre-filter when operating this air purifier. This product does not reduce or adsorb carbon monoxide gas. Make sure gas appliances are well ventilated. The ENERGY STAR name and mark are registered trademarks owned by the U.S. EPA.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=267554011"
            },
            {
                "name": "HEPA Air Purifiers",
                "link": "https://www.amazon.com/hepa-air-purifiers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510192"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Brand",
                "value": "Honeywell"
            },
            {
                "name": "Product Dimensions",
                "value": "9.88\"D x 12.99\"W x 17.52\"H"
            },
            {
                "name": "Floor Area",
                "value": "75.0"
            },
            {
                "name": "Specification Met",
                "value": "EPA Certified"
            },
            {
                "name": "Particle Retention Size",
                "value": "0.3 Micron"
            },
            {
                "name": "Controller Type",
                "value": "Button Control"
            },
            {
                "name": "Item Weight",
                "value": "9.3 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Helen of Troy"
            },
            {
                "name": "ASIN",
                "value": "B00BWYO1HG"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "HPA060"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,498 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#72,041 in Home & Kitchen (See Top 100 in Home & Kitchen) #141 in HEPA Filter Air Purifiers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Warranty Description",
                "value": "5 year limited warranty."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "air purifier"
            },
            {
                "name": "Import",
                "value": "Made in USA"
            },
            {
                "name": "Power Source Corded Electric",
                "value": "Item Weight 9.3 Pounds"
            },
            {
                "name": "Control Method Touch",
                "value": "Filter Type HEPA"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "How the Technology Works 1. Pollutants are continuously drawn in. 2. The activated carbon pre-filter absorbs VOCs/Gases/Odors and traps larger particles. The pre-filter should be replaced every 3 months for optimal performance. 3. The HEPA filter continuously captures up to 99.97% of the particles that pass through it - as small as 0.3 microns. 4. Cleaner and fresher air is returned back to the room. Easy to Maintain Replacement Filters The Pre-Filter B (model HRF-B1) needs to be replaced every 3 months. The HEPA filter H (model HRF-H1) should be replaced once a year. A filter light reminds you when to change the filters and they are easy to replace - no tools required. To ensure stated product performance, use only Certified Honeywell Replacement Filters What is Particle Pollution? Airborne particles less than or equal to 10 microns in diameter are so small that they can get into the lungs, potentially causing serious health problems. When inhaled, larger particles (2.5 microns and larger), tend to stay in the upper respiratory tract. Fine particles (2.5 microns or smaller) stay airborne longer than larger, heavier particles which increases the chances of being inhaled. These microscopic particles are considered more harmful because they can move deeper into the respiratory tract.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/62ad7405-1350-4152-9050-457145e52c3d._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/19dce180-2daf-4dc8-99b1-4f4629ebdb17._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b2b05d72-12e2-4796-a46e-cb7e852aa186._SL300__.jpg"
                ]
            },
            {
                "media_text": "Honeywell HEPA Air Purifier - Medium Room Honeywell HEPA Air Purifier - Large Room Honeywell HEPA Air Purifier - Extra Large Room Honeywell Bluetooth Smart HEPA Air Purifier - Large Room Honeywell HEPA Compact Air Purifier - Small Room Honeywell HEPA Air Purifier - Medium-Large Room Model # HPA100 (Black). HPA104 (White) HPA200 (Black), HPA204 (White) HPA300 (Black), HPA304 (White) HPA250B HPA060 HPA160 Recommended Room Size Medium Rooms (155 sq ft) Large Rooms (310 sq ft) Extra Large Rooms (465 sq ft) Large Rooms (310 sq ft) Small Rooms (75 sq ft) Medium-Large Rooms (170 sq ft) Smoke CADR Rating 100 200 300 200 48 110 Dust CADR Rating 106 190 320 190 62 120 Pollen CADR Rating 100 180 300 180 75 130 Product Dimensions 13.54 x 8.9 x 13.94 17.72 x 10.05 x 18.86 20.08 x 10.83 x 22.32 17.72 x 10.05 x 18.86 7.72 x 10.69 x 15.16 8.11 x 11.08 x 25.59 Combo Filter Packs (HEPA & pre-filter year supply) HRF-ARVP100 HRF-ARVP200 HRF-ARVP300 HRF-ARVP200 HEPA Replacement Filter HRF-R1 (1 Filter) HRF-R2 (2 Filters) HRF-R3 (3 Filters) HRF-R2 (2 Filters) HRF-H1 (1 Filter) HRF-H2 (2 Filters) Genuine Odor-Reducing Pre-filter HRF-AP1 or HRF-A100 (precut year supply) HRF-AP1 or HRF-A200 (precut year supply) HRF-AP1 or HRF-A300 (precut year supply) HRF-AP1 or HRF-A200 (precut year supply) HRF-B1 (1 Filter) HRF-B2 (2 Filters)",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/e4c9b257-0e87-4dd8-b0a1-cc5a5e9852e5._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/62ad7405-1350-4152-9050-457145e52c3d._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/19dce180-2daf-4dc8-99b1-4f4629ebdb17._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b2b05d72-12e2-4796-a46e-cb7e852aa186._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/32a81324-d303-4cd0-82a0-dc480cee2113._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9e46fc52-acdc-489d-b1b8-c4a2163da4aa._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/247d40ae-600d-4685-973e-c806f2c23c90._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/68f15336-828e-413f-9b1e-98e2e33ddae1._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c9621144-7fae-4bcd-97d1-31b7fd9f1196._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/db38eeac-417b-4f47-b184-e7e4f4ecc49e._SR150,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Greg Hinds",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYR5DATZH6AU7G6EKPBYNOHDY3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3L7IN71OGA4NN?ASIN=B00BWYO1HG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2020",
                "reviewTitle": "5.0 out of 5 stars These HP air cleaners are great. I am fully happy with them. They work as advertised.",
                "reviewText": "My wide suffers with allergies which are aggravated in the winter when we have to keep the house closed up. These HP HEPA air filters enable her to avoid taking allergy pills. The HPA060 is great for smaller rooms. We also have an HPA200 and an HPA300. We keep them positioned in different room around the house. We have three cats, and they mean the world to us. With these filters my wife is able to breath normally, even when the cats are around and active.Can go about a year on the HEPA filter. The charcoal filter will stop neutralizing orders after a few months, but it still works well as a pre-filter for particulate. We vacuum it off once in a while to extend the pre-filter life. Filters are not that expensive, after market filters are available too. Operating cost is low. Noise levels are tolerable. They are pretty quiet, with multiple speed settings when cleaning is more important than quiet. We are finding we do not have to run them constantly.They clean the air of both particulate and orders very effectively. When the sun is coming in just right and you can see all the particles in the air, turn this on and you can watch the particles get sucked in and the air clears up in minutes. My adult son's room used to smell pretty bad. Now, with the HPA60 running in there a few hours once in a while, there is no odor in there.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DOCollins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMBZV4QQZTWRPPRRY6CQHHUG7IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IZUGUDCT1L47?ASIN=B00BWYO1HG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Processes alot of air",
                "reviewText": "We put this in the room where our dogs sleep because they have so much dander. It does a fabulous job at cleaning the air within a couple of hours. We only need to run it for about 4 hours a day for it to clean a 14' x 14' room. It is not silent, but quieter than a regular fan.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris DIYer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAXU3ZTQDDHVKPYJ6XAQS2M72XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TPJG4HRK4FBN?ASIN=B00BWYO1HG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2014",
                "reviewTitle": "5.0 out of 5 stars Very effective small allergen reducer/air cleaning for a bedroom",
                "reviewText": "This is great little true HEPA air cleaner. It will sit nicely on a nightstand and looks modern. The packaging was excellent and it says it is Energy Star compliant.ME:- Light sleeper- Sleep apnea- PTSD (combat vet)- Severe allergies (I get weekly shots)- Owner of two cats that sleep on the bedLIKES:- It works. The air in my bedroom smells cleaner- On \"high\" it literally pushes a lot of air...I mean a lot- True HEPA paper filter and prefilter foam- Indicator lights to detect when to change both filters- Effective even on \"low\"NOT SO GOOD:- Wish I could leave it on \"high\" at night...but it is too loud (sounds like a small vacuum cleaner)- Woke me up one night...strange up/down fan sounds (I am an extreme light sleeper)- Have to run it on low at night and still have to have my other fan on to sleep.- Don't think it will work very well on rooms larger than a master bedroomOVERALL:- Does the job and cleans the air of pollutants to include smoke, pet dander, allergens, and funky smells. I need \"white\" noise while sleeping, but this machine is actually too aggressive sounding when on \"medium\" or \"high\" setting. Other than that...great product/price",
                "reviewVotes": "207 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CF",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDJKEOMNHPL4IJCHRP7WMTEGKVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RON2EXP8FRJRM?ASIN=B00BWYO1HG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2017",
                "reviewTitle": "4.0 out of 5 stars A Smart Choice",
                "reviewText": "My room is small and oddly shaped, and very very old. Think early 1900's post earthquake San Francisco old. The carpet is gross and I can only imagine what kind of stuff is in the air from the surrounding city.Not to mention, I don't have the inclination to dust. I vacuum some, but not as often as I should.So in picking an Air Purifier I went through a lot of research and options. Ionizers were out because of Ozone and that I'd have to replace the light bulb, plus so many said that it simply doesn't even work. Germs are not my problem anyway, dust is!I would wake up morning after morning with my sinuses struggling until I got moving outside on my way to work and they cleared. It was then that I realized I had a problem.Enter the Honeywell, at a great price-point with included permanent filter (just have to vacuum it once in a while) and a charcoal insert pad. You don't have to buy the overpriced HEPA pads either if you're willing to cut the charcoal to size from larger ones.To me, that's perfect! I wanted something average cost, low maintenance. But the most important part... does it work?I can say YES, at least for dust. I do not have pets or allergies but since this is catching so much dust, I imagine it would catch those as well. It works by sucking air in over the charcoal pad, through the permanent filter, and blowing it out the other side. Within one day of constant use I could see some dust build-up on the filter and, maybe this was placebo, I think the air in my room smelled cleaner as well.If I had to make some points against it, and they are minor, it's that the size is not suitable for any large rooms. Mine is small, so it's great! The dial has several settings which have names like 'germs' and 'allergen' but really just mean low-high power. I'll have to see, down the line, if the lights telling me to replace my filters actually work.If you'd like to modify it you could add scented things to the place between the filter and the charcoal, I imagine.Now I wake up breathing easily and not scratching my eyes in irritation. More than I expected from Honeywell, I'm glad they delivered.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}