{
    "remaining_requests": 10496,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Purifier-1862sqft-HEPASilent-Wildfire-Allergens/dp/B08F13L1CH",
    "body": {
        "name": "BLUEAIR Bedroom Air Purifier, Air Cleaner Dust Pet Dander Smoke Mold Pollen Bacteria Virus Allergen, Odor Removal, for Home Office Kitchen, Washable Pre Filter, HEPASilent, Medium Room, Blue 311 Auto",
        "price": "$141.32",
        "originalPrice": "$249.99",
        "rawPrice": 141.32,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Purifier-1862sqft-HEPASilent-Wildfire-Allergens/dp/B08F13L1CH",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CKQ5637P"
        ],
        "asinVariationValues": [
            {
                "asin": "B08F13L1CH",
                "variationName": "Style",
                "variationValue": "311 Auto",
                "price": "$141.32",
                "variationImageURL": ""
            },
            {
                "asin": "B09ZGYL34V",
                "variationName": "Style",
                "variationValue": "Blue Pure 311",
                "price": "$229.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31RFkBrZquL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41NNXcIqecL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ieC5v hjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TSHt1VaCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ayhANpV8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51haS4PuGqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61A5NPp2zfL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Blueair Store",
            "link": "https://www.amazon.com/stores/BlueairInc/page/8B8D544F-7625-4019-AD3A-858AE9E52123?ref_=ast_bln"
        },
        "brand": "BlueairInc",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 3160,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Sunday, February 18. Order within 18 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "AUTO ADJUSTS SO YOU CAN REST EASY: One touch auto mode uses a particle sensor to monitor pollutant levels and adjusts fan to ensure optimal air quality; LED indicator displays air quality status as excellent (blue), moderate (orange) or polluted (red)",
            "CLEAN AIR IN MINUTES: Blueair’s HEPASilent dual filtration delivers up to 45% faster cleaning and up to 67% less noise than traditional HEPA filtration alone; Quickly cleans 388sqft medium room in about 12.5 min or up to 1862qft XL space in 60min, on high",
            "ONE OF THE QUIETEST AIR PURIFIERS: Quieter (23 dB) than whisper on low; ENERGY STAR rated - uses less energy (3W) than an LED lightbulb on low so it’s kind to your wallet and the planet",
            "ASTHMA & ALLERGY: Removes 99.99% of pollen, helping reduce allergens and pollutants that trigger allergy and asthma symptoms",
            "REMOVES ODOR & PARTICLES DOWN TO 0.1 MICRON: Ideal for smoke & smog during wildfire season; Removes 99.97% of airborne particles like smoke, dust, viruses and pet dander, while the carbon filter traps light household odors from smoking, pets and cooking",
            "MOST AWARDED AIR PURIFIER BRAND IN THE US: Blue Pure 311 Auto has won Wirecutter Pick – The Best Air Purifier 2021, 2020, 2019; The Spruce Recommends – Top Pick",
            "INDEPENDENTLY TESTED FOR PERFORMANCE & SAFETY, ZERO OZONE: AHAM Verifide for CADR; Ozone Safety Standards Certified by CARB; Zero Ozone Verified (<5 ppb) by Intertek Sustainability Program; Trusted Education Partner of British Health Professional Academy",
            "GENUINE FILTERS FOR OPTIMAL PERFORMANCE: Replace your filter every 6 months to ensure proper functionality & only use genuine Blueair filters; Shop 311 Auto replacement filter: B08F13YBG2; Upgrade to SmokeBlock filter for enhanced removal: B0B45D9TDS"
        ],
        "description": "\"Blue Pure 311 Auto air purifier quickly cleans 388sqft medium room in about 12.5 min or up to 1862sqft extra-large space in 60min, on high. Only Blueair air purifiers use HEPASilent™ technology, delivering maximum filtration with minimum noise. Combining mechanical filtration with electrostatic charging of particles produces clean air up to 45% faster with up to 67% less noise than traditional HEPA filtration alone. Delivers high performance with automated one-button control in a lightweight, compact package and includes a washable, pre-filter in Arctic Trail (Gray). It can also be customized in other Swedish-inspired pre-filter colors that are sold separately. Carbon filter traps light household odors from smoking, pets, cooking, and more. Award-winning, sleek, Swedish design compliments your aesthetic while working hard to clean your air so you can place where it will be most effective at capturing airborne particles & odors without worrying about it cramping your style. Independently evaluated for safety standards and third-party tested for performance as part of the AHAM Verifide® Program for air cleaners, this air purifier has a Clean Air Delivery Rate (CADR) of 250 for fine smoke particles, 244 for pollen particles, and 250 for dust particles.CLEAN AIR IN A MATTER OF MINUTES: Comparing CADR performance of Blueair models with mechanical and electrostatic filtration vs same models with only H13 HEPA mechanical filtration. When similar CADR was measured, Blueair models with mechanical and electrostatic filtration achieved less noise with less energy than same models with only H13 HEPA mechanical filtration. According to AHAM, air changes per hour (ACH) is the measure of the outside air volume added to a space divided by the volume of that space over a set amount of time.REMOVES ODOR & PARTICLES DOWN TO 0.1 MICRON: Blueair models with HEPASilent's mechanical and electrostatic filtration produced higher CADR, lower noise, and had lower energy consumption vs. the same models with only mechanical filtration (H13 filter). Tested on PM2.5 (0.1 - 2.5 μm) up to 90min; Tested on Influenza A (H1N1) with a minimum reduction rate of 99.99% in 60min.REMOVES 99.99% OF COMMON ALLERGENS: Tested on pollen particles 5.048 - 11.14 μm on Blue Auto, DustMagnet™ and Protect.MOST AWARDED AIR PURIFIER BRAND IN THE US: Based on survey of over 50 awards, accolades, and recommendations issued by independent consumer associations, media publications, and industry competitions from January 1, 2022, through August 16th, 2022, for products sold in the US by top 10 air purifier brands according to NPD Group Retail Tracking Service, Small Appliances, U.S. sales dollars June 2022 YTD.BACTERIA & MOLD REMOVAL: Tested on E.coli with mininum reduction rate of 99.9% in 60min. Tested on A.niger with minimum reduction rate in 99.9% in 60min.\"",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=267554011"
            },
            {
                "name": "HEPA Air Purifiers",
                "link": "https://www.amazon.com/hepa-air-purifiers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510192"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Brand",
                "value": "Blueair"
            },
            {
                "name": "Product Dimensions",
                "value": "10.2\"D x 10.2\"W x 20.5\"H"
            },
            {
                "name": "Floor Area",
                "value": "388.0"
            },
            {
                "name": "Specification Met",
                "value": "Energy Star Certified"
            },
            {
                "name": "Noise Level",
                "value": "23 dB"
            },
            {
                "name": "Particle Retention Size",
                "value": "0.01 Micron"
            },
            {
                "name": "Controller Type",
                "value": "Button Control"
            },
            {
                "name": "Wattage",
                "value": "335 watts"
            },
            {
                "name": "Item Weight",
                "value": "6.8 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Blueair"
            },
            {
                "name": "ASIN",
                "value": "B08F13L1CH"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "106237"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 3,160 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#71,527 in Home & Kitchen (See Top 100 in Home & Kitchen) #140 in HEPA Filter Air Purifiers"
            },
            {
                "name": "Care instructions",
                "value": "Place purifier upright on a flat surface"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Washable Pre-filter in Arctic Trail, Blue Pure 311 Auto Purifier"
            },
            {
                "name": "Power Source Corded Electric",
                "value": "Item Weight 6.8 Pounds"
            },
            {
                "name": "Control Method Touch",
                "value": "Filter Type Pre-Filter"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Designed for medium rooms Filters the air at a rate of approx. 4.8x an hour (or about every 12.5 minutes) in a 388 ft² room to effectively lower particle levels in your master bedroom, living room, or playroom.​ Performance you can trust Independently evaluated for performance by the AHAM Verifide Program for room air cleaners with a Clean Air Delivery Rate (CADR) of 123 CFM smoke, 96 CFM pollen, and 107 CFM dust in 388 ft² rooms.​ Freely place almost anywhere with 360º air intake Unlike some air purifiers with strict rules for placement, the Blue Pure 311 Auto uses a 360-degree air intake, meaning you can place it almost anywhere in the room without compromising performance.​",
                "media_link": []
            },
            {
                "media_text": "Previous page Fabric pre-filter The fabric pre-filter offers the first layer of protection, catching larger particles from the air.​ HEPASilent technology Electrostatic filtration works with the particle filter to remove 99.97% of airborne particles.​ Particle filter The main particle filter removes airborne allergens, like pollen, dust, pet dander, germs, and more. Carbon layer A layer of activated carbon traps light household odors from pets, cooking, and smoking.​ Next page 1 Captures large particles 2 Electrostatic filtration 3 Removes Pollutants 4 Traps odors",
                "media_link": []
            },
            {
                "media_text": "Low noise and energy consumption Low noise level Cleans the air with noise levels no louder than a whisper on low (23 dB) and with less noise than a normal conversation on high (53 dB).​ Low energy consuption It is rated for energy efficiency (3-35 W) - certified room air purifiers are 40% more energy-efficient than standard models.​",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/063e2826-9631-4841-a2fe-b18ccc47f82e.__CR0,0,650,350_PT0_SX650_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/65210369-ce62-4438-a155-b7ab9d417b02.__CR0,0,650,350_PT0_SX650_V1___.png"
                ]
            },
            {
                "media_text": "Wirecutter Pick Independently reviewed by the experts at Wirecutter, the Blue Pure 311 Auto ranks as one of their top air purifier picks for 2020 for \"Delivering exceptional performance in an attractive form\".​",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/2e3e7013-a87d-4dde-8d0d-754e9ee8a560.__CR0,0,1464,600_PT0_SX1464_V1___.png"
                ]
            },
            {
                "media_text": "Compare Blue family air purifiers Blue Pure 311 Auto Add to Cart Blue Pure 411+ See Details Blue Pure 411 Auto See Details Blue Pure 411 See Details Blue Pure 211+ Add to Cart Customer Reviews 4.6 out of 5 stars 3,160 4.5 out of 5 stars 2,309 4.6 out of 5 stars 6,889 4.6 out of 5 stars 19,002 4.6 out of 5 stars 19,002 Price $141.32$141.32 — — — $211.37$211.37 Recommended room size 388 ft² 185 ft² 190 ft² 161 ft² 540 ft² CADR - Smoke 250 cfm 119 cfm 123 cfm 105 cfm 350 cfm Auto Mode ✔ ✘ ✔ ✘ ✘ AQI ✔ ✘ ✔ ✘ ✘ Included Pre-Filters ✔ ✔ ✔ ✔ ✔ Metal Filter Cage ✘ ✔ ✘ ✘ ✔",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/486f9b00-b4e7-436a-aae7-c541998d0bad.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/df3640ca-a13e-4d6f-a20b-368382ffcc1d.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0f78f9a6-457e-4656-bb0c-98695abef67f.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b31412e1-4bc5-488e-b38c-6d8a46b4f78c.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/79343c72-9df3-4a43-8289-af0cab8e0bdc.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/acb0b665-bc43-4fbc-99c2-5488e6393c71.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8daba38e-feb0-42ba-ae9b-db4a0dd6a4f7.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7d38335d-e281-4788-99da-fa4c3fe2258f.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/063e2826-9631-4841-a2fe-b18ccc47f82e.__CR0,0,650,350_PT0_SX650_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/65210369-ce62-4438-a155-b7ab9d417b02.__CR0,0,650,350_PT0_SX650_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2e3e7013-a87d-4dde-8d0d-754e9ee8a560.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bb3c0666-b1a7-4286-a57b-86b1da939bc6.__CR0,0,200,225_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1c59a9a8-6627-41c4-8739-6debd4fdda22.__CR0,0,400,450_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2dd88650-d1ae-4b76-9771-bd75daf76838.__CR0,0,400,450_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d1495a2f-2425-4819-9ad0-6ec7387c6a13.__CR0,0,200,225_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1e430e52-a478-41b5-b547-bb00c7576615.__CR0,0,400,450_PT0_SX200_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Angie C.Angie C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTDYS75UNLW43PVRCEMNODLUYKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZPVA3AO3YULI?ASIN=B08F13L1CH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2021",
                "reviewTitle": "5.0 out of 5 stars This purifier is amazing! Allergies, be gone!",
                "reviewText": "The media could not be loaded. This is now our 2nd Blue air purifier. I originally bought the smaller Blue 411+ for our bedroom and I was very impressed with how having that in our bedroom improved my lifelong allergies that I take a daily pill for. Prior to getting the smaller 411+ I would very often wake up with a stuffed nose. Yes, we do have 2 dogs but they are not allowed in the bedroom due to my allergies. I honestly didn't have high hopes for the smaller unit but after a couple days of it purifying the bedroom air, I noticed a huge difference. I began waking up with clear sinuses and the room smelled \"different\". Not a bad smell but maybe just NO smell? Anyhow, after giving the little Blue a good 30 days to prove itself, I knew I needed a larger one for our living room. This is also where our dogs (golden retriever and black lab) spend most of their time with us when they are inside. And having these 2 dogs and allergies doesn't make life super easy as cleaning goes. I have to vacuum daily or every other day (minimum) and will at times pull up what looks like a small dog inside my vacuum canister. Especially, when my golden is blowing her coat.Finally after comparing, I went ahead and ordered the Blue 311 Auto for our living room which is approximately 420sf.I also bought a separate filter cover that's shown in my pictures and an additional filter to have on hand.The unit arrived well packaged and without damage.It came with a main filter installed and a a light gray filter cover but tbh, I will use the light gray cover while cleaning and drying the dark gray cover I have on it now. I as I prefer the dark (name is actually Winter Reed) over the lighter gray. I also like the quality of the upgraded cover. It's a bit thicker and looks nice.The set up was simple. It's really just plug it in and go.I like that this unit has 4 mode settings and indicator lights to show air quality and when the filter needs replaced.I have noticed one time when out of nowhere the air quality sensor light briefly turned from blue to orange then back to blue.The light sensor color indicators and level info are Blue (good), Orange (moderate), and Red (polluted).The main filter change sensor is supposed to switch on after 6 months of use but I haven't had it long enough to confirm if that works yet.For maintenance, I do run my vacuum brush over the outer filter cover once a week to clean any dust off of it which, there always is. This was also an immediate indicator to me that this fella is doing its job!I will also run a damp cloth on the the plastic exterior at the same time just to keep it clean and in the best working condition.Noise Level:This 311 Auto unit has 4 modes.✔Auto Mode: (fan speed will change depending on the air quality it senses).✔Night Mode: (whisper quiet, low speed)✔Everyday Mode: (medium speed)✔Boost Mode: (fastest speed and very loud).Boost mode is like, wind tunnel loud! Way too loud for us to watch TV in the same room if it was on. But this mode is not for everyday use. The only time I've used boost mode is when there is a specific reason i.e.,dogs came in from rain or I may have cooked/baked something that has a lingering smell, etc. I would just turn it on boost for 10 minutes or so to dissipate whatever the odor issue may be.We typically have it set on auto mode or everyday mode and it's very, very quiet. I would say auto mode is more quiet or no louder than an average fan that's on it's lowest speed and everyday mode is maybe as loud as a fan on medium setting.▪️Please see video I took of the different modes to show the sound difference between all four settings▪️I have now had this particular unit running 24/7 for about 2 months and we love it! We live in Washington State so when it rains and our fur babies go out for break, any \"wet dog\" smell is gone in minutes if I kick in the boost mode but everyday mode will also take care of that within an hour or so.Sadly, I also know fire season will soon be upon us for summer and I have no doubt both units will do a fantastic job at keeping the quality of air inside our home filtered, clean and smelling fresh during the seasonal bad air quality.We will be tackling a full home remodel next year which we'll be adding central heating and air but even then, I plan on keeping both these units up and running!Would I recommend this Blueair 311 Auto?Absolutely 100%.Summary: All in all, if you suffer from allergies/asthma like me, have animals, or simply a home without filtered air and are teetering on whether or not to purchase, go for it! You won't regret it! Personally, these air purifiers have honestly changed my life! I wish I would've found this company sooner! I HIGHLY recommend!If I must find something negative, I guess I would have to say their OEM filter replacements are pricey but this was not a deterrent for me. They also offer an auto ship filter service for a discount.I give this an easy 5 star!(I was NOT paid for this review and was not asked to leave one. I have no affiliation with this company other than being a new-ish forever customer)!Hopefully this will help someone!",
                "reviewVotes": "655 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/C19-o3h2e8S.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/C1OE0ICF5uS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/C1bSDdZCKiS.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/860ce725-66c6-4b07-a194-82d998bcb9fc/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Ryan Cullen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELDH6MDDIJ27CXTM7JF47X47HWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5GALWWGEP2XB?ASIN=B08F13L1CH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 10, 2021",
                "reviewTitle": "5.0 out of 5 stars This little guy gets the job done.",
                "reviewText": "I bought 2 of these because I wanted one in the bedroom and one in the living room.Living Room - I have noticed a dramatic decline in Dust in the room. Everytime we Dust, it would take about 2-3 days to have a coating of Dust again on tables, end tables, etc... (We have alot of electronics in the living room & 3 dogs) Now it takes about 11-13 days to be visibly on the same level as before.Bedroom - When we wake up we noticed a big difference after the 1st night with it. Our sinuses were alot clearer and breathing just felt better. May be a bit bias and maybe I was looking for it and noticed it but, we have been with it for a couple months now and I am still happy with them.I sleep with noise from a TV and the living room one also has a AC in the window near it so, I may not be the best to determine the noise level tolerance. When it is Red and using the high fan to really clean the Air, you will hear it though but, to me that is just it doing its job. Doesn't really bother me even when watching a movie or anything either.In conclusion- Noise Level - perfectly fine to me- Maneuverability - Soooo Easy to move where needed- Cleanability - Cleaning the exterior cover filter is as easy as vacuuming and/or tossing it in the wash. Interior HEPA filter needs to be replaced to be cleaned and right now its about 40 bucks for a replacement but, at about 6 months a replacement I feel it is still worth its while.Honestly, will be getting 2 more when we finish the basement.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kate S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCJ36SFNOORTMIWOOU36ZK7JXLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26FQHB78GDXOL?ASIN=B08F13L1CH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Efficient and quiet",
                "reviewText": "We live in a condo with a small dog and very young kids who are crawling/early walkers. My husband is also an allergy-sufferer. I was finding it impossible to keep up with vacuuming and sweeping all the time with the dander and miscellaneous build up all over the house. We also had new rugs installed that took forever to de-shed, adding to the problem.We've been so happy with the filter as I've seen a dramatic decrease in dust bunnies, and the house smells clean- like paper or something very neutral.It is somewhat large, but it's the tradeoff we are making for an easier time keeping the house a cleaner, healthier place for my kids. I'd definitely consider another purchase down the road and consider buying one for our family that has more pets.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kyle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZXMQ2C6JPW7V7HTE5VS32WUD7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8L43EZWG6SVG?ASIN=B08F13L1CH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 14, 2023",
                "reviewTitle": "4.0 out of 5 stars The system is good and does help in my case but there are a couple things that would improve it ...",
                "reviewText": "a little further (at least this particular model). I know some of the other models have auto settings. I don't need an Auto Mode but a shut off timer would be nice. This would help a great deal if they didn't nickel and dime to try and get people to pay for other systems. In addition they really need to change the controls for this device. It's terrible. Change it to either an electric or knob. The current control \"panel\" is a nuisance.In regards to noise, I don't find it bad. . BUT that may be due to the fact I always have fans and other devices on while up and about. Relating to size, the picture is quite deceiving . This particular model is bigger than it looks in the picture. I'm not complaining. I like the size because it helps clean faster than a small room only system.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "UnboxingUnboxing",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 7, 2023",
                "reviewTitle": "Sleek and quiet",
                "reviewText": "I own 3 of the 411+ that are used in bedroom/office for last few years and I’ve have been very pleased with the 411+ air quality performance so when I saw a deal on the 311+ Auto for $195 I snatched it up instantly. Its a lot bigger then the 411+ but the fan sound is just as quiet if not quieter then the original 411+. It’s just the right size for the living room/kitchen. We always leave all of them running on second speed and you honestly don’t hear them at all but the air quality is much fresher and cleaner. Cooking smells are gone within an hour and lot less dust during the winter months when the furnace is running and no allergies in the summer months. Would recommend any of the blue-air filters when they go on sale from time to time or even buy an warehouse deal open box one on Amazon as most of the time it’s just a return that someone changed their mind. The only con is the original filters can get a little expensive but you can buy third party for a lot less if you choose too but I did notice a difference in the air quality from the original filters vs third party so just a heads up if choosing third party filters for any blue-air air filters.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71yAXzaYuZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis Miguel Covarrubias Méndez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 2, 2022",
                "reviewTitle": "Tengo 2, creo tener mi favorito…",
                "reviewText": "Tengo 2 purificadores, un dyson y este, el primero tiene control remoto y una pantallita que muestra el funcionamiento tiempo real y coincide con “lo qué pasa” en el consultorio; me recomendaron mucho este otro y en su modalidad automática hace lo que quiere, estas quemando algo y el humo pasa literal frente al aparato y no se enciende 😐…",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gerry",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 13, 2023",
                "reviewTitle": "Breathing in Clean Air Feels Good",
                "reviewText": "Bought one of these in May 2023. Ended up buying another one for downstairs in August 2023. These have definitely helped the air quality throughout the house and it seems that they are also helping out the furnace too. The filter was clean when the technician came to service the furnace and stared that it didn't need replaced yet, when previously I was replacing them every month. Might just be a coincidence but if not it's an excellent additional bonus. Also the units are both very quiet and effective. Would recommend purchasing this, especially if it goes on sale like it did, again.Excellent job blue air. 👍👍Stay safe and stay awesome.🙃✌️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Malchia7",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 25, 2023",
                "reviewTitle": "Can breathe again!",
                "reviewText": "It’s been a bad fire season, so this has really helped with all the smoke that’s been lingering around. Is quiet, but effective. Has a night mode too where the light isn’t on but it’s still running. We now have 4 in our house",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barbara de Beaupre",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 11, 2023",
                "reviewTitle": "Great little air cleaner for a small bedroom!!",
                "reviewText": "I like this little air cleaner but am disappointed that Blue Air did not change the settings so that the light can be turned off during the night, as far as I can tell...otherwise this little air cleaner is great!! And the light is just a small one...",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$238.99",
                "sellerName": "wacky jacky",
                "sellerRating": "5"
            },
            {
                "price": "$239.00",
                "sellerName": "LEY HEE",
                "sellerRating": "5"
            }
        ]
    }
}