{
    "remaining_requests": 10231,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/GermGuardian-AC9200WCA-Sanitizer-Allergens-Guardian/dp/B0177GW9Z8",
    "body": {
        "name": "GermGuardian Air Purifier, High CADR True HEPA Filter, Large Rooms to 335 sq ft, UV Light Sanitizer Eliminates Germs,Mold,Odors, Filters Allergies, Pollen, Smoke, Dust, Pet Dander, Lonizer, AC9200W",
        "price": "$349.99",
        "originalPrice": "$499.99",
        "rawPrice": 349.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/GermGuardian-AC9200WCA-Sanitizer-Allergens-Guardian/dp/B0177GW9Z8",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31sYdpy8FEL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31lDRTyGJQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/310Ad118ydL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31UzH1y5uEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31SxqSUyXLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41OhgJXHgCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31K oP00ZjL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1AJa1cQ0oS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1AJa1cQ0oS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the GermGuardian Store",
            "link": "https://www.amazon.com/stores/GuardianTechnologies/page/AFA06E26-2644-46E5-9446-463493A95D1C?ref_=ast_bln"
        },
        "brand": "GuardianTechnologies",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 347,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22. Order within 17 hrs 16 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "3-IN-1 AIR PURIFIER FOR HOME - True HEPA air filter reduces up to 99.97% of harmful germs, dust, pollen, pet dander, mold spores, and other allergens as small as .3 microns from the air",
            "KILLS GERMS - UV-C light helps kill airborne viruses such as influenza, staph, rhinovirus, and works with Titanium Dioxide to reduce volatile organic compounds",
            "TRAPS ALLERGENS - Pre-filter traps dust, pet hair, and other large particles while extending the life of the HEPA filter",
            "REDUCES ODORS - Activated charcoal filter helps to reduce unwanted odors from pets, smoke, cooking fumes, and more",
            "CARRYING HANDLE - Easily carry from room to room with a sturdy handle"
        ],
        "description": "Allergens, germs, and odors, beware! With a HEPA filter, it captures 99.97% of dust and allergens as small as 0.1 microns in size! A large activated granular carbon filter attacks common household odors including those caused by smoke, cooking, and pets. Additionally, it works to reduce the many VOC's that are emitted by common household products and cleaning chemicals. UV-C light helps reduce airborne bacteria, viruses, mold spores*, and works to reduce volatile organic compounds. The Ionizer option can be turned on/off. When on, it helps boost allergen control by attracting microscopic particles from the air which are then captured by the HEPA filter. The easy to use panel includes UV-C control, a filter change indicator and an up to 6 hour timer. The purifiers stands 27\" high and provides powerful air cleaning in rooms up to 335 sq. feet. Choose from 3 options for fan speed including an ultra quiet mode for light sleepers. *Tested with Staphylococcus Albus, and Escherichia Coli, Aspergillus Niger, and Phi-X174",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=267554011"
            },
            {
                "name": "HEPA Air Purifiers",
                "link": "https://www.amazon.com/hepa-air-purifiers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510192"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 9.75 x 17 x 27 inches; 20.65 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ AC9200WCA"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ October 29, 2015"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Guardian Technologies, LLC"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0177GW9Z8"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ China"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#641,748 in Home & Kitchen (See Top 100 in Home & Kitchen) #608 in HEPA Filter Air Purifiers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 347 ratings"
            },
            {
                "name": "Color",
                "value": "Crystal White"
            },
            {
                "name": "Brand",
                "value": "Guardian Technologies"
            },
            {
                "name": "Product Dimensions",
                "value": "9.75\"D x 17\"W x 27\"H"
            },
            {
                "name": "Floor Area",
                "value": "365 Square Feet"
            },
            {
                "name": "Specification Met",
                "value": "Energy Star Certified, ETL Certified, CARB Certified"
            },
            {
                "name": "Power Source Corded Electric",
                "value": "Item Weight 20.65 Pounds"
            },
            {
                "name": "Control Method Touch",
                "value": "Filter Type Pre-Filter"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Multiple Levels of Cleaning HEPA Filter Captures 99.97% of dust and allergensCharcoal Filter Reduces common odors from pets, smoking and cookingUV-C Light Helps reduce airborne bacteria, viruses, and mold sporesTIO2 treatment Works with the UV-C to reduce VOCs Captures Dust & Allergens HEPA Filter captures dust and allergens such as household dust, pet dander, mold spores and plant pollens. UV-C Fights Germs UV-C light helps reduce airborne bacteria, viruses, mold spores* and works with Titanium Dioxide to reduce volatile organic compounds (VOCs). *Tested with Staphylococcus Albus, and Escherichia Coli, & Phi-X174 Reduces Odors Equipped with a charcoal filter that reduces common odors from pets, smoking and cooking.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e5580405-9700-4a7c-8738-99ac7fff0425.__CR0,0,1250,1250_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/6abeae0d-c156-4669-b208-031ade70e65c.__CR0,0,1250,1250_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b7e45bc-cc11-4e06-b954-8ab0af9a9491.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5caf5a79-d212-462d-a611-b7174a819753.__CR76,76,1515,1515_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "GermGuardian FLT9200 Air Purifier HEPA Replacement Filter H GermGuardian LB9200 Air Purifier UVC Replacement Bulb AC9200WCA Compatible: ✓ ✓ Genuine Guardian Technologies Replacement Part: ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffe1c8bb-3cf8-4833-8db6-6fbd560c3cbf.__CR0,0,4042,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e5580405-9700-4a7c-8738-99ac7fff0425.__CR0,0,1250,1250_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6abeae0d-c156-4669-b208-031ade70e65c.__CR0,0,1250,1250_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b7e45bc-cc11-4e06-b954-8ab0af9a9491.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5caf5a79-d212-462d-a611-b7174a819753.__CR76,76,1515,1515_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d0f722c4-0d53-4407-8f2f-cf040bf27579.__CR0,0,625,1250_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dbf48b73-6e3b-4f0c-84ca-9bcc1596cd8a.__CR0,0,625,1250_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJ6NERXFR3IP7666C6JJ56KRVKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXMFDYT1RPYX4?ASIN=B0177GW9Z8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2021",
                "reviewTitle": "5.0 out of 5 stars It's a great all-in-one clean air solution for a living space",
                "reviewText": "I have owned a handful of other HEPA filters, and this is an excellent model. We have been cooped up inside for a while and my allergies are getting a little worse due to our pets, vintage rugs, house dust, and wood dust. This unit deals with everything, and my nasal and eye allergies are manageable again without eye drops and nose spray. This filter has a very low noise level. Easy to move around despite the weight, because the top part is a handle. Moves a high volume of air pretty quietly. The high setting sounds like a box fan on medium, and is muffled by the plastic housing. The middle setting is as quiet as a moderate outdoor breeze, and the lowest setting is nearly inaudible. My upstairs unit deals with pet allergies and old carpet dust very well - also the uvc light and airflow will hopefully help with COVID-19 safety when quarantine is over and we are having guests again. I just bought my second unit for my basement workshop and it has made a dramatic difference in the dusty air down here. I own two other small germguardian models for the bedrooms,and they're effective at rooms. This one is undeniably much more powerful at moving and cleaning air, and keeps the air clean in our connected living room, dining room, hallway, etc. Between this model and a good fan to distribute HEPA-filtered air, our living space has great quality air now. I would recommend this unit, and would buy this again myself.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "chmod",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFID3XJ6UZY2NOCEXG6BW4OI46XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDO1JT9OOZDWR?ASIN=B0177GW9Z8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 13, 2016",
                "reviewTitle": "5.0 out of 5 stars Solid filtering and odor control for a fair price.",
                "reviewText": "This is the business.Finally, a product which meets our needs. What are our needs?Our needs are a mix of needing solid air filtration due to living in a downtown environment and cooking odor mitigation. Plus, we have two cats. In our high rise, with giant dual glazed windows, etc., there is air exchange via a plenum. The air enters via a pocket door in our second (guest) bathroom which is pretty central to the (850 sq ft) apartment. So, outside downtown air is coming into our space this way. Then there are random cooking odors which manifest via this same air exchange point. OF COURSE this should be fixed by the building. But have you ever tried to get something like this fixed when all you do is lease the space and there is a waiting list? ha ha ha haThis device includes the tech to deal with the odors (charcoal, UV and Ozone) AND a HEPA filter. On medium it is a gentle white noise. On low it is inaudible. I invoke both the UV and Ion generation and this unit scrubs the air very clean. Previously, using only a HEPA device, the smells saturated the filter quickly, rendering it stinky. It sits in the hallway across from the pocket door from which streams the outside (and other) air.Highly recommended. As you can toggle the UV and Ions, it represents a high degree of flexibility. It is well made, practical with the built in handle, and effective.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Weedarkone",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFF67SU4ESUXY5RNOLVQHVATMSPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LRB0O9NPHNTW?ASIN=B0177GW9Z8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2016",
                "reviewTitle": "5.0 out of 5 stars AMAZING Results",
                "reviewText": "My somewhat detailed review: I have regular allergies that have me sneezing all day and night in my home. I do everything I can to alleviate them.I previously had three Honeywell 5020 Hepa Air Purifiers (which I bought here on Amazon) sprinkled throughout my house. My allergist uses them. To be fair, I rarely had them on in my house because they were SO NOISY, I couldn't think with them on. (I have since given them to my personal trainer, who runs them in his gym, and we have noticed a significant difference in the air quality.)I bought this purifier and the more expensive Oransi Max HEPA Large Room Air Purifier, to see if I noticed a difference. I did, and it was huge.First, noise levels: the GermGuardian is near silent on BOTH levels one and two. In fact, I've often had to check to make sure it's on, when it's on level one. It is seriously whisper quiet. Level 3 is a little noisier, but nowhere near as noisy as the Honeywells. (The Oransi rattled on level one and was noisier all around.)Secondly, the purification was noticably much better with the GermGuardian than with the Oransi. The air is srisp and clean. I can breathe without sneezing. It is amazing. ALSO, I cook A LOT of meat (I am doing a Whole 30) and bacon, which tend to really stink up my house. This purifier cleans the air very quickly. By bedtime, all food smells are gone.I now have one in my bedroom and one in the living room and my entire house is clean smelling. I look forward to seeing my electric bill... but at least I'm not sneezing all the time. :)",
                "reviewVotes": "69 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}