{
    "remaining_requests": 10224,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ionic-90IP01TA01W-Turbo-Purifier-Capacity/dp/B000H0RZB0",
    "body": {
        "name": "ENVION TA500 Ionic Pro Turbo Ultra Quiet Medium to Large Room Filter Air Purifier with 3 Fan Speeds, Ionic Purification, Black",
        "price": "$129.99",
        "originalPrice": "",
        "rawPrice": 129.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ionic-90IP01TA01W-Turbo-Purifier-Capacity/dp/B000H0RZB0",
        "soldBy": {
            "sellerID": "A1DXN92KCKEQV4",
            "name": "Spreetail",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1DXN92KCKEQV4&asin=B000H0RZB0&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41sRbuGs7ZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41uGCYobM7L.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Envion Store",
            "link": "https://www.amazon.com/stores/Envion/page/5ABFAE88-760C-428F-90AF-5F62F65AE93F?ref_=ast_bln"
        },
        "brand": "Envion",
        "merchantInfo": "Spreetail",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2765,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 21 - 23. Order within 7 hrs 46 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Ultra-quiet air purifier with cutting-edge technology reduces airborne microorganisms and odors from your home and discharges invigorated air without emitting ambient noise",
            "Whether you're dealing with a light touch-up or a thorough deep clean, this fan system made for medium rooms with a 3-speed fan ensures that your space receives the precise level of cleaning",
            "Ionic technology uses negative ions to attract positive airborne pollutants and particles in the air; Traps pollen, dust, smoke, and pet dander down to 0.1 microns",
            "Innovative easy-to-clean front-loading filter presents a highly advantageous solution that significantly reduces the necessity for frequent and potentially expensive filter replacements",
            "Intricately crafted interplay of form and function, the tower's ingenious design channels natural resources to their fullest potential by using less energy than a compact fluorescent bulb"
        ],
        "description": "With more and more germs and air irritants affecting day-to-day life, make sure your own home isn't subject to the same conditions. With the Ionic Pro Turbo Air Purifier from ENVION, your space will be free from air pollutants that can be dangerous to your health. Made for medium to large rooms, this air cleaner can purify up to 500 square feet 3 times in 1 hour. The 3-speed fan lets you decide what cleaning level is most desirable. With ionic purification, this air purifier captures pollutants. In combination with UV light, this irritant remover expertly reduces certain viruses and bacteria. This sophisticated tower uses less energy than a compact fluorescent bulb. With an easy-to-clean filter, you can limit the frequency of costly filter replacements, saving money. Say goodbye to airborne germs and odors and discharge invigorated, clean air without emitting any ambient noise. Don't overlook the impact your home's air quality has on your well-being. Improve your health and the health of those around you with the ENVION Ionic Pro Turbo Air Purifier.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3206324011"
            },
            {
                "name": "Parts & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=19149190011"
            },
            {
                "name": "Air Purifier Parts & Accessories",
                "link": "https://www.amazon.com/air-purifier-parts-accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3737401"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Brand",
                "value": "Envion"
            },
            {
                "name": "Product Dimensions",
                "value": "7.5\"D x 28.5\"W x 9.5\"H"
            },
            {
                "name": "Floor Area",
                "value": "500 Square Feet"
            },
            {
                "name": "Noise Level",
                "value": "55 dB"
            },
            {
                "name": "Controller Type",
                "value": "Button Control"
            },
            {
                "name": "Wattage",
                "value": "12 watts"
            },
            {
                "name": "Item Weight",
                "value": "7.8 pounds"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Envion"
            },
            {
                "name": "ASIN",
                "value": "B000H0RZB0"
            },
            {
                "name": "Item model number",
                "value": "TA500"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,765 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#74,213 in Home & Kitchen (See Top 100 in Home & Kitchen) #202 in Home Air Purifiers #629 in Home Air Purifier Parts & Accessories"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "November 1, 2000"
            },
            {
                "name": "Power Source AC",
                "value": "Item Weight 7.8 Pounds"
            },
            {
                "name": "Control Method Touch",
                "value": "Filter Type HEPA"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kelly Green",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6SO4GHCZ6OHLN3YTA7Y3M3K3MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10J313CQJCRT1?ASIN=B000H0RZB0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars No replacement filters needed!",
                "reviewText": "Easy to clean no replacement filters needed that is HUGE we have enough going into our landfills. Super quiet & easy to clean & I feel my home’s air quality is so much neo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ali P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJ5UAQ7HTICQOW7T6VI32QJT53Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VBW49NX77YXI?ASIN=B000H0RZB0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Love",
                "reviewText": "This ionic air purifier works fabulously. Run nonstop for 2 months and cleans the air. Have it by home HVAC air intake and combined with those filters, keeps the odor fresh. It’s near my bedroom and the bright blue light is obnoxious, so keep that in mind. (Place a tape over it or move it. Does make a nice nightlight). I love the fact it alerts when needs cleaned (so far, haven’t needed) and wipes with damp cloth. My first one died after a great, long life of 15 years. Highly recommend.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas L. Ballard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELJIKF3U4MOTJ7P42T4VBZBFEHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NIHKGB8C312O?ASIN=B000H0RZB0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2014",
                "reviewTitle": "5.0 out of 5 stars The real pro",
                "reviewText": "I love this thing.. I have had several of these things.. They do wear out, but takes a long time.. I have two of them now.. They work great.. Having said that, the biggest complaint I have heard is that they make noise, they shut off when they should not, etc.. I went through all that years ago.. So I understand how unhappy people can be with this product.. So, why do I like mine so much when other people almost hate theirs???? I learned how to clean them.. The people who sell them do not give you instructions for the proper cleaning of these units.. The secret is rubbing alcohol. I am not sure the instructions I wrote for cleaning this thing is still on Amazon or not, but if not, here is a short version. When the red light comes on, or the machine starts making the cracking zapping noise, unplug it. Take the blades out, grab a few paper towels and a bottle of plain ole rubbing alcohol.. Soak the paper towel in alcohol, or at least put a lot on it so that it is very wet, then wipe the blades down.. Lots of crap will come off the blades.. Keep doing this until the blades are clean. Then wipe with dry towels.. Then, let the blades sit for a half hour or so and dry out.. You want them really dry... Second step is to clean the wire in the back of the unit.. It is hard to get to.. I advise people to wrap a paper towel around a toothbrush handle, or similar, attach with a rubber band, get the towel very wet with alcohol, then wipe the wire up and down with the wet towel.. Then let this dry for one half hour, or until you are sure it is dry.. REASSEMBLE and turn it on.. It should work like a charm. If it does not, then you did not get it clean.. Repeat the process until it is working properly.. Went it is working as it should, it does a great job of pulling dirty stuff out of the air.. I mean a lot of dirty stuff..... Ok, get one, keep it clean, and be happy.. Better yet, get more than one!",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Saint",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCP2BTYJHXEBFOEULW6OE7U327A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R279I3RRF5IOXZ?ASIN=B000H0RZB0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2023",
                "reviewTitle": "4.0 out of 5 stars Ultra quiet",
                "reviewText": "Good initial quality with a bit of a odd smell in the first several hours of use but after that no noticeable smell, this replaced a Hunter Arguis air purifier that filters were no longer made also those filters were $60 plus shipping this purifier does not have filters that you have to buy. It definitely keeps my 14 x 20 living room dust and odor free so if it will last for several years it’s a great buy.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GAIL H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGI73WYVVDK5RSAWS3BJNUKSJDGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQVQU1NXBG2YA?ASIN=B000H0RZB0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Great",
                "reviewText": "Have 3 of these. They work very well. I have cats and 2 dogs. Recommend them. Easy cleaning.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GamsGal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPLHPHTMCBKKZN4AQTMWLUYDIAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OSKVEHL21JD1?ASIN=B000H0RZB0",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2023",
                "reviewTitle": "1.0 out of 5 stars Garbage. Didn't work after warranty expired, and I didn't want to deal.",
                "reviewText": "People keep telling me to call the manufacturer, but... puh... I really don't want to have to call another company to see what the heck is wrong with this thing. I've looked online, tried to fix it, waited a few months, tried to use it again, tried to fix it again... it just pops a red light on no matter what I do. Maybe I'll call the company, but it's not under warranty anymore so I don't know. If I do give them a call and it works out, I'll change my review. However, for this thing to have worked for such a short time and then just be... unfixable... I'm SUPER disappointed. Especially at this price point. Plus I've seen lots of other folks with the same issue, so I'm thinking it's just kinda garbage. I would NOT buy another one.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joe D. Jo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ3X3ZFU6AK3IAFCXU4VQZRBZ4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HG879NK6I6UQ?ASIN=B000H0RZB0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 15, 2023",
                "reviewTitle": "5.0 out of 5 stars I've only had it a few days so far, and I think it's fab",
                "reviewText": "This is perfect to set next to a smoker in his/her easy chair. It takes up VERY little floor space, it makes zero noise, and what I didn't realize - at time of purchase - is that, though it has no fan, it MAKES ITS OWN BREEZE by quantum electromagnetic phenomena to suck air through! Talk about effectiveness ..with its ionizing system it is essentially guaranteed to capture virtually every single particle of smoke in the vicinity. HEPA filters are a FAR cry from that exemplary capability, and they make noise, have fans. The only lament - but one can take measures to combat it - is that: though it captures each smoke particle there are millions of molecules, I guess, constituting each particle; so the matter stuck to the ion blades are capable and do release plenty of stink. You combat this effect by turning the machine facing with the breeze going AWAY from you. If you can place it close to one of your homes forced-air intake grates, odor will be quickly dispatched. I was fortunate where my easy chair is situated, next to such a grate. I simply set my thermostat's circulation fan to ON instead of AUTO. (My forced-air system's fan is in the basement, so whisper quiet.)",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Qwerty Mcgee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBUNCC5RCSLGBUNSCZL4SUF7AFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2527VXLERG9NP?ASIN=B000H0RZB0",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2022",
                "reviewTitle": "3.0 out of 5 stars Changed Review: Functional Unit Yet Lacks The Quality Of The 200sq ft. Unit",
                "reviewText": "Changed Review from one star to three stars. Unit is not a complete piece of non-functional garbage, yet lacks the quality of the older models (200 sq. ft.). The removable and cleanable blade is an excellent feature, however, my opinion is the blade to the 500 sq. ft. model is of lesser quality. The blade appears to be manufactured out of a different metal and does not clean the air like the older models with the super shiny blade. The machine is a bit louder (static sound) even with cleaning. After removing the unit from an extremely dirty environment, the machine still smells new, which is impressive considering the air quality it was residing within was absolutely disgusting. It's not a machine I can highly recommend but it's not a complete piece of junk either. If you're looking for a top notch air purifier this is probably not the unit for you. Amazon seems to send me used/junk items which is extremely disappointing to say the least. If you don't like the unit you can always return it. Hopefully this review was helpful. Thank you for reading and may it smell better in your environment!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}