{
    "remaining_requests": 10452,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Guardian-Intelligent-Purifier-Pollutants-AC3000W/dp/B0BSJZMCLW",
    "body": {
        "name": "GermGuardian Airsafe+ Intelligent Air Purifier with UV-C Light, Air Quality Sensor, 360˚ HEPA Filter, Large Room up to 1040 Sq. Ft., Captures 99.97% of Pollutants, Zero Ozone Certified, White AC3000W",
        "price": "$106.86",
        "originalPrice": "$106.86",
        "rawPrice": 106.86,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Guardian-Intelligent-Purifier-Pollutants-AC3000W/dp/B0BSJZMCLW",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $20 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41DTeU0g84L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51MkMtppNhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51P4GJbWfNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51mpWolXYyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512WGZxtijL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TM40ht nL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91kAk8BoNzL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1bcfbbb9-eb01-47ac-a051-f2fb5a4a65d0/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7b1aa844-1239-4ed3-98a3-6ab4fddd4d5c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/69bad28d-19a9-426c-b525-c2d1b93237e2/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c392e20f-92f1-4aba-9e9c-2cd390892b20/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e8dd8d97-fbcf-45e3-932d-f88892d20f01/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc5ea748-885c-4b58-bc9f-1370b8202d95/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1nDvxQErIL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1nDvxQErIL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the GermGuardian Store",
            "link": "https://www.amazon.com/stores/GuardianTechnologies/page/AFA06E26-2644-46E5-9446-463493A95D1C?ref_=ast_bln"
        },
        "brand": "GuardianTechnologies",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 229,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 17 hrs 44 mins",
            "FREE delivery Friday, February 23"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✅【GUARDING YOUR AIR】 with 3 LAYERS OF 360 DEGREE PROTECTION - Genuine high efficiency True 360 Degree HEPA air filter captures 99.97% of dust, allergens, and wildfire smoke particles as small as 0.1 microns from all directions. With over 155 pleats and 14 square feet of filter area, our True HEPA air filter traps dust, pollen, harmful germs, and pet dander.",
            "✅【ZERO OZONE CERTIFIED】 Ultraviolet - C (UV-C) acts as the ultimate line of defense, helping reduce airborne germs such as Staphylococcus Albus, Escherichia Coli, Aspergillus Niger, and Phi-X174 as well as airborne bacteria and mold spores*. Turbo charge your refresh with our UV-C optional setting. Our 2.3 watt quartz glass bulb is over 600% more effective than single LED-led solutions resulting in a ZERO OZONE verified product that releases cleaner, fresher air back into the room.",
            "✅【INTELLISENSE AIR QUALITY INDICATOR】 Measures the room air quality 60 times per minute using a PM 2.5 sensor detecting tiny particles in the air smaller than the diameter of a strand of human hair. It automatically adjusts the speed when poor air is detected, and returns to a lower speed after cleaning the dirty air. Always monitoring, Always cleaning every second of the day.",
            "✅【CLEAN AIR IN 12.5 MINUTES】 Circulate and filter the air in a medium 215 sq. ft. room every 12.5 minutes or in a large 1042 sq. ft. room every 60 minutes. Efficacy testing is performed in 30 cubic meter testing chambers to ensure accurate results and performance that is replicable in the real world.",
            "✅【REDUCES ODORS】 Activated carbon pre-filter traps dust, pet hair, and other large particles while extending the life of the HEPA filter. Treated carbon absorbs volatile organic compounds from the air and reduces odors from smoking, cooking, and pets.",
            "✅【INDEPENDENTLY TESTED IN THE USA】 Cleaning air since 2005, our Cleveland, OH based team made it a goal to change the air purifier industry using rigorous and respected testing methods, performed by labs in the United States that exceed industry standards. All Germ Guardian devices are designed and engineered in the USA. Germ Guardian air purifiers are ENERGY STAR CERTIFIED, CARB (California Air Resource Board) Certified, ETL Certified, and Zero Ozone Verified!",
            "✅【QUIET OPERATION】4 speed options with the lowest setting being utilized as gentle white noise for a quiet, restful night's sleep.",
            "✅【GENUINE GERM GUARDIAN FILTERS】For HEPA replacement Filter V, search ASIN: B0BXQHD518 or model number: FLT151 HEPA Filter V. For Carbon replacement filters, search ASIN: B0CJSPX7CM or model number: FLT15CB4. For replacement UV-C Bulbs, search ASIN: B001TLRSOA or model number: LB1000. Genuine Germ Guardian replacement filters for certified fit and maximum filtration. Off-brand filters often fail HEPA testing standards, fit incorrectly, reduce efficacy, and may cause damage to the air purifier."
        ],
        "description": "BREATHE FRESH AND CLEANER AIR The GermGuardian AirSafe air purifier helps to reduce germs and viruses, filter odors, and trap allergens with 4 layers of protection. Containing a 360 Degree True HEPA filter and optional UV-C light, this air purifier delivers crisp, refreshing air to your home. POWERFUL AND CUSTOMIZABLE Your at home comfort can be customized with 4 speed settings, ultra-quiet mode on the lowest speed setting. This Air Safe product features an Intellisense air quality indicator, measuring the air quality 60 times per minute. It automatically adjusts the speed when poor air is detected, and can monitor air quality 24/7, always cleaning every second of the day. This air purifier circulates the air in a medium 215 sq. ft. room every 12.5 minutes or in a large 1000+ sq. ft. room every hour, making it ideal for bedrooms, offices, basements, and other open concept spaces. This air purifier is designed, engineered and independently tested in the United States and exceeds industry standards. WHY USE GENUINE GERMGUARDIAN REPLACEMENTS Your purifier is only as powerful and effective as the filter you put inside, and our Genuine GermGuardian replacement parts are essential for maintaining product performance. Each filter or bulb is designed specifically for a particular unit. Not only will genuine replacement parts fit like a glove, but they also have the combination technology to match, so that you can get the most out of your air purifier. Replacement Filters: FLT151 HEPA and FLT15CB4 Carbon Filter V. Off-brand filters often fail HEPA testing standards, fit incorrectly, reduce efficacy, and may cause damage to the air purifier. This product earned the Energy Star label by meeting strict energy efficiency guidelines set by the U.S. EPA. WARRANTY GermGuardian gives you reassurance with a 5 year limited warranty in addition to your purchase.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b?ie=UTF8&node=267554011"
            },
            {
                "name": "HEPA Air Purifiers",
                "link": "https://www.amazon.com/hepa-air-purifiers/b?ie=UTF8&node=510192"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 9.75 x 9.75 x 12 inches; 7.02 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ AC3000W"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ January 17, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Guardian Technologies"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0BSJZMCLW"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ China"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#28,601 in Home & Kitchen (See Top 100 in Home & Kitchen) #85 in HEPA Filter Air Purifiers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 229 ratings"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Brand",
                "value": "GermGuardian"
            },
            {
                "name": "Product Dimensions",
                "value": "9.75\"D x 9.75\"W x 12\"H"
            },
            {
                "name": "Floor Area",
                "value": "1040 Square Feet"
            },
            {
                "name": "Specification Met",
                "value": "ETL Certified, CARB Certified"
            },
            {
                "name": "Power Source Corded Electric",
                "value": "Item Weight 7 Pounds"
            },
            {
                "name": "Control Method Touch",
                "value": "Filter Type HEPA"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "GermGuardian Airsafe Series​",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a9678af6-ad97-4d0b-986d-7bb075ac22fc.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Protection from Every Direction ​ The 360 HEPA Filter traps 99.97% of particles down to .1 microns. The activated carbon pre-filter traps dust, pet hair, and other large particles while reducing common household odors. ​ Turbo Charge your Refresh​ Sanitizing UV-C Light reduces germs, viruses, bacteria and mold spores* before releasing the cleaner, fresher air back into the room. Fits Neatly in Small Spaces​ Standing 14 inches tall, it is lightweight and ideal for use in rooms up to 1,000 sq. feet. Breathe Easy​ From the Living Room to the Kitchen, Bedroom to the Nursery, an Air of Confidence allows you to breathe a deep, clean sigh of satisfaction.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/bf0f38ea-9ad7-493c-9f90-df5eacf92986.__CR0,0,440,440_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a7da9257-353a-4afc-8682-b4878ad5d7d4.__CR0,0,440,440_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d9fb3548-6dd1-4a80-8522-1e3856b6035b.__CR0,0,440,440_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ed90e55d-b2a3-4cec-acd1-7d5842f8504b.__CR0,0,440,440_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Zero Ozone Certified All Guardian Technologies Air Purifiers with UV-C are tested and Zero Ozone Certified by Intertek Sustainability. Ozone is typically produced at wavelengths below 240nm. Guardian UV-C lights use a special quartz glass that filers out these ozone wavelengths. UV-C offers a chemical-free approach to disinfection and sanitization. Engineered and Designed in Ohio, USA At Guardian Technologies, our products undergo rigorous scientific testing performed by respected, independent labs in the United States and overseas. Guardian Technologies exceeds the most stringent industry standards to provide cleaner indoor air. Since 2005, our team has embarked on a mission to revolutionize the air purifier industry through the creation and construction of top-notch air quality products . ETL Listed Energy Star Certified CARB Compliant RoHS Compliant Zero Ozone Certified",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/c1d55dd7-c730-4762-934b-df52121b42fa.__CR0,0,600,800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a702c58d-8401-49f8-8ebe-adadbf9d3dba.__CR0,0,700,350_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "GermGuardian Filter V HEPA Pure Genuine Replacement Filter GermGuardian Filter V Pet Pure HEPA Genuine Replacement Filter GermGuardian Filter V Smoke Clear HEPA Genuine Replacement Filter GermGuardian Filter V Toxin Clear HEPA Genuine Replacement Filter GermGuardian Carbon Filter Replacements for AirSafe Series and AC151, 4-Pack GermGuardian LB1000 Pluggable Air Purifier UV-C Replacement Bulb Model FLT151 FLT151PT FLT151SM FLT151VO FLT15CB4 LB1000 Primary Filter Type HEPA - True HEPA - True HEPA - True HEPA - True Carbon UV-C Filter Description HEPA Pure Filter Removes 99.97% of particles down to 0.1 microns such as dust and allergens. Pet Pure HEPA Filter is meticulously designed to tackle pet dander, hair, and odors. Smoke Clear HEPA Filter is designed to effectively combat wildfire smoke and fume odors. Toxin Clear HEPA Filter is treated to clean the air of common VOCs and harmful gases found in everyday byproducts. The carbon filter attacks smoke, cooking and pet odors along with harmful VOC's. It helps to lengthen the life of your HEPA filter. 3.5 Watt bulb with the power of UV-C. UV-C light helps reduce airborne bacteria, viruses, mold spores* and works with Titanium Dioxide to reduce volatile organic compounds. ASIN B0BXQHD518 B0C9KX9WYF B0C9KSB6G5 B0C9KS54LL B0CJSPX7CM B001TLRSOA",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/a9678af6-ad97-4d0b-986d-7bb075ac22fc.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bf0f38ea-9ad7-493c-9f90-df5eacf92986.__CR0,0,440,440_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a7da9257-353a-4afc-8682-b4878ad5d7d4.__CR0,0,440,440_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d9fb3548-6dd1-4a80-8522-1e3856b6035b.__CR0,0,440,440_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ed90e55d-b2a3-4cec-acd1-7d5842f8504b.__CR0,0,440,440_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a89680ef-6db3-4885-a9d6-48cdc41e3699.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c1d55dd7-c730-4762-934b-df52121b42fa.__CR0,0,600,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a702c58d-8401-49f8-8ebe-adadbf9d3dba.__CR0,0,700,350_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/04e3a4fe-be7b-4e01-8bb3-e5ba40e973f3.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/602cae88-f6bc-4d87-b2b1-59ceb6f59346.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2871fe5e-0808-4d12-a420-dc721e55fefa.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f1aa6830-33bb-43b5-aedf-ed09ed14ac28.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f74bb3e1-6bb8-4efb-af46-73c93cdc20c5.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a7f8e505-894c-4a81-8dfb-e76864d61268.__CR0,0,300,600_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "NETAdmin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5WN5L7JFQ4CWULTNI2BAC3PRIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BN71V7E6SBG8?ASIN=B0BSJZMCLW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great for small and larger rooms",
                "reviewText": "I bought this for a 14 x 18 bedroom with attached ensuite bathroom and I liked that it has the capacity for cleaning the air in larger rooms when needed. The automatic setting uses the air quality sensor to ramp up the fan speed when it notices a reduction in air quality. This function works great in the bedroom, but I select medium or high when I use it in the living room with a vaulted ceiling because the low/automatic setting will not move enough air to be useful. This is to be expected with larger or dirtier rooms and isn't a fault of the product.Overall a 5 out of 5 stars at $94. The fan is quiet despite having high capacity, the UVC function works without generating a large amount of ozone, and it's nice looking. It also helps that the filter replacement costs are reasonable.Update 1: I have since bought two more units at $90. The performance on high punches way above its weight, nearly matching the CFM of a Winix 5500-2 or AW80 for half the price but with about 50% more noise (the AW80 is unusually quiet at the highest speed). Medium has more than enough throughout for most bedrooms and is quiet enough to sleep with it running. On a less positive note, the two recent units did exhibit more chemical off-gassing than the original which is a bit weird. The smell dissipated within a few hours after running the unit on high in a closed room. I only mention this for those who are sensitive to these chemicals like I am.",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Silver B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLXJB3PPMWSLQX6WA4JIWCBZAFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16ID5FCP9H0VK?ASIN=B0BSJZMCLW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Beautifully designed and extremely effective!",
                "reviewText": "I’ve purchased many different air purifiers over the years and this one stands out as my absolute favorite. In sleep mode and level one it is whisper-quiet, but I can pump it up to high when I need a quick clean. A couple reviewers complained about noise - of course you’re going to hear the fan on high – guess what – that means it’s working! The design of this little guy cannot be overstated – it is beautiful. It is small enough to be easily carried from room to room but large enough to know it is cleaning! The one-button control is refreshingly straightforward and a testament to how user-friendly and uncomplicated technology can be when given some thought. As a pet owner and someone who suffers from year-round allergies – I have noticed a significant difference in the air when I have this running. I used to wake up in the middle of the night sneezing but no more – I set this on sleep mode and am out like a baby! I also love the peace of mind I get by going with the Germ Guardian brand. I just realized they are an American company out of Ohio, USA which gives me that additional peace of mind in knowing I am buying a quality product and supporting my neighbors. For anyone in the market for an air purifier, this one is a no-brainer. Highly recommend!",
                "reviewVotes": "52 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "passerby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7LJSMFDJ3DD3URVIPHKCOV2P4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REPX6YQOD6ZY7?ASIN=B0BSJZMCLW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Excellent Purifier with Very Minor Issues",
                "reviewText": "I used this air purifier during the June 2023 east coast smoke-pocalypse (due to Canadian wildfires). The sensor definitely works as it turned red that day (I left my window open not knowing what was going to happen). Cleaned the air pretty quickly at the highest setting. Noise wise, the lowest setting is whisper quiet (I believe it is the same rate as night mode - but on night mode the sensor light shuts off). It does get progressively louder as you turn on more fans / sections (3 power settings in total). The unit is pretty nice overall. I also have the Bissell MyAir and the GermGuardian feels / weights way more substantial (also a little bigger to be fair) and has HEPA and UV (the UV can be turned off and on independently as it is separate button). I have used the UV and I didn't smell ozone. There is a \"new\" / plastic smell in the beginning regardless of UV or not, but I think that's true with all new air purifiers. I had the same \"new\" smell issue with my non-UV Bissell also (and the Bissell was even stronger in smell).I think the only complaint is that there are actually quite a couple purifier settings and you MUST rotate through it via clicking (it's auto, low, med, high, night, off I believe). The Bissell MyAir only has 2 setting so that interface is less annoying to use. That's the only gripe I have with this unit. If I could I would have given 4.5 stars, since this is a really minor issue and I feel I could shortcut better if I read the manual. Also if you are the type who just have it on auto all day I don't foresee this as an issue.Also, after reading the manual, it is possible to replace the UV light bulb (Model LB1000). There are instructions in the manual (which can be found on the Lasko website). There's no link of the product page, but it appears that LB1000 is sold on Amazon (I just searched for it).",
                "reviewVotes": "56 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}