{
    "remaining_requests": 10531,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/LEVOIT-Purifier-Allergies-Core-200S/dp/B08FJ678YK",
    "body": {
        "name": "LEVOIT Air Purifier for Home Bedroom, Smart WiFi Alexa Control, Covers up to 915 Sq.Foot, 3 in 1 Filter for Allergies, Removes Pollutants, Smoke, Dust, 24dB Quiet for Bedroom, Core 200S, White",
        "price": "$76.47",
        "originalPrice": "$89.99",
        "rawPrice": 76.47,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/LEVOIT-Purifier-Allergies-Core-200S/dp/B08FJ678YK",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CRYLYZR3"
        ],
        "asinVariationValues": [
            {
                "asin": "B09NBXDXJW",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31ILV+kd+-L._SS36_.jpg"
            },
            {
                "asin": "B08FJ678YK",
                "variationName": "Color",
                "variationValue": "Cream White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41U8pa5nUHL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41HH66tfuuL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41S7lH8GxSL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41U8pa5nUHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Cq3VQ1IrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51cfHkO6QqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51LRV00dhqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Fp6RxEG9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51STqyN9cvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51fzixfSiUL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91BrMcmpe3L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1WNHY3Mm5S.pdf"
        },
        "byLineInfo": {
            "name": "Visit the LEVOIT Store",
            "link": "https://www.amazon.com/stores/Levoit/page/36E5D100-D40D-4618-AEA6-A8FF8AD39805?ref_=ast_bln"
        },
        "brand": "Levoit",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 36937,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tomorrow, February 17. Order within 4 hrs 55 mins",
            "FREE delivery Thursday, February 22. Order within 7 hrs 40 mins",
            "FREE pickup Wednesday, February 21",
            "Or fastest pickup Sunday, February 18. Order within 19 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "OZONE FREE: Our most popular air purifier series is back with an all-new smart model. Levoit air purifiers avoid using UV-C light, which is especially harmful for Asthma sufferers and pets",
            "GENUINE REPLACEMENT FILTERS: For the best performance and longest lifespan, use genuine Levoit replacement filters. Use the in-app feature to monitor your filter life. Search B08L971Z4L or “Core 200S-RF”",
            "EFFECTIVE PURIFICATION: The compact frame and 360° design help the Core 200S purify the air wherever you put it, refreshing the air 5x per hour in rooms as large as 183 ft² / 17 m². The optimal air cleaning performance can only be delivered by powerful motors installed on products over 6 pounds, Operating Conditions Temperature: 14°–104°F / -10°–40°C",
            "IMPROVED FILTRATION: While the ultra-fine Nylon Pre-Filter and High-Efficiency Activated Carbon Filter capture large particles and absorb odors and fumes, the efficient filter of the 3-in-1 filter removes at least 99.97% of dust, pollen, and any airborne particles with a size of 0.3 microns (µm)",
            "QUIET OPERATION: With noise levels as low as 24dB, the Core 200S cleans your air without keeping you up at night. For a completely uninterrupted sleep, turn off all lights with the Display Off button",
            "ACCESS ANYWHERE: With the VeSync app, you can control your smart air purifier from anywhere. Adjust settings while you’re in the other room, at the office, or out walking the dog",
            "VOICE CONTROL: The Core 200S is compatible with Amazon Alexa and Google Assistant, so you can use your air purifier without having to lift a finger",
            "NO MORE ALLERGIES: If you or anyone in your family has allergies to air pollution, smokes, or if mold is present in your home, choosing Core 200S is a smart choice to solving these air pollution problems",
            "EASY SETUP: To get started, simply turn on the Core 200S and open the VeSync app. There you’ll find easy instructions to connect your air purifier. Once setup is complete, you’ll be able to control the air purifier with your smartphone or the display panel",
            "FULLY CERTIFIED: The Core 200S has been thoroughly tested for safe performance. It is ETL Listed, FCC Certified, CARB Certified, and compliant with California’s strict standards for indoor cleaning devices. Note: Power Supply: AC 120V/60Hz (Only applies to the USA and Canada.) CADR: 118 CFM / 200.6 m³/h"
        ],
        "description": "Levoit air purifiers avoid using UV-C light, an air cleaning method that research has shown can produce harmful ozone and secondary pollution. Please follow the details and FAQs below.Q: How safe are UV purifiers?The biggest issue with UV purifiers is that they emit varying levels of ozone. Even very small amounts of ozone in the air may result in chest pain, coughing, shortness of breath, and throat irritation. In fact, The World HealthOrganization (WHO) has issued a warning against people using UV light to sterilize their hands or any other part of their skin.Q: How effective are UV purifiers?Not very. Microbes have to spend some time in front of the UV light before they’re destroyed. The EPA explains that microbes must be exposed to the light “on the order of minutes and hours rather than the few seconds typical of most UVGI air cleaners”.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=267554011"
            },
            {
                "name": "HEPA Air Purifiers",
                "link": "https://www.amazon.com/hepa-air-purifiers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510192"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Cream White"
            },
            {
                "name": "Brand",
                "value": "LEVOIT"
            },
            {
                "name": "Product Dimensions",
                "value": "8.07\"D x 8.07\"W x 12.6\"H"
            },
            {
                "name": "Floor Area",
                "value": "916 Square Feet"
            },
            {
                "name": "Specification Met",
                "value": "ETL Certified, FCC Certified, CARB Certified"
            },
            {
                "name": "Noise Level",
                "value": "24 dB"
            },
            {
                "name": "Particle Retention Size",
                "value": "0.3 Micron"
            },
            {
                "name": "Controller Type",
                "value": "Vera, Amazon Alexa"
            },
            {
                "name": "Wattage",
                "value": "26 watts"
            },
            {
                "name": "Item Weight",
                "value": "6.58 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Levoit"
            },
            {
                "name": "ASIN",
                "value": "B08FJ678YK"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "Core 200S"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 36,937 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,085 in Home & Kitchen (See Top 100 in Home & Kitchen) #13 in HEPA Filter Air Purifiers"
            },
            {
                "name": "Care instructions",
                "value": "Clean the pre-filter 2-4 weeks"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "1* Smart WiFi Air Purifier; 1*Pre-installed Filter; 1*QSG; 1*User Manual"
            },
            {
                "name": "Power Source AC",
                "value": "Item Weight 2.99 Kilograms"
            },
            {
                "name": "Control Method App, Touch, Voice",
                "value": "Filter Type Activated Carbon"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d84115c3-a490-446e-af0d-cfaf5f8988a2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7a00bfce-b988-4644-99c3-f337d7ac9e14.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d34153c7-bf17-40a5-8859-d507569eea77.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ab255de0-eb44-4c5c-92ff-3b7363a33960.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cb197bf5-39c4-49de-b4b2-fa5d07a05d88.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f45ae953-7994-4bd9-b38f-0ded9444e6b8.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dc58b1e2-b0d6-408c-a17b-938d0c0c0b2b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Cutenewt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGF4ELP55LF5MRJJHMHONDXXYW6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A3VSLZY142DD?ASIN=B08FJ678YK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Very Easy to Use and Set Up. Looks Nice in the Room. Needs Some Space Around It. Good Value.",
                "reviewText": "I had this out of the box and working within a few minutes. The instruction manual is clear and the controls on the air purifier are clear and easy to use. It looks nice and has a clean look to it. Note: The instruction book says it should be situated 15 inches from anything (like a wall) on all sides. I didn't see that anywhere in the listing and I had planned on setting it in a corner so I had to rethink its placement a bit. It's probably more of an efficiency thing than an absolute as the intake for the air is all around the lower part of the unit and the air exits out the top but you will need to give it space to work effectively. The same company makes non-round units that can probably sit next to a wall if this setup doesn't work for you.There are three fan settings. On the lowest, it is peaceful and quiet. It's not silent, but like a very soft white noise machine. I get bothered by noise and this doesn't bother me. The highest setting is somewhat loud but the great thing is, you can set the timer on it and just have it do the high setting for a short time (like two hours) to get the room air circulating and cleaner. Then it can cut back to the quiet level.I used a very simple sound meter on my phone to measure volume and standing right next to the unit I got about 34 dB (decibels) at low level fan, 44 dB at medium level, and 54 dB at high level. For reference, a whisper is about 30 db and an average conversation is about 60 dB unless you are particularly expressive.Overall I'm happy with it and it has received good reviews as a less expensive option that is still very effective. I'm using it for our second, small room which functions as an office...and as the kitty litter room. I can turn it on high when the kitties are visiting their bathroom in the morning and partying in the dust, and then turn it down for the day while we are working and it's a soothing low level background sound. I have two litter boxes so we'll see how it does over the next couple of months but so far I am very happy. It really does look nice in the space and will make the air healthier for all of us.",
                "reviewVotes": "100 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. Porter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQURXVKHFAIU3QI445OAJYY7XDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FLLW348438GQ?ASIN=B08FJ678YK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Works better than expected.",
                "reviewText": "This product was much smaller than I expected, which is a good thing because it is less conspicuous in the room. I also purchased the 300 for my kitchen and dining room and I am glad that I purchased the 200 for my living room because it is smaller and quieter than the 300. The only feature that the 300 has that the 200 doesn't have that I wish it had is the automatic mode. In the automatic mode, the 300 automatically cuts on and shuts off based on the quaity of the air in the room that it senses. This is an energy saver and a filter saver. To compensate for the 200 not having the automatic mode, I simply set it on the timer feature to clean the air in the room without wasting electricity or filter life.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZSLVRKRGFGV4BCB3BHVK6ATL3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R278424Z87B23C?ASIN=B08FJ678YK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Quiet and effective!!",
                "reviewText": "This air purifier is amazing, and has definitely set a high bar for what an air purifier should be.One of the awesome features of this air purifier is how quiet it is. I barely notice it's on, even when it's running on its highest setting. This is amazing for me, cause I use it in my room at night. It's just a really quiet whir that helps me sleep. It has a \"sleep mode\", but honestly the low setting is quiet enough. If you're really sensitive though, sleep mode is barely audible.I've also noticed a huge improvement in my allergies since I started using this air purifier. I live in Texas, and I swear the outdoors is trying to kill me through my allergies. I've definitely noticed an improvement in my symptoms (take that, Oak trees!!).Another feature I really like is the fact that I can control the purifier with Google Home. This makes it super easy to turn on and off, and change the intensity without even getting out of bed. I will say, sometimes it disconnects itself from the levoit app. I'm not sure why. Luckily it's simple and fast to reconnect it.The filter has lasted a really long time, too. I bought the purifier in September, and the app says I still have about 14% left. Paying ~$25 for a filter every six months isn't too bad!!Finally, don't mention this to my girlfriend, but she farts a lot. She has IBS, and the mornings can get stinky. Well. They used to. Now, I don't have to hold my breath for a few moments every once in a while. That saves me my nose, and her from getting offended!!Overall, I highly recommend this air purifier. It's quiet, effective, and easy to use, and I definitely think it's worth the price. This is the first air purifier I've bought and it has definitely set a high bar for what an air purifier should be. I'm definitely not going to go back to a purifier-less life, and once I can afford another, I'll definitely buy one by Levoit for the living room.",
                "reviewVotes": "90 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blarbs ArtBlarbs Art",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHJXV7ATVV73MBFSH7Z7CAVNDLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LNXCLXKPKNRP?ASIN=B08FJ678YK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "4.0 out of 5 stars Works well, wish the filter was washable",
                "reviewText": "It's a good product, I don't think I personally saw too much change in air quality so either that means my air is already fine or too bad to notice 🤷‍♀️ like that it worked with Alexa though I kept it on more often than not so didn't use that feature much, but setting it up to do it was fine. If I was to purchase again I would search for one with a reusable filter because replacements are $26 which just seems excessive if replacing every 6 or so months and having to just add that to the list of things to buy. It does make a quiet fan noise that worked out well for low white noise though so plus for me.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71O41AHfP1L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 25, 2023",
                "reviewTitle": "Excelente purificador de aire",
                "reviewText": "El diseño, materiales y funcionamiento son excelentes. Desde el sistema del filtro y la botonera hasta el empaque es un producto impecable. Se instala muy rápidamente y se controla super fácil con la app, alexa o manualmente. Incluso la luz ambiental que tiene es muy agradable. Filtra muy eficientemente y con poco ruido un espacio de 50m2. Calidad/Precio extraordinaria.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos Alejandro Garcia MoralesCarlos Alejandro Garcia Morales",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 14, 2023",
                "reviewTitle": "Es perfecto!",
                "reviewText": "Tengo dos, super funcional.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Kxt6vvx1L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Pdtn+zS3L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paloma d.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 31, 2021",
                "reviewTitle": "Muy satisfecha con la compra",
                "reviewText": "Es un producto que definitivamente recomendaría para habitaciones que suelen tener bastante acumulabilidad de polvo/contaminación, y sobre todo quienes tienen mascotas que sueltan mucho pelaje (tengo un gato cruce doméstico mexicano bastante lanudo). Si bien a una semana que llevo usándolo he notado una gran diferencia, ya no hay malos olores y el aire se siente tan... ¿ligero?... ojo, no sustituye por completo el hecho de limpiar y/o cepillar a tu mascota.Estuve pendiente por algunos comentarios que leí del producto antes de comprarlo, así que daré mis referencias conforme estuve usando el producto:- El botón de control para mascotas sí me funcionó, sin embargo a diferencia de los otros botones éste lo tienes que mantener presionado para activar/desactivar.- El filtro tal cual es una sola pieza, bastante grueso donde aparenta tener las diferentes capas que el diagrama en el instructivo anuncia (no hay forma de \"desmontarlo\"). Sólo voy a decir que al menos en calidad del aire, olores y polvo se nota la diferencia y con eso estoy satisfecha.- Sobre el gasto de luz actualizaré ya cuando llegue mi recibo (yo lo necesito mantener encendido todo el día usando los distintos niveles, incluyendo de mode sleep).- En 1 semana noté que por encima de los \"hoyitos\" comenzó a acumular ligeramente el pelaje de mi gato que iba recolectando, sólo es pasar de vez en cuando un trapito o toalla húmeda y listo.- Sobre el ruido, la verdad es bastante obvio que a mayor velocidad del ventilador hará mas ruido (y creo yo que cualquier dispositivo similar lo hace, es inevitable), aún así es bastante tolerable, es sólo el sonido del \"viento\" que hace más que el propio ventilador. Completamente distinto a una aspiradora, por ejemplo. El modo Sleep es silencioso, el nivel 1 normal solo se escucha ligeramente, y así sucesivamente.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fredrik B",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on February 10, 2024",
                "reviewTitle": "Prisvärd!",
                "reviewText": "Prisvärd luftrenare som känns välbyggd. Enkel att använda, både via panelen samt appen. Rekommenderas",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joao-Pedro Speeckaert",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on January 24, 2024",
                "reviewTitle": "NorthAmerican power cord",
                "reviewText": "this product has a North American power cord so you need an adapter if you are going to use it in Europe.wasnt specified in the listing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}