{
    "remaining_requests": 10235,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Honeywell-InSight-HPA080B-Purifier-Indicator/dp/B09L9SC9YG",
    "body": {
        "name": "Honeywell InSight HEPA Air Purifier for Medium Rooms (100 sq ft). Allergen Reducer for Wildfire/Smoke, Pollen, Pet Dander & Dust. Air Quality Indicator and Auto Mode - Black, HPA080",
        "price": "$99.99",
        "originalPrice": "",
        "rawPrice": 99.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Honeywell-InSight-HPA080B-Purifier-Indicator/dp/B09L9SC9YG",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31pGQpaq11L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51-gSHSBHBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41cp2Tz9DNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wP45OZ cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xcOOI5MKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xNk7QTmGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31SHZVrAKCL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the PUR Store",
            "link": "https://www.amazon.com/stores/PUR/page/672A6A2A-9479-4837-BDBF-1EBA45C51C4A?ref_=ast_bln"
        },
        "brand": "PUR",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 97,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "FREE delivery Thursday, February 22. Order within 17 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "POWERFUL MEDIUM ROOM AIR PURIFIER –The Honeywell HPA080 HEPA Air Purifier helps capture up to 99.97% of the followingmicroscopic airborne allergens and particles:dust, pollen, pet dander, dust mite debris, and smoke.* Plus, it has a slim, compact design.",
            "IDEAL FOR WILDFIRE SEASON: Wildfire smoke can impact the air quality where you live, even if you don’t live anywhere near the fires themselves. Because smoke contains extremely small particles, air purifiers can help remove some of these particles¹ from your air.",
            "AIR QUALITY INDICATOR –This HEPA air purifier for home features an Air Quality Indicator and Auto Mode that continuously displays and monitors your indoor air quality while automatically adjusting to optimal filtration level for cleaner air.",
            "EFFECTIVE AIR CLEANING and CIRCULATION –The Honeywell HPA080 Air Purifier is independently tested and AHAM Verifide to circulate and filter room air up to 4.8x per hour in a 100 sq. ft. room.**",
            "INSIGHT SERIES –This Honeywell HEPA Air Purifier features aCertified HEPA Filter and an Activated Carbon Pre-Filter that helps capture large airborne particles and reduces odors/VOCs. This product is ENERGY STAR Certified.",
            "COMPATIBLE DOES NOT MEAN COMPARABLE PERFORMANCE –For best performance, use only GenuineHoneywell air purifier filters. Compatible air purifier filter replacements are not guaranteed to offer the same performance or efficiency.",
            "GENUINE FILTER REPLACEMENTS – Search B003UH9I2G for Honeywell HRF-AP1 replacement pre-filter and B078W5F7J2 for HRF-G1 replacement primary filter. Optional enhanced odor filter replacements: B09NMRMDYQ, B09NMTC4TP, B09NMRQ26C, B09NMR5943"
        ],
        "description": "Honeywell HPA080 InSight Series HEPA Air Purifierhelps provide cleaner, fresher air in medium rooms. It features HEPA Filtration, which helps capture 99.97% of the followingmicroscopicairborne allergens andparticles: dust, pollen, pet dander, dust mite debris and smoke. This Honeywell air purifieris independently tested and AHAM Verifide to circulate and filter room air up to 4.8x per hour in a 100 sq. ft. room. If you have pets or stale indoor air, air purifiers help deliver cleaner, fresher air.The Intelligent Air Quality Sensor continuously monitors and provides real-time feedback on indoor room air quality through an easy to read, color-coded display. This quiet air purifierfeatures 4 intuitive cleaning levels including Turbo and an Automatic Cleaning Mode that adjusts to the optimal cleaning level. This product earned the ENERGY STAR label by meeting strict energy efficient guidelines set by the U.S. EPA. Always purchase Genuine Honeywell replacement air purifier filters. Other compatible filter replacementsare not guaranteed to offer the same performance or efficiency.All initial filters are included. Accepts Optional Honeywell Enhanced Odor and VOC T Filters to help tackle specific household odors and VOCs from pets (HRFTP1), kitchens (HRFTK1), smoke (HRFTS1) or home renovation (HRFTC1) (sold separately).Disclaimers: From the air that passes through the filter, 0.3 microns and larger. Based on 3rd party independent CADR testing for the smoke CADR value when operated at the highest level. Air circulation depends on many factors, such as room size and configuration. There is no guarantee that all of the air in a room will pass through the filter.The ENERGY STAR name and mark are registered trademarks owned by the U.S. EPA.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=267554011"
            },
            {
                "name": "HEPA Air Purifiers",
                "link": "https://www.amazon.com/hepa-air-purifiers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510192"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Brand",
                "value": "PUR"
            },
            {
                "name": "Product Dimensions",
                "value": "12.6\"D x 19.25\"W x 10.35\"H"
            },
            {
                "name": "Specification Met",
                "value": "AHAM Certified"
            },
            {
                "name": "Particle Retention Size",
                "value": "0.3 Micron"
            },
            {
                "name": "Controller Type",
                "value": "Button Control"
            },
            {
                "name": "Item Weight",
                "value": "11.44 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Kaz"
            },
            {
                "name": "ASIN",
                "value": "B09L9SC9YG"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "HPA080B"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 97 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#359,349 in Home & Kitchen (See Top 100 in Home & Kitchen) #395 in HEPA Filter Air Purifiers"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "5 year limited"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Air Purifier"
            },
            {
                "name": "Power Source Corded Electric",
                "value": "Control Method Touch"
            },
            {
                "name": "Filter Type HEPA",
                "value": "Floor Area 100.0"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Pre-Filter Replacement HEPA Filter Model # HRF-AP1 HRF-G1",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/13831582-7a01-4618-96b2-38a475848d67.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/93d4110d-6a91-4bcc-b1c3-1b26d81c3474.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5eb5570c-c220-40b6-87ad-deffcd5f61a0.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e60dcd80-934f-4345-8237-0befc7329311.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0895ba6a-52e7-4748-a931-913d670e5e27.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d2b3a94a-2553-4cd5-a850-1f1a1605f3a3.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/28baf1fa-82e0-491c-9973-0703a524308c.__CR0,0,313,626_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/53619f15-3676-4c6a-9489-9e936a21a5d9.__CR0,0,313,626_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Robert A. Likis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5PVE6SBZOFZZY4YA6UOHIFGCYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD6J0UPZIJGBL?ASIN=B09L9SC9YG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2022",
                "reviewTitle": "5.0 out of 5 stars UPDATE: Cleaner Air Better Health Unvelivable (Almost)",
                "reviewText": "I just received this unit two days ago and placed it in my new home office/studio. First, it is a bit noisy, but all blowers make noise or they wouldn't circulate air. I placed it in the far corner and set it on \"Auto\" mode which is advertised as the setting that controls the unit - according to the quality of air in the room. Here's where it gets very interesting. I have a globe bulb lamp in my special studio that is opaque inside with a glossy surface outside. It's quite beautiful and diffuses the light perfectly. After about a year, the globe had a 2\" round dark spot inside so I had to remove and clean it. The challenge with the cleaning is that the globe drys water-spotted inside so I use Isopropyl alcohol to rinse it eliminate spotting. I reinstalled the globe which was obviously still wet (inside) with alcohol... which I allow to self dry. Lo and behold, the air cleaner turned Red and went into Turbo mode all by itself. The lamp globe was 3' away and on top of a 2' table and the cleaner was on the floor. I timed it and it ran 34 minutes before returning back to low speed auto mode. The sensor worked! BTW: I like the \"white\" smell along with a minor \"white\" noise...all good. Update: The Pre-Filter (I bought a pack of 4) is not the \"T\" filter which is what I wanted for pet odors and VOC removal. After way too much time searching herein, I had to go to Honeywell site and buy one there...$36. The \"T\" filter fits against (in front of) the main White filter so, altogether to obtain the ultimate filtration, this unit must have Three (3) filters installed.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. MOSES",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLL2SIYLRWOON3VDEMAXLHFLGZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PYZB5WVTGEK1?ASIN=B09L9SC9YG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Bedroom Unit",
                "reviewText": "Needed a smaller unit for my bedroom, as I tend to keep the window open a little bit. Our big Honeywell can only reach so far in the duplex. Being happy with the quality & durability of the 1st unit, made sense to order a smaller one.Junior sits pretty quietly in the corner, doing its air cleaning duties. Only twice has kicked into overdrive for a few minutes during the day. This coincided with the increase of road construction equipment & truck traffic about 1/2 block away. Noticed a big difference within 3 days, with dust levels down significantly. I'm not so sniffly with seasonal allergies now too first thing in the morning.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roger A. Rubio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3HYLTP43YUWF5EELMORFQN2VGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AU3WQFBCCPR?ASIN=B09L9SC9YG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Gets the job done well, but it's louder than similar purifiers on its lowest speed",
                "reviewText": "I use this purifier to keep the air in my home office clean. I recently grilled some meat indoors and the kitchen got too smoky (almost set the smoke alarm off). The smoke went almost everywhere in my house, including my home office, which is about 200 feet from my kitchen. I turned on the purifier and set it to auto, to test whether it would detect the smoke and pollutants in the air. It did:. It cycled through its colors at the top of the unit until it settled on green, then upped the fan speed and changed the color to yellow. After running for about 30 minutes, the color changed to green. The office smelled a little like smoke before I used the purifier; afterwards, it smelled a lot less.This purifier has three fan speeds, and the lowest speed is loud. I have a bigger Honeywell HEPA air purifier where you can barely hear the lowest speed (it is labeled \"GERM\"). The lowest speed on this purifier sounds like the \"ALLERGEN\" speed on my bigger HEPA filter (\"TURBO\" being the loudest). If you like white noise or you don't care how loud it is, then this purifier is a very good choice, because it uses Honeywell filters which are widely available. But if you are looking to use it in an office setting, I would look for another one where only the higher speeds make noise.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason Steinberg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE26VNTL7MKY5BG6LXE4X4LP2BBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MDCRSYJKV37M?ASIN=B09L9SC9YG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Have two one is a bit noiser than the other.",
                "reviewText": "I have 4 pets and live in a valley with a variety of trees, bushes, flowers etc. During the height of allergy season the vehicles turn that shade of green we all know, and the windows stay shut. These two little units are in the bedrooms (we have another bigger one in the main living room and another medium one in basement). So far they do what I need them to do, and I run them 24/7 for the most part. Only turning off when we have windows open(after allergy seasonal height which is spring for us mostly).Don't forget to remove the plastic on top of the unit. It'll make it shinier and you won't have \"scratches\".",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ms Bee Bee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLHVUWMNYAAWLY52A3GRM5B7WQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8R3EWN4X1U2Z?ASIN=B09L9SC9YG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Tap the button....",
                "reviewText": "The media could not be loaded. Easy to use quite when you sleeping air smells referred",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f4bb7a4e-bce8-4dbe-9591-6deb3eeacb68/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Izzy Sword",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHT2AEMCMRFRQXKGYRGIP54DEP3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13QPKD1MUQ353?ASIN=B09L9SC9YG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Not quiet",
                "reviewText": "Love it but it's for sure not quiet.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E. Gaertner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNSX4JZJIVIMRGGCEHBDKJORQRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGU501Y1UPJMX?ASIN=B09L9SC9YG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2023",
                "reviewTitle": "4.0 out of 5 stars A decent air purifier",
                "reviewText": "Overall a decent air purifier. It is a bit louder than other models but I use it in my bedroom and I always sleep with white noise, so I don't mind at all. I do wish low was a little lower, as it's still moving a ton of air on low and that would probably help with the noise. In auto mode it is very fast to react to changing air conditions, much faster than the Shark models I have elsewhere in the house. All in all a pretty solid unit.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": " Mike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBW4J53CPT76ZGC6CKAXG7DVHSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RKJIF9U3T8BC?ASIN=B09L9SC9YG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect!",
                "reviewText": "Perfect noise level to help us sleep. Small enough to sit on bedside table. Works perfet.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}