{
    "remaining_requests": 10495,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Honeywell-Allergen-Purifier-Extra-Large-White/dp/B07DD9H6YH",
    "body": {
        "name": "Honeywell HPA304 HEPA Air Purifier for Extra Large Rooms - Microscopic Airborne Allergen+ Dust Reducer, Cleans Up To 2250 Sq Ft in 1 Hour - Wildfire/Smoke, Pollen, Pet Dander – White",
        "price": "$191.65",
        "originalPrice": "$269.99",
        "rawPrice": 191.65,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Honeywell-Allergen-Purifier-Extra-Large-White/dp/B07DD9H6YH",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CG3T8TTP"
        ],
        "asinVariationValues": [
            {
                "asin": "B00BWYO53G",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51VMsOL2oNL._SS36_.jpg"
            },
            {
                "asin": "B07DD9H6YH",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51hMlNYQB0L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Z6bU2PhgL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51-gSHSBHBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bqguUD5JL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dGvkLw4YL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qkw6DW VL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NGvx47fhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xIpxhSnFL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Honeywell",
            "link": "https://www.amazon.com/Honeywell/b/ref=bl_dp_s_web_21407250011?ie=UTF8&node=21407250011&field-lbr_brands_browse-bin=Honeywell"
        },
        "brand": "Honeywell",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 31060,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Sunday, February 18. Order within 19 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "EXTRA LARGE ROOM AIR PURIFIER - Honeywell HPA304 HEPA Air Purifier helps provide fresher, cleaner air in minutes. Cleans up to 2250 sq ft in 60 mins (1 ACH), for powerful large room coverage. Provides 4.8 air exchanges per hr in AHAM suggested room size of 465 sq ft",
            "IDEAL FOR WILDFIRE SEASON: Wildfire smoke can impact the air quality where you live, even if you don’t live anywhere near the fires themselves. Because smoke contains extremely small particles, air purifiers can help remove some of these particles¹ from your air.",
            "HELPS REDUCE ALLERGENS - This HEPA air purifier has 3 air cleaning levels including Turbo Clean. It helps capture the following microscopic airborne allergens and particles: dust, pollen, pet dander, dust mite debris and smoke.",
            "EFFECTIVE AIR CLEANING AND CIRCULATION – The Honeywell HPA304 Air Purifier filters and circulates air in extra-large 465 square feet rooms up to 4.8 times an hour.",
            "ALLERGEN PLUS SERIES – This Honeywell HEPA Air Purifier is part of our Allergen Plus series. This product earned the ENERGY STAR label by meeting strict energy efficient guidelines set by the U.S. EPA.",
            "COMPATIBLE DOES NOT MEAN COMPARABLE – For best performance, use only Genuine Honeywell air purifier filters. Compatible air purifier filter replacements are not guaranteed to offer the same performance or efficiency."
        ],
        "description": "This Honeywell HPA304 HEPA Air Purifier includes a Certified Honeywell HEPA Filter that helps capture up to 99.97% of the following microscopic airborne allergens and particles: dust, pollen, pet dander, dust mite debris and smoke.* Recommended for extra-large rooms (465 Sq. Ft.). This Honeywell air purifier can filter and circulate air up to 4.8 times an hour. If you have pets or stale indoor air, air purifiers help deliver cleaner, fresher air. This Honeywell HEPA Air Purifier is part of our Allergen Plus series. This product earned the ENERGY STAR label by meeting strict energy efficient guidelines set by the U.S. EPA. Always purchase Genuine Honeywell replacement air purifier filters. They are certified to help capture odors and the following microscopic airborne allergens and particles*: dust, pollen, pet dander, dust mite debris and smoke. Other compatible filter replacements are not guaranteed to offer the same performance or efficiency. Quiet air purifier has easy to use touch controls, a filter change indicator and reset, 2, 4 or 8 hour automatic shut-off timer and a control panel dimmer. Backed with a 5-year warranty. Disclaimers: *From the air that passes through the filter, 0.3 microns and larger. **Based on 3rd party independent CADR testing for the smoke CADR value when operated at the highest level. Air circulation depends on many factors, such as room size and configuration. There is no guarantee that all of the air in a room will pass through the filter. The ENERGY STAR name and mark are registered trademarks owned by the U.S. EPA. The third-party testing for the R filter efficacy was done by LMS Technologies, Inc. on July 28, 2022.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Heating, Cooling & Air Quality",
                "link": "https://www.amazon.com/Heating-Cooling-Air-Quality/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3206324011"
            },
            {
                "name": "Air Purifiers",
                "link": "https://www.amazon.com/air-purifiers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=267554011"
            },
            {
                "name": "HEPA Air Purifiers",
                "link": "https://www.amazon.com/hepa-air-purifiers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510192"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Brand",
                "value": "Honeywell"
            },
            {
                "name": "Product Dimensions",
                "value": "20\"D x 10.8\"W x 22.3\"H"
            },
            {
                "name": "Floor Area",
                "value": "465.0"
            },
            {
                "name": "Particle Retention Size",
                "value": "0.3 Micron"
            },
            {
                "name": "Controller Type",
                "value": "Button Control"
            },
            {
                "name": "Item Weight",
                "value": "17 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Kaz"
            },
            {
                "name": "ASIN",
                "value": "B07DD9H6YH"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "HPA304"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 31,060 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,425 in Home & Kitchen (See Top 100 in Home & Kitchen) #45 in HEPA Filter Air Purifiers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "1 air purifier"
            },
            {
                "name": "Power Source Corded Electric",
                "value": "Item Weight 17 Pounds"
            },
            {
                "name": "Control Method Touch",
                "value": "Filter Type HEPA"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "1 2 2",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/3987a9cc-4617-47fb-a014-3423a251b559.__CR0,0,626,626_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/05fc0fd0-73e6-4efb-93fc-513797da38f7.__CR0,0,626,626_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/71996040-d6a9-45b8-9716-f5c3b3564961.__CR0,0,626,626_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/f210c33a-0a9b-4ca8-81ab-b24a5e9e6f25.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/3987a9cc-4617-47fb-a014-3423a251b559.__CR0,0,626,626_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/05fc0fd0-73e6-4efb-93fc-513797da38f7.__CR0,0,626,626_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/71996040-d6a9-45b8-9716-f5c3b3564961.__CR0,0,626,626_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/100b5ab7-75d4-4c20-b4ff-f4396e168802.__CR0,0,2022,625_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/7311542f-8c67-482e-877e-a361c583aec4.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "al",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQEQNAFPHDFSZPI737AXSKLGGXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UZTKGOERADRV?ASIN=B07DD9H6YH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars They work terrific, both at odors and dust and I assume other particulars",
                "reviewText": "I wanted to have cleaner indoor air quality, especially with everything that has transpired since 2020. I had purchased two of these units, I believe well over a year ago, possibly closer to two years. They have worked terrific.They do a great job of removing airborne dust etc. They do remove odors, but it takes some time, it is not an instant thing. If you are sensitive to noise, the high setting may be a little too loud. One of the units I leave in the bedroom and I have found the low setting works very well and it keeps the noise down.While changing the filters it is visible how much airborne material is removed. I vacuum the exterior charcoal filter weekly and change it every so often along with the inside filters. Maintenance is simple and basic. I am very pleased with the products.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A Wife, Mom, Jedi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMVGNLRB7R6VRPUSB5MYOZ23JLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P9KJ17VP6BME?ASIN=B07DD9H6YH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2023",
                "reviewTitle": "5.0 out of 5 stars I love this so much - we have multiple of this item.",
                "reviewText": "Over the past 7 to 10 years, we have been purchasing this exact model for our house, and all of them still work perfectly. We live in a house that was built in the late 60s, have two cats and two dogs, and three teenagers. I am HIGHLY allergic to cats - if I pet them, I have to wash my hands immediately. The amount of pet dander in my home is outrageous. We also recently had our subfloor replaces in several areas of the house and it has caused a massive amount of wood-colored dust (we need to have our duct work redone and suspect it is a part of the dust issue in the house). These are strategically placed around the house for maximum cleaning.One, these are the best because you can place them against a wall. The downside is that it will create more dust on the wall near the air purifier. Simple logic - the air exits the top and what hasn't been sucked in through the device travels on a path that hits the wall. So you have to dust your wall - no big deal. I have to do that, due to just being noticeable, about twice a year.The hepa filters only need to be changed once a year, and the pre-filter every 3 months. When I change the pre-filter, I normally run a vacuum around the edges where there is dust buildup. This is unavoidable for any air purifier (I have tried many versions and keep coming back to this one).WHAT MAKES THIS THE BEST:- Durability. I have had our first one we ever purchased (maybe 7 to 10 years ago) running all day at the highest speed without going on turbo, consistently and there has been zereo degradation to the unit. It works as well today as it did when we purchased it many years ago.- White Noise. I like white noise, and unless it is on turbo, you don't really think about the sound once you get used to it. My pets are not afraid of it, which means it's just white noise to them as well.- Frequency of filter changes and types of filters. Sure you can buy the name brand filter replacements, but the generic ones are just as good and you save money. Honeywell's products are excellent from my experience, and the device itself has stood the test of time. For the filter replacements, you're just paying for the Honeywell name if you choose their higher priced replacements.-CLEANER AIR! Like I said, we have four of these now. One in my son's room which is a mother-in-law suite - the size is sufficient for the size of his room. The room was an addition built in the late 80s, early 90s, and the door to the outside isn't perfect (old house issues), and some outdoor allergens get into his room. Having one in his room has greatly reduced allergies during high pollen season (we are in the south, pollen is around all year). Since adding the most recent unit, the amount of the brown dust I have seen has been reduced. We also have one in our living room that is large enough to seat 10 people, and a home office. My newest one is located in another home office that I share with my dogs and their crates. Again, allergen reduction was easily noticeable once it was in place. The last one we own in in our bedroom because of my allergies (no pets allowed). I know it has made a difference because I have significantly less allergies in the morning than I did prior to putting one in our bedroom. My entire life has been one allergy attack after another, even after taking allergy shots. These units help me live life - WITH PETS I AM ALLERGIC TO - without a constant runny nose and itchy eyes.If you are looking for a unit that will not die in a year, or start making strange sounds after a few weeks of use, THIS IS THE UNIT YOU HAVE BEEN DREAMING OF! Like I said, we have had the same one for many years (we got our first one at a big box store and I can only guess that it was at least 7 years ago, but I suspect it was closer to 10).",
                "reviewVotes": "267 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andy G.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZZ267H6KAPGHNDCYTG7627KJOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SVDPM3QAZLWP?ASIN=B07DD9H6YH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2020",
                "reviewTitle": "5.0 out of 5 stars Incredibly fast and effective",
                "reviewText": "This is the ultimate air purifier. This summer we were in the direct path of smoke from the Cameron Peak fire in Colorado, so I used my Dylos DC-1700 air quality monitor to test the HPA300's effectiveness. After running less than 10 minutes, the AQI in our bedroom dropped from 68.7 to 25. When I got up this morning AQI was a mere 10.4 (PM2.5 of 2.5). This was with the bedroom door open to the hallway, with the HPA300 on the other side of the room and the Dylos monitor by the open door. Incredible. Our family owns 3 of these purifiers: one at our house, and one at each of our two daughters houses. Both daughters have allergies, and have been equally happy with their HPA300s.Speeds: The fan has 3 speeds plus a \"Turbo\" button for a 4th speed. In the above test, the unit was on the middle setting, which they call \"general clean\". I'm not sure why they don't just call the fan speeds low, medium, and high. Instead, they are called \"Germ\", \"General Clean\", and \"Allergen\". What if I want to generally clean the germs and allergens from the room? Ha Ha.Noise: The lowest fan setting is quiet and still cleans the air quickly. I had no trouble sleeping with the unit running all night on the lowest setting. The turbo setting is loud, but the sound is mostly rushing air, not motor noise. This is true of the noise at all levels - the sound is mostly moving air, with just a little soft motor tone (C above middle C on the piano, with the fan at medium speed).Size and weight: This is a large unit, but moving it is easy. It's not that heavy, and there are two pockets for your hands near the top on each side that make it easy to pick up. The unit is stable - it shouldn't tip over easily thanks to the base being flared a little at the bottom and the weight of the unit mostly at the bottom (or so it feels).Ease of use: There are 4 air filters to replace once a year. There are three white colored True HEPA filters that come in a box of 3, and a large black foam pre-filter that sits over them. It is easy to open the unit and change the filters. The filters cover the entire back of the unit. I suspect this large surface area is how the unit is able to clean so quickly and quietly. There is a button to turn the fan-speed light off, which we use at night. Lastly, there is a plastic card with instructions and an explanation of the Germ, General, and Allergen settings that I joked about above. I guess the unit cleans microscopic particles like germs more completely with the slower air speed. I would expect this is true of any air purifier.",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "zzz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 14, 2023",
                "reviewTitle": "Machine works very well",
                "reviewText": "I suffer from asthma and had difficulty finding a large air purifier in my local hardware stores. Ordered it Amazon and came very quickly. Very pleased with the product. The air pollen was bad this spring then came the smoke from the forest fires. I could not open my windows for over a month. I recommend this product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Duane Atkinson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 30, 2023",
                "reviewTitle": "Quiet running. Cleans the air while you sleep. Power efficient.",
                "reviewText": "Cleans the air while you sleep. Power efficient.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "OH",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 7, 2022",
                "reviewTitle": "PESIMO PRODUCTO",
                "reviewText": "EMPEORA LAS ALERGIAS, AMANECES TODO TAPADO SIN PODER RESPIRAR, LO APAGAS A LA SIGUIENTE NOCHE Y RESPIRAS NORMAL. PESIMO PRODUCTO, SON SOLO ENGAÑOS. . .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pablo M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 30, 2021",
                "reviewTitle": "X",
                "reviewText": "RESULTO ÚTIL PARA LA LIMPIEZA DEL AIRE EN LA HABITACIÓN",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tina ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 30, 2021",
                "reviewTitle": "works great!",
                "reviewText": "definitely recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}