{
    "remaining_requests": 10730,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/OneSpace-Essential-Computer-Pull-Out-Keyboard/dp/B01HELS36K",
    "body": {
        "name": "OneSpace Essential Computer Desk, Hutch with Pull-Out Keyboard, Black",
        "price": "$149.99",
        "originalPrice": "$214.99",
        "rawPrice": 149.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/OneSpace-Essential-Computer-Pull-Out-Keyboard/dp/B01HELS36K",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09VD397VS"
        ],
        "asinVariationValues": [
            {
                "asin": "B01HELS36K",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$149.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41DL1rd9ukL._SS36_.jpg"
            },
            {
                "asin": "B07N9K27N6",
                "variationName": "Color",
                "variationValue": "Espresso",
                "price": "$204.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/3175hSlsfnL._SS36_.jpg"
            },
            {
                "asin": "B07N9KDRRP",
                "variationName": "Color",
                "variationValue": "Grey Oak",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31zxpfzF0NL._SS36_.jpg"
            },
            {
                "asin": "B01HELS4QO",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/319-vM96BrL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/51yTgN3EU4L._AC_SX679_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1DzTeP1GaS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1DzTeP1GaS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the OneSpace Store",
            "link": "https://www.amazon.com/stores/OneSpace/page/DFAA5E1A-ADF6-48F0-8FCC-E119FA9D8286?ref_=ast_bln"
        },
        "brand": "OneSpace",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 3377,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22",
            "Or fastest delivery Tuesday, February 20. Order within 1 hr 35 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "VERSATILE WORK DESK: Our computer desk is a perfect corporate or home-office desk and works in any modern space. It features a spacious bottom shelf, large hutch, and keyboard-tray shelf and measures 43.25\" W x 21.75\" D x 37.50\" H when assembled.",
            "FUNCTIONAL DESK: This large office desk includes ample desk surface space and a storage drawer. The easy-access keyboard shelf provides extra room to keep your desk accessories tidy, and the large bottom shelf can act as a bookshelf or store a printer.",
            "MODERN COMPUTER DESK: Whether you need a large computer desk to hold a monitor and desktop or a bedroom desk with storage and style, this model can do it all. Study, do homework, or display decor on this desk with shelves.",
            "DURABLE & CLASSIC: Our sturdy computer desk weighs 76 lbs. and is made from melamine. The adjustable shelving helps keep things organized, and the back of the cabinet offers convenient plug-in access for your devices.",
            "YOUR ONESPACE FOR STYLE: OneSpace helps you furnish any environment with stylish, comfortable, and functional pieces. With our vast line of home and office furniture, we’re continually improving how people live, work, and enjoy life today."
        ],
        "description": "Home office, kid's room, or anywhere else, the 50-LD0105 desk makes efficient use of every square inch. It's called an \"essential\" computer desk. But it comes with extra features you don't always find on comparable desks. For instance, both hutch and cabinet are designed for general storage and computer use. The hutch features a small \"gap\" to plug in and connect your devices with storage room to spare. The cabinet is universal to fit any CPU with convenient plugin access in back. If you need it for storage, adjustable shelving is included to keep things organized. Finished in Black melamine, this desk is offered by OneSpace, part of the comfort products family. With a history dating back to 1919, comfort products specializes in affordable brands for better living.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Home Office Furniture",
                "link": "https://www.amazon.com/Home-Office-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063312"
            },
            {
                "name": "Home Office Desks",
                "link": "https://www.amazon.com/Home-Office-Desks-Furniture-D%C3%A9cor/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3733671"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "OneSpace"
            },
            {
                "name": "Model Name",
                "value": "Essential Computer Desk Hutch"
            },
            {
                "name": "Model Number",
                "value": "50-LD0105"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#331,413 in Home & Kitchen (See Top 100 in Home & Kitchen) #1,163 in Home Office Desks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 3,377 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Style",
                "value": "Computer Desk"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Room Type",
                "value": "Office"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Desk design",
                "value": "Computer Desk"
            },
            {
                "name": "Assembly Required",
                "value": "Yes"
            },
            {
                "name": "Assembly Instructions",
                "value": "Full Assembly Needed,Avoid Power Tools"
            },
            {
                "name": "Warranty Type",
                "value": "Limited"
            },
            {
                "name": "Manufacturer Warranty",
                "value": "1 Year"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Residential Use;Non Residential Use"
            },
            {
                "name": "Target Gender",
                "value": "Unisex"
            },
            {
                "name": "Included Components",
                "value": "Keyboard Tray"
            },
            {
                "name": "Finish Type",
                "value": "Laminated"
            },
            {
                "name": "Furniture Finish",
                "value": "Black; Gloss"
            },
            {
                "name": "Base Material",
                "value": "MDF,Manufactured Wood"
            },
            {
                "name": "Top Material Type",
                "value": "Engineered Wood"
            },
            {
                "name": "Product Dimensions",
                "value": "21.75\"D x 43.25\"W x 37.5\"H"
            },
            {
                "name": "Size",
                "value": "Large"
            },
            {
                "name": "Number of Drawers",
                "value": "1"
            },
            {
                "name": "Number of Shelves",
                "value": "4"
            },
            {
                "name": "Item Weight",
                "value": "76 Pounds"
            },
            {
                "name": "Maximum Weight Recommendation",
                "value": "22 Pounds"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic"
            },
            {
                "name": "Mounting Type",
                "value": "Floor Mount"
            },
            {
                "name": "Base Type",
                "value": "Rectangle"
            },
            {
                "name": "Shape Rectangular",
                "value": "Desk design Computer Desk"
            },
            {
                "name": "Top Material Type Engineered Wood",
                "value": "Number of Drawers 1"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About OneSpace OneSpace makes home and office environments more stylish, comfortable, functional and rewarding. With its comprehensive line of home and office furniture, OneSpace is continually improving how people live, work, and enjoy life today. OneSpace is part of the Comfort Products family of brands. Headquartered in America's distribution capital, Memphis, TN, with a history dating back to 1919, Comfort Products makes design and innovation affordable. OneSpace 50-LD0105 Essential Computer Desk Home office, kid's room, or anywhere else, the 50-LD0105 desk makes efficient use of every square inch. It's called an \"essential\" computer desk, but it comes with extra features you don't always find on comparable desks. For instance, both hutch and cabinet are designed for general storage and computer use. The hutch features a small \"gap\" to plug in and connect your devices with storage room to spare. The cabinet is universal to fit any CPU with convenient plugin access in back. If you need it for storage, adjustable shelving is included to keep things organized. Convenient cord and wiring access to wall, CPU, or other devices Ample desk surface with plenty of room for any task Finished in rich black melamine that matches most interiors; ideal for home office Measures 43.25 inches wide by 21.75 inches deep by 37.5 inches high",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/0fc7df74-ffa7-4c09-b930-d2ffc5676768._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/646548f1-ff55-4171-9fdf-856ddaabc14c._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "Adjustable Storage The fully adjustable shelving lets the Essential Desk fit your needs. Ample Desk Space The pull-out keyboard tray increases your desktop space, giving you plenty of room for any task or multi-task. Hidden Cord Management The hidden cord and wiring access through the lower shelf makes it easy to plug in and connect your CPU. The hutch also features a small 'gap' to connect your laptop and other small devices.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/408c1230-d600-413d-8524-cc90bf1dcccb._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/bad1c6cd-6f85-4569-a20a-d10f50f3bdde._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d3eb08b7-495d-4b69-a3a1-c833c420b7e2._SL300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/e92cb540-380d-45e1-929d-00d28b6b737e._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0fc7df74-ffa7-4c09-b930-d2ffc5676768._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/646548f1-ff55-4171-9fdf-856ddaabc14c._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/408c1230-d600-413d-8524-cc90bf1dcccb._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bad1c6cd-6f85-4569-a20a-d10f50f3bdde._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d3eb08b7-495d-4b69-a3a1-c833c420b7e2._SL300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jack SkalitzkyJack Skalitzky",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4UXMXZDRJMWHM3BMQUN2CBKTHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QVWXPVPBZT2A?ASIN=B01HELS36K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 24, 2018",
                "reviewTitle": "5.0 out of 5 stars A surprisingly solid workspace",
                "reviewText": "I'm happy to report that my pieces arrived in very good condition--there were minor cosmetic flaws, but no cracks or dents that would make me question the integrity of the desk. I was a little concerned about the state of the drawer rails, as they're slightly bent (see attached picture), but upon closer inspection I realized that's how they're meant to be and I can confirm that they work perfectly well.The assembly process went smoothly; it took an hour, maybe an hour and a half from start to finish. You'll definitely need a hammer, and I would recommend using a screwdriver other than the one that comes with the desk; it felt flimsy and seemed much worse at actually screwing things in. I completed the assembly without power tools without much difficulty, but I could see where a drill would make things easier. I did it on my own, and none of the parts were too heavy to maneuver; the most difficult part was attaching the desktop and hutch to the bottom which might take a second pair of hands.The instructions were clear, for the most part; the pictures did a good job showing where everything went. However, there were some parts of the manual which were incorrect, such as the counts for how much of each part or which connector you're to use. To my knowledge, though, the pictures were accurate, and I deferred to them when I ran into an issue with the instructions (and I wound up with a solid desk from it).As for the parts: everything is clearly labeled, mostly. Some of the stickers indicating the part number came partially scratched off, but it wasn't too hard to figure out what was what--again, the pictures were a great guide. (Later on, as it turned out, the stickers became a bit of a pain--they're hard to get off completely without any residue.) The various screws and connectors came helpfully separated, although it's worthwhile to double check the counts when you get the desk--I didn't have any issues with having too /few/ screws, but I /did/ have too many by the end of the build. I assume if they can miscount in one direction they can miscount in the other. There is a separate bag containing spare parts, but it doesn't hurt to be careful!Once everything was all set up, I was very pleased with how the desk came out. The drawer and keyboard tray work smoothly, and there's a good amount of desk space on top. The shelf they provided for the side cabinet is a little unstable, though, so I would be careful about putting too much weight or something fragile on it. All told, it's a great, compact workspace--perfect for a small apartment or dorm.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61bxGDqG1uL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sikora",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSLES7BANFQT7YP2CAQTNIY2LJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19IU85BK0RD1Q?ASIN=B01HELS36K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Great little desk!",
                "reviewText": "I hardly write reviews, but I had to for this since its such a great desk. I bought it 4 years ago for around $80 (much cheaper than it is now) and it has absolutely punched above its price point and held up fantastically. Easy to assemble and very sturdy. It's been through 2 moves and I have no issues with it. Even at the current pricing (~$150), I'd still buy it. If you're on the fence about it, go ahead and buy it! You won't be disappointed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle CustomerKindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXE3Z3BB63WQEEWXFTRYHDAAAVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XJ90S1GKIZ7F?ASIN=B01HELS36K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 30, 2019",
                "reviewTitle": "4.0 out of 5 stars Defective part but received prompt resolution",
                "reviewText": "I’ve purchased a lot of inexpensive, self assemble furniture products. This is the first one where I’ve encountered an issue. On the left side panel, the holes for the bolts are not properly aligned with the cam holes on the back support panel. The top of the support panel is not flush with the top of the side panel and protrudes 3/8”. Therefore the desktop will not be able to be attached properly. The online support web address provided takes me to ‘page not found’ so I used the customer service email address included with the product (since a phone number for customer service was not provided). Received an automated response that the office is closed (today is Saturday 3/30) and that they will respond on the next business day. Needless to say I am quite disappointed. If the company does not send replacement parts that fit properly, I will be returning this product.Update: Wednesday (4/3) I Received a response from customer service stating they have ordered a replacement part to be shipped to me. In 3-5 days I should find whether or not this new piece fits properly.Final update: Friday (4/5) the replacement part was awaiting me when I arrived home. The part fit perfectly and the remaining assembly went quickly and smoothly.Updated my rating to four stars. It is a great desk for the price and is easy to assemble. The company was great with solving the one issue I did have and did it promptly. The only reason I’m withholding one star is because it would have been preferable to have had all the parts in the original delivery manufactured correctly and not had a delay in finishing the assembly.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71dgS+l41KL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71gL2S2WxcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71sPecQKZgL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGP252UTSG7ZQFOJVFCCB4QGVEGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BAZOT03QNT3H?ASIN=B01HELS36K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 7, 2021",
                "reviewTitle": "5.0 out of 5 stars Good sized desk for school aged children and happy with customer service as well",
                "reviewText": "The desk actually arrived with a missing piece, but after I emailed customer service, they mailed the missing piece out promptly and I received it in just a little over a week of emailing them. I was actually not expecting to receive anything as some of these reviews have stated, but was surprised to see the box with the missing piece on my doorstep today. The desk was still functional without the missing piece (it was the drawer bottom that was missing), but I’m even more happy with my purchase now that it’s complete and with the customer service, (even though I never “heard” back from them as their reply to my email went into my junk mail box so I didn’t realize anyone had actually responded back to me about my missing piece until the box arrived today.)The desk is the perfect size for my elementary aged child and would still be a good fit through high school, if the quality lasts that long. The drawer is a little on the small side, but again, descent for her needs.I really liked that the desk came with all the necessary screws and tools. All parts were labeled well and instructions were clear. I was able to put it together by myself (and I AM NOT HANDY). Took me a couple hours, but I also have 3 young children with me at all times so I kept having to take “breaks” from building.I think this is a descent quality desk at this price for school aged children. I wouldn’t hesitate to purchase another one. Just hopefully it’ll give us a few years worth of doing homework on.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIUVBRE4FY3CKHOQ4FWYGEHNOIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27NFGZHR6JG5G?ASIN=B01HELS36K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 4, 2023",
                "reviewTitle": "5.0 out of 5 stars I would buy again",
                "reviewText": "This is a nice desk that is sturdy. I'm 5'2\", so it's a few inches taller than my liking. I built this desk by myself in an hour. It's very easy to put together so long as the directions are followed. If you are not good at furniture building, I do not recommend putting it together by yourself, as it requires a lot of patience and attention to detail. The drawer slides very smoothly.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$149.99",
                "sellerName": "NOREEN.INC",
                "sellerRating": "4.5"
            },
            {
                "price": "$195.98",
                "sellerName": "Cristal Zen",
                "sellerRating": "3"
            }
        ]
    }
}