{
    "remaining_requests": 10571,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Homall-Gaming-Computer-Worksation-Adjustable/dp/B08NWBL97Q",
    "body": {
        "name": "Homall 60 Inch Computer Gamer Desk with Full Desk Mouse Pad, Carbon Fiber Surface PC Table Adjustable Height, Gaming Rack, Headphone Hook and Cup Holder(Black)",
        "price": "$114.99",
        "originalPrice": "$149.99",
        "rawPrice": 114.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Homall-Gaming-Computer-Worksation-Adjustable/dp/B08NWBL97Q",
        "soldBy": {
            "sellerID": "A3VKH2HQ5JFWXD",
            "name": "Homall Direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3VKH2HQ5JFWXD&asin=B08NWBL97Q&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08NVSKZR2"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "6",
        "stockDetail": "Only 6 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51aS6Y9VM8L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41 E0sK11GL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41cH1IlCRuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518cUbKN7EL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21mBnDfgSVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hALSQGj5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UgtSjWe4L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Homall Store",
            "link": "https://www.amazon.com/stores/Homall/page/8B657008-4A93-44D3-99F2-33E9D5EE322F?ref_=ast_bln"
        },
        "brand": "Homall",
        "merchantInfo": "Homall Direct",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 472,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$29.99 delivery February 22 - 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Widen Desktop: Further upgrading the desktop, the 60 inch supersize desktop provides more space. The mouse pad covers the entire surface, so don't worry about running out of surface space or uneven height between the mouse and keyboard.",
            "Muti functional: Homall gaming table comes with gaming handle rack, cup holder, headphone hook, and double cable management. The four expansion functions are specifically designed for gamers, which will provide a better gaming experience.",
            "Adjustable Height: Height adjustment can be satisfied you of different size for comfortable use. You can adjust the desk to the optimum height according to your height. Height of this gaming desk can be adjusted from 27.6”~31.5”.",
            "Sturdy T Shape Base: Stability is especially important for a gaming desk, because it carries gamer’s expensive equipment. T shaped base and high quality metal offer strong support for the desk.",
            "Easy to Assemble: It is easy to assemble the desk parts together with specified instruction manual and installation tool inside the package. If you have any questions, please feel free to contact our customer service."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Home Office Furniture",
                "link": "https://www.amazon.com/Home-Office-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063312"
            },
            {
                "name": "Home Office Desks",
                "link": "https://www.amazon.com/Home-Office-Desks-Furniture-D%C3%A9cor/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3733671"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Homall"
            },
            {
                "name": "Model Name",
                "value": "60 Inch Computer Desk"
            },
            {
                "name": "Model Number",
                "value": "931Y00"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#705,628 in Home & Kitchen (See Top 100 in Home & Kitchen) #2,085 in Home Office Desks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 472 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Style",
                "value": "Gaming"
            },
            {
                "name": "Color",
                "value": "Carbon Fiber Black"
            },
            {
                "name": "Room Type",
                "value": "Office"
            },
            {
                "name": "Shape",
                "value": "Semicircular"
            },
            {
                "name": "Desk design",
                "value": "Computer Desk"
            },
            {
                "name": "Furniture Finish",
                "value": "Black"
            },
            {
                "name": "Base Material",
                "value": "Metal"
            },
            {
                "name": "Top Material Type",
                "value": "Metal"
            },
            {
                "name": "Product Dimensions",
                "value": "60.8\"D x 60.8\"W x 27.6\"H"
            },
            {
                "name": "Number of Drawers",
                "value": "1"
            },
            {
                "name": "Item Weight",
                "value": "63.6 Pounds"
            },
            {
                "name": "Special Feature",
                "value": "Adjustable"
            },
            {
                "name": "Mounting Type",
                "value": "Tabletop"
            },
            {
                "name": "Assembly Required",
                "value": "Yes"
            },
            {
                "name": "Assembly Instructions",
                "value": "Require Assembly"
            },
            {
                "name": "Target Gender",
                "value": "Unisex"
            },
            {
                "name": "Included Components",
                "value": "Desktop, Legs"
            },
            {
                "name": "Shape Semicircular",
                "value": "Desk design Computer Desk"
            },
            {
                "name": "Top Material Type Metal",
                "value": "Number of Drawers 1"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1928bc1c-4021-4710-9475-fb94d0d02c1d.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bb38b7cc-d05c-4792-86ab-71de5ffbc629.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/40ef83d0-181e-4ca3-85b9-e2567684b54d.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/98b00ea8-b491-412c-8e2c-d88bfa1a1f4b.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c280f932-cb98-4b96-a476-58461c616cc9.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fd97a43c-20e9-4cee-ae44-73ebcfd6829f.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Donald DickersonDonald Dickerson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHLDZ7CJT42BAJGQLTPK4G4X5ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QZVOE5FBNHQ2?ASIN=B08NWBL97Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 12, 2022",
                "reviewTitle": "5.0 out of 5 stars A good desk for the money",
                "reviewText": "I initially selected this desk for its size - I needed a large desk as the job I had been hired for required the use of two monitors and my little desk wasn't going to handle this. And since they were going to send an entire system...I needed two desks. Because of that, besides size, price was also a factor, and many desks in the 60 inch wide range were priced over $200. I saw this one, the reviews seemed reasonable, the price was right. So I ordered two of them. They arrived two days earlier than projected. Never mind all the work I had to do to make room for them.So, I opened the first box, laid everything out and inspected all of the various pieces. Solidly made, good welds (they appear to be machine-made), good hardware. The tools that came with the desk are simple and straightforward - a 5mm hex wrench and a combination 7mm hex wrench/phillips screwdriver, and are sufficient to assemble the desk but I would recommend a good screwdriver and a 1/4 inch drive ratchet and a set of metric hex bits. You can certainly use a power screwdriver but be careful not to over-drive the desktop screws. The desktops are a good quality particle board and a strong power driver could strip out the holes.Assembly - the instructions are rather unclear but not bad. Mainly pictures only.This is how I did it: Each \"leg\" (2 of them) consist of a lower support with two screw-in feet and adjustable (during assembly ONLY!) leg. I screwed the two feet into each lower support, slid the plastic \"boot\" over the leg (because you can't do that with the lower support attached to the leg), then attached each leg to the associated lower \"foot\" and screw in the four screws. Assembled the center support with the desktop support properly oriented (see the drawing and pay attention to the arrows), attach the legs, add the end desktop supports. At this point, I set the now assembled frame upright in the area I was going to put the desk in, dumped the screws into a container, set the two desktop sections in place, crawled underneath with a headlamp on, and aligned the two desktop sections rather loosely, with the pre-drilled holes lined up with the mounting holes, and put screws into all of the holes but barely tightened - just snugged down.I tightened all of the screws down on one desktop section, then aligned the other section and tightened all of those screws. So far, so good. Then I added the cable net, cup holder, and headset hanger. Unrolled the desktop cover/mousepad and placed it on top of the desk. Inserted the two cable routing \"plugs\" and I was done. The mousepad is well done with nice edging. We will see how it survives long-term. I will say that I didn't bother with the \"gaming desk\" decals that came with the two desks. Those go onto the legs.At this point, I'll add that the manufacturer threw in a few extra screws, bolts and an extra screw-in \"foot\" for each desk so I now have a small bag of extra hardware. The desks are well made, I found no flaws in either one aside from some very minor scuffs on the bottom of one desktop section. The \"cell phone holder\" is kinda useless, for me, but I actually use it to hold my headset. And I use a mousepad on top of the desk, just to save wear.TDLR: nice desk, well made, good price, large and spacious, easy to assemble, nice full desktop mousepad. I like it.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71uqUEPIytL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "JordanJordan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECDK4CQRTWGUGLJFJZWMSML7QFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V3BUTLXETN6V?ASIN=B08NWBL97Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 8, 2022",
                "reviewTitle": "5.0 out of 5 stars Great Product for the Money!",
                "reviewText": "I recently relocated with nothing to properly support my setup. Ordering this product for the amount of money is always a gamble, however, I am pleased with how it turned out.How it arrived - The image I provided is how it arrived at my doorstep. Seeing there is some noticeable dents to the outer package, I was worried it could have damaged the table. The packing method kept the table in one-piece without any damage!Assembly - The instructions are very simple and easily guiding through all steps. The package includes *additional screws and bolts*!! Assembly took less than 1 hour, with no help or additionally tools. Everything is provided and in working order.Finish Product - The table is very sturdy, very appealing and over the top. My current setup (Image provided) fits nicely with lots of room for additional equipment. The table can support a very good amount of weight.Conclusion - I would recommend this product! If you’re looking for a simple, not so flashy or study table this is it. Beginner or optimal setup, this table handles it all.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71qTuYSJhvL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81JUFEjt5bL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDJ4JRGA4KESB26DMIRYFZR2OMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YQBVE2ZV5IFQ?ASIN=B08NWBL97Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Good Quality Desk",
                "reviewText": "The desk was exactly as advertised in my experience.1. Packaging was well done and everything was easy to find in the box. I found it beneficial to spread the items out in the room to grab items as needed.2. Instructions were easy to follow and assembly took less time than I thought. Everything fit together as designed without having to play around with things to get them to work.3. Appearance-wise, it looks good and has some heft to it. Not the most expensive desk, but it should have been priced higher.I would say, the cable management net should be reviewed and improved on. This is one item that I believe should be improved upon but not something that I feel takes away from the desk. Of the accessory holders, I only use the one for the headphones so I cannot speak to their quality. Plenty of space to work comfortably.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zachary M. ToomerZachary M. Toomer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDZDCJTAHGHWLS753UGN5NJ7XFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TV5IQI2GXQMC?ASIN=B08NWBL97Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2020",
                "reviewTitle": "5.0 out of 5 stars VERY DETAILED REVIEW. Few cons and false advertisements but no deal breakers for me.",
                "reviewText": "The media could not be loaded. Now this desk is amazing. I provided a video and plenty of photos. I tried to add more than one video but amazon doesn't allow that. However, there are some things I should explain. The assembly instructions is just one full page of photos. Keep that in mind if you aren't used to looking at photos to assemble something. There are minimal words but the photos (for me) did a good job at explaining. It took me about an hour to complete. The cable management net is smaller than I thought so I hope the photo provided will help showcase that. I use it and my cable is managed as best as I can get it. The mousepad for the table is amazing and fits perfectly. However, that's not to discredit the other reviews that mention the opposite. The height adjustment is explained in the video, and can be an issue. There's a whole process you have to do just to adjust the height. I have mine on the highest it can go and I'm 5'7\". It's fine for me but maybe an issue for others. The \"screwdriver\" isn't the one in earlier reviews. So I assume that in the past they provided that and the actual charging rack. As of now, they give you a screwdriver (shown in photo) that is very useful though so I'm not downing it. As for the charging rack, they don't provide that. They provide a rack, but you can't charge anything. There's 2 holes that resemble USB ports but it's not actually USB ports. Just holes indicating what it used to be. I ended up just giving it to somebody who could use a rack. I thought at first this desk is wobbly but no, it was my montiors that were easily moved so I fixed that. So it's very sturdy. Last thing I will add, the cup holder and headset rack is 100% useful. Definitely not something that should be overlooked! Also, it came with 2 stickers that you can put on the legs. (It says gaming desk) Bought this for myself for Christmas and it was worth the investment. I hope my review, photos, and video provided enough insight for you.",
                "reviewVotes": "75 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/A18-wVoj-jL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/A1UTaZBX+FL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/A1Wd+tKosUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/A1bdTKKyElL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1+4fixhnMS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1FuUsc+wYS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1IFoiDdjLS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1NjXVbQttS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1a-uMF-voS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1pVz3p+koS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1uPgvMzB+S.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1y4O2H7SaS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/C1W0wMNPoIS.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d0814fc8-2181-4a15-b189-b4cc7af07ac5/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Yasir",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWQ4IVA2YQ2WSIQL7DDYVLAZLEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL8VQVF7DUR0A?ASIN=B08NWBL97Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome",
                "reviewText": "Love it, sturdy and spacious",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}