{
    "remaining_requests": 21386,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Heartleaf-Soothing-HOUTTUYNIA-Moisture-Sensitive/dp/B0CMWZGLHF",
    "body": {
        "name": "Heartleaf 77% Soothing Toner with HOUTTUYNIA CORDATA Extract for Deep Moisture Balance and Soothing, Facial Care for Sensitive Dry Oily Skin",
        "price": "$4.99$4.99 ($4.99$4.99 / Count) $4.74$4.74 ($4.74$4.74 / Count)",
        "originalPrice": "",
        "rawPrice": 4.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Heartleaf-Soothing-HOUTTUYNIA-Moisture-Sensitive/dp/B0CMWZGLHF",
        "soldBy": {
            "sellerID": "A1DCCIYFT8IL9M",
            "name": "Fovcos-US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1DCCIYFT8IL9M&asin=B0CMWZGLHF&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CMWWZ6B5"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41x5l2iNYlL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/414BYcyIZPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nd3b5Yp9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51O1Im6u OL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tlSLDtqzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51iTA5mRB6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51U5XZ2lNcL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Fovcos",
            "link": "https://www.amazon.com/Fovcos/b/ref=bl_dp_s_web_115009536011?ie=UTF8&node=115009536011&field-lbr_brands_browse-bin=Fovcos"
        },
        "brand": "Fovcos",
        "merchantInfo": "Fovcos-US",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 23,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 4 hrs 35 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 4 hrs 35 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Extract natural and organic ingredients: This formula contains 77% of Heartleaf Extract, which is derived from nature and is gentle enough to give your skin pure vitality, there are also a variety of natural organic plant extracts, better care for your skin.",
            "Deep moisturizing: Deeply moisturizing and repairing dryness, roughness, dullness, aging, and wrinkles, it can provide the nutrients and moisture the skin needs, enhance the skin's moisturizing function, restore the skin's water and oil balance, make the skin smooth and delicate, and keep it moisturized and smooth at all times.",
            "Soothing skin: HEARTLEAF 77% Soothing Toner has a soothing and calming effect on the skin, promoting oil and water balance and helping to reduce inflammation and irritation, which can better protect the surface layer of your skin, experience the soothing and rejuvenating benefits of our gentle HEARTLEAF 77% Soothing Toner to create your own fresh.",
            "GENTLE FORMULA: The lightweight formula absorbs quickly into the skin without leaving a greasy residue, leaving your skin feeling refreshed and hydrated. HEARTLEAF 77% Soothing Toner comes in a large 120ML bottle, which provides enough product to last for weeks or even months and can be used any time of the year.",
            "SUITABLE FOR MULTIPLE SKIN TYPES: This Soothing Heart Leaf 77% Soothing Toner is suitable for all skin types, including sensitive skin. It's made from 77% organic heart leaves and is suitable for vegetarians. HEARTLEAF 77% Soothing Toner helps soothe and hydrate skin, perfect for use after cleansing or as a refreshing all-day treatment. It can be used alone or as part of your skin care routine."
        ],
        "description": "Here are four ways to use the product: 1.Moisturizing compress Soak a cotton pad with toner and apply it to the face for 5-10 minutes. Remove the cotton pad and gently pat until fully absorbed. 2.Facial mist Transfer the toner into a spray bottle, making it convenient to replenish moisture to the skin anytime, anywhere. 3.Wiping Moisten a cotton pad with toner and gently wipe the surface of the skin, effectively removing dead skin cells. 4.Toner application Pour an appropriate amount of toner into your palm and gently apply it to the skin until fully absorbed.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060711"
            },
            {
                "name": "Toners & Astringents",
                "link": "https://www.amazon.com/Facial-Toners-Astringents/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11061931"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 5.16 x 3.03 x 1.65 inches; 4.97 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ November 8, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Fovcos"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CMWZGLHF"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#93,454 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #568 in Facial Toners & Astringents"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 23 ratings"
            },
            {
                "name": "Brand",
                "value": "Fovcos"
            },
            {
                "name": "Item Form",
                "value": "liquid"
            },
            {
                "name": "Skin Type",
                "value": "All"
            },
            {
                "name": "Material Feature",
                "value": "Organic"
            },
            {
                "name": "Scent",
                "value": "Unscented"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tawnya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDIFAUU6SSYKXOOM6SG66D5OTCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R367A8SS5QXQCW?ASIN=B0CMWZGLHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Soothing Toner",
                "reviewText": "I appreciate that the toner arrived in a shrink wrapped box with a clearly visible expiration date. When unboxed, I removed the twist off cap and found a snap open top. I like this feature, especially for travel because it insures none of the product will spill or leak out. Following the directions, I washed my face and then applied the toner. It is fragrance free and felt refreshing. I noticed the cotton ball had a small amount of oil residue/make up on it when I was done. The toner dried relatively quickly and left my skin feeling clean. I have sensitive skin and haven’t had any side affects from using it. Heartleaf can be very beneficial in a skincare routine so I recommend giving this one a try.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JynJyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP4XV2TPIF2DYR7MDS3ABENVU4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZXUUX53GY650?ASIN=B0CMWZGLHF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "4.0 out of 5 stars Soft skin - No irritation so far",
                "reviewText": "It came inside the manufacturing box with a shrink wrap. The bottle is firm plastic. Not a squeeze bottle. You tilt the bottle and let it drip out or shake it to speed it up. You can easily control the amount of liquid dispensed with this design. It has a screw/twist top as the main lid. The secondary lid underneath is flip-top, as seen in my photo. I did not detect any scent or fragrance. The toner is absorbent and has a watery consistency. My skin felt soft without stickiness or oiliness. No negative side effects so far. I have never heard of heartleaf. That caught my attention. I wanted to try something new and different. I read that it’s antibacterial and anti-inflammatory. Sounds like it could benefit me. I’m near 40 and still experiencing acne. I am hoping this toner will be helpful. I need to use this longer and update my review in the future.There is paraben in the ingredients but you should not worry. Dr. V Rattan, a world renowned cosmetic formulator said it’s a myth. The small percentage used in skincare should not harm us. It protects us by preventing bacteria growth and mold. Parabens are actually the best preservatives compared to the substitutes that are causing a rise in contact dermatitis.-Ingredients-HOUTTUYNIA CORDATA EXTRACT, AQUA, GLYCERIN,BETAINE, METHYLPARABEN, ALLANTOIN,CARBOMER, TRIETHANOLAMINE, DISODIUM EDTA, PROPYLENE GLYCOL, ETHYLHEXYLGLYCERIN, CAPRYLHYDROXAMIC ACID, BUTYLENE GLYCOL,PROPANEDIOL, CENTELLA ASIATICA EXTRACT,POLYGONUM CUSPIDATUM ROOT EXTRACT, SCUTELLARIA BAICALENSIS ROOT EXTRACT, CAMELLIA SINENSIS LEAF EXTRACT,GLYCYRRHIZA GLABRA (LICORICE) ROOT EXTRACT, BENZYL GLYCOL, HYDROLYZED GLYCOSAMINOGLYCANS, SODIUM HYALURONATE, CHAMOMILLA RECUTITA (MATRICARIA) FLOWER EXTRACT, ROSMARINUS OFFICINALIS (ROSEMARY) LEAF EXTRACT, ETHYLHEXYLGLYCERIN, SODIUM HYALURONATE CROSSPOLYMER, 1,2-HEXANEDIOL,HYDROLYZED HYALURONIC ACID, HYDROXYPROPYLTRIMONIUM HYALURONATE, HYALURONIC ACID, SODIUM ACETYLATED HYALURONATE(I scanned the ingredient list with my phone and then copy/pasted so I’m unsure if it’s correct.)-Made in China-MFD: 2023-10-06-EXP: 2026-10-05",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61CeuXlf-DL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61PpjJGRe6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71JDL3YYgaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71mEhEurAqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Quackenbush",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRW2TGGJGVBWAJS5SSFJ5UNP7WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QNRMMSW25SMD?ASIN=B0CMWZGLHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Very refreshing, clean toner",
                "reviewText": "I really love this facial toner. It feels very clean and doesn’t leave behind any film or stickiness on my face. It has a double lid of sorts- first the twist off cap, then a little flip open piece to a smaller dispenser-type opening. It makes it easy to only get the small amount needed at once. I applied it to a cotton pad and wiped over my face after cleansing it. Even though I felt clean after cleansing, it still removed some oils and dirt that were left behind. The toner didn’t dry out my skin; it slightly moisturized it, but without feeling greasy at all. The toner contains quite a few ingredients, but feels very clean, almost like water, and has no discernible smell - yay! I haven’t noticed any lightening/whitening of my skin like it claims, but I wasn’t hoping for it either. I do think it minimizes my pores slightly, which is good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM3WMU2RDJ7OEYQDTY6X6A2HS7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUPDTEWGMZJOG?ASIN=B0CMWZGLHF",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "3.0 out of 5 stars Does okay",
                "reviewText": "This toner does okay, but I'm not sure I would call it moisturizing. It does help to soothe my sensitive skin, so no issues with that. But I found that I still need to use a separate moisturizing cream afterwards, otherwise my skin still feels dry. I found the scent of this toner to smell strongly of chemicals that reminds me of a hospital. Not my favorite toner, but it at least does soothe my skin and not cause any irritation.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rosebloom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW3UDANQQSPH6IHM6I3IFHJBO7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QHJJ0Z6KCIKL?ASIN=B0CMWZGLHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Really happy with this toner!",
                "reviewText": "Not that I want it to be more expensive, but it would be worth the price.Nicely boxed and sealed. The bottle itself has a control to allow a slow flow of product. You don't really need that much.I am incredibly habitual about cleansing, toning, and moisturizing so I was really surprised to see residue on the cotton pad when I used this toner after washing.Really, really happy with this toner. Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Crazy Dog LadyCrazy Dog Lady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQNQ2GSNL5WP6BCP56TE54TK7VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CBDE9ZQA1A6P?ASIN=B0CMWZGLHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Hydrating Tonic",
                "reviewText": "The directions for this toner state that you should clean your face thoroughly and then apply this toner to the face and allow it to be absorbed, which is what I do.I have an excellent sense of smell, and don't detect any scent at all.The toner is similar in consistency to water, and doesn't leave an oily residue. It doesn't dry out or irritate my skin, and my skin actually feels more hydrated when I use the toner.The dispenser under the cap allows only a small amount of the toner to come out at a time, but if you want more, it does come out faster if you give the bottle a few shakes while putting it on your applicator.I am pleased with this toner, and recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71PSF2ru1tL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "samanthasamantha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUTTHV2DCRDMYCCRBOGA3IBSIYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AE36D7PCL72P?ASIN=B0CMWZGLHF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "4.0 out of 5 stars Quite Suprising",
                "reviewText": "I'm surprisingly happy with this toner. The price point had me wondering if it would be quality. Happily, there is no fragrance. I applied on clean skin. I had just used a very pricy face wash. The toner still removed oil residue- makeup off of my face. My skin doesn't feel tight or oily. It's actually balanced just right. One thing that seems like a good idea, but didn't work for me is the lid. It seems really convenient, but it's actually hard to open. With my fake fingernails. I do recommend this toner, it feels nice. I would actually purchase this because it's at such a great price point.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61GGERTpJcL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}