{
    "remaining_requests": 21436,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Neutrogena-Rapid-Clear-Fight-Toner/dp/B003156NL6",
    "body": {
        "name": "Neutrogena Rapid Clear 2-in-1 Fight & Fade Acne Toner, 8 Fl. Oz.",
        "price": "$9.47$9.47 ($1.18$1.18 / Fl Oz) $8.47$8.47 ($1.06$1.06 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 9.47,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Neutrogena-Rapid-Clear-Fight-Toner/dp/B003156NL6",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Y65OZYE4L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41qEon 04 L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41R1toIeEIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31b2 luLsKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZDzKckbyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31SzQbInn0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31CaJVayTsL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Neutrogena Store",
            "link": "https://www.amazon.com/stores/Neutrogena/page/3BC8CF14-3F35-41A4-9BF3-705A7FB2B6B6?ref_=ast_bln"
        },
        "brand": "Neutrogena",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 3753,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 7 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "8-ounce bottle of acne toner",
            "Reduces breakouts and helps fade the look of post-acne marks",
            "For acne-prone skin",
            "With maximum strength salicylic acid acne treatment and Micro-Clear Technology",
            "Formulated with ingredients to help with skin cell exfoliation"
        ],
        "description": "Neutrogena Rapid Clear 2-in-1 Fight & Fade Toner is the first acne toner designed to reduce breakouts in just hours and help fade the look of post-acne marks for clearer, more even-toned skin. This toner removes oil as Micro-Clear Technology speeds maximum strength salicylic acid acne medicine straight to the source of breakouts. It is formulated with glycolic acid and is designed to speed surface skin cell exfoliation. The refreshingly clean formula is clinically proven to reduce pimple size, swelling, and redness in under eight hours and accelerates surface cell exfoliation to help fade the look of post-acne marks.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b?ie=UTF8&node=11060711"
            },
            {
                "name": "Toners & Astringents",
                "link": "https://www.amazon.com/Facial-Toners-Astringents/b?ie=UTF8&node=11061931"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ Yes"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2.01 x 2.01 x 6.61 inches; 0.11 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 070501060681"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 086800870555 701836685460 885869528113 883870891646 885577353588 524883471790 885373655329 701862634630 885486171310 885145864034 883193999821 070501060681 883835040294 885119813617"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Johnson & Johnson"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B003156NL6"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,579 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #80 in Facial Toners & Astringents"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 3,753 ratings"
            },
            {
                "name": "Brand",
                "value": "Neutrogena"
            },
            {
                "name": "Item Form",
                "value": "Spray"
            },
            {
                "name": "Skin Type",
                "value": "Acne Prone Skin"
            },
            {
                "name": "Product Benefits",
                "value": "Benefits: Meet the first toner for acne designed to reduce breakouts in just hours, revealing clearer, more even-toned skin. This formula uses Glycolic Acid to accelerate surface skin cell exfoliation and fading the look of post-acne marks.And it's clinically proven to reduce pimple size, swelling and redness in under 8 hours. Now that’s fast! See more"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Cooling"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "At a Glance: Glycolic acid helps accelerate skin cell exfoliation MICROCLEAR Technology Maximum strength salicylic acid acne treatment NEUTROGENA Rapid Clear 2-in-1 Fight and Fade Toner NEUTROGENA Rapid Clear 2-in-1 Fight & Fade Toner is the first acne toner designed to reduce breakouts in just hours, plus fade the look of post-acne marks for clearer, more even-toned skin. The refreshingly clean formula, with MICROCLEAR Technology, dissolves away oil and reduces pimple size, swelling and redness in under 8 hours. It's formulated to help speed surface skin cell exfoliation to help fade the look of post-acne marks.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/acbbeb6d-d951-4301-a2e1-901a4c7879fd._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ae727251-9a8f-480b-b39c-3cf8e58433f3._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "In general, the causes of facial breakouts in adults are the same as those in teenagers Acne occurs in part when there is a buildup of dead skin cells in the pores. Salicylic acid helps normalize the shedding of the skin cells inside the pores and helps prevent the clogging that, along with oil and bacteria, can produce pimples. Be patient. If used regularly, products containing salicylic acid are a proven method for treating acne and helping prevent future breakouts.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/fb5009ca-f0fa-4978-8a9b-e4844e25c5cd._SL300__.jpg"
                ]
            },
            {
                "media_text": "Directions: Cleanse skin thoroughly before applying this product. Cover the entire affected area with a thin layer one to three times daily. If bothersome dryness or peeling occurs, reduce application to once a day or every other day. MICROCLEAR Technology Help outsmart acne with the genius of MICROCLEAR, a revolutionary technology scientifically shown to dissolve oil and help boost delivery of salicylic acid to the source of breakouts. Salicylic Acid & Acne If you look closely at the labels of many acne medications, you'll notice that the active ingredient in many is salicylic acid.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b549e6d4-c378-48de-b0da-2945482fd1ca._SL300__.jpg"
                ]
            },
            {
                "media_text": "About NEUTROGENA Brand NEUTROGENA is a brand of Johnson & Johnson Consumer Inc. A dermatologist-recommended skincare brand, NEUTROGENA offers some of the world's most loved beauty and skin care lines, and manufactures and markets products in over 70 countries.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/60965e3a-c067-4d32-a99e-fe64d4f33d91._SL300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/acbbeb6d-d951-4301-a2e1-901a4c7879fd._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ae727251-9a8f-480b-b39c-3cf8e58433f3._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fb5009ca-f0fa-4978-8a9b-e4844e25c5cd._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b549e6d4-c378-48de-b0da-2945482fd1ca._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/60965e3a-c067-4d32-a99e-fe64d4f33d91._SL300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "alice",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWI3FWYA6VW34XJCV6EW4TFNNXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9DY2KDAP2W39?ASIN=B003156NL6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2023",
                "reviewTitle": "5.0 out of 5 stars amazing!",
                "reviewText": "THIS PRODUCT MADE MY SKIN FEEL SO SOFT OVERNIGHT!!! I have combination skin too, so it made my skin feel less oily, especially between your nose and forehead.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Summer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQXXGGU45COQOCIOVK7HSQPD53A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDPDP8RH2LQWO?ASIN=B003156NL6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 8, 2023",
                "reviewTitle": "5.0 out of 5 stars World well to even out skin discoloration",
                "reviewText": "Does take away skin coloration marks in skin, but you have to be patient. Removed some discoloration from acne after a couple of weeks on my young adult child. She says it smelled kinda funny in the beginning, almost like a fermented smell, but then got used to it and no longer feels that way about it. Didn't feel like it worked very well for acne on its own, although it works very well as a tandem for her with another treatment cream. You're not actually supposed to do that because it can cause dryness. But she uses a moisturizer too, and altogether it works very well for her for acne, and especially in making her skin color even out. She's very happy with this product.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica Hill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHINWTVICPEJ3FQDOYS2EQVKBGXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YBA241OEMKZP?ASIN=B003156NL6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2022",
                "reviewTitle": "5.0 out of 5 stars Been using this for years and my skin has never been clearer or younger looking.!!",
                "reviewText": "I don't have really bad acne nor have I ever, but when I would get the occasional \"monthly\" pimple or two I had a bad habit of touching/scratching/popping/picking it because I just wanted it to go away. What that ALWAYS led to was a scar that, to me, looked worse than the zit itself. So, what this product does quite rapidly actually is get rid of current pimples AND faded my scars COMPLETELY even ones I still had that I was sure would always be visible.This doesn't burn or dry out my skin and since using it I can't even remember the last time I saw a single pimple on my face anywhere at all. Plus my skin looks brighter and fresher WITHOUT wearing makeup. I actually love wearing minimal makeup because at 40+ now, I love looking in the mirror and seeing skin that looks better than when I was in my 20's. Neutrogena never disappoints. I use this AND the Rapid Clear pads. And like I said, it's great for acne prone skin and does everything it promises on the bottle BUT even if you don't have really bad acne and want something good for scars or brighter, more youthful skin, totally give it a try. Did wonders for me! 🥰",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kate",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPS6RYFFLMH5U543NZZGWJOLBRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U6M6A5CUUXBC?ASIN=B003156NL6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 24, 2018",
                "reviewTitle": "4.0 out of 5 stars A little bottle of gold...",
                "reviewText": "This'll do it. My son is 13. This is the first time I've experienced any sensitive acne/pimples in my family so I'm new to this. I've been blessed with nice skin but I also take care of it. I tried to treat him naturally first. With mixtures of essential oils, Biore wash, exfoliating etc But he kept having issues. I persoally have an expensive heavy duty cream that I use for wrinkle prevention and is often prescribed for acne. I used it twice on my son and was amazed. But I didn't feel comfortable using it on him continuously...it was more of an experiment and then perhaps a trip to the dermatologist. Not needed. Once I saw how well THAT worked, I began researching online and found this golden bottle of magic. I would only recommend this if you have trouble spots, full blown acne or constant problem skin. We applied it all over his face with s cotton ball for three days only once a day. He only has a few problem areas around his upper face, lower cheeks, nose area etc. Also on his upper back (he had the biggest problem here). Be super careful to go light at first. It TOTALLY cleared up his face, but it also dried it out so much that he looked slightly sunburned and was actually itching a lot. I needed to rub coconut oil very lightly into his face to keep it moisturized. We are good to go now. If this happens to you, only use Raw Virgin Coconut oil on your face. It has lauric acid which is antibacterial and absorbs VERY well into the skin unlike other moisturizers which sit closer to the surface and block pores. Use the thinnest layer possible and massage it, in gentle circles, with your fingertips directly into your skin until absorbed. It should not appear greasy. Do not use coconut oil to treat acne alone! Leave your pores completely open with NO moisturizer after cleansing. Don't believe propaganda about needing moisturizers. If you have trouble skin, you DON'T NEED IT. (Wrinkle cream is a whole different story ladies!). Only use coconut oil on clear skin or skin that needs treatment (excessively dry, sunburned etc). Once we treated his now DRY skin with the oil, he is back to using this toner several times a week to keep it clear. But others may need to increase this amount. I'm super happy I found this. Remember to try all holistic options FIRST before applying synthetic, marketed products from stores. There are many holistic recipes on the internet. They've always worked for my skin. But they don't work for everyone. Why a 4-star review? Because I think they should communicate more precisely, the reaction you may have if your skin is sensitive. Simply use common sense and you've got this... Good luck - God speed!",
                "reviewVotes": "40 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Trust'N'God",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFANLFFVL3VOPDVOLN6TYSZGYHDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JK2AX7M5SKCT?ASIN=B003156NL6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars This is my holy grail toner",
                "reviewText": "I live by this it’s like the best toner I ever used and I’ve tried quite a few Ambi toner, witch hazel ect but this right here is the best it’s really hard to find never at Walmart sometimes it’s at target but it’s always available here on Amazon when all L’s fail this is a must buy especially if you break out often a lil pricey but definitely worth it , it can be a life changer trust me!!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Traveling man",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVKDI75JVRIT7X2AA2YWXCVCBIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TZGJAVMNEA9B?ASIN=B003156NL6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Effective but not harsh",
                "reviewText": "Great value for salicylic acid cleanser from a reliable brand. Pleasant fragrance",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shanon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6WZXBFRT4IS67XGWSSFPMFQMTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D9T6X6BAZL36?ASIN=B003156NL6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Smells amazing",
                "reviewText": "Love the citrus smell of the product, does not burn when applied to the skin unless applied to broken skin, I have seen some fading of acne scars from the past, and super easy to apply to skin with cotton round.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Megha Vaish",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 12, 2018",
                "reviewTitle": "Amazing product does what it says",
                "reviewText": "Amazing product does what it says. It has a strong smell which might be a problem initially . I won't say it completely manages to remove scars but definitely fades them to a visible degree.No acne problem since i am using this product which used to happen every other day . In all a must buy !!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Soumya",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 16, 2018",
                "reviewTitle": "Authentic Product",
                "reviewText": "So the product arrived within 14 days.Since imported I assure its authenticity in terms of medicated pupose.It works well,has a stringent smell because of alcoholic content.Good for oily skin and has controlled my sebum production.Your skin would peel but thats the part of process.I do not regret buying.The seller has been courteous as well.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "anupam chhetri",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 13, 2020",
                "reviewTitle": "Good",
                "reviewText": "Worth it .Best toner if have oily skin and prone to pimples.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "devyani",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 21, 2014",
                "reviewTitle": "fight acne..YES..fade post acne marks..NO..!!",
                "reviewText": "I am giving four star not because the product isnt good.. But because it didn't fullfilled my requirements upto the mark..!!I searched on net..came accross many products but found Neutrogena rapid clear toner the best coz of the reviews n videos i saw online..Now its been a month since m using this product but there is not so much of change in my post acne marks..though dey have lightened a bit but not as much as shown in the videos..so m a lil disappointed on this note..But i must say that it helped me to fight acne which appeared almost every second day on my face...i finally got rid of dem but the post acne marks r still d same...",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S Singh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 6, 2019",
                "reviewTitle": "Helps clear skin",
                "reviewText": "Really good toner, doesn’t dry skin at all and helps to clean up acne.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}