{
    "remaining_requests": 21384,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Simple-Soothing-Facial-Toner-Ounce/dp/B005TI7NPI",
    "body": {
        "name": "Simple Kind To Skin Soothing Facial Toner, 6.7 Ounce (200ml) (Pack of 2)",
        "price": "$11.66",
        "originalPrice": "$14.85",
        "rawPrice": 11.66,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Simple-Soothing-Facial-Toner-Ounce/dp/B005TI7NPI",
        "soldBy": {
            "sellerID": "A348FGTHMG6D3Q",
            "name": "50 Star Retail USA",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A348FGTHMG6D3Q&asin=B005TI7NPI&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CRK8BQ8L"
        ],
        "asinVariationValues": [
            {
                "asin": "B00CHHJX0M",
                "variationName": "Size",
                "variationValue": "6.7 Fl Oz (Pack of 1)",
                "price": "$6.30",
                "variationImageURL": ""
            },
            {
                "asin": "B005TI7NPI",
                "variationName": "Size",
                "variationValue": "6.76 Fl Oz (Pack of 2)",
                "price": "$11.66",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "Only 4 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41z9eMPIKhL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51tWkztdCML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51V-7xoMhGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412FNoYRi L.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Simple Store",
            "link": "https://www.amazon.com/stores/Simple/page/6949D443-9536-47ED-8E65-F974F3F153BA?ref_=ast_bln"
        },
        "brand": "Simple",
        "merchantInfo": "50 Star Retail USA",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1162,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 8 hrs 35 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Simple Soothing Facial Toner is a light and 100% alcohol-free toner and is pH balanced so it refreshes your skin without drying",
            "3 key skin-loving ingredients: Chamomile, which helps gently soften and soothe, Witch Hazel, which helps tone and tighten pores, and Allantoin which helps soften skin",
            "This Simple Facial Toner contains Pro-Vitamin B5 which is known to help restore, soften and smooth",
            "Made with skin loving ingredients and triple purified water, our purest possible water, this face toner provides instant hydration to the skin",
            "Simple facial toner contains no artificial perfume or dyes and no harsh chemicals that can upset your skin"
        ],
        "description": "Simple Soothing Facial Toner is a light, alcohol-free toner that cleans and refreshes skin without irritation or overdrying. It contains no alcohol, dyes, artificial perfumes, or other irritants, so it's gentle and suitable for all skin types, especially sensitive skin. This Simple Toner holds on to the moisture that already exists naturally in your skin while smoothing the skin's texture and refining your pores. It also is packed with Vitamins and skin-loving ingredients. The combination of Chamomile, Witch Hazel, Allantoin and Vitamin B5 provide the perfect Facial Toner to give you the softest skin possible.Simple Soothing Facial Toner enhances your skincare routine with a gentle yet effective toner formula. The toner works to balance your skin's natural pH level, plus it can smooth skin's texture by minimizing pores. With Simple Facial Toner, your skin keeps its natural hydration while also better absorbing any moisturizer you apply. The toner cleans your skin of residue or impurities that cleansers may leave behind, using ingredients that are gentle and perfect for sensitive skin.Simple is a complete range of facial skincare products perfect even for sensitive skin. The Simple brand knows that what is left out is as important as what is put in when it comes to gentle, yet effective skincare. The complete Simple range has 18 products, including cleansers, moisturizers, eye care, and wipes. All Simple products have no dyes, artificial perfumes or harsh irritants that can upset skin and contain skin-loving ingredients and added vitamins for natural, healthy-looking skin. Simple products are hypoallergenic, non-comedogenic and pH balanced.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b?ie=UTF8&node=11060711"
            },
            {
                "name": "Toners & Astringents",
                "link": "https://www.amazon.com/Facial-Toners-Astringents/b?ie=UTF8&node=11061931"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2.25 x 1.63 x 6.4 inches; 13.6 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ BHBUSAZIN029875"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ October 5, 2011"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Simple"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B005TI7NPI"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#82,456 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #637 in Facial Toners & Astringents"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,162 ratings"
            },
            {
                "name": "Brand",
                "value": "Simple"
            },
            {
                "name": "Item Form",
                "value": "Liquid"
            },
            {
                "name": "Skin Type",
                "value": "Sensitive,all"
            },
            {
                "name": "Product Benefits",
                "value": "Moisturizing"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Soothing"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Soothing Facial Toner At a Glance: Gentle formula is suitable for sensitive skin Smoothens skin texture by minimizing pores Helps restore your skin's natural pH level after cleansing Removes any impurities left behind by cleansers Keeps your skin hydrated and prepares skin to better absorb moisturizer Simple Soothing Facial Toner Simple Soothing Facial Toner enhances your skincare routine with a gentle yet effective toner formula. The toner works to balance your skin's natural pH level, plus it can smooth skin's texture by minimizing pores. With Simple Facial Toner, your skin keeps its natural hydration while also better absorbing any moisturizer you apply. The toner cleans your skin of residue or impurities that cleansers may leave behind, using ingredients that are gentle and perfect for sensitive skin. What's in the Box: Simple Soothing Facial Toner, 6.7 Ounces (Pack of 2).",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/26776ce9-b589-4c1a-9440-78ec67fe7f1e._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/3120d317-53a4-4f27-900f-285f3fa6acf1._SR230,100_.png"
                ]
            },
            {
                "media_text": "Balances and Smoothens Skin Texture Simple Soothing Facial Toner ensures that your skin is clean, naturally smooth, and balanced. Facial toner is an essential part of any skincare regime and Simple's brings back natural pH levels after cleansing. Plus, skin-loving ingredients in Simple's Facial Toner smooth your skin by minimizing pores. Gently Cleans and Moisturizes A pH-balanced and alcohol-free formula means that Simple Soothing Facial Toner can work to cleanse and smooth your skin without drying it out. Simple's toner retains your skin's natural barrier so it stays hydrated and better absorbs your moisturizer. Our Facial Toner contains no artificial perfume or dyes and no harsh chemicals that can upset your skin so they are safe to use on sensitive skin, so your face won't feel irritated or dry. Skin-Loving Ingredients Vitamin B5: Known to actively restore, soften, and smooth skin, vitamin B is especially good for dry skin. It may also help your skin's appearance by evening out its overall tone, reducing the appearance of age spots. Witch Hazel: Works to tone the skin and tighten pores. Allantoin: Can help keep your skin toned and refreshed.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/0e4fa36b-7883-4740-b980-9dcced746bd2._SL300__.jpg"
                ]
            },
            {
                "media_text": "Refresh and Instantly Hydrate with Triple-Purified Water Simple products use water that's been through a multi-step purification process to nourish and instantly hydrate your skin. The triple-purified water reduces possible skin irritation caused by artificial colors and perfumes as well as other particles and contaminants. Plus, the water is enriched with healthy multivitamins to help improve your skin. About Simple When it comes to gentle yet effective skincare, Simple knows that what is left out is as important as what is put in. Developed in the United Kingdom in 1960, Simple was the first to create a cleansing product for sensitive skin with no perfume and no dyes. Today, Simple products are still made with no dyes, artificial perfumes, or harsh chemicals that can upset skin. Simple made its U.S. debut in 2012 with a full range of products made with skin-loving ingredients and vitamins for natural, healthy-looking skin.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/355183bc-2bee-4fe9-a44a-26f370d569ad._SL300__.jpg"
                ]
            },
            {
                "media_text": "Simple Cleansing Micellar Water Simple Smoothing Facial Scrub Simple Replenishing Rich Moisturizer More Simple Products Simple Micellar Cleansing Water cleans the skin of dirt and impurities and unclogs pores Simple Smoothing Facial Scrub helps skin to better absorb moisturizer Complete your daily skin care routine with Simple Replenishing Rich Moisturizer",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/26776ce9-b589-4c1a-9440-78ec67fe7f1e._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3120d317-53a4-4f27-900f-285f3fa6acf1._SR230,100_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0e4fa36b-7883-4740-b980-9dcced746bd2._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/355183bc-2bee-4fe9-a44a-26f370d569ad._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dd7022fc-5eda-4ff3-a084-99e867247c3f._SR970,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/075712cb-7306-4a96-b8fc-58e939da29a1._SR150,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0b3ef287-59ea-456a-a034-0a28cd924d01._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6028222c-57df-42e8-b140-5bb117e071a3._SR150,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Laurie T.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQRP6P5NEVZX2V6HP4E52KBTIZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27VA6GQVWMCN2?ASIN=B005TI7NPI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Clean and non-drying",
                "reviewText": "Unlike many toners this toner is mild and non-drying. I don't have to worry about this toner causing redness around delicate eye areatissue. Using this toner ensures that any remaining debris is removed and my skin is clean and ready for applying a moisturizer. I highly recommend \"Simply Kind\"!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Williams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGVGBBV35DBC3I4A5Z6QQSEB24A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36U04FYJZE9KQ?ASIN=B005TI7NPI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 10, 2016",
                "reviewTitle": "5.0 out of 5 stars Great for sensitive skin.",
                "reviewText": "I started using Simple cleaning facial toner, as I was looking for something that was closer to all natural and paraban free. I've used several toners over the years, some leave a greasy feeling, others dry me out far to much, and albeit some break me out. The last one I was using from WholeFoods was suppose to be all natural, good, blah, blah, blah. However, I found it kept breaking me out and my skin was clean as I would of liked it.After alot of searching I found Simple. I tired the toner first and I love it. It works the way a toner should, and it doesn't dry me out or break me out. Those are huge pluses in my skin. Nor does it extra redness to my already fair pinkish skin. I've used this product for 2 months and I've added there exfoliating cleanser, and there daily cleanser to my routine. Simple is a really great brand, and I'm glad I found them because it works so well for me. My skin type is dry (dry t-zone too), very pale, and some pink/reddish cheeks. Almost anything I use is always to much my skin to oily, or to drying. This has been a perfect balance for me and highly recommend them. I bought this product at full price on here because I couldn't find it at my local target or walmart. I will continue to purchase this when I run out.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LoLo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE23WLYAJ44E7RNBNFMWP65LLJTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AIUPLN10V8SK?ASIN=B005TI7NPI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Finally found something that I am not allergic to, and really feels good on my skin.",
                "reviewText": "No perfume, and it does not make me sneeze or give me itchy eyes. Love this product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BarLee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWO7IK6DOMO5MFQW63BJR6TJG5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RY4IDI0ERKKW1?ASIN=B005TI7NPI",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2015",
                "reviewTitle": "4.0 out of 5 stars A Light Facial Toner",
                "reviewText": "I purchased this toner due to it being alcohol free and for use in a Korean style beauty routine. I have fair, dry/combo skin that is very sensitive and prone to breakouts and psoriasis.Simple Facial Toner in the Soothing formula is very light and scentless. It is a mild and pleasant feeling toner. It is alcohol free and made with 'simple' ingredients. Since I used the toner in a Korean style beauty routine, I poured a small amount of toner into clean hands and patted it over my face, neck and chest. By using my hands I save product that would otherwise be sucked up by cotton balls but either method works fine. The toner did not sting or dry out my face when applied. It offers a light moisturizing boost and drys on the face fairly quickly.I liked the Simple Facial Toner in Soothing formula due to its gentleness and effectiveness in maintaining ideal skin pH conditions for the products that followed behind. I personally will not repurchase because I feel I need a toner that provides a heavier douse of moister to the skin but I would recommend this to anyone with very sensitive skin.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lover of Books, Food & Good Deals",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUG7LBHQ6T2ZZCJQS4EYDJMPKBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZLYHB05M7UFY?ASIN=B005TI7NPI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 29, 2020",
                "reviewTitle": "5.0 out of 5 stars Unscented, Gentle, Effective",
                "reviewText": "There are no ingredients I'm trying to avoid in the pleasingly brief list of what's used in this toner. I notice no scent at all when using the product, which is exactly what I prefer. Even using a gentle cleanser, my aging and sensitive skin needs calming after cleansing, and this does the trick. It balances the skin's Ph after washing and includes ingredients that help it retain moisture, but it's only one step in the process. You'll need a good moisturizer as well. This is my first experience with the Simple brand and it lived up to expectations. My skin was irritated and flaking from a different toner, and it took only a day or two to clear up after the switch.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim Starkweather",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEU2GSZ5LOYGMJHYFS5HVAXMGG2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO8PK1AETBYIE?ASIN=B005TI7NPI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 19, 2023",
                "reviewTitle": "5.0 out of 5 stars I love all Simple products.",
                "reviewText": "This product works for my skin.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kdog",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2H5VZID725ILCU5FTIUELGMKWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E3RJ774R0GFS?ASIN=B005TI7NPI",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 27, 2023",
                "reviewTitle": "1.0 out of 5 stars No harsh chemicals?",
                "reviewText": "This product caused my skin to break out in a rash, so I give it a thumbs down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQ6CANPJ6ZQ5BPAGNIINV5LDSHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNPR0RO8ORTN6?ASIN=B005TI7NPI",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2021",
                "reviewTitle": "3.0 out of 5 stars Great but arrived broken",
                "reviewText": "Love this toner because it's non irritating and takes away some of that tight feeling I get after washing my face. I haven't noticed any bad reactions and my skin just feels nice and clean after using it. I gave it 3 stars because my bottle arrived damaged- the top couldn't close all the way and I lost a significant amount of product since it leaked all over the bag. I was able to buy another container and switch the tops so that it closes now, but it was definitely annoying that I had to pay extra for a new container and had less product than I was expecting. I'll attach a photo soon.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Liz Wakeley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 19, 2023",
                "reviewTitle": "Excellent product",
                "reviewText": "Has a good ability to cover skin",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maggie M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 25, 2022",
                "reviewTitle": "Do you want your face to feel refreshed?",
                "reviewText": "I have used this product twice a day for years, on cotton wool pads, after first cleansing with Simple cleanser and removing that with tissues and before putting on Simple vital vitamin day and night cream. I love it and I think you would too.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rebecca",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 10, 2020",
                "reviewTitle": "Great",
                "reviewText": "Really good toner. Very good value for money, does it exactly what it says. The toner is great for different skin types and it is easy to use.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mia Speirs",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 13, 2022",
                "reviewTitle": "Great for sensitive skin",
                "reviewText": "I’ve used this every day since i purchased this toner.It’s great, no scent, no irritants.It works for sensitive skin- or any skin for that matter.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BusyBea",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 12, 2022",
                "reviewTitle": "Good for sensitive skin",
                "reviewText": "Absolutely swear by this stuff. Cleanses my sensitive skin really well",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$11.80",
                "sellerName": "Quality On Time",
                "sellerRating": "5"
            },
            {
                "price": "$11.99",
                "sellerName": "Wiki Deals",
                "sellerRating": "5"
            },
            {
                "price": "$12.00",
                "sellerName": "50 Star Retail USA",
                "sellerRating": "4.5"
            }
        ]
    }
}