{
    "remaining_requests": 21483,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dear-Klairs-Supple-Preparation-Facial/dp/B00PGOFYG0",
    "body": {
        "name": "Klairs Supple Preparation Facial Toner, 180 ml",
        "price": "$20.00$21.90",
        "originalPrice": "",
        "rawPrice": 20.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dear-Klairs-Supple-Preparation-Facial/dp/B00PGOFYG0",
        "soldBy": {
            "sellerID": "A2ITVQXVLEC8P",
            "name": "wishtrend",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2ITVQXVLEC8P&asin=B00PGOFYG0&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BTKWGTGL"
        ],
        "asinVariationValues": [
            {
                "asin": "B07NQSQP23",
                "variationName": "Size",
                "variationValue": "1.01 Fl Oz (Pack of 1)",
                "price": "$10.00",
                "variationImageURL": ""
            },
            {
                "asin": "B00PGOFYG0",
                "variationName": "Size",
                "variationValue": "6.09 Fl Oz (Pack of 1)",
                "price": "$20.00",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41QWfNtQ5pS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/519AHE289oL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sjoVMwt L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jH40sS46L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61DYSkRpgDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/414hzCiOu L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51x7cwlQm9L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7fc9dc8b-229b-4630-9635-230f8df29780/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d55ee5c-50f4-47f5-bd33-f43157d50985/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d65117b9-e521-49a3-aeeb-f712522a752e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b098dd7-ab17-48c0-adfb-33d672db7d1a/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the DearKlairs Store",
            "link": "https://www.amazon.com/stores/DearKlairs/page/A3CB5A8C-1C58-4937-A837-E765E0844737?ref_=ast_bln"
        },
        "brand": "DearKlairs",
        "merchantInfo": "wishtrend",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 5114,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 20 hrs 45 mins",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35. Order within 20 hrs 45 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "🌊A daily toner that is safe and non-irritating to moisturizing with enhanced hydration by 4th generation moisture ingredients 'lipidure'. It also contains other hydrating ingredients such as Beta-glucan and Hyaluronic Acid.",
            "⚖️It optimizes PH levels for the skin and helps to balance skin moisture your skin. It balances the pH levels and relieves the skin of dehydration.",
            "🍃Contains the ingredients from nature provides plentiful moisture and calming for the skin that is stressed out.",
            "😌Manufactured in Korea. 180ml. For all skin types, including sensitive skin.",
            "✅Recommended to use it as an all day moisturizing toner",
            "*Please note that the scent may slightly vary during the manufacturing process because the essential oil is extracted from natural ingredients. There is no change in formulation or oil ratio, and it is a natural characteristic of essential oils in the toner."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060711"
            },
            {
                "name": "Toners & Astringents",
                "link": "https://www.amazon.com/Facial-Toners-Astringents/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11061931"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3.94 x 3.94 x 3.94 inches; 0.01 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 250012"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ November 11, 2014"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ KLAIRS"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00PGOFYG0"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#15,089 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #115 in Facial Toners & Astringents"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 5,114 ratings"
            },
            {
                "name": "Brand",
                "value": "DearKlairs"
            },
            {
                "name": "Item Form",
                "value": "Drop"
            },
            {
                "name": "Skin Type",
                "value": "Sensitive"
            },
            {
                "name": "Product Benefits",
                "value": "Hydrating"
            },
            {
                "name": "Material Feature",
                "value": "Natural"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Amazon's Choice Klairs Supple Preparation Facial Toner",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A2ITVQXVLEC8P/B00PGOFYG0/tFMb6CUpRh2g._UX614_TTW__.jpg"
                ]
            },
            {
                "media_text": "Supple Preparation Facial Toner is upgraded, 150ml > 180ml! The first burst of hydration the skin meets is a toner. Meet the non-irritating toner that rejuvenates and restores hydration for tired skin. [Features] The first burst of waterKLAIR’S toner hydrates and calms sensitive skin post-cleansing and tidies the skin texture to smoothen while maintaining the optimal pH balance to help the absorption of other products as well. With a various plant extracts and soothing ingredients blended together for a calming formula, the non-irritating, super hydrating toner can be used for sensitive skin as well. Faster absorption, enhanced hydration skin glows healthier with higher moisture retention. The Renewal Toner is prescribed with an upgraded moisturizer that rapidly absorbs into the skin while prolonging hydration by more than 20% than conventional toners with hyaluronic acid and beta-glucan. For dry skin, use 2-3 times consecutively to help relieve strain from dry skin. With decreased oiliness and increased absorption, it’s suitable all year around for oily skin as well. Improve & fill the gapsThe new toner exceeds the capacity of the conventional toner by 30ml and can be used more generously with the replacement and exclusion of all components which may be irritating to sensitive skin by natural ingredients. Improve your experience with the improved package as well!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A2ITVQXVLEC8P/B00PGOFYG0/4JMGFAjvTmF._UX850_TTW__.jpg"
                ]
            },
            {
                "media_text": "Additional information [How to use] 1) After cleansing, apply an appropriate amount to clean skin and use the heat of your palms to help the complete absorption. For dry areas, multiple applications are recommended. 2) If using a cotton pad, soak the pad completely. [KeyIngredients] Hyaluronic Acid, Centella asiatica extract, beta-glucan, lipidure (polyquaternium -51) [Ingredients] Water, Butylene Glycol, Dimethyl Sulfone, Betaine, Caprylic/Capric Triglyceride, Natto Gum, Sodium Hyaluronate, Disodium EDTA, Centella Asiatica Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Polyquaternium-51, Chlorphenesin, Tocopheryl Acetate, Carbomer, Panthenol, Arginine, Luffa Cylindrica Fruit/Leaf/Stem Extract, Beta-Glucan, Althaea Rosea Flower Extract, Aloe Barbadensis Leaf Extract, Hydroxyethylcellulose, Portulaca Oleracea Extract, Lysine HCL, Proline, Sodium Ascorbyl Phosphate, Acetyl Methionine, Theanine, Lavandula Angustifolia (Lavender) Oil, Eucalyptus Globulus Leaf Oil, Pelargonium Graveolens Flower Oil, Citrus Limon (Lemon) Peel Oil, Citrus Aurantium Dulcis (Orange) Peel Oil, Cananga Odorata Flower Oil, Copper Tripeptide-1",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A2ITVQXVLEC8P/B00PGOFYG0/kel4zlrRRyyM._UX663_TTW__.jpg"
                ]
            },
            {
                "media_text": "Package Renewal Please be informed that Dear Klairs product packaging is consistently changing in an effort of eco- friendly reasons. Therefore, if you purchase from Wishtrend, we make sure the genuinity of the products as the brand owner of Dear Klairs. Thank you.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/74fc93e9-e187-439a-8fde-507d173c62b9.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Supple Preparation Facial Toner Supple Preparation Unscented Toner Daily Skin Softening Water Daily Skin Hydrating Water Texture Thick Thick Lightweight Lightweight Main Ingredients Beta Glucan, Lipidure and Hyaluronic Acid essential oil-free version of supple toner 45% of cucumber water, 0.15% of citric acid 45% of green tea water Fuction Hydration Hydration Exfoliation, Hydration Hydration",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A2ITVQXVLEC8P/B00PGOFYG0/vZTicNM6RGaF._UX300_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A2ITVQXVLEC8P/B00PGOFYG0/vL2Nle9bTI6._UX300_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A2ITVQXVLEC8P/B00PGOFYG0/KjkQuc6QsGW._UX300_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A2ITVQXVLEC8P/B00PGOFYG0/tFMb6CUpRh2g._UX614_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A2ITVQXVLEC8P/B00PGOFYG0/4JMGFAjvTmF._UX850_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A2ITVQXVLEC8P/B00PGOFYG0/kel4zlrRRyyM._UX663_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/74fc93e9-e187-439a-8fde-507d173c62b9.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/169e236c-5ab9-48d3-b7bd-6fb65e096d6a.__CR157,0,750,1500_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7863b65d-07ea-41ed-a710-a3cfd6e1afce.__CR143,0,750,1500_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1f8e7a26-2208-4a07-9e43-e4f38b8babbf.__CR79,0,540,1080_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d153dccf-faba-415e-a933-33bc6b9284bc.__CR39,0,540,1080_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "RebeccaRebecca",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAIKXFDLB5VW5ZDJGN66WONOWYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14CY99FCTX2JW?ASIN=B00PGOFYG0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 5, 2017",
                "reviewTitle": "5.0 out of 5 stars I'm a huge skincare skeptic! This is Amazing! (update 2018)",
                "reviewText": "This is my honest and very detailed review of the Klairs Supple Preparation Facial Toner 180ml. I received this on February 6 2017, and I bought it from the seller Wishtrend. My product was not counterfeit and the shipping was fast because I have Prime. I have been using it for about 4 months now. This product is amazing. If you wish to read the full details of my review please keep reading. I hope this review helps someone :).Pros/ Good:1. Hydrating for a toner!2. Very gentle, it is gentle enough that it didn't irritate my sensitive acne prone skin3. Seems to be great for all skin (my mom and sister tried it and they have different skin then me)4. No fragrance ( artificial fragrance is especially not good for the skin)5. Layers well with other products6. Fast absorbing7. Seems to do what is advertised8. Get a good amount of product for the price9. Packing is simple and nice, and it dispenses well10. My other products seem to absorb better and with no peeling with this tonerCons/ Bad:1. The price may be a turn off to some because it is not exactly really low cost2. Some that like simple ingredient list may not like the long ingredient list this product has ( I don't mind).My skin type: I have dry, sensitive skin that is prone to mild acne. My skin reacts terribly to harsh chemicals and fragrances. I have always had clear skin in my teens but for some reason saw mild acne bumps occur on my cheeks ( small 3-4 of them) and I am in my 20s. Sometimes I would get 1-2 deep, pus filled zits. My skin has gotten a lot better since 2 months of use and this has helped ( though not the main reason). To make clear this did not clear up my acne but it did help because hydrated skin is happier skin. What helped my acne overall were probiotics ( and sugar free yogurt) and switching to a low refined carbs and sugar diet, I also consume more fruits and veggies when I can because eating clean is expensive.The Package: I think it is important to pay attention to packaging when purchasing skin care products. The toner comes in a brown cardboard box. The front has an image of the toner, and the coloring is brown and purple with black ink. The writing is in black ink for the majority of the package. The writing is in Korean and english. It states the location of manufacturing. The bottle is made of plastic and is a very dark brown with a black plastic top. The label is placed on the actual bottle and is a ivory or off white color. The text is in Korean and english. It dispenses like a drip, so one drop at a time. It looks legitimate and none counterfeit from my research. Please research all your skincare before purchase.The ingredients list: Main ingredients- sodium hyaluronate, glucan, centella asiatica extract, lipidureOther ingredients: water, butylene glycol, dimethyl sulfone, betaine, caprylic/caprice triglyceride, natto gum, sodium hyaluronate, disodium EDTA, centella asiatica extract, glycyrrhiza glabra (licorice) root extract, polyquaternium-51, chlorphenesin, tocopheryl acetate, carbomer, panthenol, arginine, luffa cylindrica fruit/leaf/stem extract, beta-glucan, althaea rosea flower extract, aloe barbadensis leaf extract, hydroxyethylcellulose, portulaca oleracea extract, lysine HCL, proline, sodium Ascorbyl phosphate, acetyl methionine, theanine, lavandula angustifola (lavender) oil, eucalyptus globulus leaf oil, pelargonium graveolens flower oil, citrus limon (lemon) peel oil, citrus aurantium dulcis (Orange) peel oil, cananga odorata flower oil, copper tripeptide-1How I use it: I do not use this with a cotton pad or a cotton ball because cotton absorbs a lot of the product causing one to use more. If you think you have extra make up on your face and want to wipe it off just incase then a cotton pad/ball would be recommended. However, I use it mainly as a toner after I know all my make up is gone. I wash my hands, dry them and then use a few drops and gently pat it on my face.My experience: This product is a holy grail! The product dispenses really well so I never use to much. The color is clear, it is pretty much odorless, and the texture is a little viscous and not really watery, and none sticky. Like I stated before I have dry skin. I often get dry flaky spots in the winter. I have used toners before and they were all watery and drying. Most toners have an alcohol smell and some irritated my skin or dried it out worst like CosRx toner. I switched to Klairs toner after seeing great reviews. I was skeptical, and the price was not the cheapest if it did not work but I was desperate for hydration so took the risk. I do not regret it! This is as hydrating as a toner can get. It leaves my skin smooth and not tight. It is fast absorbing and layers beautifully under products and no peeling. It does what it advertises and helps remove extra make up. I also notice my products absorb better into my skin when I use this toner, they absorb faster and do not peel ( I use 4-5 products in my skincare routine, including the cleanser). I cannot believe a toner like this exist! No irritation, no dryness so this is a dream!My family experience: My mother and sister tried this product and both love it! My sister has oily skin and my mom combination skin with oily and dry. My sister has moderate acne. My mom clear skin, sensitive, with a few wrinkles around the eyes ( my mom is in her 40s and my sister is in her 20s). They both had no negative reaction to the toner, and they both said it was hydrating. The toner did not peel and layered well for them. It also helped my sister remove her makeup.Overall: I highly recommend this product. This product does everything it advertises and that is remarkable. It is fast absorbing, layers beautifully, hydrating and helps in the removal of make up, gentle enough for sensitive skin. I can't believe this worked and I hope this works for everyone as well! I hope my review helps someone.Update: 9/1/2018- I am almost done with my second bottle since this review and it is still great. My skin still loves this product and as you can see I have only ever purchased 2 bottles! It last a long time and no one has had any adverse effects in my family. My skin has gotten better over all since my probiotics and cleaner eating ( my acne was mainly inflammatory gut issues) but my skin is still sensitive. I still recommend this product for everyone but again do your research before anything. I have sensitive skin but this has helped me, for those with skin sensitive to essential oils or more sensitive than mine than they also released another version of this that contains no essential oils I believe. I have not tried that yet but hope to some day, but Klairs is expensive so I am not sure if that will be anytime soon, however, I love this product so look forward to buying again. Thank you everyone and if anything some how gets worst I will update this review. I hope this helped some :)",
                "reviewVotes": "635 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71GCEWgG0xL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71P0C+zVQBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71PqxceByUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71TcZ8+LsDL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYO35CKNU6GEQ7SGSHVWNFF3N5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PPKDEQSBWMMQ?ASIN=B00PGOFYG0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for additional moisture and barrier repair",
                "reviewText": "This was my second time getting this. I love this toner. Its especially great when your skin barrrier is going through hard times. It reminds me of the Clarins Extra Comfort Lotion, but at a great price. I will buy this again!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sharmin gugat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4QQ4Q3D7ZIA3GHM2FE2KPHOQVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MYOSTAPGAC7E?ASIN=B00PGOFYG0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Great product.",
                "reviewText": "Goes on smooth and makes your face feel wonderful.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDX4KWOBEH6HEVXXPSI4RN6XEXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VBI683Q1S17L?ASIN=B00PGOFYG0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Love it but it’s way smaller than it was previously",
                "reviewText": "Great product. Frustrating that they are charging the same price for more than half the size of what it used to be.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jenny M. Raja",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRX2PG5MQKVUOJHUW2VRYBEAETA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CQMI04WSTGWR?ASIN=B00PGOFYG0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Is it the secret sauce we’ve been looking for?",
                "reviewText": "I bought this on the strength of another woman’s review: I’m using it every night after washing my face - I put about 1/2 tsp on my hand and pat it on. When it’s dry I apply a brand of the snail slime that’s all the rage, and when THAT’S dry I put on a nighttime face cream. I’m 58 and my skin hasn’t looked this good in years!! Even my husband noticed, and he can go weeks before noticing I’ve colored my hair🤣! I don’t know which one is the secret sauce and I’m not taking any chances!! Also, unlike most toners this doesn’t have any alcohol odor. In fact I barely notice any odor at all. 100% recommended.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ZakZak",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJDZNXZXO3DBG2L2PJXNXJTRADQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAN2TPV4G2OME?ASIN=B00PGOFYG0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2023",
                "reviewTitle": "5.0 out of 5 stars DearKlairs has me in a chokehold",
                "reviewText": "I always keep coming back to this toner! I’ve repurchase literally 5 times and I’ve tried to switch it up… Like if someone has something better please tell me because it’s been 5 years and I’m still here.I have east asian, super dry skin that is prone to hyperpigmentation. I wash my face, dump a few drops of toner directly onto my hands and then pat across my face. This toner feels soo luxurious and hydrating- I’m a HUGE fan of the scent as well but they also have a scent free version if you prefer that.This is the one. Idk what else to say. It doesn’t strip your skin of anything, feels viscous and thick but absolutely breathable, smells like a dream. Packing is sturdy and cute af, esp next to the DearKlairs cleansing oil. Cant ask for anything more.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61eR2parELL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mintylips",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNEYFXBFQUXZXF2CXN2Q3JXWYQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15L0D7ZRXHUXX?ASIN=B00PGOFYG0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Yes yes yes!!",
                "reviewText": "Hydrating and non scented this is my go to toner. Im already on my 4th bottle. Has helped keep my dry skin from feeling like the desert",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Popeye A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 27, 2023",
                "reviewTitle": "Great brand, thicker toner",
                "reviewText": "Thicker than your usual water consistency toner, but that’s because it’s very moisturizing. A couple of layers after cleansing does wonders! Great for sensitive skin.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sneha Madhu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 17, 2024",
                "reviewTitle": "Klairs toner",
                "reviewText": "Soothing and refreshingGood for oily skinHelps to calm the skin",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniela",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on May 25, 2023",
                "reviewTitle": "Adoro",
                "reviewText": "Adoro i prodotti coreani....mi trovo benissimo ed anke la mia pelle va meglio",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adriana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 16, 2021",
                "reviewTitle": "El mejor Tonico",
                "reviewText": "En verdad que es el mejor Tonico que he probado, te ayuda muchísimo a que tus otras cremas se observan súper bien!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nmay",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 11, 2021",
                "reviewTitle": "Surprisingly good",
                "reviewText": "I really didn't expect this product to be THIS impressive. I LOVE the consistency, it's liquid but just a little bit jelly like, so it stays in your palm unlike very watery toners.I suppose most people think that toner is the part of skincare routine that can be skipped or neglected, but in my opinion, it makes the biggest difference.I have normal dehydrated skin and based on my experience, every other products work better when a toner is added to a skincare routine. It's like it fine tunes the other products, if that makes sense to you. It \"sets the scene\".This toner is particularly good, I will defined rebuy it and possibly, I won't even buy a different toner in the future.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}