{
    "remaining_requests": 21287,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Nasola-Clarifying-Hydrating-Niacinamide-Glutathione/dp/B0C6F8WF2P",
    "body": {
        "name": "Kojic Acid Facial Toner Skin Clarifying and Hydrating Mist Spray with Glycolic Acid, Niacinamide, Licorice, Glutathione, Vitamin C, Salicylic Acid, Aloe Vera, and Gotu Kola - 3.38 Fl Oz",
        "price": "$21.95$21.95 ($6.49$6.49 / Fl Oz) $20.85$20.85 ($6.17$6.17 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 21.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Nasola-Clarifying-Hydrating-Niacinamide-Glutathione/dp/B0C6F8WF2P",
        "soldBy": {
            "sellerID": "AZ2F768QHV20H",
            "name": "ChanobHQ",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AZ2F768QHV20H&asin=B0C6F8WF2P&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51FnNeiRuKL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41a1jjnBtpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41W44mViljL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41L3XiRZFEL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Nasola Store",
            "link": "https://www.amazon.com/stores/NasolaNaturalSkinCare/page/3B6B83B8-A6ED-449A-8503-AB16A442CD2D?ref_=ast_bln"
        },
        "brand": "NasolaNaturalSkinCare",
        "merchantInfo": "ChanobHQ",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 10,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 8 hrs 22 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Revitalize & Transform: Harness the power of Kojic Acid, Glycolic Acid, and Licorice to reduce skin discoloration, sun-induced marks, blemishes, and other complexion inconsistencies, revealing a radiant tone and luminous glow. Nasola Kojic Acid Facial Toner Spray blends Vitamin C and Vitamin A to enhance skin luminosity further, revealing an insta worthy glowing complexion.",
            "Hydrate, Plump & Refresh: A fusion of Aloe Vera, Vitamin B5, and Glutathione work synergistically to provide optimal hydration and plumpness, diminishing the appearance of wrinkles and aging signs. This organic mist moisturizer is expertly crafted to leave your face feeling moist, rejuvenated, and youthful. Our potent formula also ensures enhanced moisturizer absorption for a deeply hydrated and refreshed skin feel.",
            "Pore Perfection: With the potent blend of Niacinamide, Salicylic Acid, and Ferulic Acid, this facial toner spray minimizes the appearance of pores, controls excess oil, and calms the skin. The result? Smooth, pore-less skin that's prepped and primed.",
            "Multi-Active Age Defense: Go beyond mere refining and rejuvenating with our unique combination of Vitamin A, Vitamin B3, and anti-aging properties. Experience reduced fine lines, anti-wrinkle effects, and a youthful glow. The daily peel properties of Nasola Kojic Acid Facial Toner Spray make it a multi-active solution against all signs of aging.",
            "Clean, Natural & Powerful: Formulated without harmful ingredients, Nasola promises a natural approach to skincare. With an organic blend of Vitamin B3, Vitamin C, and other essential nutrients, show off the best version of your skin, regardless of type. Gentle for daily use, our spray is an essential step in your skincare routine, suitable for both women and men. Remember, for optimal results and protection, pair with a broad spectrum SPF moisturizer as the next step in your morning routine."
        ],
        "description": "Discover a transformative skincare experience with Nasola Kojic Acid Facial Toner Spray, uniquely designed to address the specific needs of women and men with skin discoloration, sun-induced marks, blemishes, and other complexion inconsistencies. Refine, revitalize and transform your complexion as this potent blend harnesses the skin enhancing powers of Kojic Acid, Glycolic Acid, and Licorice. Imagine feeling the insta worthy radiance of your skin, further enriched with a fusion of Vitamin C and Vitamin A, illuminating your natural beauty and evoking a youthful luminosity. Revel in the sensation of face that's not just refreshed but feels moist and rejuvenated. Thanks to this organic mist moisturizer infused with Aloe Vera, Vitamin B5, and Glutathione, your skin attains optimal hydration and plumpness, artfully diminishing the appearance of aging signs. No more worries about large pores or excessive oil. This facial toner spray's expert formulation, packed with Niacinamide, Salicylic Acid, and Ferulic Acid, gives your skin pore perfection, creating a smooth, prepped, and primed canvas. Age gracefully and with confidence. The daily peel properties of our facial toner, combined with the potent punch of Vitamin A and Vitamin B3, ensure a multi-active defense against wrinkles, fine lines, and other signs of aging. With each spray, you're not just rejuvenating but activating a powerful shield against time. True beauty is natural and powerful. Nasola's promise is an unwavering commitment to clean skincare. Dive into a transformative skin journey crafted without harmful ingredients and anchored in an organic blend of essential nutrients. Suitable for all skin types and gentle for daily use, our spray is the quintessential step in your skincare routine. And for that final touch of protection, always pair with a broad spectrum SPF moisturizer every morning. Join the Nasola revolution and redefine skin vitality with a spray that doesn't just beautify but empowers!",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b?ie=UTF8&node=11060711"
            },
            {
                "name": "Toners & Astringents",
                "link": "https://www.amazon.com/Facial-Toners-Astringents/b?ie=UTF8&node=11061931"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 5.83 x 1.65 x 1.65 inches; 4.97 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ September 22, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Nasola"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0C6F8WF2P"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#101,699 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #620 in Facial Toners & Astringents"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 10 ratings"
            },
            {
                "name": "Brand",
                "value": "Nasola"
            },
            {
                "name": "Item Form",
                "value": "Spray"
            },
            {
                "name": "Skin Type",
                "value": "All"
            },
            {
                "name": "Material Type Free",
                "value": "Fragrance Free, SLS Free, Butylparaben Free, Sulfate Free, Paraben Free"
            },
            {
                "name": "Product Benefits",
                "value": "Anti-Aging, Anti-Acne, Anti-Wrinke, Clarifying, Exfoliate, Hydrating, Firming, Fine Lines, Moisturizing, Nourishing, Pore Minimizing, Plumping, Radiant Skin, Recovery, Revitalizing, Skin Cell Renewal, Smoothening See more"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "HibouHibou",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4QLBNQC22XDKC2N6SASDLQCQDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HQBOGN431J09?ASIN=B0C6F8WF2P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Gentle",
                "reviewText": "This is a really nice toner that you can spray apply and it does not irritate my very sensitive, eczema prone skin. I am using it once every other day, as I am very careful with my sensitive skin and use products sparingly so I don’t irritate it. It has no real smell to it and I like that the ingredients are all natural and that so many of them are active ingredients, not just fillers. It seems to improve my skins integrity and I would purchase it again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Et1577OQL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Candace D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUOPAIIBK4GOXIQYIVGIQPLAIYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36C8ONM206N9F?ASIN=B0C6F8WF2P",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "4.0 out of 5 stars Pretty good!",
                "reviewText": "Nice product. Works well with my sensitive skin. Great for stacking my other products with it since there is no harsh smell or feelings. Worth the price since the quality is good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Indy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVWIFK6ADTQYDKPDWBHAS7TZ4SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW5KU37GHGMHG?ASIN=B0C6F8WF2P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Nasola Kojic Acid Facial Toner Spray",
                "reviewText": "The most user friendly skincare product with kojic acid I've tried. It doesn't get any more simple than cleansing and spritzing this on my face a couple times a day. The mist comes out fine, but a good quantity comes out and I can get my whole face and neck in two to three sprays if I sweep down each side of my face. Have not noticed any difference in my face, but I think this is one of those products that helps with the cumulative effect of consistent skincare. It dries pretty quickly and doesn't make my skin feel greasy or dry, just slightly hydrated like I used a light toner. Would recommend to anyone wanting to add a product with kojic acid to their routine.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3JO32KJSKQ7M2DKDHVZRG3Q4ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18IXOJY1M5X82?ASIN=B0C6F8WF2P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Gentle But Good",
                "reviewText": "So far, this is a really nice exfoliating and moisturizing spray. It sinks in quickly with no tacky residue but does leave your skin nicely hydrated and glowy. It does not have a scent and doesn't irritate my skin despite the many powerful ingredients. I have very pale, very sensitive skin, so any changes would be immediately visible.Make-up goes over this well. It doesn't pill or cause patches.I can't speak to long-term use yet, but I have long used many of the ingredients in here (like niacinamide and glycolic acid) so I will update if there's any change to the usual effects (even skin tone, improved skin texture, etc.).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R.S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFH2BKAYPSMZJHXV5QAVNLFQYHLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LFGQ7L6VS5KJ?ASIN=B0C6F8WF2P",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 23, 2023",
                "reviewTitle": "4.0 out of 5 stars Quality toner",
                "reviewText": "I was curious to try this product because although I have a favorite cleanser, serum, moisturizer, etc... I've never had any strong loyalty to any one toner. I've often seen little to no benefit from many of them. This one I did and the biggest difference was in texture. My face has felt much smoother the past couple night when using this (guessing it's the salicylic acid which has always helped me with texture). My skin also felt more hydrated. It provided a much better base for my hyaluronic acid serum and moisturizer. It's called fragrance free and while I did pick up a very slightly chemical scent, it's not bad. My main issue and why I can't consider using this product going forward is it's not cruelty-free, or at least it doesn't state it. I will only use products not tested on animals. So, I'll keep searching.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LASunshine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFARDDK4VGRMXQZK5PYZNC4ZKNFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB54T8YDFKG1D?ASIN=B0C6F8WF2P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Quality toner at a great price",
                "reviewText": "This toner has all the heavy hitters in skincare, of which I'm most interested in glycolic acid. Glycolic acid makes your skin refreshed, exfoliates, and brightens. I love this stuff! In a spray bottle for easy usage, and has a good amount. My skin feels smooth, clean, and looks bright after using this for 2 weeks. The price is really good too, as a lot of luxury brands with the same ingredients are at least 3 times more. Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "User1234User1234",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNXSHAEUC2PWM6KZQDZEWBGAVLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Q8L09EO545EK?ASIN=B0C6F8WF2P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Facial Toner",
                "reviewText": "This Nasola Kojic Acid Skin Clarifying and Hydrating Facial Toner made with a lot of natural ingredients. One bottle does all the jobs, such as anti-acne, anti-aging, anti-winkles, brightening and hydration. So far, I noticed that my skin tone turns brighter and some noticeable fine line on my face start to fade away after two weeks using every night. I really like this product working to my skin, definitely will order more.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71LODnDoVUL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sun Y.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENXOCYG57ZHRAS7UFL3KUHZAYKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R131JGOEXXORT3?ASIN=B0C6F8WF2P",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Refreshing facial toner",
                "reviewText": "My skin tends to get oily and this facial toner is great on my face. I use it after washing and it makes my face feel very clean and revived. It has a lot of natural ingredients which is a huge plus for me.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}