{
    "remaining_requests": 21402,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Thayers-Alcohol-free-Petal-Witch-Hazel/dp/B00016XJ4M",
    "body": {
        "name": "Thayers Facial Toner, Witch Hazel with Aloe Vera, Rose Petal, 12 Fl Oz",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Thayers-Alcohol-free-Petal-Witch-Hazel/dp/B00016XJ4M",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B0BP5GSPLL"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ZXcWLWGdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51rm1UzhkuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vRFEEOjQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MWzvrzH-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51BJ2kOGldL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-m-c8EK9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KBThqw GL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the THAYERS Store",
            "link": "https://www.amazon.com/stores/Thayers/page/89511E3A-63A7-438D-A23E-B9EDF8D7905C?ref_=ast_bln"
        },
        "brand": "Thayers",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 21561,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Soft rose fragrance, Soothing Rose Toner made with rose-petal water and proprietary Witch Hazel extract",
            "Un-distilled witch hazel cleanses and moisturizes, Certified organic aloe vera",
            "Free of alcohol, parabens and propylene glycol",
            "Packaging may vary"
        ],
        "description": "\"Flower Power. Thayers Alcohol-Free Rose Petal Witch Hazel Toner with Aloe Vera will make your skin bloom. Thayers remarkably soothing Rose Petal Toner is made with rose water, filet of aloe vera, and our proprietary Witch Hazel extract. Rose petals, which, through distillation, create the rosewater we use in our formula, are full of natural oils and sugars that help restore dehydrated skin and bring out a natural, dewy, glowing complexion. The natural astringent properties of rose petals work in tandem with witch hazel, tightening pores, controlling oil production, locking moisture in, and keeping free radicals out. Rosewater is also full of Vitamin C, which is crucial for collagen production, strengthening skin cells, and fading blemishes and scars. Thayers creates the only Witch Hazel products made of non-distilled extract from the Witch Hazel shrub, maintaining the highest levels of therapeutic tannins, the mild antioxidants that help your skin look and feel its best. These natural elixirs have been a fixture in medicine cabinets for generations. Once you use them, you'll know why.\"",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060711"
            },
            {
                "name": "Toners & Astringents",
                "link": "https://www.amazon.com/Facial-Toners-Astringents/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11061931"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2.4 x 2.5 x 6.2 inches; 12.52 Ounces"
            },
            {
                "name": "Manufacturer recommended age ‏",
                "value": "‎ 6 months - 3 years"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 646562"
            },
            {
                "name": "Department ‏",
                "value": "‎ Face & Oral Care"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 041507070035"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ MIOLQ - pallet ordering"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00016XJ4M"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#70,696 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #442 in Facial Toners & Astringents"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 21,561 ratings"
            },
            {
                "name": "Brand",
                "value": "THAYERS"
            },
            {
                "name": "Item Form",
                "value": "Oil"
            },
            {
                "name": "Skin Type",
                "value": "All"
            },
            {
                "name": "Material Type Free",
                "value": "Alcohol Free"
            },
            {
                "name": "Product Benefits",
                "value": "Soothing"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About Us A legacy personal care brand with a 175-year history…and counting. The son of a physician and one of Massachusetts’ founding families, Henry Thayer was trained in the medical arts at Boston Medical School and received the degree of M.D. The special study to which he devoted himself was chemistry, under the most eminent chemists of Boston and New York. Initially, Dr. Thayer practiced medicine for a short time, and at 21 years of age in 1843, opened a drug store in Douglass Block in Cambridge, where he continued for a few years, only leaving to establish his famed Henry Thayer & Company in 1847, on corner of Main and Essex Streets in Cambridge.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/5c0c34b2-5156-4588-99f2-7ce89f20df44.__CR768,0,384,384_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/5c0c34b2-5156-4588-99f2-7ce89f20df44.__CR768,0,384,384_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Shelly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIOXA7DRSTOTHVMU7BE37YNF33A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SU7HH1A7ZX8H?ASIN=B00016XJ4M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 25, 2015",
                "reviewTitle": "5.0 out of 5 stars SUPER OILY Skin Review",
                "reviewText": "Let's start with my skin type. As a fellow online shopper, I think it's important to know the reviewers skin type so I can compare with my own. SUPER OILY.How oily? Let's put it this way. On average I use 4-6 oil blotting papers each time to remove shine. I do this 2-3 times a day to not look like butter. My supposedly long lasting 15-h foundation only lasts 2 hours before melting and I don't use eyeliner (even though I would love to!) because my eye lids melt everything; pencil, gel, powder, liquid. Anything. That is how oily I am. To add to my problems, I also have mild acne. I treat this with benzoid peroxide face wash, retinoid cream, and benzoid peroxide gel daily. I am simply adding the toner to my routine so any results or side effects are achieved with a combination of products. I will report as accurately as possible.Now back to the product.Day 1: I received the package very quickly and at first I was a little apprehensive because the liquid looked like baby oil inside the bottle. Later at night, I finally opened it and I was wrong. The toner is very light, non-greasy, and smelled like roses. The smell was a bit strong when I first poured it on a cotton pad, but about 5 minutes after application, 95% of the smell went away. So for those who are worried about the scent, it goes away quickly! After applying the toner on my face I felt very clean and normal. I say normal meaning I didn't fee dry and I didn't feel oily either. It was great. I followed quickly with my usual moisturizer and voila. Done.Day 2: I woke up and my face was not as oily as before, pre-toner. Upon washing my face, it felt softer and smoother. Definite plus. After using the toner only once, I am already feeling a difference. Overall, my skin feels cleaner and less heavy with oil. If your goal is to find something to clean and sooth, this toner does a pretty good job. As for pore sizes or acne, I will have to update after I've used the products for a few weeks. I'm going to add the toner to my routine twice a day as recommended and will update soon!One Month Later: I have lowered my use to once a day, at night, to clear away any excess dirt or makeup that was overlooked by the makeup remover + face wash. Aside from what I mentioned earlier, I did not notice any additional benefit of this toner. It definitely does help keep my pores cleaner but after a while, I still need to use clay masks or nose strips to remove the blackheads. Overall, I would say that using this toner wouldn't hurt. I observed no negative reactions and it's quite affordable as a toner for only $10!Recommendations: For anyone looking for a general toner that covers all your bases, I would recommend this one due to its low costs and large quantity. (After one month, I barely used half the bottle.) For anyone looking to target anything specific like oiliness, acne, pores, etc, I would recommend to possibly keep shopping. Let me be clear that this toner is not bad, in fact, it's a lot better than other toners I've tried because it didn't dry out my skin, but it also did not fulfill the hopes that I had when trying it. If you have relatively good skin, go for it. This one is both good for your wallet and skin.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Momo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGI3DFGDACSDTK633BJQKJL2PXBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GF3I7XWLW37O?ASIN=B00016XJ4M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2018",
                "reviewTitle": "5.0 out of 5 stars Helps soothe and soften sensitive skin",
                "reviewText": "When I first started using this product, it was extremely effective at managing my breakouts. It made a difference that even my family had noticed. Notably, my problem area (my chin, mouth) gets swarmed with painful cystic acne at least once a month, around my cycle. Last year I also went through finals and some bad family drama around the holidays, but this toner kept my skin fresh. Unfortunately with my most recent cycle I've had a resurgence of stubborn cystic acne, but this toner still deserves these 5 stars because it is an excellent moisturizer and a wonderful product. Besides, it's not actually marketed as an acne product! That is just a nice bonus for some of us. It has definitely had a very soothing effect on my skin and has helped to manage some of the crustiness and peeling that can come with bad acne.The bonus is that this product seems very natural. I haven't inspected the ingredient list or anything, but I don't think it contains any of the drying acids or harsh chemicals that are usually found in other skin products. Especially ones for acne. It's alcohol-free!!! So it smells great, doesn't burn the nose or eyes with harsh fumes, and I feel fine to use it several times a day without drying out my face. It does quite the opposite, in fact, by revitalizing the skin. It dries quickly and leaves a light, clean feeling on the skin, not to mention a pleasant rose fragrance that doesn't linger too long. My face is a lot softer and overall healthier than it has ever been.This product has replaced my regular moisturizer that goes on before applying makeup. I just pour some toner on a cotton square and wipe it over my skin after washing my face (with a makeup wipe or Neogen cleansing stick). The skin flakes I used to see after putting on foundation are no longer an issue. I rarely need to exfoliate. I will use this toner in the morning, before bed, and sometimes in the middle of the day when my skin feels oily or needs a pick-me-up. This toner is one of the most gratifying skincare products I've ever used! Highly recommend for yourself or as a gift for someone who struggles with dry skin. This is a must-have product for anyone who loves skincare products.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bruno",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 15, 2020",
                "reviewTitle": "Súper útil :D",
                "reviewText": "Tengo 29 años, piel muy sensible, tiendo a tener espinillas (de las feas) y me ha ayudado bastante :D Ningún efecto negativo, el olor es agradable y se va rápido, te deja la piel tersa e hidratada.Es conveniente que después de que te laves el rostro te apliques el toner con una almohadilla de algodón y luego uses un hidratante para reforzar (yo uso Neutrogena Water boost oil free) y todo de lujo :DSi quieres añadir un producto a tu rutina de aseo, este es el que buscas :D",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Oishi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 10, 2019",
                "reviewTitle": "Effective",
                "reviewText": "Nice product.Genuine . Effective .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Justine Kau",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on January 24, 2020",
                "reviewTitle": "Awesome",
                "reviewText": "Good product",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 9, 2016",
                "reviewTitle": "New part of my skin care routine",
                "reviewText": "I found this product by chance while trying to find a korean rose petal toner I had seen on an online review. Seeing the reviews so far on this product, I thought I might as well give this a chance. I've been using it regularly since I got it (I think it has been over 2 weeks now) and it has been working WONDERS. I have combination skin which tends to be oily around my T-zone and dry around my nose and chin, and my skin is very sensitive so I often have trouble finding products that I can use for my skin care routine. Most of the time, I have a lot of red splotchy areas - mainly on my cheeks and on my nose. Since using this, I have found that the redness on my skin has been significantly reduced.It's a fairly cheap product and comes in a really large bottle that'll last for quite a while. I've been using about a thumbsized amount each time I use it, which I gently pat onto my face after I wash my face in the morning and at night.If you're looking for something to introduce to your skin care routine to help with redness, then I would recommend giving this a shot.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fernanda Mendoza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 15, 2020",
                "reviewTitle": "IMPACTADA",
                "reviewText": "Compré el toner para añadirlo a mi rutina. Estoy probándolo con la rutina de 7 skin care, que consiste en poner 7 capas de tónico por las noches después de lavar tu cara y WOW, desde el primer día amanecí radiante, con la piel mucho más suave, definitivamente más hidratada y con un glow increible! Incluso he notado una pequeña mejoría en ojeras y unas pequeñas lineas de expresión que se me hacían al despertar.Lo recomiendo. :)",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}