{
    "remaining_requests": 21400,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Paulas-Choice-SKIN-PERFECTING-Exfoliant-Facial-Lines-1-1oz/dp/B07C5SS6YD",
    "body": {
        "name": "Paula's Choice Skin Perfecting 2% BHA Liquid Salicylic Acid Exfoliant, Gentle Facial Exfoliator for Blackheads, Large Pores, Wrinkles & Fine Lines, Travel Size, 1 Fluid Ounce",
        "price": "$12.35$12.35 ($12.35$12.35 / Fl Oz) $11.70$11.70 ($11.70$11.70 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 12.35,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Paulas-Choice-SKIN-PERFECTING-Exfoliant-Facial-Lines-1-1oz/dp/B07C5SS6YD",
        "soldBy": {
            "sellerID": "AFDRC8T2FYEHK",
            "name": "Paula's Choice Skincare",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AFDRC8T2FYEHK&asin=B07C5SS6YD&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CS37G9C5"
        ],
        "asinVariationValues": [
            {
                "asin": "B07D8DBS7S",
                "variationName": "Style",
                "variationValue": "",
                "price": "$43.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41LzB9ooL8L._SS36_.jpg"
            },
            {
                "asin": "B00949CTQQ",
                "variationName": "Style",
                "variationValue": "",
                "price": "$35.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/310uP4V46lL._SS36_.jpg"
            },
            {
                "asin": "B07C5SS6YD",
                "variationName": "Style",
                "variationValue": "",
                "price": "$13.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/31tzIszvgAL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/313pgngqNAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/414jRxUuA9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51myFa51V-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51kSHrm-pxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nFjkweeoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411wUEnSVGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ai2iFrfKL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81WtbRvduoL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91MLtaIomZL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Paula's Choice Store",
            "link": "https://www.amazon.com/stores/PaulasChoice/page/557786A0-7AE5-4420-8E18-4253B57534B4?ref_=ast_bln"
        },
        "brand": "PaulasChoice",
        "merchantInfo": "Paula's Choice Skincare",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 96446,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 13 hrs 22 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 13 hrs 22 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest pickup Sunday, February 18. Order within 22 hrs 37 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "GENTLE NON-ABRASIVE LEAVE-ON EXFOLIATOR: with 2% BHA (Beta hydroxy acid) to unclog & diminish enlarged pores, exfoliate dead skin cells, smooth wrinkles & brighten & even out skin tone; Combats redness, wrinkles, aging, enlarged pores, & blackheads",
            "Dramatically improves skin's texture for radiant youthful even-toned skin; Beta hydroxy acid (BHA also known as salicylic acid) mimics the natural exfoliation process of younger skin by helping it shed extra layers while unclogging and clearing pores",
            "HYDRATE, BRIGHTEN & SMOOTH FINE LINES: Our unique, non-abrasive, leave-on exfoliant is gentle enough for daily use on all skin types; Exfoliates dead skin cells while clearing pores for a more even tone, plus it visibly reduces fine lines & wrinkles",
            "Paula's Choice facial exfoliants are gentler on delicate skin of the face & neck than an abrasive face scrub, which can cause micro-tears; A BHA leave-on exfoliator delivers hydration & can exfoliate directly inside the pore & improve how the pore works",
            "Paula's Choice Skincare makes science-backed products that work. No fragrance, no parabens, no fluff. Just effective, cruelty-free formulas that target any concern from wrinkles to breakouts."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060711"
            },
            {
                "name": "Treatments & Masks",
                "link": "https://www.amazon.com/Facial-Treatments-Masks/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11062031"
            },
            {
                "name": "Facial Peels",
                "link": "https://www.amazon.com/Facial-Acids-Peels/b/ref=dp_bc_aui_C_5?ie=UTF8&node=7792926011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2.52 x 0.75 x 0.75 inches; 1.06 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 22016"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 655439020169"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Paula's Choice"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07C5SS6YD"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #1 in Facial Peels"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 96,446 ratings"
            },
            {
                "name": "Brand",
                "value": "Paula's Choice"
            },
            {
                "name": "Item Form",
                "value": "Liquid"
            },
            {
                "name": "Skin Type",
                "value": "Oily, Combination, Dry, Normal"
            },
            {
                "name": "Product Benefits",
                "value": "Exfoliating, Radiant Skin, Even Toning, Blemish Control, Smoothening"
            },
            {
                "name": "Active Ingredients",
                "value": "Salicylic Acid, salicylic_acid"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/98a0cf5d-3ff7-49e7-b645-3bba425fc063.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3cc97166-53de-48df-8eaa-0ae62868d84c.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/7b662a7f-d22f-4ec2-9306-a353017b09c4.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e0f4289-1109-4ad6-8c30-0c6b134a8de8.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1f46fed1-10b8-4a0b-9280-ac1d58e8854d.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Audrey S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUTP43M6C7G7PADPODX2QFPDWQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16RNY0VDORBW3?ASIN=B07C5SS6YD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2020",
                "reviewTitle": "5.0 out of 5 stars If you actually understand how to use it, it's amazing.",
                "reviewText": "My skin type:- Very Dry, easily dehydrated- Oily nose- Prone to stubborn acne and closed comedones- Redness on chin and cheeks (not rosacea)I already use a nightly Tretinoin cream (.04% concentration) to help with my acne and premature signs of aging but decided with my derm that incorporating a BHA would be a good idea to help with my seriously stubborn closed comedones and some irritating textural issues. It was between this and the Cerave SA lotion and I ultimately decided on this due to the higher concentration of salicylic acid.It's moisturizing, and feels sticky for the first 5-10 minutes after application but seems to sinks in to something of a satin finish on me and I can no longer feel it on my skin. You just have to be a little patient. My skin feels well hydrated and plump after it settles and looks really smooth and my pores aren't as obvious. It sits just fine under makeup for me but I'm not a new user to chemical exfoliants so I don't have lots of dead skin pilling up or sloughing off when I use it, my skin is, for the most part, already very smooth outside the acne and CCs. Occasionally I'll apply it further down my neck/decolletage than usual and WOW do I old skin just ball up and peel right away - it's so gross but also satisfying. So those that don't exfoliate often or are new to BHA/AHAs will likely have issues with foundation until their skin adjusts (but it will adjust). My advice in those cases is to either use this at night for the first few weeks or just accept going barefaced for a little while if you can.I'd strongly suggest not applying this product over anything that you feel does not dry down fully, the times I've attempted to use it after serums or heavier products it takes forever to sink in and sometimes never fully does. I save all my serums and essences for after this has absorbed and it's far easier to work with it as a result. My steps go like this most days: ACWell Licorice toner --- PC 2% BHA --- 10% Niacinamide serum --- TO Matryxil serum --- Secret Key Black Snail cream or Syn-ake cream w/ 3 drops Stratia Fortify oil --- Sunscreen.It works fairly quickly IMO, on my neck where I typically don't apply my Tret at night I noticed the peeling and balling of dead skin on day one and on my face where I have a patch of really awful CCs I noticed them getting smaller and smoother by around day 3-4. I'm going on about 8 days now and they're barely visible unless I'm right up in the mirror and feel as if they're almost gone when I touch my fingers to that area. I do have some slight peeling of the skin around my mouth and nose but it's not terrible (likely because I already exfoliate the heck out of my skin with the tret).Some tips and things keep in mind:1)DO NOT RINSE IT OFF. I don't understand some of the top reviews advising people to do that, it says on the bottle not to rinse and nearly all chemical exfoliators are meant to be left on until the next cleansing specifically so they can do their job. If you rinse it off you're either going to prevent it from properly exfoliating or end up irritating the hell out of your skin. If you have oily skin and feel this might be heavy on you than you can probably just use this on bare skin and then sunscreen if you use in the AM or a lightweight lotion/cream and be done with it, but you need to leave it on your skin.2)You have got to use sunscreen while you're using this product! Any BHA or AHA exfoliant causes increased sun sensitivity and you have to address that in your routine. You should already use sunscreen daily but it becomes a must when you incorporate a chemical exfoliator or you risk sun damage.3)Less is more! Don't slop this on your face or soak a cotton pad in it, a little goes a long way and you'll be kicking yourself if you apply way too much and have to wait 20+ minutes for it to sink in. Use a shake or two and add more if needed but go easy.4)Expect some irritation initially. Chemical exfoliants can be harsh and rough even on sturdy skin and you have to give yourself time to adjust. Over-exfoliation is a possibility but sometimes just introducing a BHA or AHA into your routine can cause some sensitivity. Don't panic and just be gentle to your skin. Use ceramides (like Cerave Skin Renewing cream) or fatty oils to soothe your face if needed and try to stay away from any harsh products or acids like Vitamin C right after applying this to avoid really burning your face.",
                "reviewVotes": "6,100 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darlene S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGZU54AHVEEYK2ZIPKRKIZV6WQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2738GPGGM1I6B?ASIN=B07C5SS6YD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars So good!",
                "reviewText": "I have only used this twice so far spaced 3 days apart as I do tret in between and also one day break with nothing but moisturizer and wow! After just one use I saw a massive difference in my wrinkle depth under my eyes that tret was not helping with or anything else I tried. It has not dried out my skin which is great but I do use a good moisturizer after applying. I am so happy I bought this as I really am stunned at the quick results in wrinkles appearance so soon! I have seen no irritation. The only thing I don't like is the smell but once applying moisturizer over I don't notice it. Slight sting sensation for a few mins after application but who cares when you get such good results.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shelly Simoneau",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3HSKGYW6VSFHOZG656XMEX2XPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24896RAAE7ICE?ASIN=B07C5SS6YD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars An excellent product",
                "reviewText": "I have been using Eucerin Intensive Repair for awhile. I did not realize it had Alpha Hydroxy Acid in it (a very good thing). About 10yrs ago I started using Tretinoin Cream and it was a great product that complimented the Eucerin. So as my skin got used to these products I tried Vitamin C serum, hyaluronic acid and other skin products that my skin hated...then I realized that Eucerin has AHA so I looked for products with that ingredient and Paula's Choice 2% BHA (beta hydroxy acid) and it was the perfect match. So the morning after Tretinoin....2% BHA and I am peeling without effort. I also discovered Vaseline is a great exfoliator also....it helps slide the dead skin without tearing the skin. Highly recommend this product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Drier than the desert itself",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTK2NCZQOMLZV3SDOW5IGHIBQ6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMSOWYDP9XKXE?ASIN=B07C5SS6YD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "4.0 out of 5 stars Desperate",
                "reviewText": "I have had blackheads all over my nose for years, nothing ever got rid of them. Recently I used a pore strip (please I was desperate) and apart from getting more blackheads on my nose, I suddenly started getting some on my cheeks. I bought this to help because my face was resembling a strawberry. I patch-tested it (like you should every product) and began slowly incorporating it into my skincare by using it once every third day at night. DO NOT USE IT EVERYDAY, listen to me on that one. I entered the purging stage ( I broke out) which is completely normal when using a new product since your skin needs to push everything out from underneath. Remember, it gets worse before it gets better. I have been using it for about 4 weeks now and have now switched to using it every other day. I can tell it has helped. I only have 3 barely visible blackheads on my cheek in comparison to having about 12 before. On my nose, I have noticed a couple gone and a lot that have become smaller. some even on the surface. The blackheads on my nose will take longer because they are way deeper and have been there for years. Mine didn't have any weird smell, it smelt like nothing. If you are to buy this, make sure you use it at night, slowly incorporate it into your skin, and take into consideration that you will probably break out. Thats it, buy it or don't.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lex",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUIGGY3SHFIOMH6ZRCPXJCQNNPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G11WOVU0KVYS?ASIN=B07C5SS6YD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Holy Grail Exfoliant for Flawless Skin!",
                "reviewText": "Paula's Choice Skin Perfecting 2% BHA Liquid Salicylic Acid Exfoliant is an absolute game-changer for my skincare routine! This product has become my holy grail, as it's the only thing that truly helps my skin.I use it twice a week, and the results are incredible. The 2% salicylic acid formula effectively exfoliates, leaving my skin smoother and noticeably clearer. It's a lifesaver for keeping pesky breakouts at bay.What's even more impressive is the longevity of the travel-sized bottle. A little goes a long way, and I'm amazed at how this compact size lasts me forever. It's perfect for those who are always on the go.I appreciate that this exfoliant is fragrance-free and gentle on my skin. No irritation, just pure effectiveness. If you're looking for a reliable and long-lasting solution for radiant skin, Paula's Choice 2% BHA Liquid is the answer! I can't recommend it enough.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JulieJulie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 26, 2024",
                "reviewTitle": "Génial",
                "reviewText": "Ce produit est fantastique!! Après 3 semaines, je vois déjà des résultats. J'ai la peau tellement plus lisse et moins grasse! Oui, la bouteille est petite mais c'est un format voyage et ça m'a permis de découvrir un produit merveilleux. Je le recommande!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71t9dqluphL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ZNLXv8BgL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ximena",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 7, 2024",
                "reviewTitle": "Excelente producto",
                "reviewText": "Súper ligero, lo absorbe la piel rápidamente, no se siente pegajoso, para el tercer día notas diferencia en los poros.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 26, 2023",
                "reviewTitle": "ABSOLUTELY WORTH IT!",
                "reviewText": "I planned on waiting a couple of weeks before giving this product a review, however recent events persuaded me to write one sooner.After tons of research and paying almost $50 for it, I figured I'd give this product an honest try.Opening the bottle I thought, \"how much could a thin watery liquid really improve the sebaceous filaments and blackheads on my nose?\" I was wary about whether Paula's choice stuff would actually work considering I've tried so many different products to deal with my strawberry nose.But I tried it out and gave it an honest go.After about the 3rd day I noticed my pores were considerably empty. They were still the same size, but no longer filled with oily blackened gunk.I was pleasantly surprised, yet suspicious.After so many trials with other products that ended in disappointment I was cautious about whether this was actually working or not, or if the results would last. Even still, I noticed a drastic improvement in my pore's appearance.Then a coworker commented on my skin. She said it was looking \"amazing\" and particularly my nose was looking incredible. She inquired about what I was using.I'm a 30 year old man and this was an unsolicited observation about the pores on my nose. I've tried so many different things to deal with the large gunk pores on my nose (derma rolling, retinoid creams, glycolic acid peels, facial cleansers, exfoliants, etc...) however this 2% salicylic acid exfoliant has worked the best thus far.After doing some research I found out that BHA acid (salicylic aid) is a small enough molecule to penetrate deep into the pores and chip away at the dense hardened oil buildup thats inside the pores which gives them their distended appearance. Its been over a week now, and my pores are looking as empty as they've ever looked and are also shrinking.I exfoliate with an abrasive sponge in the shower and hope that continuous use of this product, along with regular exfoliation, will result in small looker pores.Even though its been only over a week I notice drastic improvements in my pore's appearance.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnkushAnkush",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 6, 2024",
                "reviewTitle": "PAULA'S CHOICE PERFECTING",
                "reviewText": "I buy this product for protecting my skin and it was amazing. There was no any side-effects by using this products. Even I had taken this product to Europe for using because it was costly there hahaha",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71sUb295daL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61E-oC1fTnL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 7, 2024",
                "reviewTitle": "Great exfoliator",
                "reviewText": "I love this exfoliator!It’s great for when my skin feels congested after a few days of wearing makeup, I use it around 2 times a week and over time it’s really helped my skin feel smoother and have less blemishes.I bought a mini one to take when I travel or stay at my partners, this is really useful!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}