{
    "remaining_requests": 21281,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Otaci-Passion-Natural-water-Hydrating/dp/B07P3GQZSN",
    "body": {
        "name": "OTACI Rose Passion 100% Natural Rose Water Hydrating Toner, Facial Skin Moisturizer Hydrating Natural Cleanser",
        "price": "$8.63$8.63 ($1.70$1.70 / Fl Oz) $8.15$8.15 ($1.61$1.61 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 8.63,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Otaci-Passion-Natural-water-Hydrating/dp/B07P3GQZSN",
        "soldBy": {
            "sellerID": "A3ML5Q34R95C4W",
            "name": "OTACI US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3ML5Q34R95C4W&asin=B07P3GQZSN&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Jamr3JRuL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41VBRZ f1OL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31BP1l5uYML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41t6JPGMSNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Bqy7n--cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ysfm4B-0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61QCZc5Zl5L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e2c3e20-280f-4558-b021-81b24bd019c3/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the OTACI Store",
            "link": "https://www.amazon.com/stores/OTACI/page/A0F38766-AE98-4DBB-B131-FBCCE96BBDBF?ref_=ast_bln"
        },
        "brand": "OTACI",
        "merchantInfo": "OTACI US",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 195,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 20 hrs 21 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "100% Natural Mediterranean Rose Water toner cleanser",
            "Facial skin rosewater moisturizer hydrating",
            "Help balancing PH levels and acne",
            "Dermatologist tested, Vegan, Cruelty-Free,Clean label , Sustainable",
            "Does not contain: Colorants, Synthetic Perfumes, Paraben, Silicon, Mineral Oils, Animal products"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b?ie=UTF8&node=11060711"
            },
            {
                "name": "Toners & Astringents",
                "link": "https://www.amazon.com/Facial-Toners-Astringents/b?ie=UTF8&node=11061931"
            }
        ],
        "productInformation": [
            {
                "name": "Language ‏",
                "value": "‎ Turkish, Turkish, Turkish, Turkish, Turkish"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3.74 x 3.74 x 3.74 inches; 5.07 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ ST392"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ August 3, 2019"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Kurtsan Holding A.Ş."
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07P3GQZSN"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#124,924 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #749 in Facial Toners & Astringents"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 195 ratings"
            },
            {
                "name": "Brand",
                "value": "OTACI"
            },
            {
                "name": "Skin Type",
                "value": "Dry"
            },
            {
                "name": "Product Benefits",
                "value": "Hydrating,Moisturizer"
            },
            {
                "name": "Material Feature",
                "value": "Natural"
            },
            {
                "name": "Scent",
                "value": "Natural Rose"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Heritage A young entrepreneur and a revolutionary scientist, Ph. Niyazi Kurtsan, planted the seeds of 'Kurtsan'​ at a compact pharmacy in Istanbul, 65 years ago with the vision of healing people through the power of nature. At a time when 'herbal medicines'​ and 'natural living'​ were just a dream to many, Ph. Niyazi Kurtsan developed pharmaceuticals, remedies and cosmetics from the miraculous plants of Anatolia, Turkey. Since 1955, Otaci has been an accomplished brand in the natural skincare, cosmetics and pharmaceutical industries. We have significantly contributed to these industries through vigorous and innovative Research and Development with the core objective of utilizing nature to make lives better for the humankind. Otaci aims to protect human health through the healing power of nature. Our vision is to be a global brand that heals people with high-quality herbal products inspired by nature. Otaci is the reliable, premium, local and the most honest natural and herbal alternative to the daily ritual of all personal care & cosmetics. The hills of Isparta in the Mediterranean are surrounded by a cloud of excitement in May. With the sunrise, farmers make their way to rose gardens of Isparta. They handpick every single one of the petals of the most delicate and valuable flowers, Mediterranean Rose, “Rosa damascena”. Our delicate roses are rushed to our pharmaceutical factory to create Otaci Rose Passion with the most valuable oils & extracts of the Mediterranean Rose, “Rosa damascena”. Rosa damascena forms a herbalist's floral ritual to purify, revive and hydrate the face and body. Made from this Mediterranean Rose, a miracle treatment that is indigenous to the city of Isparta, Otaci's skin products naturally promote beauty through formulas that optimize cellular moisture, firmness, nourishment and softness.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7674cf65-011f-4059-bbba-e1340ca94636.__CR277,0,3046,1884_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Natural and Vegan Skin Care Since 1955 Otaci Rose Passion 100% Natural Rose Water Hydrating Face Mist, Spray Rosewater Face Mist Facial Hydrating Natural Skin Otaci Rose Passion 100% Natural Rose Water Hydrating Face Mist, Spray Rosewater Face Mist Facial Hydrating Natural Skin is packed with a refreshing burst of rosewater and natural ingredients. Give your skin the hydration it deserves with the all-natural Rose Water Hydrating Face Mist. Our facial mist is the perfect pre- or post-makeup refresher and contains high concentrations of 100% pure rose water to gently soothe and hydrate your skin. OTACI Rose Passion 100% Natural Rose Water Hydrating Toner, Facial Skin Moisturizer Hydrating Natural Cleanser Concentrated and powerful, discover the power of 100% natural Mediterranean rose water toner in our original Rose Passion formula! Our hydrating toner helps to balance PH levels, acne and even redness. This is a fresh & light facial toner that refreshes and hydrates skin as it cleanses. OTACI Rose Passion Deep Hydration Face Cream Otaci Deep Hydration Face Cream is the ultimate solution for dry skin. This rich, non-greasy & gentle cream is the perfect blend of natural ingredients, including 100% pure Mediterranean rose water, pure olive oil and shea butter. OTACI Rose Passion Deep Hydration Face Cream uses only the purest, organic and natural ingredients and has a clean, cruelty-free label.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2614664e-b984-4043-974a-48ad7e46ac0d.__CR0,0,3240,3240_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c98f08c1-4198-45ce-b50d-6a367e2f8131.__CR0,0,2160,2160_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6febfdd7-e308-4648-ad1f-a517f678fb34.__CR0,0,2160,2160_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "OTACI Rose Passion Brow and Lash Serum, Lash Growth Eyelash Growth Natural Want to have natural-looking brows and lashes? THE PERFECT SOLUTION IS the OTACI Rose Passion Brow and Lash Serum, Lash Growth Eyelash Growth Natural. This vegan, dermatologist-tested, cruelty-free formula contains natural ingredients that promote eyelash and eyebrow growth. With this natural serum, you'll have the perfect eyebrows & lashes you've always wanted. OTACI Rose Passion Micellar Cleansing Water, Face Cleansing Makeup Skin Remover Wash Rosewater Hydrating Moisturizer OTACI Micellar Cleansing Water deeply and quickly removes all traces of makeup, dirt, oil, and impurities in seconds and through the use of gentle natural oils. It is not just a skin cleanser but also a refreshing toner with a light weight non-greasy formula that leaves your skin feeling refreshed, soft and smooth. OTACI Rose Passion Facial Cleansing Foam, Face Cleanser Wash Foam Skin Facial Water Rose Foaming Natural Say goodbye to dry, red, irritated skin! Our facial cleansing foam is gentle enough for everyday use and contains 100 % natural Rose oil and Rosewater. When it comes to cleansing, OTACI Rose Passion Facial Cleansing Foam is the most luxurious and effective way to remove excess oils, dirt, and makeup. It's dermatologist tested and so gentle you can use it every day. The refreshing fragrance of Rose oil will leave your skin feeling soft and hydrated.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4389124-7fe9-496e-aa74-b899bb3be377.__CR0,0,3240,3240_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/67e01211-8666-41f0-b4a8-1323251b9869.__CR0,0,2160,2160_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8e5d65fd-e7b7-4762-80ff-428cbad858e3.__CR0,0,3240,3240_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "OTACI Rose Passion 100% Natural Rose Water Hydrating Toner Otaci Rose Passion 100% Natural Rose Water Hydrating Face Mist OTACI Rose Passion Micellar Cleansing Water OTACI Rose Passion Facial Cleansing Foam OTACI Rose Passion Brow and Lash Serum OTACI Rose Passion Deep Hydration Face Cream Key Ingredients Contains Only Natural Mediterranean Rose Water Contains Only Natural Mediterranean Rose Water Natural Cleansing Base, 100% Natural Mediterranean Rose Water Natural Mediterranean Rose Extracts, Organic Certified Aloe Vera Natural Rose Water, Yarrow, Provitamin B5 Rosa Damascena, Extra Virgin Olive Oil, Shea Butter, Vitamin E, Provitamin B5, Ingredients conformed to Natural Cosmetic Standards Function 1 Revive Revive Purify Purify Moisturize Moisturize Function 2 It is 100% natural rose water, nothing else. Apply post make-up removal ritual as tonic to firm up your face and neck. Keep your skin fresh and hydrated with Otacı Rose Ritual 100% Natural Rose Water Hydrating Face Mist. Ideal for a finishing touch. Natural Mediterranean Rose Water Extracts will purify, nourish and moisturize your skin Developed in foam form for sensitive skin, it gently removes make-up, purifies the skin and moisturizes the face with delicate Rose Extracts and Aloe Vera. Promotes eyelash & eyebrow growth and strength with Rose Water, Yarrow and Provitamin B5. Nourishes your face and neck with delicate and unique rose oil in the morning and at night. Contains Extra Virgin Olive Oil and Shea Butter for deeper hydration for a younger looking skin. Form Liquid Toner Liquid Spray Liquid Micellar Foam Liquid Dropper Intense Cream Where To Apply Face Face Face Face Eyebrows and Eyelashes Face Does Not Contain Colorants, Synthetic Essences/ Perfumes, Paraben, Silicon, Mineral Oils, Animal Products Colorants, Synthetic Essences/ Perfumes, Paraben, Silicon, Mineral Oils, Animal Products Colorants, Synthetic Essences/ Perfumes, Paraben, Silicon, Mineral Oil, SLES, SLS, Animal Products Colorants, Synthetic Essences/ Perfumes, Paraben, Silicon, Mineral Oil, SLES, SLS, Animal Products Colorants, Synthetic Essences/Perfumes, Paraben, Silicon, Mineral Oil, Animal Products Colorants, Synthetic Essences/Perfumes, Silicon, Paraben, Mineral Oil, Animal Products",
                "media_link": []
            },
            {
                "media_text": "As the first step of the most natural Rosa damascena ritual, purify your skin with Rose Passion Facial Cleansing Foam and Micellar Cleansing Water. FACIAL CLEANSING FOAM Developed in foam form for sensitive skin, it removes make-up, purifies the skin, moisturizes the face with Rose Extracts and Aloe Vera. OTACI ROSE PASSION MICELLAR CLEANSING WATER It cleans your skin with natural make up removal base. Natural Anatolian rose water and extracts will purify, nourish and moisturize your skin. Revive your skin with Rose Passsion 100% Natural Rose Water Hydrating Toner and Face Mist as the second step of the all natural Rosa damascena ritual. OTACI ROSE PASSION 100% NATURAL ROSE WATER HYDRATING TONER It is 100% natural rose water, nothing else.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/adfc0445-01d6-402f-a03d-8f136ef8061c.__CR0,135,1080,1080_PT0_SX300_V1___.jpeg"
                ]
            },
            {
                "media_text": "OTACI ROSE PASSION %100 NATURAL ROSE WATER HYDRATING FACE MIST Keep your skin fresh and hydrated with Otacı Rose Passion 100% Natural Rose Water Hydrating Face Mist. Ideal for a finishing touch. Finish off the magical Rosa damascena ritual with Rose Passion Deep Hydration Facial Cream, Nourishing Hand & Body Cream and Eyebrow & Eyelash Serum. OTACI ROSE PASSION DEEP HYDRATION FACIAL CREAM Nourishes your face and neck with delicate and unique rose oil in the morning and at night. Contains Extra Virgin Olive Oil and Shea Butter for deeper hydration for a younger looking skin. OTACI ROSE PASSION NOURISHING HAND & BODY LOTION Hydrates your hands and body with Argan Oil, Shea Butter, Rose Extracts and Vitamin E. OTACI ROSE PASSION EYEBROW & EYELASH SERUM Promotes eyelash & eyebrow growth and strength with Rose Water, Yarrow and Provitamin B5.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-brand-media/91f3b4317f82e5349298faca6fca9c86.w1920.h2400.__CR0,240,1920,1920_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "We are vegan certified. Certifying Body: The European Vegetarian Union License No TR1706265 Date of Certification: 07/20/2018 No harm induced on animals. Certifying Body: The European Vegetarian Union License No TR1706265 Date of Certification: 07/20/2018 No Paraben No Alcohol No Perfume Single Sourced Dermatologically tested Packaging Recovery Organisation Europa Certifying Body: ÇEVKO Çevre Koruma ve Ambalaj Atıkları Değerlendirme Vakfı Certification Number: 1295 Year of Certification: 2019 Rose Passion is gluten free. Certifying Body: The European Vegetarian Union License No TR1706265 Date of Certification: 07/20/2018",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/0869970d-dcc5-48fd-9e75-103b045a21f6.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/890c4d86-792d-45eb-b9c7-5f168a61187d.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/a8ff65cc-8eeb-468d-8e45-ee4b1f10b4ab.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/68a80dcf-f9e1-478f-974a-336d581971c8.__CR0,0,220,220_PT0_SX220_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7674cf65-011f-4059-bbba-e1340ca94636.__CR277,0,3046,1884_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2614664e-b984-4043-974a-48ad7e46ac0d.__CR0,0,3240,3240_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c98f08c1-4198-45ce-b50d-6a367e2f8131.__CR0,0,2160,2160_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6febfdd7-e308-4648-ad1f-a517f678fb34.__CR0,0,2160,2160_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4389124-7fe9-496e-aa74-b899bb3be377.__CR0,0,3240,3240_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/67e01211-8666-41f0-b4a8-1323251b9869.__CR0,0,2160,2160_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8e5d65fd-e7b7-4762-80ff-428cbad858e3.__CR0,0,3240,3240_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/37b6552b-50d8-4629-99f5-3d964bdc8299.__CR250,0,500,1000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/d31fce30-5df1-4a43-b207-eb914c8eceb9.__CR250,0,500,1000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/c4acb209-dc5c-4f7f-9536-a563cfc8a543.__CR250,0,500,1000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/a5e7a24f-9825-422f-8398-54df5dc41e84.__CR250,0,500,1000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/3e0c5bc2-043c-4b72-a7f2-49c279e087e9.__CR250,0,500,1000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/9b61aa63-2116-4575-84f7-48a6f03023e4.__CR0,0,750,1500_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/adfc0445-01d6-402f-a03d-8f136ef8061c.__CR0,135,1080,1080_PT0_SX300_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-brand-media/91f3b4317f82e5349298faca6fca9c86.w1920.h2400.__CR0,240,1920,1920_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/0869970d-dcc5-48fd-9e75-103b045a21f6.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/890c4d86-792d-45eb-b9c7-5f168a61187d.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/a8ff65cc-8eeb-468d-8e45-ee4b1f10b4ab.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/68a80dcf-f9e1-478f-974a-336d581971c8.__CR0,0,220,220_PT0_SX220_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lakisha Locus",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGECEG5CTD3UWMR2R2KUO525JNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAD8UILRQOWHX?ASIN=B07P3GQZSN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars As Described",
                "reviewText": "Love this toner. It’s gentle enough to where I’m not stripping my face or aggravating my skin. Some toners will burn if I’ve washed my face too much, but not this one. I love it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wistful Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGZ7Z4HD7HUGMH4KEXN5IHOMRJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z6296MRD3LPL?ASIN=B07P3GQZSN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2023",
                "reviewTitle": "5.0 out of 5 stars I have super reactive skin, and this is perfect!",
                "reviewText": "I keep this in the fridge, and use it both as a toner in the morning, and as a refresher in the afternoon. It's lightly scented, as it should be, and I've never had anyone notice the scent. But I do, and it's lovely.I have super reactive skin, I blister, develop hives, and/or get contact burns from most toners. This is perfect, soothing, and it balances skin ph, so my skin is calmer longer.Great product, I'm a fan.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG72BQHLM5HLNVQ4MGZWBAUZSONQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFZDSH2WAXSIK?ASIN=B07P3GQZSN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "5.0 out of 5 stars A good toner that is soothing.",
                "reviewText": "I use rose water as a toner after cleansing. It is very soothing.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sabina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESE7ACFYDRW6ZAKUCBUGSYDKSBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIV1E78KG9P8W?ASIN=B07P3GQZSN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 18, 2023",
                "reviewTitle": "4.0 out of 5 stars Ocati Rose Passion Toner",
                "reviewText": "I am enjoying this toner, it's light and has a pleasant fragrance, very subtle.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFVEKPYDWHTMHISE5PXQP53I4TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EBKD4ROYIX1J?ASIN=B07P3GQZSN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 17, 2023",
                "reviewTitle": "5.0 out of 5 stars NewFind",
                "reviewText": "So pleased this rose water does what it is supposed to do for your skin. Not only a good moisturizer but it smells heavenly & very natural.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "No name",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJUT6VCLBVVUDCTRTQBZ6ATDE4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UWGPLE7LZ6JY?ASIN=B07P3GQZSN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Great product",
                "reviewText": "Effective",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "N.A.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXUTSSXW7TBRW7CK2ZTF37LLPSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLNOABCOM6QF?ASIN=B07P3GQZSN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Best rose water",
                "reviewText": "I have tried and tested several brands of rose water, this one is by far the best, and genuine",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gerard Rolland",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYZUQWIVWDDHWQ4AO4UIWF2QSKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLEFNB79NCQMC?ASIN=B07P3GQZSN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2023",
                "reviewTitle": "5.0 out of 5 stars half content leaked",
                "reviewText": "will not order this again",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Loli",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 13, 2023",
                "reviewTitle": "Hidrata",
                "reviewText": "Hace poco la estoy usando . Me gusta",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ines Schöke",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 1, 2023",
                "reviewTitle": "Sehr gutes Produkt",
                "reviewText": "Gutes Produkt, spendet Feuchtigkeit und guter Preis5!Schnelle Lueferung!Kaufe es wieder.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 10, 2023",
                "reviewTitle": "Ottimo prodotto",
                "reviewText": "Senza alcol, senza profumo e senza tutte quelle schifezze che di solito si trovano nei prodotti cosmetici.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Giovanni",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on October 15, 2023",
                "reviewTitle": "ottimo",
                "reviewText": "ottimo prodotto....",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jose luis palomo muñoz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 27, 2023",
                "reviewTitle": "perfecto",
                "reviewText": "le va bien a mi mujer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$14.67",
                "sellerName": "OTACI US",
                "sellerRating": "5"
            }
        ]
    }
}