{
    "remaining_requests": 21435,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/TruSkin-Daily-Facial-Super-Toner/dp/B016L9QJJY",
    "body": {
        "name": "TruSkin Daily Facial Super Toner – for All Skin Types with Glycolic Acid, Vitamin C, Ocean Minerals and Organic Anti Aging Ingredients, 4 fl oz",
        "price": "$14.39$14.39 ($3.60$3.60 / Fl Oz) $13.59$13.59 ($3.40$3.40 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 14.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/TruSkin-Daily-Facial-Super-Toner/dp/B016L9QJJY",
        "soldBy": {
            "sellerID": "A3PYXGO7OVEV2N",
            "name": "TruSkin",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3PYXGO7OVEV2N&asin=B016L9QJJY&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save an extra 25% on your first Subscribe and Save order.",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Q0-O35dWL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51QCzbUpqSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41TBK0i4cwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mVb-lPBLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/B1DlluNqL1S.png"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cfcc98b9-eaf9-4215-8856-b01ac5d8a89c/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the TruSkin Naturals Store",
            "link": "https://www.amazon.com/stores/TruSkin/page/1CD9F377-043B-46C0-B2B3-6F7CC8593FB0?ref_=ast_bln"
        },
        "brand": "TruSkin",
        "merchantInfo": "TruSkin",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2961,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35. Order within 20 hrs 40 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "TURBO CHARGED FACIAL TONER: Formulated with Ocean Minerals, MSM and Matrixyl 3000, this toner is an essential missing step in most people's routines for refreshed, healthy-looking skin",
            "POTENT BEAUTIFYING INGREDIENTS: Power-packed with Peptides and known anti-aging ingredients, our Super Toner couldn't-be-simpler for improving your skin routine",
            "NOURISH, BALANCE, REFRESH & TONE: Not your ordinary witch hazel toner. Skin is freshened & toned with Organic Aloe & True Witch Hazel Extract, nourished by Deep Ocean Organic Mineral Complex, softened and smoothed by Glycolic Acid & Vitamin C",
            "CRUELTY FREE & MANUFACTURED IN THE USA: TruSkin is Leaping Bunny-certified cruelty free–and all our products are manufactured and bottled in the USA for guaranteed freshness",
            "THE TRUSKIN DIFFERENCE: If for any reason you decide this product isn't a fit for your skin, we're here for you. Each purposefully balanced medley of key antioxidants, super-nutrients and nourishing botanical actives enhances efficacy and delivers skin-friendly benefits, without added additives or fragrances"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060711"
            },
            {
                "name": "Toners & Astringents",
                "link": "https://www.amazon.com/Facial-Toners-Astringents/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11061931"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.5 x 1.5 x 6.5 inches; 5 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 784672000000"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ October 13, 2015"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ TruSkin Naturals"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B016L9QJJY"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#25,129 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #174 in Facial Toners & Astringents"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,961 ratings"
            },
            {
                "name": "Brand",
                "value": "TruSkin Naturals"
            },
            {
                "name": "Item Form",
                "value": "Liquid"
            },
            {
                "name": "Skin Type",
                "value": "Normal"
            },
            {
                "name": "Material Type Free",
                "value": "Sulfate Free, Phthalate Free, Paraben Free"
            },
            {
                "name": "Product Benefits",
                "value": "Revitalization"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/419aa2b0-2880-4f2b-b9e9-a8bbe643a058.__CR0,0,600,180_PT0_SX600_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0d2b2f69-ec2f-48de-a13d-01c024ae258b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f8433a07-0004-4b68-8175-5f2b1b63213c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f93b5197-6ca8-49f5-b3b1-e3b5beb55d07.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/48427b0c-a4ea-4c4f-a18e-819649bba9d7.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Britney ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBPQAJJ2G3OQ4V5OEJAY6QA72AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD5T3FR2MSS09?ASIN=B016L9QJJY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars So far, only positives",
                "reviewText": "I’ve had the serum for a while, so I decided to get the toner as well. I’ve definitely felt my skin become smoother and softer in the recent weeks. As someone with dry and sensitive skin, this is a good sign.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Traci",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXEHT4MX4CCU6QTBQGP6ICRAOTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U1RHRBAW0MLY?ASIN=B016L9QJJY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Addition to Skin Care Routine",
                "reviewText": "The spray is too large. I wish it were more focused as I feel as though I am wasting product.The scent is okay but not my preference as it has some strong earthy undertones.However, the spray does moisturize well and makes me skin feel nice.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ali",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5KOIWWXWZ42OMHSEEBEM7PUKKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F83P6X7VZO5O?ASIN=B016L9QJJY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "4.0 out of 5 stars old was better",
                "reviewText": "The old formula was better this one doesn't feel as good but im not ready to look for a new toner",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SuB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2LLUCBHX2L6ZH4N4S5Z6H7UHPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MHPUQOIMTHGJ?ASIN=B016L9QJJY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 27, 2017",
                "reviewTitle": "5.0 out of 5 stars Excellent Line w exceptional customer service!",
                "reviewText": "My routine consists of each morning and night I use the cleanser to wash my face, I dry it and use the toner, then the vitamin C serum (just a drop or two is enough!), then the HA serum, let them sit for a minute or two, and then finish with my moisturizer. I don't use make up daily, but when I do I just do my regular makeup after the moisturizer. Honestly I've noticed that since using these I haven't felt the need to use foundation. I don't have flawless skin, but with TruSkin I feel comfortable enough in my own skin that for the most part on a daily basis, I just leave for my office with the moisturizer as my last thing.It's been well over a month since I bought this and have been using this-along with the face cleanser, Vitamin C serum, HA Serum and moisturizer. I have always had skin that breaks out and even other expensive products I've tried haven't worked. They usually clog my skin and make my face either super oily, super dry or just not work at all. As a result I've found that products that the less I use on my face, the better my skin is. I used to have cystic acne some years ago for which I would get facials whenever I could afford them (I was a student in college at the time so had a right budget) but thankfully I found an excellent estestician who did wonders for my skin. She's the one who helped me to learn about my own skin and help me figure out what works and what doesn't. She used to use dermalogica products on me which worked great. Fast forward some years, I'm now living in the south with a different environment than MI weather and I think due to that -or maybe just getting older-I feel dermalogica doesn't work as well on me anymore. As a result I wanted to find products that made my skin look and feel as great as it did each time after my facials.When I moved down here, I found another estetician who recommended a different line, which I tried (was not the cheapest either!) but I didn't like it at all so I asked her for a different recommendation. She told me to try out TruSkin from amazon and see how I liked these -and am I glad I did!I could see and feel the difference almost immediately. TruSkin is truly awesome for my skin. It's made my skin more supple and beautiful. It doesn't look as dull or bleh as it used to. I'm almost 30 and while that's still very young, I had started feeling like my skin needed some love (besides the facials I never really invested in good moisturizers and skin care really). And since I've been using it for about 2-3 months now I can honestly say this is not one of those products that feel good in the beginning week or so and then just does nothing -each time I use these, I feel great!Lastly I have to make a comment about their excellent customer service. By far the best experience I've ever had. I contacted TruSkin to ask if they would be willing to send me a dropper for my HA serum (it comes with a pump) with a reorder of the HA serum which had opened and spilled during travel, and they responded right away saying they would send me the dropper and another bottle of the serum free of charge. I wasn't expecting that at all! I spoke with someone named Erica, who has truly been wonderful (I hope TruSkin recognizes her for her excellent service)! I would-and DO-recommend TruSkin to all my friends! The quality of the product in addition to their customer service has made me a loyal customer!",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lilac Roe PinLilac Roe Pin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5UFUTELKFDXDVYOB6PZTL7VXXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HH2O81NGB22V?ASIN=B016L9QJJY",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 16, 2018",
                "reviewTitle": "3.0 out of 5 stars Not for my skin but...",
                "reviewText": "Final update June 2018:While this product doesn't work for my skin, the quality shows to me in the consistency, and absorption. I love the spray bottle and how the product soaks into the skin, though for me it's some sort of allergy. I'm adding stars for my absolutely positive customer service experience. The company took the time to reach out to me and help me! Because of this, I am a believer in their customer service and will now feel comfortable giving their other products a try. You'll have nothing to lose with this brand, they stand by their name and their customers. Good people!---Update May: Does me more harm than good. Was really hoping this stuff would work, but it must be made for different skin than mine. Those bumps I mentioned before always appear with the use of this and began appearing on my neck, behind, above and under my ear even if avoiding those areas somehow. Causes me dermatitis!Update April 4th:allergy/irritant. This seems to do me OK in my face but not my upper forehead where it begins to become the hair line. Everytime for some reason it becomes red with a few large bumps, like pimples but they never produce substance and eventually dry out. I will not repurchase this stuff because it really doesn't do much for me but I imagine it's a good product for some. I still use it on my face every now and again.Update March 18:I like this stuff however, after a few days use I found it drying and gave me an odd breakout. My dryness came with dry pimples which are a little hard to treat. I will continue using this but not regularly as its too much for my skin. After my break out heals I will use it a few times a week rather than everyday and adjust from there.Seems to be a good toner! I noticed it smells familiar and reminds me a bit of a combo of my Avalon vitC toner and this vitamin (I think B vitamin or maybe placenta) stuff I used to treat my hair with. It's an expected smell for a toner, an OK smell and it works well so far. Slight sting which quickly leaves when drying. Will update!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71ZtiLQUmSL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 16, 2023",
                "reviewTitle": "Very gentle and effective",
                "reviewText": "I just bought my second bottle. The first one lasted me from December until July.I bought this because I wanted vitamin C in my skincare routine, but it’s hard to find it without Vitamin E in the mix. My spouse is allergic to Vitamin E. I honestly was not expecting such a difference. I have always been prone to small but constant breakouts around my nose and mouth area. They are gone now. They came back about a week after my the first bottle ran out, but we’re gone days after my second bottle came.And it requires very little. A spritz or two once or twice a day.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wande Williams",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 27, 2022",
                "reviewTitle": "Smell is horrible and toxic",
                "reviewText": "No difference on my face",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 13, 2017",
                "reviewTitle": "Love it.",
                "reviewText": "It works wonders for my skin. Love it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melia Belli ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 21, 2023",
                "reviewTitle": "Skin looks and feels fabulous!",
                "reviewText": "I am very pleased with this project and highly recommend. It is gentle on my sensitive and rosacea-prone skin.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ken",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 24, 2023",
                "reviewTitle": "Happy",
                "reviewText": "Girlfriend wanted it she’s happy so I’m happy",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}