{
    "remaining_requests": 21460,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Witch-Hazel-Face-Toner-Hydrating/dp/B00OABVT1E",
    "body": {
        "name": "Rose Water Toner for Face - Face Toner for Women, Skin Toner Rosewater Facial Toner, Rose Toner Alcohol Free Witch Hazel Toner Astringent for Face, Agua de Rosas Rose Water for Face Hydrating Toner",
        "price": "$23.74$23.74 ($3.77$3.77 / Fl Oz) $22.49$22.49 ($3.57$3.57 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 23.74,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Witch-Hazel-Face-Toner-Hydrating/dp/B00OABVT1E",
        "soldBy": {
            "sellerID": "A17119QUPKBK8A",
            "name": "Beauty by Earth",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A17119QUPKBK8A&asin=B00OABVT1E&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07D6STL96"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save 17%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Z TFqX9AL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41VArWU7bVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415OmCt926L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51--UAQwnPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41KhNkm1JAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41cbrrHzUEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZEcY2EUcL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eb82d6d8-4394-4105-8a62-291e3cd7921f/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Beauty by Earth Store",
            "link": "https://www.amazon.com/stores/BeautybyEarth/page/337A7055-99EE-449E-BD27-8B8025EDC8C7?ref_=ast_bln"
        },
        "brand": "BeautybyEarth",
        "merchantInfo": "Beauty by Earth",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 614,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 7 hrs 58 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "100% Natural Facial Toner: This skin toning liquid leaves your skin feeling toned, fresh and ready for anything. Apply after face wash and before moisturizer. Our alcohol free formula will tone, shrink pores and leave your skin feeling refreshed.",
            "HYDRATING AND DETOXIFYING: Mild, gentle and moisturizing. Suitable for oily, sensitive, dry, or combination skin types. Gentle enough for sensitive faces and for problematic acne prone or oily skin. Beauty by Earth's Face Brightening Toner is also great as a makeup remover.",
            "MADE WITH ORGANIC INGREDIENTS: We use Organic Witch Hazel, Organic Rose Petal Water, Natural Glycerin, Organic Aloe Vera and Organic Cucumber",
            "NO CHEMICALS: Paraben free, gluten free, soy free, GMO free and not tested on animals. No artificial perfumes that might cause irritation. Perfect for any anti-aging skin care regimen.",
            "ADDED BENEFITS: Use this for minimizing pore size, make up remover, mid day cleaning or freshening and so much more. Try our best selling botanical toner and feel the spa-like bliss on your face and body."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060711"
            },
            {
                "name": "Toners & Astringents",
                "link": "https://www.amazon.com/Facial-Toners-Astringents/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11061931"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.75 x 1.75 x 7.25 inches; 8.5 Ounces"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 793936916926 850452007085"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Beauty by Earth"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00OABVT1E"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#128,855 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #771 in Facial Toners & Astringents"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 614 ratings"
            },
            {
                "name": "Brand",
                "value": "Beauty by Earth"
            },
            {
                "name": "Item Form",
                "value": "Liquid"
            },
            {
                "name": "Skin Type",
                "value": "Oily, Acne Prone Skin, Combination, Sensitive, Normal"
            },
            {
                "name": "Material Type Free",
                "value": "Dye Free, Sulfate Free, Phthalate Free, Alcohol Free, Paraben Free"
            },
            {
                "name": "Product Benefits",
                "value": "Hydrating,Moisturizer,Moisturizing"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Have you ever read the list of ingredients on the back of some of the most common brands of beauty and skin care products? Ever wondered why there were so many ingredients that were unrecognizable or completely impossible to pronounce? Have you ever read a list of ingredients and gotten a strange feeling in your stomach, like maybe some of the items you just read aren’t all that “good for you?” Maybe you’ve read a list of ingredients and seen items that you know are harmful to one’s health, or even downright carcinogenic? You’re not alone. Did you know that your skin is your largest organ? Everything that you put on it is absorbed right into your system. That’s why it’s shocking to see exactly what gets put into mainstream personal care products. Even the most everyday items, like face wash, sunscreen, facial toner, and lip balm, can be filled with toxic substances. Thankfully, there’s a better way. Organic, natural skin care products that nourish your body without disrupting its natural state. That’s why we’re here.",
                "media_link": []
            },
            {
                "media_text": "Let Your Inner Beauty Shine Through Light, fresh, clean, refreshed… Do those words describe your skin? They will once you start using facial toner with rose water! This light, bright, and refreshing spray helps clear away excess dirt, oil, and dead skin that may be on your face after washing. It also helps nourish your skin, reduce redness, swelling, and irritation, helps relieve sun and razor burn, and just feels really, really good.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/7e94cd09-cc45-4314-b9f5-d91fb74c1554.__CR0,0,2000,2000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "There's No Going Back What do we like best about our facial toner with rose water? Besides the fact that it helps make complexions look their best, makes pores smaller, balances skin pH, is easy to use, and smells incredible, it’s made with 100% natural and organic ingredients. Everything in the bottle (and, now that we think about it, the bottle itself) is sustainably sourced and entirely cruelty free. There’s really no better way to care for your face. Once you start using our toner, you won’t want to go back!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/0301287d-a18e-4e45-a4ae-31600b9cf7c5.__CR29,0,937,937_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "4 Fast Steps to Better Looking Skin How to Use Facial Toner with Rose Water Wash your face using your favorite soap or cleanser. For bonus points, use a konjac sponge.Use the spray bottle to apply a few spritzes of toner to your face and decollete. Alternately, you can spray several times onto a cotton round and apply indirectly.Follow up with your favorite facial moisturizer, then continue on to your makeup routine.Spray toner over your makeup throughout the day to keep your face feeling fresh, light, and glowing.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/0486ec9f-dc66-40c4-a952-cebf6efee10e.__CR0,0,2000,2000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "You'll Love it, We Promise We’re all about the good stuff. Our facial toner never contains phthalates, parabens, sulfates, “fragrance,” or any other sketchy junk. Instead, we use organic aloe vera juice, organic witch hazel extract, organic cucumber fruit extract, and rose water to give your face a natural, cruelty free treat.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/29b4b676-5909-477f-8c77-50610121f28b.__CR0,0,2000,2000_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/38313ace-e76d-41fb-8fa2-32e66f851e73.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/7e94cd09-cc45-4314-b9f5-d91fb74c1554.__CR0,0,2000,2000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/0301287d-a18e-4e45-a4ae-31600b9cf7c5.__CR29,0,937,937_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/0486ec9f-dc66-40c4-a952-cebf6efee10e.__CR0,0,2000,2000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/29b4b676-5909-477f-8c77-50610121f28b.__CR0,0,2000,2000_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Aisling",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQUOXHJMRRILD5FDOYLYWBZGENQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19HYJJIKXZ80B?ASIN=B00OABVT1E",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 21, 2015",
                "reviewTitle": "5.0 out of 5 stars Fantastic, Inexpensive Natural Toner",
                "reviewText": "This is a fantastic, inexpensive natural toner, and it smells great. I normally don't use toners so I don't have anything else to compare it to. The closest thing to a toner that I have used is a softener from a high end brand, which I am not going to name (am I allowed to mention other brands in my Amazon reviews?). When I first used the softener, which is $50, I thought, \"WOW this is amazing!\" because it literally softens the skin. But since it is, after all, $50, I wanted to find a cheaper (and definitely more natural) alternative. I stumbled on this facial toner while looking for aloe vera products on Amazon and decided to give it a go.So how did this approximately $20 toner compare to the $50 softener? Pretty well I would say.The way softener works is that it prepares your skin for moisturizing, and it allows the skin to absorb more products. It also helps remove dirt, makeup, and soap residue. It's quite similar to a toner. So here's a comparison breakdown between Beauty by Earth toner and the high-end softener:1) Is it moisturizing?True to its name, the softener really softens and takes away that dry feeling I normally get after cleansing. The toner does moisturize to a certain extent. But make no mistake, the moisturizing power does not match that of the softener (keep in mind that this softener has quite a lot of chemicals in it to make that happen).2) Is it refreshing?Both refresh the skin quite well. However, I prefer the toner because it smells so good! I put the toner in the fridge too, and that's added bonus for the hot weather (I live in California).3) Does it clean well?Both clean well. I normally don't wash my face with soap in the morning, so the toner is perfect for me as a morning cleanser and refresher. So far, I am loving this quick, simple experience.4) Price?Obviously, the toner wins here.5) Ingredients?Again, the toner wins with its natural and organic ingredients.6) Overall experience?Although I liked the softener, it didn't really improve my skin. I ran out of the softener so I stopped using it, and my skin certainly doesn't miss it. As for Beauty by Earth's toner, I wouldn't say that it changed my life. However, I do notice the overall improvement in my skin tone after using it. My skin looks brighter, like it's glowing from the inside out. Side note: I did start adding other aloe vera products to my skin care routine and that probably helped too.In conclusion, if you're looking for something to freshen up your skin or for a quick cleanser or quick moisturizer (probably will work better for someone with oily skin than dry skin), give this toner a try!",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ryan Terry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNDRTPWU7KJW4C36YLASGPLVHOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KK7AM7DJPTBW?ASIN=B00OABVT1E",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2016",
                "reviewTitle": "5.0 out of 5 stars Well worth the premium",
                "reviewText": "After a year of using witch hazel astringent pads and putting up with that awful smell, thinking it was good just to be using something all natural and alcohol-free and all that, I realized there has to be something better.First off, I knew I wanted to ditch the pre-moistened pads. Like most other things, you pay for this added \"convenience\", and applying a bit of product to a cotton pad isn't nearly hassle enough to justify paying for it. On top of that, most astringent pads are very thin and abrasive, which is a real problem if you have a beard or even just stubble.So I thought maybe I'd try a bottle of witch hazel extract, but I really dislike the smell, so somehow along the way I stumbled upon this. I read about the benefits of rose water and witch hazel, how some people prefer one or the other for various reasons - but this one combines them both, and it has all the natural benefits to go along with it. Sure, it's a bit pricier than some alternatives, but skimping on skin care is usually only a temporary habit - you buy something on the cheaper end of things, use it for a while, realize you're dissatisfied, then pay a few bucks more and find the difference is noticeable and more than worth it.So I ordered a bottle of this stuff along with Delon 100% Cleansing Cotton Rounds, which seemed to be the best value and I still believe it is. In the morning I'll shower, use Anthony Logistics Glycolic Facial Cleanser, shave using a safety razor and Truefitt & Hill cream, then follow up with an alum block, Beauty by Earth Facial Toner, and Anthony Logistics Oil Free Facial Lotion. Summer, Winter, whenever - this routine works for me. I also use this Facial Toner when I get home from work, just as a relaxing refresher because it's quick, easy, and feels nice.The aroma is definitely on the rose-y end of the spectrum, which I thought might be a put-off, but it's not a scent that lingers, so you don't have to worry about using this and walking around smelling like a bed of flowers. Whether you love it or hate it, either way, it's a big step up from that pure witch hazel funk.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ángela",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 7, 2016",
                "reviewTitle": "Me encanta",
                "reviewText": "Primero decir que mi piel es ultra sensible y algo seca, tirante después de lavarla.Después de probar tónicos tanto de farmacia como Sisley, Biotherm, Clarins etc. este es el único al que le he encontrado efectos que merecen la pena.De los demás simplemente puedo decir que refrescan un poco, huelen bien y eliminan algo de suciedad o restos de desmaquilladores, por lo que si no los uso no me necesarios. Sin embargo este tónico ha dejado mi piel agradablemente hidratada y elástica (y perfumada) después de lavarme la cara, que sin él me quedaría seca y tirante hasta echarme la crema (he usado un jabón de Lancaster). Se siente como si hubieses aplicado un ligerísimo aceite o crema (ojo, que no es aceitoso, me refiero al efecto sobre la piel)Refresca estupendamente al volver de la calle sudorosa, y al pasar el algodón se ve lo mucho que es capaz de limpiar, tanto como un agua micelar (no la he usado llevando maquillaje).El frasco, de plástico,no lleva atomizador, hay que trasladarlo a otro si lo quieres usar de esta forma, lo bueno es que uno pequeño cabe en el bolso y así se aprovecha mejor en verano.Puede usarse en el area de los ojos, para mí fundamental. El olor es estupendo, destacando el aroma a rosas con algo más.En resumen, piel cómoda, suave, sin agresiones producidas por el alcohol que lleva la mayoría, poros cerraditos. Lo recomiendo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on October 31, 2016",
                "reviewTitle": "refrescante",
                "reviewText": "es muy refrescante y huele genial, aunque me gustaría que fuera en forma de spray pero esta bien.la aconsejo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nat Bee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 4, 2016",
                "reviewTitle": "Very gentle and lovely scent",
                "reviewText": "Looooove it! Smells so nice. Gentle. Great as toner and for insect bites.I have purchased several Beauty by Earth products on Amazon.ca, and I love them all.This toner is very gentle on the skin and has so many uses. I also open it sometimes just to smell it. It really is like \"smelling the roses.\"I use it as a toner in my daily skin care routine. Works better than any other toner I have used in the past. Plus it is all natural. I am usually quite sceptical about products claiming to be organic. I usually do not expect it to work as intended or think it will contain \"natural\" ingredients that have no place being in skin products. Just because it says 100% natural does not mean it is safe for the skin. This toner, however, is. I have combination skin, and this does not make my face oily at all. It is hydrating but not greasy.I have used it on insect bites so itchy they kept me up at night. I just poured it onto a cotton ball and pressed it on the skin for a while. Did the trick! Soothes the itch.My only \"regret\" is not getting this toner in the available spray format. I actually wonder why the toner is offered in two formats. It would be nice to just spritz it on my face on hot days or to relieve itchy skin or sunburns. I do not want to risk putting the toner in a cheap spray bottle and alter it's effect.I also have the clay face mask, aloe Vera gel and Beautyful makeup bag. I can't wait to try the newly added Beauty by Earth face wash and face scrub.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 30, 2021",
                "reviewTitle": "Refreshing and it works!",
                "reviewText": "I initially bought the smaller spray bottle of this product which was a little cheaper, just incase I didn't like the product, or it didn't work for my somewhat now older skin, which can be a bit of everything including battling enlarged pores. Well I just bought my 2nd order of the larger non- spray bottle as a refill for my spray bottle, because this spray is wonderful. It has helped my pores become smaller, it boosts my other facial products, as I generally spray it on before and after anything I use for aging skin. This toner also boosts my fresh face look when I'm not wearing makeup, and has helped my morning glow. It has helped clear up any blemishes or new scaring which would take months to clear up, but now it's just weeks. I cause my skin to feel alive and ready for the day. Corny but true! 😀",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffanie McIntee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 5, 2020",
                "reviewTitle": "Great product!",
                "reviewText": "UpdateSo I have purchased 3 bottles so far.This product has multiple uses. I have used it for my pimples, and cystic acne. I have also used it on sunburns, bruises. I even use it to clean my dogs ears ( I put a small amount on a cotton pad and clean inside the ear). I even had a cyst that I was trying to get rid of and after using it 3 times in one day the cyst popped. I rave to everyone about this product and I recommend it to anyone that has acne, pimples etc. As far as face acne it will take a few weeks to clear up but once it does your face feels amazing. Make sure you have a good moisturizer.This product is truly amazing. I have battled cystic acne, eczema and rosacea and nothing has worked. I've been using this toner for over a month and it has reduced my acne, and any dryness. I only use it in the morning after washing my face. My skin tone has evened out and I don't need to wear foundation. Good product I will be ordering again.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}