{
    "remaining_requests": 7134,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Compatible-Stanley-Accessories-Neoprene-Travelling/dp/B0CLR487L1",
    "body": {
        "name": "Water Bottle Holder with Strap and Handle Fits for Stanley 40 oz Pouch Holder with Adjustable Shoulder Strap, Neoprene Sleeve Water Bottle Carrier Bag for Hiking Travelling Camping",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Stanley-Adjustable-Shoulder-Neoprene-Travelling/dp/B0CLR3S7QW",
        "soldBy": {
            "sellerID": "A1KFTOPGYF3SGI",
            "name": "Lunakj",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1KFTOPGYF3SGI&asin=B0CLR487L1&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CLR3S7QW"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CLR487L1",
                "variationName": "Color",
                "variationValue": "black",
                "price": "$9.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41iMUP1yiSL._SS36_.jpg"
            },
            {
                "asin": "B0CLR3FN4W",
                "variationName": "Color",
                "variationValue": "white",
                "price": "$9.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41SLEjX9CmL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41iMUP1yiSL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41gTXD-UaGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51MqedkeZdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yBXVDKSAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PYEjl3jxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bkSdrmG8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/819jT7kzdWL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/18ba26cc-554b-4045-b919-609ede6c966f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8d7946d7-1005-4943-9780-c8f225181880/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: futaiphy",
            "link": "https://www.amazon.com/futaiphy/b/ref=bl_dp_s_web_120127316011?ie=UTF8&node=120127316011&field-lbr_brands_browse-bin=futaiphy"
        },
        "brand": "futaiphy",
        "merchantInfo": "Lunakj",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 6,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 6 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Specially Designed for Stanley Tumbler 40 oz】The water bottle holder with strap specially designed fits for Stanley Quencher H2.0 40 oz and Stanley Adventure Quencher 40oz. This water bottle holder made of excellent neoprene material, Working great in absorbing messy sweat to avoid dripping on the table or seats. The bottom three-dimensional cutting, more than other cup sleeve to fit the design, solid and not easy to fall. All-round Protection for Stanley Cups.",
            "【Premium Neoprene Material 】Water bottle carrier bag made of excellent neoprene material, Specifically designed for stanley cup 40 oz, this Stanley pouch ensures a soft yet sturdy shield against scratches and dents. Water bottle holder has a unique design that holds your cards and a cell phone of any size, and is finished with an in-built key chain and removable shoulder strap & handle strap for convenient hands free carrying!",
            "【With Straw and Straw Cover 】 Equipped with a stanley cup accessories silicone spill stopperand straw, which can prevent the straw from being contaminated by dust in the air, keep the straw and cup hygienic, and allow you to drink with confidence at any time.The straw made of the same food-grade Tritan material as the original, BPA-free, odorless, wear-resistant, hard, thick and reusable.",
            "【Suitable for any occasion】 If you don’t like to use the shoulder strap, the extra handle strap is the other choice to releases your shoulder. Whether you're traveling, commuting, enjoying outdoor adventures like hiking, camping, or attending sporting events, this water bottle holder with strap fits seamlessly into your lifestyle. Perfectly suited as a thoughtful Christmas gift for avid Stanley tumbler fans.",
            "【PRODUCT GUARANTEE】 This water bottle holder for stanley 40 oz tumbler is your best choice. Enhance your Stanley cup accessories experience with our set including : 1set silicone spill stopper, 2 straws, 1 straw brush. We are committed to providing the best customer service. If you have any questions about our products, you can contact us directly and we will solve them for you ASAP. For your complete satisfaction, we also offer a 30-day risk-free money-back guarantee."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Sports & Outdoors",
                "link": "https://www.amazon.com/sports-outdoors/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3375251"
            },
            {
                "name": "Sports & Outdoor Recreation Accessories",
                "link": "https://www.amazon.com/Sports-Accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3394801"
            },
            {
                "name": "Sports Water Bottle Accessories",
                "link": "https://www.amazon.com/Water-Bottle-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2403094011"
            }
        ],
        "productInformation": [
            {
                "name": "Item Package Dimensions L x W x H",
                "value": "‎11.46 x 7.72 x 2.17 inches"
            },
            {
                "name": "Package Weight",
                "value": "‎0.22 Kilograms"
            },
            {
                "name": "Brand Name",
                "value": "‎futaiphy"
            },
            {
                "name": "Color",
                "value": "black"
            },
            {
                "name": "Material",
                "value": "Silicone"
            },
            {
                "name": "Manufacturer",
                "value": "‎futaiphy"
            },
            {
                "name": "ASIN",
                "value": "B0CLR487L1"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 6 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#100,921 in Sports & Outdoors (See Top 100 in Sports & Outdoors) #1,000 in Water Bottle Accessories"
            },
            {
                "name": "Date First Available",
                "value": "October 25, 2023"
            },
            {
                "name": "Brand",
                "value": "futaiphy"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jennifer J.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFC3LQDB5OICJDLKOBSV3MMJJZTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BDU48B900KAO?ASIN=B0CLR487L1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars This is my top choice for a carrier!",
                "reviewText": "Let me say right up front that the carrier is not a bright \"white\" but what I would call a creamy, winter white or an ivory - but that is absolutely clear from the pictures of the item and why I chose it in the first place. Since I've been buying and selling online for years, using a variety of devices to do so, I know that colors do not always appear the same in person as they do on your computer screen but so long as they haven't been edited to look better than they are in person (and this one does not appear to have been edited to look whiter, in my opinion), I accept that as a given. In any event, the creamy white color of this carrier looks great with my sunset colored cup.More important to me than the color is the craftsmanship of the product vis a vis the price and this one gets my highest marks for both. Since I've ordered several carriers from different manufacturers and can compare the features of each, this is the carrier I measure all others against. First of all, it's one of the best priced carriers you can find. Equally important though is its quality and the attention to detail in its construction. I give it a perfect score for the following details:- the color of the strap is a perfect match to the color of the carrier itself- it fits my cup perfectly and the combo fit in the drink holder of my car- it has a double outer pocket so I can keep personal items enclosed in one and my phone in the outer mesh pocket so I can see who is calling without fishing it out- the pocket is wide enough to retrieve my items easily but not so wide that they're in danger of accidentally falling out- the sides of the carrier are reinforced with canvas webbing along the full length of the carrier and not just through the area of the jump rings, which make it less likely to tear along the stress points- the hardware used (the clips that attach the straps) are metal so won't crack or break as easily as plastic- there are two carry straps so it can be hand carried with the short strap or carried cross-body/shoulder with the longer strap- the price is amazingI highly recommend this carrier for anyone looking for a beautiful, well designed bargain!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angel GAngel G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDJPFTRZXYF4QTUHGF6RIUDPSGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NLDTHDCDR7PD?ASIN=B0CLR487L1",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "3.0 out of 5 stars Not a fan of the beigy/lt. yellow color",
                "reviewText": "This is a miss for me because of the color. The ad and the photo say white, but it's actually a beige/lt. yellow color that looks just like the color that medical aids (like braces, wraps, etc.) are made of. When I wear it as a cross body it looks like I have my arm in a sling across my chest. Weird. Other than that, the only other negative I have is that my Samsung Galaxy S21 Ultra does not fit in the zipper pocket (it's a little too tall so the zipper doesn't close). I expect a lot of people will fall in this category since phones are big these days. Everything else is good and as expected: the neoprene is well made, light and waterproof. It comes with separate crossbody strap and handle strap as well as a few Stanley-type bottle accessories.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71CYv1mbB4L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "BritniFowler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUKSMSXPHZ7DDCWQK7XYH77PETA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RWZKSHXJTD2B?ASIN=B0CLR487L1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Down with purses!",
                "reviewText": "Sold! no more purses for me unless absolutely necessary! The fact that my water bottle an phone both fit into this container was the first positive. Once I figured out I could fit my key wallet items and keys it was game over. I have a buys life and two kids. Having my water and essentials all in one place that I can throw over my shoulder is a convenience that I cannon stress enough! If you have a compatibly cup I highly recommend one of these multi function holders. I plan on gifting them on every occasion until everyone I know has one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}