{
    "remaining_requests": 41118,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Type-C-Flash-Drive-MacBook-Android/dp/B0BVM8ZJ93",
    "body": {
        "name": "USB3.1 Flash Drives 1TB,Type-C Dual USB Thumb Drive,Pendrives for MacBook Pro,USB C Memory Stick External Storage Drive for Android Phones,Pad and PC",
        "price": "$32.89",
        "originalPrice": "$47.98",
        "rawPrice": 32.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Type-C-Flash-Drive-MacBook-Android/dp/B0BVM8ZJ93",
        "soldBy": {
            "sellerID": "A2PMSAT7K569D",
            "name": "Fuansheng",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2PMSAT7K569D&asin=B0BVM8ZJ93&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CSN5XWLL"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BVM8ZJ93",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "$32.89",
                "variationImageURL": "https://m.media-amazon.com/images/I/317kuiKDByL._SS36_.jpg"
            },
            {
                "asin": "B0BVMBMT8Y",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "$33.84",
                "variationImageURL": "https://m.media-amazon.com/images/I/31YjH5QX5NL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31dzfk1MZnL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41fprFRSZjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lqvIv5 5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41a3LXFfvmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zrZxNmmxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/510f6Ok6AHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41f1QuZFqlL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: NEHEUI",
            "link": "https://www.amazon.com/NEHEUI/b/ref=bl_dp_s_web_120747721011?ie=UTF8&node=120747721011&field-lbr_brands_browse-bin=NEHEUI"
        },
        "brand": "NEHEUI",
        "merchantInfo": "Fuansheng",
        "customerReview": "3.7 out of 5 stars",
        "customerReviewCount": 606,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 21 hrs 55 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Thursday, February 15. Order within 21 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Dual Ultral USB3.1 Thumb Drive】1000GB USB-C stick drive for Macbook pro 1TB with USB C port,micro interface and USB 3.0 port.The OTG memory drive device compatible with OTG enabled devices.The external storage stick for Android can quickly transfer files between your devices. Instantly free up space or quickly move pictures or movies on your USB C smartphone/Pad/Macbook pro/PC/Tablet/Computer/Car audio system and more.",
            "Dual USB Interface Zip Drive with the USB 3.1 and USB Type-C interface, Type-c external date storage for Computer & Phone photo storage stick drive for android phones.You Can Easily Transfer Files and Data Between Smartphones, Tablets and Computers instead of Using WiFi and Cloud Services, Efficiently Save File Transfer Time and Greatly Improve Work Efficiency。",
            "Phone picture storage drive for smart cell phones with the USB 3.1 and USB Type-C interface,External date storage drive for Computer & Photo Stick for android phones.You Can Easily Transfer Files and Data Between Smartphones, Tablets and Computers instead of Using WiFi and Cloud Services, Efficiently Save File Transfer Time and Greatly Improve Work Efficiency.",
            "The NEHEUI 1TB Type C jump drive USB C Casing is Made of Premium Zinc Alloy, which Makes the flash stick Extremely Sturdy and Durable.360° Rotation Protecting Cap Design Prevent Cap Losing, and 90 ° Stuck Point Design Avoids the Drive Rotates Randomly. You Can Hang the Thumb Drive USB C on a Key Chain with the Hanging Ring.",
            "【Note】 When you use Android mobile tablet with USB-C interface, such as iPad mini., When inserting the USB C interface, please operate in the file management of the device. For Android phones or other devices with USB C port and micro USB port, please first determine whether your smartphone has OTG function. Because the USB flash drive needs to be used for smart phones with OTG function, the OTG function must be turned on to use USB Stick Drive normally."
        ],
        "description": "USB C Thumb Drive 1TB Warm Tips : The Thumb Drive is made of metal material,due to the transmission speed,so It is normal that it has a slight heat during use. please rest assured it does not affect your normal use. Media Formats Supported： Music: M4A / AIFF / CAF / MP3 / WAV Image: GIF / JPG / PNG / JPEG Video: AVI / FLV / M4V / MKV / MOV / MP4 / RMVB Document: DOC / PPT / XLS / XLSX / PDF / HTML / TX",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Data Storage",
                "link": "https://www.amazon.com/Memory-Cards-External-Storage/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1292110011"
            },
            {
                "name": "USB Flash Drives",
                "link": "https://www.amazon.com/USB-Flash-Drives-Storage-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3151491"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "NEHEUI"
            },
            {
                "name": "Item Weight",
                "value": "‎1.13 ounces"
            },
            {
                "name": "Package Dimensions",
                "value": "‎5 x 2.76 x 0.67 inches"
            },
            {
                "name": "Color",
                "value": "‎Silver"
            },
            {
                "name": "Manufacturer",
                "value": "‎NEHEUI"
            },
            {
                "name": "ASIN",
                "value": "‎B0BVM8ZJ93"
            },
            {
                "name": "Date First Available",
                "value": "‎February 20, 2023"
            },
            {
                "name": "Customer Reviews",
                "value": "3.7 3.7 out of 5 stars 606 ratings 3.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#54 in USB Flash Drives"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "1 TB"
            },
            {
                "name": "Hardware Interface",
                "value": "USB Type C, USB 3.0"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight, Compact"
            },
            {
                "name": "Read Speed",
                "value": "55 Megabytes Per Second"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Trevor SerraTrevor Serra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESP3K2EMUTAOKOBB572YG6RNKLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V3LDZGIMI52E?ASIN=B0BVM8ZJ93",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent tool to assist with old school storage.",
                "reviewText": "If you dislike using cloud storage for a variety of reasons or simply like having a back up and need something that could be used to store photos and videos taken with a smart phone or something so they could eventually be transferred to an external hard drive with a superior storage capacity that plugs into a PC then this is the perfect product for such a purpose.Keep reading to find out why it’s still a good idea to use old school methods of data storage.3 big reasons to use old school storage: Ease of access, Security, and Back Up Storage. The cloud is a network of servers kept up and running by cloud providers so you’re trusting total strangers with your data. Using the cloud means vulnerability to data loss which could be due to human error, natural disasters, security breaches, etc., and while this may be unlikely it is still a risk associated with cloud data storage. With that being said it is wise to have your data backed up on a hard drive somewhere.People say encrypted cloud storage is newer, that it provides an extra layer of security to your data. This is true. Even if a hacker gains access or a secret government court orders a cloud storage provider to disclose your personal information, they still won't be able to read it. But hackers or a secret government can still break encryption to access the data using a number of different methods. The most common method is stealing the encryption key itself. Another common way is intercepting the data either before it has been encrypted by the sender or after it has been decrypted by the recipient. Just because your data is in the cloud does not mean you’re totally immune to problems like theft and privacy violation.Also, a WiFi connection is required to access the cloud. Hard drives are easily accessible, they’re literally in your possession so they can be used anywhere at any time without a WiFi connection. Having the hard drive makes you vulnerable to theft but it also means you don’t lose your data forever in the event cloud data loss occurs due to one of the issues I listed earlier because you have a back up. My advice is to keep your hard drive hidden away locked in a safe when it is not in use.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61FW6V8FV5L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "DougDoug",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5YAHM4LIYN5FXKS6ALGM64YFHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJJ2NAH5B3IBI?ASIN=B0BVM8ZJ93",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 7, 2023",
                "reviewTitle": "1.0 out of 5 stars Broken out of the box. Replacement Pending. Will let you know.",
                "reviewText": "We purchased two of these flash drives. This pink one for my wife never worked correctly. Mine works fine. I plugged hers into her computer and it would cycle on/off over and over. So, I pulled it out of the port and tried to plug mine in to see if it may have been the port on her laptop. I could not plug mine in. So I thought something is in the port. Then, I got some tweezers, unplugged her pc and pulled out a little plastic piece with blue plastic and four prongs, but one prong was missing. I turned the laptop over and the little extra prong fell out. So then I compared her drive to mine and sure enough the piece that was stuck in her laptop was supposed to be in the flash drive. Since the device has two connectors, I tried turning it around and plugging it into the other port on my wife's laptop. And although it says the drive is there. It says no media. I tried to create a new volume and it again says no media.Update: Amazon put me in touch with the seller. After a few emails, they have promised to send me a replacement. I have not seen it yet. Still waiting.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ekCts6TRL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Constructive",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFB44O6HUYNAULEOYXMYJB36XKPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27NN8Y1QNLXPC?ASIN=B0BVM8ZJ93",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Latest and greatest",
                "reviewText": "I remember back in the day when a 1TB hard drive was an expensive novelty....we have come a very long way. This little fellow packs 1TB in a tiny package (yes I know you can get microSD cards in 1TB too, but it is still impressive to me) It is super handy to be able to just plug this into my phone or tablet for easy file transfers back and for to my PC or to work. I wish there was a way to have both sides protected as I would still be hesitant to carry this , say on a keychain, but this will be hanging around my desk for the foreseeable future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "carolyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCIQZTRWZQMFQ6Q2464NVGJ6UBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DRP1HDWSM1AP?ASIN=B0BVM8ZJ93",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "4.0 out of 5 stars Doesn't fit well in all usb c",
                "reviewText": "Purchased to download pictures from Samsung s22 it didn't fit but fits my s23 fine still having trouble learning how to move pictures from my Google account",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JadeJade",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGF2HOEBGYOVADTCUN7L624P6XAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OJ528J5P2ENJ?ASIN=B0BVM8ZJ93",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars 1TB usb flashdrive",
                "reviewText": "This is just what I needed for my school work and transfer of photos I have on my phone. It is light weight and convenient, I carry this by my side all the time for school projects as well as saving all my files in a safe place. I like that it has a high storage capacity too. Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61y57TlWp8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "David TurpinDavid Turpin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNPRHZUZBOYJYCXSZZPFBXRF5IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R215FR87TN6J13?ASIN=B0BVM8ZJ93",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "1.0 out of 5 stars NEHEUI Not worth the money BUT THE LACIE IS",
                "reviewText": "After buying this NEHEUI memory stick witch is 1 tb thinking I could clean up the memory on my iPadBut no luck after being on line and phone with Apple for a week or two and nothing was workingI had to take the stick to a computer shop and have it reformatted as I only have a iPad and a windows laptop and it wouldn’t change to the format neededfrom exFAT WHICH IS a common format for photos But apple recommended ( APFS ) to be able to except larger filesWhile transferring the files on this device it took forever up to 20 minutes for some files only to discoverthey didn’t work videos would pop up but when you click on them the only thing that popped up was the file numberThen back on line with tech and after moving a few thousand photos it stopped workingThe device says it had only used about 15 percent of available memoryWe tried all the tricks plug it into a reader plug it in directlyBut no matter what we tried it still wouldn’t workI then visited the Apple Store and had a appointment with a technician there still no answerI then purchased a memory device from them it’s a LaCie 2tb model it came with exFAT format that they changed to APFSIt works great and it works for everythingI now have transferred almost 10,000 videos and photos with out one issue and have only used about 25 percent of available memoryAlso your file transfer speed downloading from the cloud will be determined by your internet speed if you have over 50 megabytes itwill be fairly fast only a few minutes for videos 30 megabytes and a few seconds for smaller filesI will strongly recommend the LaCie memory device and they are available here on Amazon and for a little less than Ipaid at Apple",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714bNGHzRVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71g9kNLxhYL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Madden",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGP4XBTANXO4WAQZO7DFCDXBUJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QZME71UU6YJL?ASIN=B0BVM8ZJ93",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars 1TB USB drive review",
                "reviewText": "I use this literally every day or every other day both reg USB and USB C connections work flawlessly highly recommend this item",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lee anne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQPXGIHJ324RD5Q44OUERF3JP7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M415WE959H71?ASIN=B0BVM8ZJ93",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "3.0 out of 5 stars C did not work for my phone",
                "reviewText": "The c would slip out of my phone and it never worked but the USB did with 1 TB so I kept it",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}