{
    "remaining_requests": 40963,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Photo-Stick-iPhone-15-Flash-Drive-iPhone-External-Storage-iPad-Photo-Backup-Stick-iPhone-Thumb-Drive-iPhone-Photo-Storage-Android-Photo-Stick/dp/B0CLRRDX6Q",
    "body": {
        "name": "128GB Photo-Stick-iPhone-15-Flash-Drive iPhone USB C Memory Stick for Photo Video Contact iPhone-External-Storage-iPad-Photo-Backup-Stick iPhone-Thumb-Drive iPhone-Photo-Storage Android-Photo-Stick",
        "price": "$29.99",
        "originalPrice": "",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Photo-Stick-iPhone-15-Flash-Drive-iPhone-External-Storage-iPad-Photo-Backup-Stick-iPhone-Thumb-Drive-iPhone-Photo-Storage-Android-Photo-Stick/dp/B0CLRRDX6Q",
        "soldBy": {
            "sellerID": "A3QZNYX8179T3B",
            "name": "JiangdaUS",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3QZNYX8179T3B&asin=B0CLRRDX6Q&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CLRX9BB9"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CLRRDX6Q",
                "variationName": "Size",
                "variationValue": "128GB",
                "price": "$29.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CLRSCX6Q",
                "variationName": "Size",
                "variationValue": "256GB",
                "price": "$45.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CLRVJ7SQ",
                "variationName": "Size",
                "variationValue": "512GB",
                "price": "$75.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 5% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41pc GsADZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51tgpggiPsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Acz0GE1zL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519seQIMwnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OW-n1nPUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NTOmB5T2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/714F6grqCaL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1f524db0-2486-47fd-bc89-22830048c818/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c780ce0-6740-4d71-b3f8-9a951070cc80/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a273d5a8-0153-4340-a8ff-395e59b42486/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4777d66a-4fad-41a4-9d54-1fa71faf435a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4bd5825a-5348-4e5a-8490-4712335a19d1/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 5,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1ELm6tif9L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1ELm6tif9L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the JSL JDTDC Store",
            "link": "https://www.amazon.com/stores/JSLJDTDC/page/D660B0F6-0A3E-4645-A822-C186B54B0D48?ref_=ast_bln"
        },
        "brand": "JSLJDTDC",
        "merchantInfo": "JiangdaUS",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 50,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 12 hrs 34 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✅【USB-C+USB 3.0 Dual-Interface Design】This iPhone flash drives feature a dual-interface design with both a USB-C &USB 3.0 connector.Photo stick compatible with various devices, including iPhone 15 Series, iPad, Android, Mac, Windows. With an iPhone 15 thumb drive,you can easily connect,transfer data between different devices. Our iPhone photo backup stick can ensures compatibility across various devices, allowing for effortless file transfers and sharing. Excellent apple photos transfer device.",
            "✅【One-Click Backup Photos Videos Contacts】Requires download of JD Drive app to use on iPhone iPad.Photo stick offers a convenient way to back up and transfer photos and videos from your devices. Simply plug photo stick into iPhone.Easily one click backup the whole Album/Contacts.No complicated steps. iPhone usb drive is great for backup.This iPhone usb memory allows you to free up storage space on your devices while keeping your precious memories securely stored. No need Internet or WiFi.",
            "✅【Expanded Storage Capacity】iPhone flash drive photo stick provide additional storage space for your iPhone or iPad. iPhone external storage allow you to store and access files, photos,videos,documents directly from the iPad usb flash drive,freeing up valuable internal storage on your device. iPhone usb c memroy stick offers a cost-effective solution for creators & individuals seeking efficient storage option. Photostick - Perfect for content creators and people who take a lot of videos,photos.",
            "✅【Plug & Play】Photo stick for Android, PC phonesutilize Plug and Play technology allowing fastly and easily viewing, saving and transferring of data. No need to install any app. Simply connect the iPhone photo storage stick, and photo stick is ready to use. You can connect the usb c flash drive to your Android USB-C port, and iPhone usb storage will be recognized as external storage, allowing you to access and manage files directly from the drive. Decent flash drive for iPhone & Android Device.",
            "✅【Secure Data & Great iPhone Storage】iPhone memory stick built-in encryption options, providing an added layer of security for your stored data.You can password-protect your files, ensuring that your photos and videos remain private and protected even if the photostick is lost or stolen. All data is physically stored on this iPhone USB stick Not in an App. This provides an added layer of data protection and peace of mind. (Note: once the file is encrypted,it becomes invisible on the Android/PC).",
            "✅【Well-Made iPhone Backup Storage & 18-MTH Warranty】iPhone usb photo stick is well made with metal.The photo stick ipad is sturdy & solid. Comes with the metal ring,it is a great key chain and you always have a ipad flash drive with you. Photo Stick for iPhone supports devices with the Latest USB C port and iOS 9.0 or Above: iPhone 15/iPhone 15 Plus/ iPhone 15 Pro/ iPhone 15 Pro Max/iPad 10/iPad Mini 6/iPad Air 4 5/iPad Pro 3 4 5 6.Android/Mac/PC. iPhone photo stick comes with an 18MTH Warranty",
            "❗️❗️❗️ Note:If you want to use this photo stick on iPhone with Lightning port, you need USB C to Lightning adapter (Not Included).",
            "❗️❗️❗️Note that \"NCHKQ\" marked on the iPhone flash drive serves as the batch number for identification purposes. The iPhone Photo stick you received may be different, (\"NCHKQ\" The batch number is not unique) which can help to trace product information."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Data Storage",
                "link": "https://www.amazon.com/Memory-Cards-External-Storage/b?ie=UTF8&node=1292110011"
            },
            {
                "name": "USB Flash Drives",
                "link": "https://www.amazon.com/USB-Flash-Drives-Storage-Add-Ons/b?ie=UTF8&node=3151491"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "JSL JDTDC"
            },
            {
                "name": "Item model number",
                "value": "‎JD009"
            },
            {
                "name": "Item Weight",
                "value": "‎2.82 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎2.5 x 0.59 x 0.24 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎2.5 x 0.59 x 0.24 inches"
            },
            {
                "name": "Color",
                "value": "‎silver"
            },
            {
                "name": "Manufacturer",
                "value": "‎JSL JDTDC"
            },
            {
                "name": "ASIN",
                "value": "‎B0CLRRDX6Q"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎November 8, 2023"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 50 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#374 in USB Flash Drives"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "128 GB"
            },
            {
                "name": "Hardware Interface",
                "value": "USB 3.0"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight"
            },
            {
                "name": "Read Speed",
                "value": "75 Megabytes Per Second"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Photo Stick For iPhone 15 Series Apple MFi Certified Photo Stick Apple MFi Certified Photo Stick Apple MFi Certified Photo Stick Auto Backup Hard Drive Enclosure Auto Backup Data Cube Lightning Connector ✓ ✓ ✓ USB C Connector ✓ ✓ ✓ ✓ ✓ USB 3.0 Connector ✓ ✓ ✓ iPhone 15 Series ✓ Needs USB C Adapter ✓ ✓ ✓ ✓ Backup Backup For iPhone 15 Series, iPad One Click Backup For iPhone iPad One Click Backup For iPhone iPad One Click Backup For iPhone iPad Auto Backup While Charging Auto Backup While Charging Capacity 128GB 128GB 128GB 128GB No HDD or SSD Contained 128GB Compatibility iPhone 15 Series/iPad/Android/Mac/PC iPhone/iPad/Android/Mac/PC iPhone/iPad/Android/Mac/PC iPhone/iPad/Android/Mac/PC iPhone/iPad/Android/Mac/PC iPhone/iPad/Android/Mac/PC Warm Tips USB C to Lightning Adapter Required For Use on iPhone/iPad with Lightning Port. (Adapter Not Included) USB to USB C Adapter Required For Use on iPhone15/iPad with USB C Port. (Adapter Not Included) USB C to USB Adapter Required For Use on PC with USB Port. (Adapter Not Included)",
                "media_link": []
            },
            {
                "media_text": "High Quality & Well Made iPhone Flash Drive This iPhone Storage Flah Drive has USB-C and USB 3.0 connectors.This dual connectors design allows you to connect the photo stick to a wide range of devices, including USB-C-enabled devices like laptops, smartphones, and tablets, as well as devices with standard USB Type-A ports. JSL JDTDC Photo Stick is well made and constructed of a soft brushed metal frame on a sleek rotating swivel that’s built to last. The metal finish not only looks stylish but also feels robust in hand. iPhone external storage come with small and compact design, making the iPhone usb memory incredibly portable. You can easily slip it into your pocket or attach it to your keychain, ensuring your essential files are always within arm's reach. Memory stick for iPhone is a must-have gadget for anyone who values efficiency and peace of mind in their digital life! Photos Stick Support the Latest iPhone 15/iPhone 15 Plus/iPhone 15 Pro/iPhone 15 Pro Max with USB C Port.Support the Latest iOS Version. Strong Function One Click Backup Photos & VideosShooting Videos/PhotosFile Management and TransmissionContacts Backup and Restore",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a18326a-1dd8-4326-8580-8fbcaaeadf74.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "One Click Backup for iPhone Photos and Videos - Tech Gadget to Back Up Pictures on iPhone Pretty simple and intuitive to use. For iPhone/iPad requires JD Drive software download.Easiest way to get photos and videos off your iPhone to your PC. JDTDC Photo stick is Perfect for content creators and people who take a lot of videos and photos. Easy Photo Backup: Our iPhone 15 photo sticks offer a convenient way to back up and transfer photos and videos from your devices. Simply connect the USB-C end of the iPhone backup stick to your iPhone/iPad, and use the JD Drive app to initiate the backup process. iPhone Backup Storage enables you to free up storage space on your device while keeping your precious memories securely stored. Photo sticks offer a simple and convenient way to back up and store your photos and videos. Just a single click, you can backup your files from your devices to the iPhone usb photo stick, ensuring that your memories are safely stored and easily accessible. Backup and Restore: iPhone usb flash drives often come with backup and restore features, allowing you to create backups of your device's important data and restore it if needed. This provides an added layer of data protection and peace of mind. The iPhone usb storage capacity is huge and the ipad storage device is well made. This flash drive for iPhone storage would make awesome presents with Elegant & Special packing, perfect as gift to your loves and friends. Suitable for all kinds of festivals. Rest assured, your data's security is a top priority.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a065f824-c8b5-4c1b-b333-1b2039bb9779.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Cost-Effective Storage Solution For Creastors & Individuals In a world where monthly subscriptions for services like Google Photos can add up, our iPhone flash drive photo stick offers a cost-effective solution for creators and individuals seeking efficient storage options. Great little iPhone thumb drive to save photos and videos without paying monthly fees for storage. This little gadget iphone for thumb drive can solve “Your iCloud storage is full” problem.Photo Backup Stick iPhone is a must have accessory for iPhone users who take a lot of photos while on vacation. The automatic backup process is seamless. An excellent way to backup and store your vacation photos and videos when your iCloud storage is limited and fills up quickly. After photos and videos have backed up to the iPhone usb drive, the iPhone usb stick works just like a regular flash drive where you can view and transfer photos and videos to a PC or Mac. It’s that easy. Our Photo stick is great for content creators! After downloading the app you're able to quickly empty your camera roll for more storage space!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/07bbe366-fcf6-4b87-9eaf-607b2985c15a.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "A great way to extend an iPhone's memory! iPhone storage flash drive are designed to be compact and lightweight, making them highly portable. You can easily carry iPhone flash drive photo stick in your pocket, bag, or keychain, allowing you to have your photo storage solution readily available wherever you go. You do need to download the free JD Drive app on your mobile device to use it. Easy to transfer iPhone photos and videos to iPhone USB thumb drive or store directly from the camera to iPhone flash memory on the go. This is a must-have for anyone transferring data to/from an iOS device. Easily share all of those precious memories with everyone around you, and not worry that you will lose them. Whether it's moving hefty media files or backing up important documents, this iPad usb c flash drive delivers unrivaled performance. This iPhone Photo Storage Memory Stick is a game-changer for anyone who values their time and appreciates the convenience of swift data transfers. Media Formats Supported: Photo: HEIC,GIF,NEF,JPEG,JPG,PNG,TIFF,TIF,BMP Music: MP3,WAV,M4A,AIFF,AC3,AAC,CAF Video: MP4,MOV,VOB,WMV,RMVB,AVI,MKV,FLV,3GP,MPG,4K-MP4,3G2,DIVX,M4V Document: DOC,XLS,PPT,PDF,TXT,HTML,RIF,Keynote,PPTX,VCF,Pages,Nubmers NOTE: For iOS 11 or above and iPhone 7 or above devices, the default photos or videos format is HEIC, HEVC or MOV, these are only read by iOS or Mac system devices. Please install some free HEIC MOV extension on your PC. If you try to open a HEIC file on your Windows PC, you will find that your machine says the file format is not supported. That happens because Windows does not support this new image format. This iPhone Photo Transfer Stick remains the original information in the backup or tranfer, will not change any information such as Format, shooting time or size. But these format may not be supported by Windows computers, please install the associated viewer or player on Windows computers to view.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36e9771e-7944-4372-9cbd-478b1b768d22.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Dual USB Connector Compatibility:photo sticks feature both a USB-C connector and a USB 3.0 connector. This dual compatibility allows you to connect the iphone photo memory stick to a wide range of devices, including USB-C-enabled devices like laptops, smartphones, and tablets, as well as devices with standard USB 3.0 ports.You Don’t have to use Any app e on PC and Android. Photo sticks are compatible with various operating systems, including Windows, macOS, Android, and iOS. Whether you're using a computer, laptop, smartphone, or tablet, you can easily connect and transfer data between devices without compatibility issues. Future-Proofing: With the increasing prevalence of Type-C ports on modern devices, this flash drive ensures seamless compatibility across a wide range of laptops, smartphones, and tablets. Dual USB C and UBS 3.0 Flash Drive iPhone External Memory is compatible with: 1). iPhone Model:(Requires iOS 9.0 or later) iPhone 15/ iPhone 15 Plus/ iPhone 15 Pro/ iPhone 15 Pro Max 2). iPad Model:(Requires iPadOS 9.0 or later) iPad Pro 12.9-in. (6/5/4/3)iPad Pro 11-in. (3 generation)/ iPad Pro 10.5‑in./ iPad Pro 9.7‑in/iPad Air 5/4 iPad 10/ iPad Mini6 3). MacBook & iMac Model:(Requires macOS 11.0 or later) MacBook Air Series/ MacBook Pro Series/ iMac Series/ Mac mini/ Mac Pro 4). USB-C Android Phone with USB C: Samsung Galaxy, Nokia, OnePlus, Motorola, TCL, Google. ect USB-C Phone with OTG function.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2b487f81-311a-4a02-857a-2072cfe86ac2.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Plug and Play USB C Flash Drive For Android Phone On Android (with Type-C connector and OTG function) you can use android photo sticks like a normal flash drive --->No need to install any app, No One-Click Backup function In the Android phone it’s just a standard memory disk so just use your file manager of choice to copy files to it and then unmount the stick before physically removing. The transfer is very fast! How to connect usb c memory stick to Android? 1. Method 1: Connect USB-C thumb drive to your Android phone. Go to “My Files”---> You can see there is a “USB Storage1” icon. 2. Method 2: Plug the USB-C memory stick into your Android phone and swipe your finger down on the phone's home screen to display \"USB storage1\" connected on the notification panel. 3. Then you can Click “Copy” or “Move” to select the files you want to transfer. Above/below you will see \"Paste Here\". Once you do that, your files will be copied or moved to that folder. This iPhone Storage USB flash drive lets you move data easily between your OTG-enabled Android phones or tablets to your laptops, PCs or Mac computers. ***********NOTE********** After using the photo stick, please make sure to turn off the apps related to the iphone flash drive, and then unplug the usb flash drive gently, so that the the usb flash drive will not be damaged.Before removing the drive from the PC,Please do a right click and clicked on Eject to minimize the disturbance to the drive during the drive removal operation.The photo stick system Defaulted Format is exFAT.Plase install Free HEIC MOV extension on your PC. If you try to open a HEIC/MOV file on your Windows PC, you will find that your machine says the file format is not supported. That happens because Windows does not support this new image format.For a better experience, please remove protective cases if necessary before using photo stick for iPhone.Limited by DRM (Digital Rights Management), It cannot transfer Music or Video files in iTunes or downloaded by the 3rd APP to this iPhone external storage.Note that \"NCHKQ\" marked on the iPhone flash drive serves as the batch number for identification purposes. The iPhone Photo stick you received may be different, (\"NCHKQ\" The batch number is not unique) which can help to trace product information.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a103696-1518-4547-846f-80f7f25a9426.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4e377a8c-b303-4ea0-8643-420429142ce3.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7d1a5af-2bac-45ab-b82e-4f73288a554c.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/80320dd3-5ef6-4b2a-9e70-7c5450cb20e0.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b76149ce-22d5-4909-ab36-7c9f4bbcc737.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/24a8296d-1e69-4444-8049-b89b428e697a.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bfde09fa-ec34-482d-b562-99922cfa556d.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a18326a-1dd8-4326-8580-8fbcaaeadf74.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a065f824-c8b5-4c1b-b333-1b2039bb9779.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/07bbe366-fcf6-4b87-9eaf-607b2985c15a.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36e9771e-7944-4372-9cbd-478b1b768d22.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2b487f81-311a-4a02-857a-2072cfe86ac2.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a103696-1518-4547-846f-80f7f25a9426.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Larry Brehm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZSTHABYFJLKRYMO7JUZZ4T3CJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RSVRNFT0TSTF?ASIN=B0CLRRDX6Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars easy to use for new iphone 15 pro",
                "reviewText": "we have been waiting for one for the iphone 15 pro and it worked great. Some iphone photos have a iphone folder you need to convert if plugging into a laptop but its easy",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra Pina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXVQ4C7ESK6O3ZCJKMP3H6FD4PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OT1GTU4ZA8JA?ASIN=B0CLRRDX6Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Very good product.",
                "reviewText": "Easy to use product. I bought this product to help me save pictures from my iPhone 15. It worked wonderfully.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Junior Long",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGR6C2PMHA7DJ4BOMPPFGNA7GPAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31MJEUNG42MRG?ASIN=B0CLRRDX6Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Updated photo stick for iPhone 15pro",
                "reviewText": "I love this updated photo stick for my new iPhone 15PRO now able to upload photos and videos on to my Lenovo computer also store files from my iPhone onto the flashdrive with lightning speed. Andy long",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lezza",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDVIDD523KC4LS2WMDIXUPRGABA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTC9G64Q0P424?ASIN=B0CLRRDX6Q",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "4.0 out of 5 stars Expensive but Nice Quality",
                "reviewText": "The 128GB flash drive is build well with nice weight to it. I benchmarked the drive and got about 65mb/s for write and 73mb/s for read. The box it came in was nicely presented and would be great for gift. The drive is all metal build and has snaps at 90 degrees when rotating it. Using the drive, it does get a bit warm with a lot of usage but nothing uncomfortably hot. The drive comes with a nice keyring as well.The downside is that it's quite expensive for a 128GB flash drive, although it's nice quality. May be good as a gift.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chuck",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMJ3GAR3YJTWE3KMAYUDWCGB35A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IXVS6CKDANRF?ASIN=B0CLRRDX6Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Works perfectly!",
                "reviewText": "Bought a Diskk - had problems with it - got no relief from the seller - their product was defective- this unit I bought works perfectly- very happy I made this purchase",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "david ansel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZRPW32FFG4ZLTG6H5BYSKXESKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AH91FSM7DQNK?ASIN=B0CLRRDX6Q",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "1.0 out of 5 stars . Tis a complete failure",
                "reviewText": "I cannot tell if any memory/photos were recorded. It will not replay or be recognized by USB a insertion in my TV.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kay S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7BFPI2WI2MH4EGYNQSABVPP63A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7MML875012MD?ASIN=B0CLRRDX6Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "5.0 out of 5 stars It's adaptable",
                "reviewText": "Before I even got this item seller notified me that it is for an iphone 15. This is a gift and I know the person does not have an iphone 15. Seller then sent pictures of the adapter that I needed to purchase. Great to know...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darlene",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQLJBWMUIZ5TVI2UDANO7E2VEQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26W71VHGQ5CAH?ASIN=B0CLRRDX6Q",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "2.0 out of 5 stars Not worth my money",
                "reviewText": "I got this flash drive because it said for the new iPhone 15’s. I was excited about that. It is easy to use. But! The download to use with it only has a 2.6 rating. The first time I used it it said it had downloaded all 4,000 of my photos. I like to make sure my photos are there before deleting so I do t lose any. Tv next day it said it had 499 photos on there! There were so many empty spots where photos should have been. It wasn’t worth the money for me.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jean-Marc Proulx",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2024",
                "reviewTitle": "Stockage extra",
                "reviewText": "Je m’en sert pour contenue multimedia films,tv,musiques,photos aide a l’ibérer de l’espace sur telephone",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darius A",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 10, 2024",
                "reviewTitle": "Works very well",
                "reviewText": "Transfer videos and photos from my iPhone 15",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dos Santos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 30, 2023",
                "reviewTitle": "Très bon produit , clef usb conforme aux descriptif.",
                "reviewText": "Très bien , je recommande à tout le monde.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Wow efficace et vite",
                "reviewText": "Très utile et pas cher pour utilisation",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "charles bamford",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 18, 2024",
                "reviewTitle": "Quality",
                "reviewText": "Fantastic product, did everything I needed and more, although expensive it was worth the extra cost, so much so my daughter now wants on, so a discount would be great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}