{
    "remaining_requests": 41043,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/RecovStick-FlashDrive-Expansion-Transfer-Retention/dp/B0CQZ4FGBR",
    "body": {
        "name": "RecovStick FlashDrive 64GB USB Flash Drive for iPhone, Android Phone, PC, MAC, iPad Memory Expansion | Durable USB Thumb Drive | Easy Transfer, Syncing and Data Retention USB for iPhone Storage",
        "price": "$18.59",
        "originalPrice": "$21.99",
        "rawPrice": 18.59,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/RecovStick-FlashDrive-Expansion-Transfer-Retention/dp/B0CQZ4FGBR",
        "soldBy": {
            "sellerID": "A1TOACOBBQK36C",
            "name": "Nu Lifestyle Marketing LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1TOACOBBQK36C&asin=B0CQZ4FGBR&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 15% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41iYqX5KBWL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41lxBUh76lL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51BR39FcVPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51RxOpwiERL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Taq0wIidL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AMnS79IWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NpNmqNb8L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/51CqxOC4uBL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91+XKMIpB4L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the FREEZE2TRIM Store",
            "link": "https://www.amazon.com/stores/Freeze2Trim/page/9D0858BB-6D8D-4050-90F9-9B31913DCFE0?ref_=ast_bln"
        },
        "brand": "Freeze2Trim",
        "merchantInfo": "Nu Lifestyle Marketing LLC",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 22,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 13 hrs 28 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 11 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Expanded Storage and Backup: Supercharge your device's capacity with our 64GB USB storage flash drive, providing essential additional space for Android and Apple devices for files, photos and regular backups, safeguarding against data loss.",
            "Compatibility: Experience seamless connectivity with our 4-in-1 USB drive design, featuring a Lightning flash drive connector, USB 3.0, USB Micro adapter, and a USB-C adapter. This ensures compatibility with all iPhone, iPad models, and most Android devices.",
            "Effortless File Transfer: Seamlessly transfer files across devices using our USB stick- iOS to Android, iOS/Android to PC, and more. For iOS, download the i-FlashdeviceHD app from the Apple App Store. For Android, access file storage directly in the Google Files App (requires OTG support). Manage your files effortlessly with a user-friendly, intuitive interface.",
            "High-Speed Connectivity: Enjoy fast data transfers with USB 3.0 technology, surpassing competitors' standard USB 2.0 speeds. The included USB Type-C adapter ensures lightning-fast transfer speeds, to quickly and efficiently handle large files.",
            "Convenient: Take your storage on the go with our compact USB flash drives compact design. The iPhone storage flash drive for photos and more is ideal for travel or device switching, it provides a reliable external storage drive solution without the monthly costs of cloud storage."
        ],
        "description": "\"Buy from the Brand You Trust Recov Stick FlashDrive 64GB USBFlash Drive – secure, durable, and efficient portable storage. Durability: Built to withstand the demands of your on-the-go lifestyle, our flashdrive for your iphone and Android boasts exceptional durability. Crafted with high-quality materials, this portable usb flashdrive is engineered to endure the rigors of daily use. Backup Solution: Make regular backups a breeze with our flash drive for Android phones and more. It's not just a USB storage drive device; it's your go-to solution for safeguarding against data loss. With our iPhone backup flash drive, you can easily back up your important files, ensuring that your memories, work, and crucial documents are secure. All Types of Media Storage: Our photo stick for android, iPhone photo transfer stick and cell phone picture transfer device is the ideal companion for storing and transferring large media files. With a spacious 64GB capacity on the USB Thumbdrive photo storage stick, you can confidently store your high-resolution images, photos, movies, videos, documents, voice recordings using our picture keeper connect for iphone to SD card photo transfer. Ease of Use: Navigating through your files has never been simpler. Our memory sticks thumb drive for photos and more boasts a user-friendly interface, providing intuitive controls for managing and accessing your data. iOS utilizes the i-FlashdeviceHD app, while Android accesses file storage directly in the Google Files App (requires OTG support). Enjoy the convenience of straightforward file management for files of all formats. Security and Privacy: Your personal data is protected with advanced security features. Our iphone to usb flash drive employs protocols to safeguard your sensitive information, ensuring your privacy is our top priority. The dedicated app provides a safe and controlled environment for managing your files. \"",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Data Storage",
                "link": "https://www.amazon.com/Memory-Cards-External-Storage/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1292110011"
            },
            {
                "name": "USB Flash Drives",
                "link": "https://www.amazon.com/USB-Flash-Drives-Storage-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3151491"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "FREEZE2TRIM"
            },
            {
                "name": "Series",
                "value": "‎Photo Stick"
            },
            {
                "name": "Item Weight",
                "value": "‎1.06 ounces"
            },
            {
                "name": "Package Dimensions",
                "value": "‎5.79 x 3.19 x 0.79 inches"
            },
            {
                "name": "Color",
                "value": "‎Silver"
            },
            {
                "name": "Manufacturer",
                "value": "‎FREEZE2TRIM"
            },
            {
                "name": "ASIN",
                "value": "‎B0CQZ4FGBR"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎December 26, 2023"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 22 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,189 in USB Flash Drives"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "64 GB"
            },
            {
                "name": "Hardware Interface",
                "value": "USB, USB 3.0"
            },
            {
                "name": "Special Feature",
                "value": "Multifunctional 4 IN 1 Interface, Extended Compatibility, Dual USB Connector, iPhone, iPad Pro and USB Type-C devices, Quickly move content to your computer, Plug and Play, One-Click Backup, Compact, Lightweight, HIGH-SPEED TRANSFERS WITH USB 3.0, FREE UP YOUR MEMORY SPACE, APP, support Android phones with OTG function, Cost-Effective, High-Speed Data Transfer, File Transfer, No Internet Required, Front Retractable Design, password protection and encryption, Perfect Protection of Personal Privacy, Retractable Design, See more"
            },
            {
                "name": "Write Speed",
                "value": "40 MB per second"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "CDCD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ5KWHFBHPJEAYJQVBDUG2BD5BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBP059CQ51Z14?ASIN=B0CQZ4FGBR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars A versatile flash drive with a small problem",
                "reviewText": "I got the RecovStick FlashDrive as a universal thumb drive to manually backup and sync my devices. It has a unique way of using three types of USB connectors. The USB-C is available as a USB-A to USB-C plug. On the thumb drive itself, the USB-A body opens up to reveal a Micro USB plug. I used this side of the flash drive to connect to my PC and my Android phones. On the other end of the flash drive is the lightning plug for Apple devices.The device works well and the 64GB space is just right for moving files or even create a Live drive for operating systems. The only problem I ran into is that the USB-C connector has a wide head which prevents the flash drive sliding into the USB-C socket easily since I protect my mobile devices with a cover. I had to remove the cover and then the flash drive fitted into the mobile phone snugly. A small annoyance, but worth the extra effort.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61fBPRs7iJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61w7CUbtMdL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ycHrJxMhL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Dak88XEBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71N8fE8UHWL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71aQRvc0dYL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "HerayHeray",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPILHRDCGRCMUU52I3IFG5ROECA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BP5HDPK2MKZI?ASIN=B0CQZ4FGBR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "4.0 out of 5 stars 4-in-1 USB Flash Drive",
                "reviewText": "This flash drive has two ends sliding design without full cover of the two ends’ connection ports. When the flash drive is not inserted into a device, either one end’s connection port has to be exposed without covering. Moreover, it will easily loose after many sliding actions in future usage. Fixed connection ports with covers at both ends may be more durable and practical. The flash drive has storage capacity of 64GB.The USB flash drive provides four interfaces of connection. There are USB 3.0 for PC, lightning for iPhone/iPad/iPod, micro-USB for Android as well as USB-C from an independent adapter for the latest Apple and Android devices. This high compatibility allows you to easily transfer data between devices without cables.The application of this USB flash drive in iPhone/iPad needs to work with a “i-FlashDevice HD” App that can be installed from App Store or iOS App. When the flash drive is used in Android phone, just turn on the OTG function to access the data from the flash drive through file management.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/3119woeD4EL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/313NpXYf1JL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/31uaI-paIUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41Bq54tWJlL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41qRQQC4xYL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51I5XGEb2zL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary WrightMary Wright",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYEIRJT5DHK27QWMITWBZRPTDEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DS2200DTBKPH?ASIN=B0CQZ4FGBR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars It is easy to use. No software needed.",
                "reviewText": "I got this flash drive because I needed away to store my pictures. I was tired of using the cloud because it required my payment information to be stored. So I decided to try this. It was very easy to use. I love how it is just plug and play and no software needed. I also like how it can be used on my iPhone, iPad, pc and even iPod although I don’t own an iPod. Now I can backup my important files and pictures and have them forever. I can also backup my contacts too. I also love how it gets rid of duplicates so that provides more space. It is 64 GB so that can hold a lot of pictures. This is much better to me than the cloud because I can now have all my pictures on one device instead of some on my computer and some on my phone. I also love that it was not that difficult to use. I am not that good in tech stuff but I was able to do this . It definitely serves my purpose and I am happy with it. I give it five stars. I also think it is a great value for the money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7110I3VI0XL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sue Williamson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUJF65PGUFLIBC73H6SNKI5KYNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FQ8WZY2G3F4C?ASIN=B0CQZ4FGBR",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "1.0 out of 5 stars it was corrupted!",
                "reviewText": "I couldn't get it to work on my Android phone. The box only mentioned Apple products but the directsions on one side were for Androids. We finally saw that the USB was \"corrupted\"",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeffrey ImbodyJeffrey Imbody",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIRB267IGP2AMAOCJGRIUEGSWFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R330YFC8YNN4N0?ASIN=B0CQZ4FGBR",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "3.0 out of 5 stars Exceptional idea...lackluster execution.",
                "reviewText": "I loved the idea of this drive! I needed a new drive to transfer data between computers with USB 2.0 and US B c ports for work, and figured I could also use it to store pictures and other items from my phone to have an external storage backup. This seemed like the perfect unit to do all these things.The Good: It does what it says it will do with an adapter to go from USB 2.0 to USB c, and a separate port to use on an I-phone, (it's the older connector, not the new proprietary I-phone connector, so new I-phone owners beware). The drive is roomy, (though a few Gigs short of the manufacturer's claim of 64 gigs as you can see from the picture), and the transfer rate on USB 2.0 ran between 13 and 20 MB/s which is better than what I was getting with my old travel drive. The transfer rate using the USB c adapter was a little better, but not much. The unit is VERY well constructed and seems solid.The not so good. When I first plugged in the drive, it registered 58.5 Gigs of storage space, but when I went to transfer 2.6 gigs of data, I suddenly got an error message that the drive was full at 1.6 gigs, and could not hold any more. I did a drive reformat which SEEMS to have resolved the issue, but it was odd, and gives me concern that there might be future issues. I also got a couple of random error messages during the initial upload that files were having difficulty transferring and I needed to try again. After the re-format, when I went to upload the same data, everything worked just fine.I also found the slider, though it made an audible \"click\" when sliding from the I-phone connector to the USB 2.0, was very loose, and prone to sliding with the least amount of pressure. this made it awkward to try to slide the drive into a USB 2.0 port, and also awkward for sliding into an I-phone device. I had to physically hold the tab on the slider in place to keep it from moving, and even then, it was challenging to plug the unit into either port. The USB c adapter does keep the slider from moving once it is seated on the USB 2.0 port, but putting it on was also awkward cause \"sliders gonna slide\".I also wish the manufacturer had included some kind of small case or bag to keep the pieces in. These are small parts and could be easily lost.With a few adjustments, this product could be amazing. Right now, it's just passable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/611AtawrXRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61HUiPmrhOL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71kj7gYPJ6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristy H.Kristy H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7XKLWRI5QXV7KGMGFTTS2H2RLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UMRLX32U0QUX?ASIN=B0CQZ4FGBR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Lightning, USB-C,USB-A, Micro Flash Drive",
                "reviewText": "The best thing about this flash drive is all the different connections it offers. It worked as expected on my pc and android devices. The iPhone I tested it on is very old (it's a 4s) and an app download was required to be able to use it. One thing to be aware of is depending on your device's case, you might not be able to plug this in without taking the case off. It's not like plugging in a charging cable because this is almost an inch wide. I was unable to use it on my iPad or iPhone without removing the case first.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71hrpju7UlL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$18.59",
                "sellerName": "Nu Lifestyle Marketing LLC",
                "sellerRating": "4"
            }
        ]
    }
}