{
    "remaining_requests": 40919,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SanDisk-Cruzer-Force-Flash-Drive/dp/B00C9Q6NM2",
    "body": {
        "name": "SanDisk 32GB Cruzer Force Flash Drive USB 2.0 - SDCZ71-032G-B35, Black",
        "price": "$14.98",
        "originalPrice": "",
        "rawPrice": 14.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SanDisk-Cruzer-Force-Flash-Drive/dp/B00C9Q6NM2",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00EVO6ETC"
        ],
        "asinVariationValues": [
            {
                "asin": "B00C9Q5PGM",
                "variationName": "Size",
                "variationValue": "16 GB",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00C9Q6NM2",
                "variationName": "Size",
                "variationValue": "32 GB",
                "price": "$14.98",
                "variationImageURL": ""
            },
            {
                "asin": "B00FJRS73G",
                "variationName": "Size",
                "variationValue": "64 GB",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00C9Q2IM6",
                "variationName": "Size",
                "variationValue": "1 Count (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Engs3c8IL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/312ihpo- 0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Ay cxhQvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mmzvVsP1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31BCYVsx6cL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/54fc39b9-2d37-4f95-bcc1-619a3a8e023c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fef9e0f8-a7ef-4234-8c49-f34e35d92a4a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/660e7c2f-ca83-4ecd-a343-976594eb51b7/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fb4f7946-5d34-4a3b-b2d5-fd771adf030f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f3edd11a-8228-4ded-8db4-544a552bc912/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ae00fea2-beb9-4b44-aa8c-167993327123/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SanDisk Store",
            "link": "https://www.amazon.com/stores/SanDisk/page/CD971F4B-EE23-4EA1-96E3-567678AC9C0A?ref_=ast_bln"
        },
        "brand": "SanDisk",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 18563,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 17 hrs 13 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Reliable storage for photos, videos, music and other files",
            "Password protection and file privacy with included SanDisk SecureAccess software",
            "Durable & sleek metal casing",
            "USB 2.0 compatibility",
            "Two year warranty",
            "Password protection available, 128-bit AES encryption"
        ],
        "description": "Cruzer Force USB Flash Drive has a sleek design with a durable metal casing and protection for your private files no matter where you go. The included SanDisk SecureAccess software provides password protection to keep private files secure while leaving the rest of the drive available for sharing. Password protection uses 128-bit AE S encryption and is supported by Windows XP, Windows Vista, Windows 7, Windows 8 and Mac OS X v10.5+ (Software download required for Mac, see SanDisk website for description)",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Data Storage",
                "link": "https://www.amazon.com/Memory-Cards-External-Storage/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1292110011"
            },
            {
                "name": "USB Flash Drives",
                "link": "https://www.amazon.com/USB-Flash-Drives-Storage-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3151491"
            }
        ],
        "productInformation": [
            {
                "name": "RAM",
                "value": "‎16 GB"
            },
            {
                "name": "Number of USB 2.0 Ports",
                "value": "‎1"
            },
            {
                "name": "Brand",
                "value": "SanDisk"
            },
            {
                "name": "Item model number",
                "value": "‎SDCZ71-032G-B35"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC, Mac"
            },
            {
                "name": "Item Weight",
                "value": "‎0.32 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎1.35 x 0.29 x 0.47 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎1.35 x 0.29 x 0.47 inches"
            },
            {
                "name": "Color",
                "value": "‎Black"
            },
            {
                "name": "Manufacturer",
                "value": "‎Western Digital Technologies Inc."
            },
            {
                "name": "ASIN",
                "value": "‎B00C9Q6NM2"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎April 9, 2013"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 18,563 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,520 in USB Flash Drives"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "32 GB"
            },
            {
                "name": "Hardware Interface",
                "value": "USB 2.0"
            },
            {
                "name": "Special Feature",
                "value": "Encrypted"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "M. Opland",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGNHTPTN7HE76DH3OIOPL2LIDVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YJAPK1BN22YU?ASIN=B00C9Q6NM2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2015",
                "reviewTitle": "5.0 out of 5 stars Fantastic flash drive for everyday use",
                "reviewText": "This drive stands out from many other flash drives because it is simple, durable and it looks great. I have finally found a thumb drive that doesn't feel like it’s made of cheap plastic! This is important because I primarily use this drive as carry-around storage, so it needs to be tough as nails.A little shorter than an average house key, it fits perfectly on my key ring without getting in the way. The sturdy aluminum housing has not only held up well to the abuse it suffers while in close proximity to my keys, but it also looks great. Whenever I take it out, people like to give it a closer look because it has great lines -- very modern and futuristic.From a utility perspective, it is top notch. Because it I always have it with me, it is loaded with files and apps that come in handy in a pinch. Here are some of the things I keep on the drive: -- I have a folder with some awesome pictures of my family. This is great when visiting relatives - I can give them school pictures and family pictures for them to print. -- I keep a kid’s movie (the Lego Movie right now) on the drive at all times, 5-10 episodes of their favorite shows (Paw Patrol) and a huge folder full of music. This alone has saved my life on a number of occasions with many televisions and most cars coming with USB ports as standard connections. -- I also keep an encrypted file containing some of my passwords (managed by 1Password). While the very security conscious out there might not recommend this, I feel the risk of the drive falling into the hands of a person motivated and educated enough to decrypt this file are slim. -- There is still plenty of space for incidental file storage left on the drive – 16GB is more than enough.The physical connections to the USB port seem very solid which is often an issue with tiny drives like this. If anything, it tends to be a bit tight with some ports. While I have not personally had the types of issues that some other reviewers seem to have with this drive not fitting into USB ports, I can see how that may be a problem. I would recommend your checking the fit on your laptop or other hardware before starting to use the drive.From a speed perspective, it is about average for a USB 2.0 drive at 24 MB/s (r) and 4 MB/s (w). I have rarely been inconvenienced by the speed, but for those who want to edit right off the device or use it as a network-storage disk, you may want to consider a faster drive.Overall, this drive has been an indispensable component of my EDC (every day carry) and is a solid piece of hardware for a variety of uses.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Runion",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD7EN3LPGGZ4TEHNR7ZK3ZZ3AXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TKG722E596K7?ASIN=B00C9Q6NM2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2018",
                "reviewTitle": "5.0 out of 5 stars SanDisk 64GB Cruzer Force Flash Drive - USB -- A very good looking reliable drive, Had to initialize",
                "reviewText": "I really like the look of this thumb drive, compact, good looking. It isn't the fastest drive but it is safe and gets the job done.I have purchased these in the past with nothing out of the ordinary, ready to go, but the drive I just received appeared to be DOA. My Linux machines would not see it when plugged in. I went to my XP pro machine, it come up in My Computer but it indicated no open disk space.I attempted to format but it would not format the drive.I ended up going into MANAGE DISKs, the same screen you have to go to when you initialize your hard drives. The thumb drive was there but indicated it needed formatting. Clicked on format, and after about 2 minutes, it was formatted and ready to go. Now the Linux machines can find the drive as well.This was a very unusual occurrance and I don't expect to find this problem very often. It was a drive that was returned so I don't know if the previous buyer did something to foul the works or if it was a manufacturing debuckle. However the fix was easy and took little time.I like the sleek look of these drives, the size is perfect for my needs, very small physical size so be careful as it can be lost easily, the storage size is good and its not the fastest drive which I was aware of when I bought it.One very CRITICAL point. This is a drive, a memory drive. It has the same memory inconsistancies that the SSDs have. that is, it is a memory drive and as you use it, look at is as when ever you write to it, the memory developes a resistance to being written to. ALL memory drives have this concern, SSDs and thumb drives. In time, you will no longer be able to write to this memory drive. I think the estimate is 4 to 5 years, depending on how much writing you do to your drives.To AVOID DATA LOSS, and this is true of ALL DRIVES no matter what kind, MAKE YOUR COPY OF THE DRIVES.All these complaints of Data loss is on you, not the drive. You know the drive, any drive, can fail so when you buy a thumb drive, SSD, HDD, whatever, buy two. In the case of SSD's, it is recommended to buy a HDD for the backup drive. One is the working drive, the second is the back up drive. If you do not do this, plan on losing your data at some point. It WILL HAPPEN.My fast suggestion for storing such small a drive is pick up a cheap USB hub and plug the USB drive in those hubs. You can label them if needed for fast access and is a really handy way to keep the USB drives stored without losing them.The USB hubs come in many sizes where the small compact ones are great for transporting USB drives and the larger USB HUBS work well in office or home.I do, however strongly urge you to resist hanging ANY kind of USB thumb drive from a key chain. Putting any drive on a key chain, and then put said key chain into a pocket submits the drive to forces when your body is against a counter, wall, even the art of walking and chewing gum at the same time is pressing keys against the drive.We constantly see reviews about complaints that the drive electronics fall out and get lost or the drive just stops working. Those forces against the drive is pushing and bending the drive case, as metal does allow, plastic even more so, and things will break, disconnect, come loose from any glue and parts fall out.In my study it has never been a good idea to attach to a key ring and in most cases has ended up in damage or lost memory.I would recommend this drive for a good looking drive, compact and reliable memory, if high speed is not a concern.I do not know this seller and I did not receive any merchandise or payment for my independent review.180211 2347181120 1336",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Randy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYLZMIKEY7Z4223GTNBEK56MJUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3L2C7X5NWWGWC?ASIN=B00C9Q6NM2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2022",
                "reviewTitle": "5.0 out of 5 stars PERFECT SIZE!",
                "reviewText": "This USB flash drive is the perfect size (smaller than what I expected but I’m glad it was), which is smaller than a quarter. The program to setup and use the password protection on this is a little confusing for someone like me who insists on only reading directions if all else fails but I did figure it out after about ten minutes of playing around with it. Seems well put together but I wish it would have came with a lanyard which I bought separately for it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Operandi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2K7C6SIZUJNEKZ7WR3WHBTB24Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D44WGUV62NVF?ASIN=B00C9Q6NM2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2014",
                "reviewTitle": "4.0 out of 5 stars Great small form factor USB 2.0 drive",
                "reviewText": "Seems to be pretty solid drive so far. I bought mine to keep on me when I'm out for those instances when I didn't plan on needing a USB drive that inventively pop up. It fits perfect on my tiny Nite Ize key chain carabineer so it should work great in that regard.Construction seems great as it looks to be a pretty sturdy plastic frame housed in metal. Physical connections to the USB port seem very solid which is often an issue with tiny drives like this.Performance seems just ok. I copied a Office 2010 install file over and the average speed was around 5MB/s which could be a lot better. I then copied it back and was getting 19-20MB/s so on reads its pretty much maxing out USB 2.0 which is good. I also tried it on a couple different USB 3.0 chipsets ASmedia and VIA and it seems to work just fine. One odd thing I noticed is that it shows up as a local hard disk not removable media under “My Computer”.Overall I like it and I’ll probably pick up a USB 3.0 version if SanDisk make one which I’m hoping they do.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFDNJQULTOANML2KZBGW3KPJM7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RZBV44NM5CD0?ASIN=B00C9Q6NM2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Good",
                "reviewText": "Excellent tool",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "veritech_13",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3WU5ONLSAQXNSWL6OUKALZS7DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QUGXEJDIQKIO?ASIN=B00C9Q6NM2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 15, 2019",
                "reviewTitle": "5.0 out of 5 stars Awesome SIZE and Portability",
                "reviewText": "The size of the drive is awesome and if you are afraid of losing it does come with a keyring slot so you can hook it to your keys, lanyard or hook of any type. The size makes it durable and storage and price is amazing!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paulo Ricardo ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 28, 2023",
                "reviewTitle": "Qualidade",
                "reviewText": "Estou utilizando não apresentou problemas está tudo ok.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manfred Winter",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 12, 2023",
                "reviewTitle": "gutes produkt",
                "reviewText": "sandisk, wie immer gut",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "athil",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 10, 2023",
                "reviewTitle": "Good product. Small and compact one.",
                "reviewText": "Yes it is small but I don't feel it uncomfortable.I'm very satisfied with it.Trasfer speed also good value for money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ACONCAHUA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 26, 2023",
                "reviewTitle": "Calidad y precio",
                "reviewText": "Muy funcional",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pascal Savio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on July 22, 2023",
                "reviewTitle": "very small",
                "reviewText": "Handy, works fine and can put on a key holder",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}