{
    "remaining_requests": 40952,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/EATOP-Intended-External-Compatible-Computer/dp/B0BPGQX4XT",
    "body": {
        "name": "EATOP USB 3.0 Flash Drive 1TB Intended for iPhone iPad, USB Memory Stick External Storage Thumb Drive Photo Stick Compatible with iPhone/iPad/Android and Computer (Dark Purple)",
        "price": "$39.99",
        "originalPrice": "",
        "rawPrice": 39.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/EATOP-Intended-External-Compatible-Computer/dp/B0BPGQX4XT",
        "soldBy": {
            "sellerID": "A3PH90AI4BQAXT",
            "name": "EATOP",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3PH90AI4BQAXT&asin=B0BPGQX4XT&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BQ3MVC8M"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BGBJYCR2",
                "variationName": "Color",
                "variationValue": "USB01-Dark green",
                "price": "$39.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ttJZ2ckKL._SS36_.jpg"
            },
            {
                "asin": "B0BPGQX4XT",
                "variationName": "Color",
                "variationValue": "USB01-Dark purple",
                "price": "$39.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41r2SyC94YL._SS36_.jpg"
            },
            {
                "asin": "B0BZCNXLRX",
                "variationName": "Color",
                "variationValue": "USB01-Light Blue",
                "price": "$39.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41BEBlTWfrL._SS36_.jpg"
            },
            {
                "asin": "B0CFMBYRXH",
                "variationName": "Color",
                "variationValue": "USB01-Light Purple",
                "price": "$39.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41RQHeLxNrL._SS36_.jpg"
            },
            {
                "asin": "B0CJ4RV3ZR",
                "variationName": "Color",
                "variationValue": "USB01-Rose Gold",
                "price": "$39.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41K7YksJ7VL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 18% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41r2SyC94YL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41nagfUs3iL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iwPBbVdUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41OZg-B4oqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51f6QAZ4-BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vae43QeVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41x2CC9VoYL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the EATOP Store",
            "link": "https://www.amazon.com/stores/HOME/page/A4395C35-AF87-4D36-90D6-78DECFF7D7A1?ref_=ast_bln"
        },
        "brand": "HOME",
        "merchantInfo": "EATOP",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1863,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 11 hrs 3 mins",
            "FREE pickup Sunday, February 18",
            "Or fastest pickup Tomorrow, February 14. Order within 20 hrs 33 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✔【4 IN1 USB FLASH DRIVE】Compared with traditional single plug flash drive, iPhone flash drive has multiple plug models and supports devices such as Android(OTG function)/ iPhone/iPad/PC. Just use this compact flash drive and you can transfer photos and videos freely between multiple devices. (Note: For iPhone/iPad devices you need to download the APP \"Y-Disk\", you can search and download it through APP Store, For Android phones must have OTG function in order to use this flash drive)",
            "✔【ONE-CLICK BACKUP】Compatible with iPhone memory stick provides a simple and quick way to transfer photos and videos. Just plug the usb flash drive into moblie phone, install and open \"Y-DISK\" app, and you can easily backup all photos, videos and files with one click. No need for tedious selection, copying and pasting. Save your time and memory space with a thumb drive!",
            "✔【HIGH-SPEED TRANSFERS WITH USB 3.0】Directly plugs into your mobile phone port and USB 3.0 port, experience up to 80 MB/s reading and 30 MB/s writing speed with USB port. Enjoy the whole relaxing trip with never stuttering or buffering video play on the go. Support videos formats: AVI, M4V, MKV, MOV, M P4, MPG, RM, RMVB, TS, WMV, FLV, 3GP; AUDIOS: FLAC, APE, AAC, AIF, M4A, MP3, WAV.",
            "✔【PRIORITY TO PRIVACY PROTECTION】Compatible with iPhone photo stick to share files, photos and videos with colleagues and friends without worrying about personal privacy leaks. Because our iPhone thumb drive has file encryption function. You can choose to encrypt some files with Touch ID or a password, or you can choose to encrypt all files. The encrypted files will not be displayed on the computer, which will provide you with a more convenient and safer use experience.",
            "✔【FREE UP YOUR MEMORY SPACE】Still get annoyed with the short-storage of mobile phone? You will no more have that bad feeling with our 1tb flash drive! Store your favorite movies, music & images to our Memory Photo Stick for iPhone and iPad, and enjoy them when you are on a trip or trave. Or you can capture wonderful moments in life and save them into this iPhone photo storage device, and then upload them on your social media to share the joy with family and friends!"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Data Storage",
                "link": "https://www.amazon.com/Memory-Cards-External-Storage/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1292110011"
            },
            {
                "name": "USB Flash Drives",
                "link": "https://www.amazon.com/USB-Flash-Drives-Storage-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3151491"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "EATOP"
            },
            {
                "name": "Series",
                "value": "‎USB01-Dark purple"
            },
            {
                "name": "Item model number",
                "value": "‎USB01-Dark purple"
            },
            {
                "name": "Item Weight",
                "value": "‎0.12 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎0.6 x 0.16 x 1.6 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎0.6 x 0.16 x 1.6 inches"
            },
            {
                "name": "Color",
                "value": "‎USB01-Dark purple"
            },
            {
                "name": "Manufacturer",
                "value": "‎EATOP"
            },
            {
                "name": "ASIN",
                "value": "‎B0BPGQX4XT"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎December 7, 2022"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,863 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#325 in USB Flash Drives"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "1 TB"
            },
            {
                "name": "Hardware Interface",
                "value": "USB, Lightning"
            },
            {
                "name": "Special Feature",
                "value": "Compact"
            },
            {
                "name": "Write Speed",
                "value": "30 MB per second"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Are you tired of your iPhone/iPad running out of memory? Do you want to keep enough Phone memory during your trip? This is a USB 3.0 Flash Drive 1TB (Multi-Functioning, Mini-sized, Aluminum alloy design, large storage capacity) which has double connectors, can be transferred the documents for Android (with OTG Function) /iPhone/iPad/PC. 1）Protect Your Privacy Enable all data to be protected by password and touch ID, your privacy information will not be stolen even you lose the flash drive. 2) Front Retractable Design EATOP iPhone external storage drive is made of aluminum alloy and plastic, with a frosted surface that is comfortable to touch and non slip. Retractable design not only brings a smaller size, but also reduces the damage caused by accidental falls, more secure. 3）Multifunctional 4 IN 1 Interface The original 4-in-1 design of iPhone memory stick avoids the instability caused by additional adapters. EATOP iPhone flash drives offer up to 80MB/s read and 40MB/s write speeds, allowing you to easily free up space on all types of storage devices. 5）Extended Compatibility Compatible with a wide range of devices for iPhone/iPad/Android and Computer. You can capture HD pictures or videos and save it directly to EATOP iPhone thumb drive via Y-DISK Application. The Flash Drive’s interface is suitable for most smartphones of almost all brands, while retaining the excellent speed and performance of all EATOP iPhone photo stick. 6）More Content More Freedom iPhone flash drives are integral when it comes to backing up your smartphone media. Whether its photos, videos or other types of media, usb flash drives will not only allow you to back up and protect your precious data, they also act as extra storage so you never run out. 7）Perfect Protection of Personal Privacy Passwords protect data security on iPhone flash drive. Set the Touch ID and data password to protect the entire storage, or use the password to lock the selected file. With it, you don't have to worry about leaking.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b5f94dec-2695-4945-b7dd-b700a74101dc.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Never lose important documents, videos, photos again thanks to large and reliable iPhone USB flash drives. When it comes to backing up your important documents or easily transporting files, one of the safest and easiest ways to do so with is a iPhone flash drive. Smaller and more compact than a portable hard drive and easy to use without WiFi, unlike the Cloud or other online storage systems, iPhone photo stick continue to be a preferred method of storage and backup for many computer and smartphone users. iPhone memory stick because of their size, making it easy to carry with us anytime. iPhone flash drives can plug directly into a iPhone, iPad and Computer, acting as additional storage for photos, videos and your music library. Because of the flash drive’s compact case, these iPhone flash drive can go with you while you travel or on your daily commute. iPhone usb flash drive can make it easy to transport private documents or any files that you want to easily share without creating an online backup system. iPhone Flash drives are integral when it comes to backing up your phone media. Whether its photos, videos or other types of media, these drives will not only allow you to back up and protect your precious data, they also act as extra storage so you never run out. USB flash drives are optimized for iPhone but will work with and/or can be compatible with Android and Windows operating systems as well. All of our picks utilize plug and play technology allowing for fast and easy transfers, have secure data encryption technology ensuring privacy for all your data across all platforms and have specially designed apps to allow easy saving and transferring of data. Please Note 1. If necessary, please remove your phone case before use. Because the phone case will affect the connection between the phone and the usb flash drive. Even if you insert the usb drive into the phone, the usb drive may not be recognized by the phone. 2. After using the iPhone memory stick, please make sure to turn off the apps related to the usb flash drive, and then unplug the usb flash drive gently, so that the files in the usb flash drive will not be damaged. 3. Please check the description and pictures of the product details page carefully before using the iPhone photo stick. If you have any questions, please find us immediately for help. 4. If the product cannot keep the original date of the photo, please connect the iPhone flash drive to the computer and format it as \"EXFAT\". (Please download the highest version of the App 1.4.6) 5. What is in the package 1* USB Flash Drive 1* Manual 1* Type-c Adapter",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/19ade113-22dd-4124-9889-4f5f1e13b596.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15649916-1da2-404d-b2f9-f1e29da41657.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/23904322-f3d2-4dd0-ac49-903774921b74.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f5ae8dbb-da4d-4c9e-b203-2bfcd0df1f93.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7c367583-cc1d-4e25-98d4-95854015219a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b5f94dec-2695-4945-b7dd-b700a74101dc.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Banco Exterior",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6HUMULWFA7LTG6OIWNIZVZKAZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MG9HF12XLD8H?ASIN=B0BPGQX4XT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Efficient and Versatile Storage Solution",
                "reviewText": "Designed for seamless compatibility with iPhone, iPad, Android devices, and computers.Design and Build Quality:The EATOP USB 3.0 Flash Drive features a sleek and compact design that makes it highly portable and easy to carry around. The dark green color gives it an attractive appearance. The build quality is robust, with a sturdy construction that feels durable and reliable. The USB connector and lightning port are both well-designed and offer a secure and stable connection to devices, minimizing the risk of accidental disconnection.The USB 3.0 interface ensures fast data transfer speeds, allowing for quick and efficient file transfers between devices. Whether you're transferring large media files, documents, or backups, the flash drive handles the task admirably, significantly reducing transfer times. Furthermore, the drive supports a wide range of file formats, making it compatible with a variety of media types.Compatibility:One of the standout features of the EATOP USB 3.0 Flash Drive is its broad compatibility. It works seamlessly with iPhone, iPad, and Android devices, enabling easy data transfer and storage management across different platforms. Additionally, it can be effortlessly connected to computers running various operating systems, including Windows, macOS, and Linux. This versatility makes it an excellent choice for users who work with multiple devices.User-Friendly App:To facilitate data management and file organization, the EATOP USB 3.0 Flash Drive comes with a user-friendly app that can be downloaded from the App Store or Google Play. The app allows users to easily back up photos, videos, contacts, and other files directly from their mobile devices. It also provides additional features such as file encryption and the ability to view media files directly from the drive, further enhancing the user experience.Capacity and Value for Money:With a generous storage capacity of 1TB, the EATOP USB 3.0 Flash Drive offers ample space for storing a vast amount of data. Whether you need to store large multimedia files or create backups of your important documents, this drive has you covered. Considering its competitive pricing in comparison to other similar products on the market, it offers excellent value for money, especially for individuals requiring substantial storage capacity.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joanne GreenwayJoanne Greenway",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2PPYYSKWYYRBCNPMBIDBL6ZX4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DNUX2XYLK08D?ASIN=B0BPGQX4XT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Small and easy to use with tons of storage!",
                "reviewText": "I bought this so that I can take as many pictures as I want and then back them up to this device so they won’t just be lost in a cloud that I have to pay for. Easy to use and I got it the SAME day! Seems like a good quality product. Incredible storage capacity!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71L7WzjrnhL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manny ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK5CZWUYPBMBZEGTBLDPHTOJE6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17L555QMDHJKN?ASIN=B0BPGQX4XT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "4.0 out of 5 stars Great capacity in a small form factor.",
                "reviewText": "Handsome design & comes with Type C to USB adapter. Mini colored instructions are great. Also scam QR for complete online instructions. Cool packaging and an easy to activate 18 month warranty",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aimee Lee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPKNSR6UGJAKIU4RTL4ML5TOVCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YZXVSTL31I7R?ASIN=B0BPGQX4XT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Great product easy to use",
                "reviewText": "Great product and easy to use. Very simple. Lots of storage",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kylee Breanne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGY7ULUIT7KN3DU4MVKBASKYYAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19GVTN3JM86XL?ASIN=B0BPGQX4XT",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2023",
                "reviewTitle": "3.0 out of 5 stars You get what you pay for! Pros, cons, and everything in between :/",
                "reviewText": "The media could not be loaded. I thought if you slid the grey notch to the middle - that both connectors would be inside the flash drive casing and not poke out with the possibility of any damage like getting water or dust in them, having them bend or snap off entirely - however I was wrong. Obviously if you have it slid out all the way on either end would have the entire connector out of the casing to be able to plug into a device, however sliding it in the middle does not in fact protect either protruding connector whatsoever, and it does NOT come with any sort of case unless you use the box it was shipped in. Using the box is also risky though - the lid comes off very easily, so while traveling or storing it safely you would have to tape it closed each time you use it and pray the lid doesn’t fall off and don’t lose your flash drive with all of its contents because of this system. This is a huge bummer for me since the entire point of keeping important documents/photos/videos/etc stored on a flash drive is to be portable when traveling because I can’t take my entire desktop setup with me, I like to keep my flash drives connected to a lanyard so I don’t loose them. While prime shipping is fast, if I had known this would be an issue with no protection, I would have spent a little more on a 1TB flash drive that DID have a protection system of some kind instead. Now I have to spend even more time looking for a case that allows me to safely and securely travel with these (I bought both the green and purple versions) so that’ll be more expensive in the long run that just spending that little bit more originally on a 1TB flash drive that had protection, as well as saving time of searching for a case that’ll work. You get what you pay for though I suppose. It DID have all the port connectors I needed as well as the large amount of storage I also needed, with the benefit of coming in pretty colors, and it was cheaper than most others I was finding - and that price tag shows with the sheer lack of protection needed for such priceless and irreplaceable information that could very easily be lost or broken, therefore making anything you store on it in a constant state of risk of losing it all. The 3 stars were earned by the storage level, colors, and number of port connections compatibility - however, it lost 2 stars for the lack of protection that now forces me to spend more time looking for a portability solution, as well as having to spend even more money to do so. If I could give 2 and 1/2 star’s positive and 2 and 1/2 stars negative I would. If I could go back in time to save time and money, I would just buy a slightly more expensive flash drive with all the features I needed instead - the price was the main reason I picked this flash drive over the other ones I was also contemplating. I suppose if looking for a positive side to not return them would be that odds are I can probably find a cute case/holder to hang them on my lanyard in, instead of having a boring/plain looking flash drive just dangling from my lanyard. So overall I wouldn’t recommend this product, but I wouldn’t tell people to NOT buy it. Purely neutral, I would tell them what I said in this review and not convince them of either side/choice. There are both pros and cons with this product.",
                "reviewVotes": "41 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/43544126-6177-4cf7-b404-a4ab59ee51db/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Elizabeth P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHWDXIKMFNK3HI76Y6MVYD3U7PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3K73HG0QGPO8I?ASIN=B0BPGQX4XT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars I like it!",
                "reviewText": "So far, it’s great. Easy to use, extended warranty was easy to get, the app was easy to find and install, mega amount of room. Can’t wait to put all of my photos on it and clean up my devices!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "chrisbrad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5EVGQXJ53V2X6PZ6HKDJZPPLFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RATDWRDY3F4CR?ASIN=B0BPGQX4XT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Great packaging and tons of storage",
                "reviewText": "I like that this came in storage tin. Device is easy to use for iPhones,iPad and android. Quickly moved photos from all three devices. Only downfall is that it likes to slide so you have to hold the slider button when inserting into the usb on your computer.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Benjamin Pius",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWEBB7IOIEP4IST6TIV3QLO6FIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M9NMSR8JN8ON?ASIN=B0BPGQX4XT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "4.0 out of 5 stars Great for iPhone storage",
                "reviewText": "Just what I needed to move photos from phone to computer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LEONARDO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 11, 2023",
                "reviewTitle": "Excelente producto",
                "reviewText": "Excelente producto fácil de usar excelente precio",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Khaitoh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 26, 2022",
                "reviewTitle": "Easy to use.",
                "reviewText": "Great memory stick and easy to use. Only problem is it takes so much time to transfer if you have lots of pictures.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Puneet Malhotra",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 5, 2024",
                "reviewTitle": "Product is not working at all",
                "reviewText": "Looks like a toy - it’s not working at all",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Brooks",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 25, 2024",
                "reviewTitle": "Nice easy product for iPhone 13 pro",
                "reviewText": "Works as promised and saves your files for your own use and safety.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eduardo Irusteta De Unanue",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 17, 2023",
                "reviewTitle": "No útil",
                "reviewText": "No es tan fácil de usar y la forma en que copia archivos, fotos, es muy lenta y no tiene mayores instrucciones para optimizar el producto, me decepcionó",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}