{
    "remaining_requests": 41038,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Corsair-Flash-Survivor-Stealth-Drive/dp/B00YHL1LN8",
    "body": {
        "name": "Corsair Flash Survivor Stealth 64GB USB 3.0 Flash Drive, Black (CMFSS3B-64GB)",
        "price": "$24.99$24.99",
        "originalPrice": "$36.99",
        "rawPrice": 24.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Corsair-Flash-Survivor-Stealth-Drive/dp/B00YHL1LN8",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00ZIJMT84"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41X1DGuRvSL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/313URa4JF6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31pzp80AesL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41b6DIVtO-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wUP165FsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Q7HIVyJ6L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/61ApedbYDEL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/61ApedbYDEL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Corsair Store",
            "link": "https://www.amazon.com/stores/Corsair/page/A8559A65-3FF5-4A92-A08B-15F699944A8E?ref_=ast_bln"
        },
        "brand": "Corsair",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1864,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 14. Order within 11 hrs 28 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 14. Order within 22 hrs 58 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Compatible devices: Support for Microsoft Windows, Mac OS X and Linux, with no driver or software installation necessary"
        ],
        "description": "Military-style, adventure-proof design: Constructed from hard-anodized aircraft-grade aluminum, waterproof to 200 meters with an EPDM water seal, and both shockproof and drop tested with a molded shock-dampening collar. This unique drive is designed to protect your valuable data on your next covert operation. It offers high performance USB 3.0 and full compatibility with USB 2.0. Just plug it in and it works, with Windows, Mac OS X and even Linux. The Flash Survivor Stealth USB 3.0 is backed by Corsair, a respected name with a passion for quality and customer service.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Data Storage",
                "link": "https://www.amazon.com/Memory-Cards-External-Storage/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1292110011"
            },
            {
                "name": "USB Flash Drives",
                "link": "https://www.amazon.com/USB-Flash-Drives-Storage-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3151491"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Corsair"
            },
            {
                "name": "Item model number",
                "value": "‎CMFSS3B-64GB"
            },
            {
                "name": "Hardware Platform",
                "value": "‎Mac"
            },
            {
                "name": "Item Weight",
                "value": "‎1.28 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎8.66 x 3.15 x 1.18 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎8.66 x 3.15 x 1.18 inches"
            },
            {
                "name": "Color",
                "value": "‎black"
            },
            {
                "name": "Computer Memory Type",
                "value": "‎EEPROM"
            },
            {
                "name": "Manufacturer",
                "value": "‎Corsair"
            },
            {
                "name": "ASIN",
                "value": "‎B00YHL1LN8"
            },
            {
                "name": "Country of Origin",
                "value": "‎Taiwan"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎November 6, 2014"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 1,864 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#462 in USB Flash Drives"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "64 GB"
            },
            {
                "name": "Hardware Interface",
                "value": "USB 3.0"
            },
            {
                "name": "Special Feature",
                "value": "Waterproof"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Military-style data transport with USB 3.0 and USB 2.0 compatibility Your files are important — that's why you're taking them with you. Flash Survivor Stealth USB 3.0 flash drives help keep them safe. The anodized, aircraft-grade aluminum housing is waterproof to 200 meters, vibration-resistant, and shock-resistant.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/0eb2775d-62c0-4d49-ac52-aa728c9590a8._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "USB 3.0 speed with High-performance USB 2.0 support If you move a lot of data, you've noticed that as convenient as USB flash drives are, they never seem to be as fast as you'd like. USB 3.0 changes the game. Flash Survivor Stealth USB 3.0 offers read speeds up to four times faster than traditional USB 2.0 drives. It's fast enough to view most videos directly from your Flash Survivor Stealth, without having to take the usual extra step of copying it to a hard drive first. Not only is Flash Survivor Stealth USB 3.0 backward compatible with USB 2.0 — it offers great performance, too. No matter how up-to-date your PC is, you'll be able to quickly take care of moving your files and be off on your next adventure. Universal compatibility It works with Microsoft Windows, Mac OS X, and even Linux without drivers, and there's no software to install. Just plug it in, and go. If your computer has a USB 2.0 or 3.0 connector, you can use Flash Survivor Stealth USB 3.0. Proven reliability With over two decades of building enthusiast-grade memory and components, we've earned a reputation for quality, compatibility, and performance. Need help? We're available by phone call, email or web forum. Note: Some of the listed capacity on a Flash storage device is used for formatting and other functions and thus is not available for data storage. The actual available capacity for data storage is less than what is listed on the product. Features Encased in extremely strong CNC-milled, anodized aircraft-grade aluminum Water proof to 200M through the use of a EPDM waterproof seal Protected from vibration or impact damage through the use of a molded shock damping collar High Performance with USB 3.0 or USB 2.0 Plug-n-Play compatible Protected by a limited 5-year warranty",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/57b8bf05-47dc-4e00-8dbb-8b2f0d26029d._SL300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/0eb2775d-62c0-4d49-ac52-aa728c9590a8._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/57b8bf05-47dc-4e00-8dbb-8b2f0d26029d._SL300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "steadyt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNE342KDBXSSEFMKRWF4PYZGL5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U4X9CR20FK45?ASIN=B00YHL1LN8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Rugged, Reliable, and Ready for Anything!",
                "reviewText": "The Corsair Flash Survivor Stealth 64GB USB 3.0 Flash Drive in Black is a true champion when it comes to storing and transporting data. This flash drive has exceeded my expectations in every aspect, making it a standout choice. Here's why I highly recommend it:1. Unbeatable Durability: The Flash Survivor Stealth is built like a tank! Its rugged design features a hard-anodized, aircraft-grade aluminum housing that can withstand extreme conditions. From accidental drops to water exposure, this flash drive has proven its resilience time and time again, keeping my valuable data safe.2. Ample Storage Capacity: With a spacious 64GB capacity, this flash drive provides ample space for all your important files, documents, photos, and more. Whether you're a student, professional, or casual user, you'll appreciate the generous storage that allows you to carry your data wherever you go.3. Lightning-Fast Speeds: Equipped with USB 3.0 technology, the Flash Survivor Stealth ensures blazing-fast data transfer speeds. It saves you valuable time by swiftly transferring large files, reducing waiting time and boosting productivity. Backing up or transferring data has never been quicker or more efficient!4. Secure and Portable: The flash drive's compact design makes it highly portable, easily fitting into pockets, bags, or keychains. Additionally, Corsair's SecureAccess software provides password protection, keeping your sensitive data secure from unauthorized access. It offers peace of mind knowing that your files are safe, even if the drive gets misplaced.5. Stylish and Sleek: The black color of the Flash Survivor Stealth adds a touch of elegance and sophistication. It's the perfect combination of style and functionality, making it suitable for both personal and professional use.In conclusion, the Corsair Flash Survivor Stealth 64GB USB 3.0 Flash Drive in Black is an outstanding choice for anyone seeking a durable, high-capacity, and reliable storage solution. Its unbeatable durability, ample storage, fast speeds, security features, and sleek design make it a true standout in the market. Say goodbye to worries about data loss or damage, and confidently carry your files with this exceptional flash drive. Trust me, once you experience the reliability of the Flash Survivor Stealth, you won't settle for anything less.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MIGUEL P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAQMDJGTZFZEVGMHVG7MTRPR6OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW46UL7R5O2KJ?ASIN=B00YHL1LN8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2020",
                "reviewTitle": "5.0 out of 5 stars Great quality, fast , very secure",
                "reviewText": "i bought one many years ago, before i bought new ones this year, let me say the old one got some beating by falling from a second floor, fall in water, and the concealed system they got is perfect. Also i dropped by mistake from my moving car, my small dog used it as a chewing toy for some minutes ( before this one i lost 7 normal USBs to my crazy dog). but this old one still perfect and kicking.I order TWO new ones because this new ones got more storage capacity , my old one still working like new but its storage capacity is very low comparing to new ones, and love it!! also they are smaller in size comparing to the older versions which makes them more portable. same quality though.quality feeling of the product is high, excellent fabrication, fast USB port, overall yeah if you want something secure and that will long last better buy this oneI use it specially for a stand alone operative system, i encrypted and also use it as storage, (YEAH im a Geek)so yeah guys if you looking for a secure portable waterproof this is one amazing option.100/100 Recommended",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark Harrington",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERZ6S7VJMRXXW6ZIGR75BMXMKTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y0V30950344Q?ASIN=B00YHL1LN8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2021",
                "reviewTitle": "5.0 out of 5 stars Very Well Made , And Water Resistant",
                "reviewText": "I must tell you the first time I saw one of these was when the Jason Bourne movie came out in 2018, I guess it was used as product placement in the movie but it caught my eye so I bought one then. It is excellent and has served its purpose incredibly well and now the price is half of what I paid 3 years ago so I thought I would buy another one and I am very pleased.It has its own nice tube with a screw in top that has a waterproof gasket most of the construction is metal it's easy to fit in the pocket or hang around the neck with a loop provided for your own rope or chain",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manuel F. Rossel jr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAO756O5JNPJ7CJOXFJRSH54WMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R394X67QU37ONI?ASIN=B00YHL1LN8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Value",
                "reviewText": "Fast, and reliable, works great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "I hate Sunlight",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEE33PWKZMODI6FTIUUENRY7EP6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ENM2DQU75DSF?ASIN=B00YHL1LN8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 16, 2022",
                "reviewTitle": "5.0 out of 5 stars Better than Gorilla",
                "reviewText": "I use USBs to store my music library and plug it into my car console. Gorillas could not take the Texas Heat. Would sometimes just not work. The Corsair has had zero issues. Other than the occasional flashing as it's working, which is really a function. Will not buy anything else that I need to use outdoors",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hugh ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 10, 2022",
                "reviewTitle": "Solid",
                "reviewText": "When you unscrew the cap you can hear and feel air rushing in. So I imagine it's quite waterproof. The case and caps are very sturdy. The rubber on the caps allows for dropping it and it bounces rather than lands with a thud.The only downside, and that's only if your Jason Bourne or some such, is it writes very slowly, I suppose to insure no loss data transfer.If you're looking for something in say a live stage environment, this IS the drive for you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "paulo c.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 18, 2022",
                "reviewTitle": "Otima aquisição",
                "reviewText": "Excelente!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 15, 2023",
                "reviewTitle": "Resistente",
                "reviewText": "La carcasa exterior es perfecta, resistente y con aros de goma en los extremos para absorber los impactos, además la carcasa crea un contenedor estanco para evitar daños por líquidos. Es perfecto 👌",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex D",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 28, 2023",
                "reviewTitle": "Solide",
                "reviewText": "Super clé USB, très solide ! Elle est passée une fois en machine à laver, par inadvertance, cela a été l'occasion de vérifier son étanchéité. La clé fonctionnait toujours sans aucun problème.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KevinKevin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on September 10, 2022",
                "reviewTitle": "Buy it.",
                "reviewText": "Top. Probably the best USB on the market, for DJ's. Solid.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61vitZr-0SL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71H202WZbdL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}