{
    "remaining_requests": 41171,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/WOFICLO-High-Speed-Transfer-Samsung-PC-Black/dp/B09HXZWS2F",
    "body": {
        "name": "1TB USB Flash Drive for Phone, Dual USB3.1 to USB C Memory Stick 1000GB, WOFICLO High-Speed Transfer Type-c Thumb Drive for iPad Pro, Mac pro, Samsung Galaxy, PC.Black",
        "price": "$33.68",
        "originalPrice": "",
        "rawPrice": 33.68,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/WOFICLO-High-Speed-Transfer-Samsung-PC-Black/dp/B09HXZWS2F",
        "soldBy": {
            "sellerID": "A37DX130J4EUZH",
            "name": "Rasy",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A37DX130J4EUZH&asin=B09HXZWS2F&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09L69DH1V"
        ],
        "asinVariationValues": [
            {
                "asin": "B09HXZWS2F",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$33.68",
                "variationImageURL": "https://m.media-amazon.com/images/I/311v6HbH3UL._SS36_.jpg"
            },
            {
                "asin": "B0C3L3XKRM",
                "variationName": "Color",
                "variationValue": "Gray",
                "price": "$33.67",
                "variationImageURL": "https://m.media-amazon.com/images/I/31plAbLgcfL._SS36_.jpg"
            },
            {
                "asin": "B0BTXF1W8Y",
                "variationName": "Color",
                "variationValue": "Rose Gold",
                "price": "$33.69",
                "variationImageURL": "https://m.media-amazon.com/images/I/31d2UIqb3eL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/311v6HbH3UL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41FMj1BaNNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wh7r4490L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/318seVwjyYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xdy-LdYiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415MYaoVw9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Nl1nXrTML.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: WOFICLO",
            "link": "https://www.amazon.com/WOFICLO/b/ref=bl_dp_s_web_39112713011?ie=UTF8&node=39112713011&field-lbr_brands_browse-bin=WOFICLO"
        },
        "brand": "WOFICLO",
        "merchantInfo": "Rasy",
        "customerReview": "3.7 out of 5 stars",
        "customerReviewCount": 2029,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 15 hrs 47 mins",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Universal for Phones and Computers】Note: Not available for iPhone. The flash drive carries three data ports: usb3.1, usb-c (type-C) and micro USB, and is compatible with all smart devices except iPhone. No additional data cable or adapter is required to exchange data and share photos among mobile phones, computers and tablets.",
            "【Plug and Play】The thumb drive can be used directly without installing app whether it works on mobile phone or computer. Photo stick can be used for Windows CE 6 or above, Android 4.2 or above, Mac OS 10.6.5 or above, and Linux kernel 5.4 or above. Support iPad pro (2018 / 2020 / 2021), iPad air 4 and ipad Mini 6.",
            "【Lightweight, Portable, Ready to Use】 This 1TB high-capacity USB memory stick adopts a metal shell and uses 360 ° rotation to select different data ports. Photo stck is strong and durable, and the top of the shell is provided with a key hole, which is easy to carry and use and not easy to lose.",
            "【High Speed Backup File】 The external storage stick uses the original class A chip and the usb 3.1 integrated control board designed by Rui Si. Its reading speed on the usb-c port of the computer is as high as 100MB / s, and the reading speed on the USB a port is 30MB / s. The reading speed is 30MB / s on the USB C port of the mobile phone. It can quickly back up files and reduce our waiting time.",
            "【Sincere Service】 Our team has used many processes and systems to make high-quality USB drives, but after long-distance logistics and transportation, if there are any problems, please contact us at the first time, and we will give you a written reply in a very short time."
        ],
        "description": "The USB C flash drive can be used to transfer photos and videos at high speed and for file backup. USB flash drives are commonly used in various Android smartphones and tablets, iPad Pro and iPad Mini using USB-c port, as well as PCs and laptops. Using it, you can make photo sharing and file transfer between these devices very simple and fast.Precautions: The initial storage format of this USB C thumb drive is exFAT. If there is incompatibility on the mobile phone, you need to reformat it to FAT32 format. However, FAT32 format cannot store a single video or file with a capacity greater than 4GB. The capacity calculation method of the computer is different from that of the USB drive. The computer uses 1MB = 1024KB and the USB drive uses 1MB = 1000KB. Therefore, the display capacity of the USB drive on the computer is about 92% of the marked capacity. USB flash drive will generate heat when working. This is a normal phenomenon. Please rest assured to use it. Media Formats Supported：Music: M4A / AIFF / CAF / MP3 / WAVImage: GIF / JPG / PNG / JPEGVideo: AVI / FLV / M4V / MKV / MOV / MP4 / RMVBDocument: DOC / PPT / XLS / XLSX / PDF / HTML / TX Compatible Devices:- iPad Pro2019/2020 (under iPad OS system, the USB is in \"\"File Folder\"\")/iPad Air 2020- MacBook/MacBook Pro/Macbook Air- All Android smartphones and reading devicesNOTE: After some brands of Android phones are used, when they are used in Windows, the Windows system will prompt \"Repair\". Please do not click \"Repair\" unless Windows cannot read the flash drive. Please do not reformat the flash drive by yourself. The formatting tool provided by Windows will damage it. You can contact us and we will give you new substitutes.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Data Storage",
                "link": "https://www.amazon.com/Memory-Cards-External-Storage/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1292110011"
            },
            {
                "name": "USB Flash Drives",
                "link": "https://www.amazon.com/USB-Flash-Drives-Storage-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3151491"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "WOFICLO"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC, Mac"
            },
            {
                "name": "Item Weight",
                "value": "‎0.634 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎2.1 x 0.6 x 0.25 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎2.1 x 0.6 x 0.25 inches"
            },
            {
                "name": "Color",
                "value": "‎Black"
            },
            {
                "name": "Manufacturer",
                "value": "‎RUI SI"
            },
            {
                "name": "ASIN",
                "value": "‎B09HXZWS2F"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎October 7, 2021"
            },
            {
                "name": "Customer Reviews",
                "value": "3.7 3.7 out of 5 stars 2,029 ratings 3.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#36 in USB Flash Drives"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "1 TB"
            },
            {
                "name": "Hardware Interface",
                "value": "USB 3.0"
            },
            {
                "name": "Special Feature",
                "value": "Portable"
            },
            {
                "name": "Write Speed",
                "value": "30x"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TyTy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHO2WPQR53M5BF4JUIZUDIPJLIHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E996VRSYTAIF?ASIN=B09HXZWS2F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy does come in eFAT and here's how to fix it",
                "reviewText": "So it is 1TBShort version: stuck USB flash drive into an USB slot in computer---> open windows file explorer----> click on the USB DISK----> right click on USB disk----> Click on format...-----> Format USB DISK windows opens----> pick NTFS for file system-----> Volume label name it whatever you like----> quick format should be checked ✔️----> click start---> click okay ---> format complete----> click okay---> doneMaybe because I have an gaming computer I built it was easy to reformat as it tok about 2 seconds.I'm an IT professional and was in helpdesk role for a couple of years so let me give you the non and quick technical how to on how to get the drive to the correct storge capacity.For windows computers - anything with without an apple for an logo...Put the USB in a USB slot doesn't matter which one just stick it in a working one (on the right hand side the drive will pop up saying hello to you aka an notification its in)Open your file explorer (the thing that looks like an digital folder on the computer or one of them basic vanilla folders you find in the office file cabinet.. you know the smell of them)On the left hand side of that window you will \"This PC tab\" click on it and it will drop down a bunch of options (looks like an mini digital computer icon only difference is its not destroying you eye sights like the one you're staring at now)Look in those options and you will see your \"USB DISK\" or \"USB DISK (E:)\"Right click on USB DISK or USB DISK (E:)you will get a big list of crap in the options for it, you want to find the \"Format...\" option click that.A window will pop up with the titile at the very top: \"Format USB DISK or Fromat USB disk (E:)\"Alright don't be scared since the drive has nothing on it anyway so if you mess up you can do it all over again :).In that window you want to select the drop downs like this:Capacity: will be automatically detected (ignore that one)File system: Change to NTFSIgnore \"Restore device to default\"Volume lable: change to whatever name you want to give to your usb stick or keep its the same doesn't matter (example \"Super fast metal stick thing\" thats what will show up in the file explorer when you're trying to find your USB device).Format options: keep that check ✔️ on \"Quick format\"Now it StartClick okay as it will ease all data on the USB flash stick (since the USB stick is empty assuming you started this before using it just click okay)Then click okay againNow congratulations you have an 1TB drive now..Mac is a bit different but thats okay!Short version: plug in USB device into mac computer ---> on desktop you should see \"USB disk\"-----> at the very top of your desktop click on the magnified glass---> type in Disk Utility and click on it----> Select USB disk----> click erase at the top of the disk utilities window ----> Name it whatever----> Format selete MS-DOS (FAT)---> Click Erase----> wait for progress to be done----> click done------> top next to apple logo click on disk utility---> click quit disk Utility--> doneInsert your USB stick into the computerMac should receive the drive on your desktop should say \"USB disk\".Now at the top right you see that tiny magnified glass or the \"search tool\" click on that.Type in \"Disk Utility\" without the \"\" quotation marks.Click on \"Disk Utility --Utilities\"You will see and drive with an doctor's stethoscope on itIn the list you will see \"USB Disk\" click on that.At the top of that disk utility window you will have options first aid, partition, erase, restore and unmount.The option we want to click is erase.Another window will pop up! It will say:Erase \"USB Disk\"?In the options box below that you will haveNameFormatFor Name: you can name it anything you want!For Format: change it to MS-DOS (FAT)Select EraseLet it the bar turn fully blue and when finish it will show an green check mark and blue in done.Click doneAt the very top where the apple logo is click on \"Disk Utility\" select \"Quit Disk Utility\"Congratulations you're still an basic mac userAlso no I didn't proof read as I am too lazyAnyways the device works perfectly fine and is 1TB just comes in the wrong format so format it before using it. If your computer is taking years it's probably your ram or you already have too much junk on your PC or just an old computer/laptop.This thing is soild, got it for my brother who is starting trade school doing CNC, 3d printing and auto cad. :)",
                "reviewVotes": "123 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71BlZBWYq-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/8142GS111VL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christian Calderon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7K5ABPLW2TPWDNQQDVKPATIL6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX8E6CPL0KR6T?ASIN=B09HXZWS2F",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 19, 2023",
                "reviewTitle": "1.0 out of 5 stars Will show up as 1tb. It actually isn't.",
                "reviewText": "When you check storage it will say the 1tb. Not really. 999GB which is a lot more than you'd expect. That being said it isn't. I tried it multiple times but after 100~120gb (correction like 64GB) worth of data saved on it everything becomes \"corrupted\" and then disappears from the drive. Regardless of what I did I couldn't save anything on it after that point. I was very careful and COPIED my files instead of moved them or cut/paste. If you cut and pasted or moved and the device did not actually save because the data limit was met... I am guessing that info would be GONE for good. So be careful. After the initial save I tried putting One video of 300mb and it would copy then not be able to play and when unmounted and swapped to the pc? It is not there. 0 bytes. So if you want to transfer data to your pc from your phone completely doable. Just do it in smaller batches. write speeds are around 20-30 and it even was 40mb for me at some points depending on what transferred.WARNING: Do not cut/paste or move your files here. COPY THEM. You want to keep your original file saved until you transfer it wherever it is you want to transfer them to. Make sure they files work.EDIT: Raising it to 2.5 stars because it does work. I have been transferring things like I wanted to. I believe they have an actual \"size\" of about 64GBs. The You will know when its over because everything after said point will come as \"corrupt\" and look like it is actual data and you will transfer that but it is \"corrupted\".. IE: You transfer a total of 100GB. Find that 40GB or so show up as \"corrupt\" and cannot be opened. So if you save small batches AND delete them after you can transfer more that way. My recommendation is look at the size and do not exceed around 60GB and there is a very high chance of it working out for you. I always check my files after I try transferring them to see if they open up and play or they show up as \"corrupt\".EDIT: Dropping it to 1.5 as longevity is definitely not one of its strong suits. Do not expect to use it too much before it just fails completely. I think this is the first flash drive I have ever owned that failed within 3 months and this was with almost the full time being unused. I tried to transfers some files and it did and then it didn't. Then kept crashing while trying to transfer the files (it did this before quite often but not to this degree--usually I think its because the phones open space was too small but I couldn't transfer a 2gb video when I had 10gb worth of space on the phone which is not normal). It is a good thing I do not delete or move my files from my phone to the drive as they'd have been lost forever.I like the fact this drive has 3 ways of connecting but given how quickly it burns out. Given how of the 1tb worth of space is actually more like 64GB if that (after the first day I never put more than 50gb into this drive while making space). I Do not recommend this product. You can buy another usb c drive with 128gb or 256gb of say Samsung for LESS.UPDATE: Finally used the new samsung 256gb drive to transfer files from my Samsung s21 ultra t my PC. I Had NONE of those problems That I had with the drive. I was able to Transfer muliple files a one time. It was significanly faster and the drive was not constanly failing. I originally though maybe my phone had issues which was why it consistently disconnected from the drive but no. It definitely was The drive.I really cannot recommend the drive unless you need all 3 options and you decide not to buy say a usb-c o usb-a converter.",
                "reviewVotes": "69 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYBZXSBGSVSQFSRV4U3A7QTZCYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L0FCIK32ETCT?ASIN=B09HXZWS2F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Most versatile USB flash drive!",
                "reviewText": "I loved how it worked with everything.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPEHRBS4FMUK3HKMMBPTRBWRQJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ALTSH20PPAJ7?ASIN=B09HXZWS2F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Thumb Drive",
                "reviewText": "Very handy and easy to operate!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cory",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHT6U6QMGULFWCL74BM7UJIB6Q3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CJ183VD894QE?ASIN=B09HXZWS2F",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Great for the Price",
                "reviewText": "The upload is a little slow but other then that its awesome!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Person",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWYKQJOJSOEB74QNFUOAWBGAGHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LTQZTO3770F3?ASIN=B09HXZWS2F",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "1.0 out of 5 stars Does not work",
                "reviewText": "Anything I put on this drive would get corrupted. Different file formatting does not help.Edit: Thinking back on it now, when the package arrived, the product box seemed like it may have been opened, with the plastic covers for the USB plugs rattling around loose in the box. I wouldn't be surprised if when they get my returned, corrupt usb stick, they repackage it and sell it to the next unfortunate person who buys this broken mess of a product.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDN5QFNY3CBAY6XXDDSGNBIAGDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBP7VMK5UEVF4?ASIN=B09HXZWS2F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Highly recommend!!!!!",
                "reviewText": "This is a powerful little device! I love that I can plug it directly in to my phone and chromebook. Long go the days of having to wait hours for all my pics, music etc to transfer and backup. I transferred thousands of pics, videos, documents, music within about 2 minutes. I saved so much time. No more fiddling with a ton of smaller micro sd cards. Now I have one device with mass storage and you can't beat the price!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob McMac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTSGDBQTMNSYEPHVGZWIQTXPTQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWHHYETJY7YZ7?ASIN=B09HXZWS2F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars IT WORKS WELL",
                "reviewText": "SMALL COMPACT AND TWO INPUTS",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hannah",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 9, 2023",
                "reviewTitle": "Doesn't load everything. Folders are empty. files corrupted",
                "reviewText": "Don't get this awful device. It doesn't safely load everyhting. Many of the folders were filled with empty corrupted files. What a disappointment and a waste",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MJM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 9, 2023",
                "reviewTitle": "1TB",
                "reviewText": "Good to have 2 connection types",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LARRI",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 29, 2023",
                "reviewTitle": "Un ROBO",
                "reviewText": "Es un robo que permite AMAZON pues aunque te devuelva el dinero que no lo hace pierdes tiempo y mas dinero... productos chinos son una estafa!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "alicia j.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 27, 2022",
                "reviewTitle": "DOES NOT WORK",
                "reviewText": "Can copy files on to it, but then they cannot be seen. IT Professional also evaluated the USB stick. Reformatted it, still would not work.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daisy Lopez Basurto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 15, 2023",
                "reviewTitle": "Es excelente!",
                "reviewText": "Me es útil para mi trabajo y mis estudios. Es una gran capacidad de almacenamiento que puedes llevar en un bolsillo o un llavero.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}