{
    "remaining_requests": 40968,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SCICNCE-External-Compatible-Computer-Green/dp/B0BZKVLQVC",
    "body": {
        "name": "SCICNCE 1TB Photo Stick for iPhone Flash Drive, USB Memory Stick Thumb Drive External Storage Compatible with iPhone iPad Android Computer (Light Green)",
        "price": "$42.99",
        "originalPrice": "",
        "rawPrice": 42.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SCICNCE-External-Compatible-Computer-Green/dp/B0BZKVLQVC",
        "soldBy": {
            "sellerID": "AS0VCSPAT7SZP",
            "name": "SCICNCE",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AS0VCSPAT7SZP&asin=B0BZKVLQVC&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C1W4Z18B"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BZKXTX4F",
                "variationName": "Color",
                "variationValue": "Light Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/419irZOJ3mL._SS36_.jpg"
            },
            {
                "asin": "B0BZKVLQVC",
                "variationName": "Color",
                "variationValue": "Light Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41k71m+44CL._SS36_.jpg"
            },
            {
                "asin": "B0BZKW9RZ9",
                "variationName": "Color",
                "variationValue": "Light Purple",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41QhhmOchBL._SS36_.jpg"
            },
            {
                "asin": "B0BZKVMDTV",
                "variationName": "Color",
                "variationValue": "Rose Gold",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41YDwnWhqUL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 15% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418YlzU77JL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41QmV0JQPBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413noyckGqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Dn1BZeEwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51fh2a7uOsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nht2KbMDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51N48eb09NL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SCICNCE Store",
            "link": "https://www.amazon.com/stores/SCICNCE/page/EE10C497-C4E1-440B-A5C2-ACE24F970954?ref_=ast_bln"
        },
        "brand": "SCICNCE",
        "merchantInfo": "SCICNCE",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 747,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 1 hr 50 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✅📱【Multi-Port USB Drive】The iPhone photo stick with USB 3.0/iPhone/Micro USB/Type-C (independent adapter) three interfaces, which is more convenient for data transfer between different devices, so as to get rid of the data cable and iTunes and iCloud, let you switch easily storage space. What's more, you can also store your captured videos, photos or favorite movies on the photo stick and watch them directly on the iPhone memory stick. No more worrying about phone storage issues!",
            "✅📱【One-Click Back up】Plug and Play, you can easily back up photos, videos, and contacts on your phone by One-Click from the APP, and you can also use the USB side to store your own backups on your computer for double insurance. (Note: For iPhone/iPad devices you need to download the APP \"Y-Disk\", you can search and download it through APP Store, For Android phones must have OTG function in order to use this flash drive, no need to download APP)",
            "✅📱【Compatibility and Transfer Speed】The iPhone external storage is compatible with iOS 7.1.2 or above iOS devices/OTG Android phones/computers and other devices with USB ports. With up to 80 MB/s read and 40 MB/s write speed, you can save a lot of waiting time. You can also share documents/photos directly from the photo storage to social media such as: Facebook, Twitter, etc. Use the photo stick for iPhone to easily share data with family, friends and colleagues, making entertainment and work more interesting!",
            "✅📱【Excellent External Storage For iPhone iPad】No need Internet or Wi-Fi any more.Using this iPhone usb drive, you can go on vacation or something and not have to worry about running out of space.You can play movies and music on this iPhone flash drive photo stick without taking up space on iPhone. The only setup that you need to do is install the \"Y-DISK\" app on your iPhone and plug in the iPhone storage device. Also You can save photos/videos direct to the photo stick via In-app camera.",
            "✅📱【Priority to Privacy Protection】Compatible with iPhone photo stick to share files, photos and videos with colleagues and friends without worrying about personal privacy leaks. You can choose to encrypt some files with Touch ID or a password, The encrypted files will not be displayed on the computer, which will provide you with a more convenient and safer use experience. If you have any questions about the usb flash drive you received, please feel free to contact us, we are willing to provide a refund or replacement."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Data Storage",
                "link": "https://www.amazon.com/Memory-Cards-External-Storage/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1292110011"
            },
            {
                "name": "USB Flash Drives",
                "link": "https://www.amazon.com/USB-Flash-Drives-Storage-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3151491"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "SCICNCE"
            },
            {
                "name": "Series",
                "value": "‎USB3.0-1TB-Light Green"
            },
            {
                "name": "Item model number",
                "value": "‎USB3.0-1TB-Light Green"
            },
            {
                "name": "Item Weight",
                "value": "‎0.1 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎0.6 x 0.16 x 1.6 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎0.6 x 0.16 x 1.6 inches"
            },
            {
                "name": "Color",
                "value": "‎Light Green"
            },
            {
                "name": "Manufacturer",
                "value": "‎SCICNCE"
            },
            {
                "name": "ASIN",
                "value": "‎B0BZKVLQVC"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎March 24, 2023"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 747 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#435 in USB Flash Drives"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "1 TB"
            },
            {
                "name": "Hardware Interface",
                "value": "USB, Lightning"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight"
            },
            {
                "name": "Write Speed",
                "value": "40 MB per second"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "• If you feel the font of the instruction manual is too small to be seen, please con-tact us for a PDF version. Do you want to make your Phone more convenient? Are you tired of your Phone running out of memory? Do you want to keep enough Phone memory during your trip? Never lose important documents, videos, photos again thanks to large and reliable iPhone flash drives. One-Click Backup You can easily backup with one click and manage files at any time. No need of iTunes, manage files, phone address book, pictures and videos through the mobile app to quickly backup to iPhone flash drive, save the storage space of the mobile phone, and at the same time, operations such as forwarding files on the usb drive can be performed. Plug and Play Share your photos, videos, songs and other files between iPhone picture stick easily. You don't have to pay extra for additional storage, just insert iPhone external storage and enjoy the extra space of your flash drive. Protect File Privacy The General Password & Touch ID can encrypt file information in APP to protect your private files and prevent theft. Media Formats Supported Music: M4A / AIFF / CAF / MP3 / WAV Image: GIF / JPG / PNG / JPEG Video: AVI / FLV / M4V / MKV / MOV / MP4 / RMVB Document: DOC / PPT / XLS / XLSX / PDF / HTML / TX",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a30d0b8-3745-4f40-a493-5c94d538eb19.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "REMARKS 1. Flash drive for iPhone/iPad needs to download app ''Y-DISK'', you can search the app from the App Store. (When the phone does not recognize the usb stick, please uninstall the \"Y-DISK\" APP, then restart the phone and manually download the \"Y-DISK\" APP from the APP Store) 2. If you've used iCloud before to back up your files, you'll need to download the files from iCloud to your Phone or Pad and then copy them to usb flash drive. 3. For Android phones must have OTG function in order to use this flash drive, no need to download APP 4. Only support Android phones with OTG function. You can find the external usb storage in the \"File Manager\" APP of your phone. (NO NEED TO DOWNLOAD APP) * If your phone doesn't work, you need to open the phone set to open the OTG connection. PLEASE NOTE * You cannot transfer or view media files downloaded from iTunes or other third-party applications. Because these files are protected by digital rights management. * If necessary, please remove your phone case before use. Because the phone case will affect the connection between the phone and the usb flash drive. Even if you insert the usb drive into the phone, the usb drive may not be recognized by the phone. * The FAT32 format is usually suitable for small-capacity iphone flash drive and has better compatibility; if it is a large-capacity USB flash drive, the preferred format is recommended as: EXFAT>FAT32. If flash drive for iPhone cannot transfer files, you can convert FAT32 to EXFAT format by formatting. (Please save the file before formatting to prevent data loss) * After using the iPhone photo stick, please make sure to turn off the apps related to the iPhone flash drive, and then unplug the usb flash drive gently, so that the files in the usb flash drive will not be damaged.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/28789cba-8245-462c-9af8-79c6d1fb842d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ccf30e14-69f3-43a7-8786-577486e706fc.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fc540341-782b-4ad9-bf90-59c3cdc067cf.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/81835697-aba6-4b6c-8bc8-dda61108058a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/51354a74-40c4-4a1c-bb81-28a88b0f4c55.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a30d0b8-3745-4f40-a493-5c94d538eb19.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Caroline",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGU5EO6KIGCJDKJDNCQ4HUUKE5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PK67YFES72T8?ASIN=B0BZKVLQVC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Does the trick!",
                "reviewText": "This 128GB Memory Stick is a stellar solution for on-the-go data storage. Its sleek design and durable build make it a convenient companion, easily fitting into my pocket or attaching to my keychain.What sets the UltraFlash apart is its remarkable read and write speeds, powered by the efficient USB 3.0 interface. Transferring large files is a quick and seamless process, saving valuable time during busy days.With 128GB of storage space, this memory stick caters to diverse needs, comfortably accommodating high-resolution photos, HD videos, and numerous documents. It's an ideal choice for professionals and students who require a reliable and capacious portable storage solution.Compatibility is a strong suit, effortlessly connecting to various devices without the need for additional software. The plug-and-play functionality ensures quick access to files, enhancing overall user convenience.Despite its high-performance capabilities, the UltraFlash is reasonably priced, offering excellent value for money. XYZ Tech's commitment to quality and functionality is evident in this compact and powerful memory stick.In summary, the Memory Stick is a top-tier choice for those seeking a reliable, high-performance portable storage solution. Its combination of speed, durability, and ample storage capacity makes it a wise investment for users with diverse data storage needs. Highly recommended.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "miraluz espiritumiraluz espiritu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESBQNMCBOH7S3FCTULEEGM5DPWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GSMTT1AZVJC6?ASIN=B0BZKVLQVC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy-to-Use and Useful",
                "reviewText": "For several years, I had to rely on my free iCloud storage and my already large storage space on my iPhone to save my pictures and videos. I had pictures of my kids, my husband— all the memories I had was on my phone. Eventually, I ran out, and I struggled to find options to save storage on my device. I had more than 15,000 photos and videos saved (accumulated over 8 years), which accounted to hundreds of GB of storage. I tried transferring it to my PC via a lightning cable, but found it was too tedious as I had to manually select my photos. Worse, at the times where I did successfully select a handful of my photos to transfer, the process would stop completely due to a copying error. I also considered paying for an iCloud subscription, but I realized I did not want to pay a pricy subscription that I would most likely need to upgrade in the future. This product solved all these problems. The thumb drive connected to my phone easily. The accessibility of the app and its ease-of-use allowed for me to transfer hundreds of my media at one time, which was so much easier than doing it manually. The one time price is well worth it, as opposed to paying hundreds of dollars over the months paying for a storage subscription like iCloud. What’s more, its convenient adaptability of its connectors allows me to also use it on my PC, a device I use often, which makes this product even better. The only warning I have, which is not even specific to this product but all external drives, is that it must be kept safe! You need the drive in order to access your photos, but it’s essentially the same as keeping your phone safe or not downloading viruses into your computer hard drive. Ultimately, this product absolutely worth it— the storage, price, and all the memories you save to make room for more are all positive qualities this product has that makes it worth buying.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61I7Jbwk2FL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61nShedxK0L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roy Tristan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCYXSGRWVUNZYTZO5KNOCW267BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G2S8FURQF3NF?ASIN=B0BZKVLQVC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Easy to use!",
                "reviewText": "The SCICNCE 1TB Photo Stick for iPhone Flash Drive seems to offer a convenient solution for expanding storage and transferring files between devices. The 1TB storage capacity provides ample space for photos, videos, and other data. The multi-port USB drive feature is great for connecting to different devices, and the plug-and-play functionality ensures ease of use.The emphasis on privacy protection is a positive feature, as it's essential to keep personal data secure when transferring files between devices.Overall, the SCICNCE 1TB Photo Stick for iPhone Flash Drive appears to be a nicely made flash drive option for extra storage and efficient file transfers while prioritizing privacy.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Renee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPQ3FIB5MTVX3OPFXZMRE2OGR3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU93EDBGYWDZN?ASIN=B0BZKVLQVC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy to use",
                "reviewText": "I got this for Christmas and it is wonderful and easy to use. I can transfer photos easily from my phone to my computer. You will need to download an app, but then it's so simple. Choose the pictures and click transfer. I wish I'd bought this sooner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Legacy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQ73V4C3ADJ7OC6WGKZ2N446KJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1I54LY1GFEKY9?ASIN=B0BZKVLQVC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Simplicity",
                "reviewText": "Small, complete, easy to use, perfect solution to free up space on your iPhone. Wish I had found it sooner, but I’ve got it now. Great instruction manual, too!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rene crystal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHK2PDAS4UXBO6PJAPMN5RFDOCJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KVWTDQEM647J?ASIN=B0BZKVLQVC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Super addition for iPhone!",
                "reviewText": "As an avid photographer using the iPhone, now I don't have to worry about losing any of my photos should the phone crash - and you know it always happens! Connect this flash drive and, voila! all my photos are saved. Thanks so much for a terrific item. It's a permanent part of my iPhone accessories.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darrell C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUF3G5WAJDGTDAJJFVEIQGIVZ3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H5REMUO4PA5T?ASIN=B0BZKVLQVC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great!",
                "reviewText": "Setting up with iPhone was super easy, took me a minute to figure out how to use it on Android, but it works well with both phones. Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH76TPBZIPMNUDKYIYJZKBCG5GBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PBUUFHU9GA10?ASIN=B0BZKVLQVC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "4.0 out of 5 stars 1TB photostick",
                "reviewText": "The backup of photos is very fast The associated app is easy to use. The only negative I found is when you try to insert the stick into the device there is no locking mechanism to prevent it from retracting into the case.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "井出村春樺",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on February 11, 2024",
                "reviewTitle": "素早く取り込めた！",
                "reviewText": "ストレスなく写真や動画をUSBに取り込めた。またストレージがいっぱいになったら再度購入したい。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "taka_neya",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on January 21, 2024",
                "reviewTitle": "星もつけたくない品物",
                "reviewText": "さすがです。星もつけたくない品物です。お金を返して欲しいです。",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rob",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on June 13, 2023",
                "reviewTitle": "Excellent Purchase",
                "reviewText": "Quick delivery and product as shown. Works as described. Will be purchasing.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "佐藤一也",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on January 2, 2024",
                "reviewTitle": "良い商品です",
                "reviewText": "大変便利でした。購入をし良かったです。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}